{
  "url": "https://moz.com/blog/the-big-bursty-links",
  "slug": "the-big-bursty-links",
  "title": "The Big, Bursty Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When I say \"big links\", I'm talking about the sites that drive incredible amounts of traffic to sites in a very short period. They include:\n\nSlashdot\nYahoo! Picks\nDigg\nDel.icio.us/popular\n...",
  "content": "The Big, Bursty Links Link Building By: Rand Fishkin January 12, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 12, 2006 The Big, Bursty Links Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When I say \"big links\", I'm talking about the sites that drive incredible amounts of traffic to sites in a very short period. They include: Slashdot Yahoo! Picks Digg Del.icio.us/popular Reddit Newsvine These are links that can drive many thousands of visitors to your site, many of whom use these link lists to find blog material and places to link to, increasing their value exponentially to SEOs (this obviously relates directly to my last post on link bait). Recently, this comparison of Digg vs. Slashdot traffic caught my eye. I think it's a great case study and worthy of being scrutinized. Note what Kottke says: I'm measuring (roughly) visitors from each of those sites. From the kottke.org data, you can infer how many people visit each site by how many people visited from each site initially...the bandwidth burst from Slashdot was roughly about 1.8 times as large as Digg's. That's actually almost exactly what Alexa shows (~1.8x). But over a period of about 4 days, Slashdot has sent more than 4 times the number of visitors to kottke.org than Digg -- despite a 18-hour headstart for Digg -- and the aftershock for Slashdot is much larger and prolonged. It's been four days since the Slashdotting and kottke.org is still getting 15,000 more visitors a day than usual. This indicates that although Digg may rapidly be catching up to Slashdot traffic-wise, it has a way to go in terms of influence. Does anyone know of comparable data on some of the others? I'd be thrilled to see what traffic looks like from Reddit and Yahoo! picks in particular. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Big, Bursty Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Big, Bursty Links"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}