{
  "url": "https://moz.com/blog/the-unspoken-reality-of-net-neutrality",
  "slug": "the-unspoken-reality-of-net-neutrality",
  "title": "The Unspoken Reality of Net Neutrality - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn why net neutrality impacts far more than what you have been led to believe. Join us in our Day of Action.",
  "content": "The Unspoken Reality of Net Neutrality Search Engines | Moz News By: Russ Jones July 12, 2017 Table of Contents Copied! By: Russ Jones July 12, 2017 The Unspoken Reality of Net Neutrality Search Engines | Moz News It's not very often that Moz as a company openly advocates for a particular political position. While we've always supported our employees' choices to be vocal about the issues for which they're passionate and have done our best to live by the TAGFEE values (as imperfect as that attempt may be), we have rarely directed the attention of our customers or our readers toward a particular end. Today, we break with that tradition to join hands with countless organizations across the web in a Day of Action in support of net neutrality. Net neutrality is a fairly simple principle: that Internet service providers should enable access to all content and applications regardless of the source, and without favoring or blocking particular products or websites. At face value, net neutrality seems to affirm the basic principles of free speech which most of us hold dear. If the FCC moves forward in retracting policies that protect the Internet in the interest of the public good, it is reasonable to suspect that these freedoms will be curtailed. This curtailed freedom is often described in terms of small or independent content producers who will be cut out of this new caste-like system of Internet access. However, I would like to take a moment to shed light on different vital services which are likely to suffer without the protections provided by net neutrality. 1. 911 call centersOver 65 million Americans rely on Voice-Over-IP (VOIP) for their home phone service, and in 2009, the Congressional Research Service called for 911 call centers to migrate to IP technology in modernizing their infrastructure. Both families and the call centers themselves depend on unfettered bandwidth. When you call 911, seconds matter, and the quality of that bandwidth determines that speed. Without net neutrality, that bandwidth and those seconds are put to the highest bidder. 2. Clinical Video Telehealth for our veteransIn 2016, the Department of Veterans Affairs served over 677,000 veterans in rural and under-served areas via telehealth. The VA's Clinical Video Telehealth (CVT) is a true innovation, connecting their best doctors with their neediest patients. Unfortunately, this critical health technology relies on the same network backbone as any Internet service. Who will pay the increased tolls to ensure that serving our veterans remains a priority on these networks? 3. Online education for K–12 students and their teachersFinally, by 2014, 75% of all US districts offered some form of online education for K–12 students. More than 2.7 million students took advantage of this blended ed-tech, while 315,000 students were enrolled in full-time online education. The same technology you might use in your workplace to hold sales calls is used by teachers to meet with parents and students across the country, delivering education to those who are difficult to serve otherwise. It's annoying when Netflix buffers, but it is tragic when a child can't communicate effectively with his or her teachers. These are just three of countless examples of how the Internet has come to provide vital services to our veterans, our children, and our communities. Without the basic protections net neutrality affords, these vital services, and so much more, are at risk. Net neutrality advocates are correct to be concerned about the free and unfettered speech of sites across the web if the Internet is left unprotected, but we should not pretend that only our words are at stake. Our safety, our veterans, and our children are on the line, too. If you're interested in learning more and taking action, take a look at Battle for the Net. Thank you for your consideration. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Unspoken Reality of Net Neutrality"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Unspoken Reality of Net Neutrality"
    },
    {
      "level": "H3",
      "text": "1. 911 call centers"
    },
    {
      "level": "H3",
      "text": "2. Clinical Video Telehealth for our veterans"
    },
    {
      "level": "H3",
      "text": "3. Online education for K–12 students and their teachers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Russ Jones\n          \n            Russ Jones\n          \n            Russ Jones"
}