{
  "url": "https://moz.com/blog/the-great-google-sketchup-experiment",
  "slug": "the-great-google-sketchup-experiment",
  "title": "The Great Google SketchUp Experiment - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEO is an analytical occupation, so it’s no surprise that we experiment. The trouble is, we can’t experiment freely with our clients’ websites, and setting up a website just for experimentation doesn’t really mimic the natural conditions in the online environment. Therefore, I was delighted when I…",
  "content": "The Great Google SketchUp Experiment Link Building R By: Rebecca Haden October 7, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! R By: Rebecca Haden October 7, 2008 The Great Google SketchUp Experiment Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. SEO is an analytical occupation, so it’s no surprise that we experiment. The trouble is, we can’t experiment freely with our clients’ websites, and setting up a website just for experimentation doesn’t really mimic the natural conditions in the online environment. Therefore, I was delighted when I recently had the opportunity to arrange a small experiment under remarkably controlled conditions. I have to provide a little bit of background. Before I became a fulltime SEO, I did a lot of teacher training. When I began working with a web engineer with a commitment to client education, it was only a small step to persuade him to do a little teacher tech training with me. He was excited about Google SketchUp, an application designed for architects. I came up with a dozen lesson plans, we did the training, I posted the plans at my education blog, and that was the end of it. Until the engineer, having seen the lesson plans mount up, decided to make a page at his website with links to all those plans. So there was a new page with no content, really, besides a group of links to lesson plans on SketchUp. It had nothing to do with the rest of his website, which is about web design. Yet it’s a real page, not something created for experimental purposes. I’m a real teacher, and my blog is a real education blog. The new page of links is in fact the most useful page on the web for people who want cross-curricular lesson plans for SketchUp. And here’s the great thing: almost nobody does. I checked, and sure enough, there’s hardly any searches for SketchUp lesson plans, and no competition to speak of. So here we had an obscure little page that provides the best information on an obscure little subject which is not associated with its domain in any way. There is no money changing hands, no clients to worry about, just a keyword phrase and a page. It’s not a keyword phrase carefully chosen for its SEO potential, nor was the page itself designed to pull people in. There’s also no history or industry buzz. The domain has a healthy page rank, but no ads or paid links, and no IRL marketing going on for it in the education community, either. If that page got any traffic, it would be entirely a reflection of SEO efforts. And, since no one else was making any competing efforts, it would be a reflection of the particular SEO efforts I wanted to track. The question, then, was how quickly would a little manipulation show results? And I say “a little manipulation” advisedly. I posted a couple of comments at an old discussion on a Google educators’ group, one at my education blog, and one each at a couple of educational technology discussions where I sometimes hang out. I posted a link at Wikipedia. That’s it. These were not enticing links, either. They were bald announcements: “There’s a collection of lesson plans for SketchUp posted at ___.” The anchor text wasn’t optimized. I didn’t email anyone about them or otherwise use networking, charm, or eloquence. Just links. The results? They were evident within days. The links collection is on the third page at Google, the second page at Yahoo, the first page at MSN. One of the lesson plans (the one with the engineer’s very cool log cabin model) was on the front page at both Google and Yahoo before I did any experimenting, and it hasn’t moved, but it’s not in the top hundred at MSN. The rest of the lesson plans are languishing in obscurity, unfindable unless you actually type in something like “SketchUp lesson plan on the Golden Section” – and even then, the page of links is #1 and the lesson plan itself is down in the middle of the page. #1 at Google is the comment I made at the Google groups page – with the engineer’s URL prominently displayed before you even click through. Not bad for half an hour of SEO. Traffic has also zoomed. At one point, the page of links had more visitors than the engineer’s homepage. While some people do come look at the actual SketchUp lesson plans from search, most come through the page of links. There may not be very many people looking for SketchUp lesson plans, but those who do are definitely coming to visit. If there were anything for sale to teachers there, the engineer would be celebrating. What does this tell us? First, I think it shows that standard SEO works. In the absence of manipulation, I think it’s safe to assume that the lesson plans themselves – at a relatively old blog about education – would be the hands-down winners over a newly-made page at a non-educational site with mere links to the lesson plans. Dropping a few links made a difference. When we so often have to wonder whether our results come from our efforts, from the IRL marketing we coach our clients to do, or simply from some natural progress over which we have no control, it’s good to see some evidence. Second, it shows that the search engines work. Once the page was pointed out to them, they served that page right up to the searchers. We do have to point things out, and the system can be manipulated, but in the absence of active pushing around, it works. This ought to be encouraging to those of us who emphasize excellent content and honesty over trickery. It’s so easy to feel as though you’re quixotically encouraging your clients to follow rules while all around them others are breaking the rules and perhaps at least briefly benefiting. Third, this should cheer up our clients who haven’t yet hit Google’s page one for their desired keywords. Most of the traffic to the page in question is from referring sites, not from search. Good quality links benefit the website before they move the page up in search rankings. It is possible that you’re questioning my use of the word “benefit” there. After all, the visitors are leaving the page to follow the links. A few checked out the engineer’s portfolio while they were there; one went to the contact page. But it may seem to you that the engineer is not benefiting at all, while I had the geeky fun of my experiment and a blog post topic. There are other sorts of benefits, though. The engineer tells me that late at night, when he is at work in his office, he enjoys seeing people from all over the world visiting that page. Someday one of them might need a website. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Great Google SketchUp Experiment"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Great Google SketchUp Experiment"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Haden\n          \n            Rebecca Haden"
}