{
  "url": "https://moz.com/blog/the-accidental-wisdom-of-long-tail-targeting",
  "slug": "the-accidental-wisdom-of-long-tail-targeting",
  "title": "The Accidental Wisdom of Long Tail Targeting - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In the long tail of keyword searches, the great value comes from having hundreds or thousands of unique, valuable content pages written on a niche subject. The millions of completely unique search terms that hit the engines each day help to bring in traffic that a purely \"designed\" strategy could…",
  "content": "The Accidental Wisdom of Long Tail Targeting Keyword Research By: Rand Fishkin April 3, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 3, 2006 The Accidental Wisdom of Long Tail Targeting Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In the long tail of keyword searches, the great value comes from having hundreds or thousands of unique, valuable content pages written on a niche subject. The millions of completely unique search terms that hit the engines each day help to bring in traffic that a purely \"designed\" strategy could never receive. What's fascinating about the long tail targeting process is that its largely an accidental system. There's little or no \"intent\" behind the use of terms or phrases in the pages, but for anyone who's tried writing a few hundred blog entries a year or adding unique articles to a site, the return on investment is clear. The tough part is generating a strategy to that creates the content. Internally, we have a few methods that we use and recommend to clients: Brainstorm attitudes, questions, concerns and interests from different perspectives about the industry - vendors, consumers, regulators, outsiders, financial side, bizdev side, marketing side, advertising side, sales, etc. Approach from a \"hobby\" angle - does anyone do this for fun? If so, what aspects are they interested in? Hit the communities - use forums and message boards to generate new topics (this is a great way to stay timely and relevant, too) Subscribe to the newswires - as industry related news comes in, you can find new topics to fit in Does anyone else have a methodology they follow or a practice they like in order to generate long tail content? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Accidental Wisdom of Long Tail Targeting"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Accidental Wisdom of Long Tail Targeting"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}