{
  "url": "https://moz.com/blog/the-huge-untapped-potential-of-qa-content-for-seo",
  "slug": "the-huge-untapped-potential-of-qa-content-for-seo",
  "title": "The Huge Untapped Potential of Q&A Content for SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Question and answer content has been around on the internet a lot longer than the web. From the early days of usenet (and before that, on prehistoric technologies that came before my time) people have been asking experts for answers. You can't fail to have noticed, however, that it has resulted in…",
  "content": "The Huge Untapped Potential of Q&A Content for SEO Content Marketing By: Will Critchlow July 3, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Will Critchlow July 3, 2011 The Huge Untapped Potential of Q&A Content for SEO Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Question and answer content has been around on the internet a lot longer than the web. From the early days of usenet (and before that, on prehistoric technologies that came before my time) people have been asking experts for answers. You can't fail to have noticed, however, that it has resulted in some of the lowest quality content on the web. For far too many questions, the ranking answer is Yahoo! Answers (or similar) that looks as though it was written by someone who found writing YouTube comments too intellectually challenging: Incidentally, note that there is a Yahoo! Answers API which can be a great source of data for keyword research and content inspiration. There is a clear need and opportunity for this kind of content. Many users search in question format: unfortunately not quite enough to support the venerable Ask Jeeves that encouraged this behaviour There are clearly a lot of commercially-oriented queries in there. You only have to look at many of the kinds of questions people ask on Twitter to see this: You can see the attraction to search engines of indexing Q&A content. While they have made leaps forward in natural language processing, they are still dumb text query engines at heart and having both the question and the answer in plain text on the page clearly supports them in providing efficient answers to many natural language queries. My favourite example of the right way of doing things is Stackoverflow. If you have ever tried to do anything related to programming, you will have hit annoying issues very early on. At Distilled we have labelled most programming as \"copy, paste, swear, fix typo\". If you're anything like me, RTFM might as well stand for JFGI these days and you will Just Google It(TM) straight away. As soon as you do this (certainly in recent months), odds are you are going to land on Stackoverflow. The answer you find there is likely to be helpful, authoritative and on you go. But how did it get that way? Stackoverflow is clearly good for search engines, but it got that way by being great for users. If anything, the experience of asking a question and getting it answered is even more impressive than just seeing the repository of brilliant answers that already exist. Even really annoying basic questions get quick, patient answers Lessons from Stackoverflow So what did they do so right? Avoid many versions of the same question The issue of multiple almost-identical threads is so prevalent on most Q&A sites that Google has evolved a UX pattern specifically for this: Stackoverflow gets around this with a many-pronged attack: Start with a culture of curation - when users know they are creating a reference, they behave differently to threaded forum discussions Use great power wisely - with curation as a justification, Stackoverflow editors can edit, move, lock or close replies to questions to encourage desirable behaviours Scale curation and editorial - I'll write more about the gamification, but the increasing site editing ability that comes with the earning of karma enables a small core team to enlist the help of a large passionate team of editors UX hints point people in the right direction - as you start asking a question, similar previous questions appear \"google-instant\" style encouraging browsing before submitting Get good answers, fast From what I've read the biggest KPIs for the Stackoverflow team are proportion of questions with accepted answers and the speed of answer. Indeed these are high on the list of metrics to consider before opening a bring q&a site out of beta. I love the data-driven attitude and transparency they show - this is a post about bringing the home improvement forum out of beta: It's interesting to think about how they have designed a site and a community to achieve great results on this front. In my opinion, a large part of it stems from having nailed the incentives - in particular: Gamification It's no secret that people love points, awards and power. The game mechanics built into stackoverflow bring all of these things: Points - with evidence ranging from gathering twitter followers to foursquare points, we see that give people a number and they will work to improve it even without an obvious reward. The setup of stackoverflow rewards both quick answers (high # points / time) in general and correct / insightful answers to hard questions (that get voted up). This nicely aligns with the goal of \"good answers, fast\" Awards - you get badges (see below) as you complete tasks around the site. These are nice for their own sake - especially if you get access to the rarer ones - but they also bring you: Power - the points and badges you acquire unlock special powers ranging from the ability to rate other people's answers all the way up to full admin rights to the site with the power to delete, move and edit pretty much anything. This funnel of power aligns user incentives very effectively I've only got a handful of stackoverflow badges so far. Maybe I'm immune to their wily ways? If you can, build from a passionate community In the case of Stackoverflow, they built from a bunch of overlapping groups of passionate users (as I understand it, based largely on the personal clout of Joel Spolsky and Jeff Atwood). In the case of the SEOmoz Q&A forum, it's obviously benefiting greatly from the community on the blog etc. If you want to read more about the intersection of Stackoverflow and SEO, they have had a couple of posts about it: one, two and a HN thread. Great moderation Stackoverflow solves the moderation problem in one way. Quora is tackling it in a different but fascinating way: A quiz for new users (that wasn't in place when I joined!) to ensure that everyone registering for the site at least understands the way that the business wants the site to end up structured A whole bunch of product features designed to nudge people towards desired behaviours An encouragement to \"think in the Quora way\" throughout - see the FAQ for a number of examples You should want these benefits on your site We have been doing a lot of thinking about the possibilities in this space - and what happens when you get it right. When Tom was at SEOmoz (before heading to NYC), one of the things he pushed hard was to add many of these features to the Q&A forum: Ask an Owner I have also been working with one of our UK clients, Reevoo, on a new feature they call \"Ask an Owner\" that enables retailers and manufacturers to allow potential buyers to ask questions of those who already own a product. By allowing those retailers and manufacturers to expose that content to search engines, we hope to access some relatively untapped areas. Reevoo already provide review functionality for many top retailers and brands and they are seeing some phenomenal stats on the new Ask an Owner service in terms of questions being answered, % of good answers etc. It is amazing how many relatively sensible questions still have no content indexed e.g. \"Does the HP probook 4320s support skype video calling?\" you can work out the answer from many of the resulting pages if you know what to look for, but wouldn't it be great if there was a page with that title and body content including something like: \"Yes. There is an in-built webcam that works very well in reasonable lighting conditions. As with many laptops, it's built into the top of the screen which makes for natural conversations as you automatically look roughly at the camera as you speak. The built in microphone is also good enough in quiet conditions. For more serious use, you should consider a stand-alone microphone.\" That's the kind of content that should be generated by \"ask an owner\" style functionality. If you happen to want to know more about ask an owner and our general views on UGC in retail, you can check out the whitepaper I wrote on the subject (registration required). Q&A and the investment community The investment community got all excited about Q&A sites last year and pumped loads of money into Quora and the like. The reasons they got excited are similar to the reasons I believe there is untapped SEO potential here, but I also think there is significant value for many smaller businesses even in things that wouldn't get investors hot under the collar. Today is a US holiday and I'm also not in the UK office. As a result I may be slow to jump back into the comments below, but don't let that stop you sharing your thoughts. I'll join in when I can! Hey everyone, this is Casey from the SEOmoz Marketing Team, I thought I would take this time and add some stats from the SEOmoz Q&A Forum. Below are the stats from March 28 to July 3, 2011: Question 4,256 Total public questions asked by 1,941 members. 3591 questions are looking for a specific answer. 665 questions are open discussions. 18 Hours - the average until first answer was received. 2,044 answers marked as helpful. Traffic 1,011,500 pageviews. 5,254 keywords to 2,841 pages. 14,656 unique visitors from search traffic. Members 2,422 active members in Q&A. 52,722 MozPoints earned. 100 Users earned more than 100 MozPoints Thanks to all our members who have spent many countless hours in the Q&A Forum answering questions for other members! The amount of knowledge that gets shared in there is amazing! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Huge Untapped Potential of Q&A Content for SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Huge Untapped Potential of Q&A Content for SEO"
    },
    {
      "level": "H2",
      "text": "Lessons from Stackoverflow"
    },
    {
      "level": "H2",
      "text": "You should want these benefits on your site"
    },
    {
      "level": "H2",
      "text": "Q&A and the investment community"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Critchlow\n          \n            Will Critchlow\n          \n            Will Critchlow"
}