{
  "url": "https://moz.com/blog/the-google-payola-issue-isnt-going-away-anytime-soon",
  "slug": "the-google-payola-issue-isnt-going-away-anytime-soon",
  "title": "The \"Google Payola\" Issue Isn't Going Away Anytime Soon - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This morning, Andy Greenberg wrote an article for the front page of Forbes' technology section - Google Purges the Payola. The article focuses on the ongoing battle between search engines and paid links - a battle that most see as unlikely to ever end:\n...",
  "content": "The \"Google Payola\" Issue Isn't Going Away Anytime Soon Blogging By: Rand Fishkin October 4, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 4, 2007 The \"Google Payola\" Issue Isn't Going Away Anytime Soon Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This morning, Andy Greenberg wrote an article for the front page of Forbes' technology section - Google Purges the Payola. The article focuses on the ongoing battle between search engines and paid links - a battle that most see as unlikely to ever end: To most users, the difference between sponsored links and advertisements is a blur. Take, for instance, the online site for the British magazine, New Scientist. Near the bottom of the New Scientist homepage are \"sponsored links\" that launch the curious to odd destinations including teeth whitening sites or German language sites that sell women's shoes--places that are probably only marginally interesting to most New Scientist readers. In the byzantine coding world of search engines, however, the mere existence of such links bumps up the placement of those particular teeth and shoe sites when someone types \"white teeth\" or \"schuhe\" into Google's search engine. Search engines hate this kind of paid-for popularity. Google's Webmaster guidelines ban buying links just to pump search rankings. Other search engines including Ask, MSN, and Yahoo!, which mimic Google's link-based search rankings, also discourage buying and selling links. But as Web commerce has boomed, so too has the value of links--for everyone, including Google. And that's lead to innovation--or from Google's perspective, scams. Tonight, as I was answering emails, I opened up some tabs and hit the \"stumble\" button - admitedly, I love StumbleUpon and the wonderful corners of the web it brings to me - and noticed an odd pattern. The first site I reached had this in the bottom right-hand corner: Wow... Paid links - and sure enough, no \"nofollows\" on those suckers. Well, I thought, maybe it's just a coincidence. I kept stumbling. The next site up had this in the footer: No way! It's using a Wordpress theme that's been \"sponsored\" by a web hosting outfit. The theme links back to the creator, but the ICDSoft link is pointing to their site and has the link title as \"web hosting by ICDsoft.\" Crazy coincidence? Yeah, probably, but I decide to start tracking as I'm stumbling - maybe it'll make for a good blog post (whoa... did Rand just break the fourth wall?). Site #3 had this in their sidebar: Links to Feng Shui and SEO Services without nofollows - why am I not surprised? Over the course of the next 20 minutes, I stumbled another 16 sites, and found 6 more that featured the kinds of links that might fall under the heading of \"Google Payola.\" Check it out: There on the top is an advertising link without a \"nofollow\" on it. Who knows? Maybe the two sites are owned by the same people, or the site wants to give them editorial endorsement, too - totally possible, but very hard to tell. The next site, as you scroll down, shows a lot of questionable links (though again, hard to tell if they're truly \"Payola\"). Next up is a blog with a cute design and a post on Feedburner. But, on the sidebar: BTW - From what I can see, Bizrate.com's links in their marketplace widget are direct and passing juice. And they're ranking pretty well for those four phrases on Google right now. Next up we've got another site that looks pretty suspicious (just from the layout) and has a lovely list of very \"run, don't walk\" type links at the very top: Then there's a blog with a nifty post on must-know Latin words and expressions: All well and good except... Look at the four image links in the top right-hand corner - nofollow's? Nope. The next site has a pink theme to raise awareness for breast cancer - which is terrific. In fact, I don't even see any bad sidebar links. But, then I scroll down a bit more and see a familiar badge: I personally think PayPerPost and other pay-to-blog services are terrific so long as they're disclosed. In fact, I'm thinking about using them for SEOmoz's premium content one of these days. However, they do certainly fit into what Andy discussed in his piece for Forbes and Google has railed about them in the past, so they probably come under the headline of \"Payola,\" too. Of course, finally, I had to come full circle. There's a large number of odd pages on Forbes.com and since this has been reported several times in the SEO world previously (and Google's probably removed the link value at this point), I figured it's fine to mention. Basically, on the bottom of many pages at Forbes, you get a drop down menu that looks like this: Forbes' Special Advertising Dropdown The problem is, when you look at the code of the site, you see this: Forbes Noscript Tag Content The pages they link to look like this: Forbes' Mesothelioma Attorney Page While there's an obvious indication at the top that it's a sponsored page (much like a sponsored section in a magazine), the links aren't \"nofollowed\" which I'm guessing is why the pages don't appear in Google's index (though Yahoo! and MSN both have all the ones I checked). I suppose you could call that irony. My point with all this isn't to \"out\" sites for selling links - no way. I've encouraged some of our clients to purchase links in the past and I suspect I'll do so in the future (though we generally try to be extremely careful about it). I personally think selling links and making a living off the gap in search technology is neither evil nor illegal (though I do think there's usually smarter ways to go about it). What I'm really trying to show is what an immense quantity of websites are engaged in link practices that Google would consider \"un-trustworthy.\" Yet, as you can clearly see in the search results of thousands of commercially competitive terms, paid links still rule. I think Danny Sullivan summed it up best in the Forbes article: \"Google will never be able to stop paid links altogether,\" Sullivan says. \"They'll stop the obvious stuff. They'll create a climate of fear and a sense of responsibility. But some will still get through.\" And so long as \"some\" get through, the economy of paid links will continue to generate revenue for a massive subsection of the web. The search engineers certainly have their work cut out for them if they want to tackle this problem in a scalable fashion. p.s. One final frustration - I would have loved to link out to some of the sites that I posted about, but I'm seriously concerned about the \"bad neighborhoods\" phenomenon, which is frustrating. I hate worrying about whether or not a link from SEOmoz is going to hurt our rankings (as something has with this page) or if the engines might remove our ability to pass linkjuice if we're not careful where we link. There's got to be a better way, right? UPDATE From Rand: Although I'm still conflicted as to whether it's the right thing to do, I've removed the references to the actual sites in question. It certainly makes the blog post less powerful and doesn't nearly illustrate the hypocrisy of the engines' positions on paid links (as showing the site helped to illustrate how many high quality, legitimate sites that probably have never heard of Matt Cutts or the guidelines for paid links engage in this behavior). However, I'm trusting Donna Fontenot's wisdom and pulling the specifics. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The \"Google Payola\" Issue Isn't Going Away Anytime Soon"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The \"Google Payola\" Issue Isn't Going Away Anytime Soon"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}