{
  "url": "https://moz.com/blog/the-fear-of-the-disconnect",
  "slug": "the-fear-of-the-disconnect",
  "title": "The Fear of the Disconnect - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I am going on vacation today and there is one thing that concerns me a lot about my upcoming holiday. For the next nine days, I will have no access to the Internet. Absolutely none. Not even dial-up.",
  "content": "The Fear of the Disconnect Moz News By: Jane Copland July 13, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland July 13, 2007 The Fear of the Disconnect Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I am going on vacation today and there is one thing that concerns me a lot about my upcoming holiday. For the next nine days, I will have no access to the Internet. Absolutely none. Not even dial-up. My hands are getting clammy as I type. It's not a nice feeling. Rand mentioned a plan whereby you can access the internet through cell phone service, but the place we're going to is not covered by my provider. There is not even any roaming coverage in the northern-most part of Idaho. We have a land line and we used one of those omnipresent AOL dial-up CDs last summer, but we were there for three months. Like most of you undoubtedly are, I'm addicted to the Internet in a way that my saner family and friends don't understand. I'm the sort of person who checks their email within ten minutes of getting up in the morning. I scored 10/10 on the Internet Micro-Celebrity quiz. I think LOLcats are hilarious. And I'm expected to go without this vice for nine days? I started remembering those awful times during college when my nasty Gateway computer would break down, or when the college IT department would \"discover a virus\" making its way around the dorms and shut off our connection. They were awful times. Fifty-eight television channels to choose from and nothing made up for not being able to access AIM. Both times I've moved into a new apartment, I've stressed about whether or not I'll be able to steal wireless off the neighbours before the Comcast guy comes around and hooks me up. But every now and then, through the cuticle-chewing, it occurs to me that there was a time before the madness. Up until I left for college, I didn't have Internet access at home. We had a computer, but I'd check my email once or twice a week at school and there was no such thing as Facebook. When I had to find out something for an assignment, I'd look it up in a book. I don't think I even know how to do that anymore. I don't know if I can remember how to find things in books. Books do not have Ctrl + F. However, I somehow managed to graduate from high school without Gmail, Wikipedia and the self-esteem boost that comes from seeing that three people wrote on your wall while you were sleeping. How did I keep in touch with people in different cities and countries? How did I have friends? Did I have friends? I used to read the newspaper instead of Reddit and, once, I could correctly type both \"goggles\" and \"Google\" without any confusion or backspacing. I'm amazed that no one else in my family is at all concerned about this nine day hiatus. They haven't even mentioned it. I'm still torn over whether to even take my laptop, as it may only serve to remind me how much I miss my Firefox; how well it knows me and how much I love its customized tool bars. MSN Messenger will glare at me from its desktop icon. It will try to sign itself in every time I turn it on, and its failure will be solely my fault. I don't think I can take the guilt of seeing the little green and blue blobby icons covered in a nasty red circle. The monitors with the red cross slapped across their little dark screens. It would be like going back to the house I grew up in and finding that the subsequent owners had let it all but fall down. I'm going to have to stop now, because I have a few errands to run and I've created an ulcer inside my bottom lip. Please don't spam my Facebook wall while I'm away: I'm almost at 1000 comments and I don't want to miss the opportunity to screenshot such an event. In the meantime, I'll leave you with the horror of what I'm going to be doing while I'm forcibly offline: See you all next Monday! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Fear of the Disconnect"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Fear of the Disconnect"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}