{
  "url": "https://moz.com/blog/the-pros-and-cons-of-writing-your-own-blog",
  "slug": "the-pros-and-cons-of-writing-your-own-blog",
  "title": "The Pros and Cons of Writing Your Own Blog - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "After Rebecca’s desperate plea for YOUmoz posts, I felt compelled to stop being a lazy churl and get my finger out.\n\nSo here you go!\n\nSelf promotion is a big thing in our little community, and in my comment I alluded that it may be leading to the dwindling number of YOUmoz posts. As such, for all…",
  "content": "The Pros and Cons of Writing Your Own Blog Content Marketing By: Stuart P Turner February 9, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Stuart P Turner February 9, 2009 The Pros and Cons of Writing Your Own Blog Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. After Rebecca’s desperate plea for YOUmoz posts, I felt compelled to stop being a lazy churl and get my finger out. So here you go! Self promotion is a big thing in our little community, and in my comment I alluded that it may be leading to the dwindling number of YOUmoz posts. As such, for all you lovely SEO people I am going to lay down my pros and cons of posting on your own blog, as opposed to posting here. Pro – You’ve Got Your Own Blog! Having your own blog means you can stamp your personality all over it. Add your own logo, look & feel, naked pictures – anything you like. Con – You’re On Your Own A new blog has no real authority, and as such it will take you some time to build up a reputation through quality posts and content. Pro – Your SEO Buddies Can Help You can ask all your lovely friends to give you some link love, or even to co-author with you. Con – You’re In Direct Competition Your lovely friends might not want to give you the link love if it means you get their business. You are also competing for readership against some big players… Pro – You Can Practice On Your Blog You can try out new techniques, test theories & get stuck in to analytics. Con – You Might Not Have The Traffic There are so many SEO blogs out there, it could be a long time before you get enough visitors to garner conclusive results. Pro – Rebecca (Usually) Won’t Turn You Down That’s right, many times you can post whatever you want, whenever you want. Con – No Quality Control Proof reading and QC is a big bonus when it comes to SEO, to avoid repetition of posts, misunderstandings and general spelling and grammar errors. Pro – You Can Include Subjects Other Than SEO One of the brilliant things about all the SEOs I know or stalk is the range and diversity of interests they have. Many blogs combine SEO with another personal interest to spice it up a little. Con – Regular Updating Can Become a Challenge Sometimes there just isn’t anything to say. When you make blogging your business, you have to post regularly, but doing this alone can be tough. A community takes that pressure off and may even inspire posts you didn’t know you had. Personally, I have to post on my employer’s blog in the Search Marketing section, which I enjoy doing (I’m not linking, as a whole new blog design is going live soon), and I have started my own; however, I am now considering just turning this into more of an information/contact page. Posting to YOUmoz keeps us together as a community, whereas if we all just posted on our own blogs we would have about a thousand RSS feeds to read every morning, and trawling through them would become a real pain. This would mean valuable posts may get lost in the noise, as well as possibly getting tarred with the ‘snake oil SEO’ brush. So I am for YOUmoz - my resolution from this day forth is to make a bigger effort to post on here and get more involved with other posts. I’m sure you all have more pros and cons and opinions to add, so please do and give YOUmoz a kiss of life. No tongues please. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Pros and Cons of Writing Your Own Blog"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Pros and Cons of Writing Your Own Blog"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Stuart P Turner\n          \n            Stuart P Turner"
}