{
  "url": "https://moz.com/blog/the-seo-routine",
  "slug": "the-seo-routine",
  "title": "The SEO Routine - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Mark Scott wrote me this morning to ask about recommendations for an SEO \"routine\" - putting together the process for all the tasks required to successfully implement search friendliness, targeting, marketing and all the other elements of SEO. I'm happy to oblige :)\nAt SEOmoz, we've got a fairly…",
  "content": "The SEO Routine SEO Basics By: Rand Fishkin May 9, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 9, 2007 The SEO Routine SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Mark Scott wrote me this morning to ask about recommendations for an SEO \"routine\" - putting together the process for all the tasks required to successfully implement search friendliness, targeting, marketing and all the other elements of SEO. I'm happy to oblige :) At SEOmoz, we've got a fairly standard process for sites we build and market (internally; not for clients - a whole different story) that goes something like this: Develop an Idea Worthy of Spreading Virally Since we're not interested in paying a fortune for advertising or promotional campaigns, and have proven to be very proficient with word-of-mouth techniques (particularly on the web), we favor ideas that we think will spread like wildfire, without much incentive. Conduct Competitive Research It's critical to know who you're up against, and searching at Google, Yahoo!, del.icio.us/popular tags, Digg and Technorati (depending on the vertical) helps us identify potential competitors. We want to know what they're doing right and wrong so we can execute smarter and better. Alternatively, if the competition has the market sealed up, we won't waste our time with an idea that's already been done well. Brainstorm Keywords We're not just brainstorming for keyword research, we're also exploring other angles a project could take and other channels for opportunity. Keyword Research You have to know if your ideas have enough popularity and relevance to be an attractive target for traffic. Assume that you can get between 1-5% of the keyword numbers reported by Overture or Wordtracker and then decide - would it still be worth it? When the answer is yes, you've got a winning project. We also use the keywords to know what to target in our pages and our linkbait marketing efforts - generally if we think the idea is good enough, we'll ignore the competitiveness level and shoot for the moon, i.e. the highest trafficked, most popular term/phrase in the sphere. Information Architecture Building out the concepts for which pages should exist on a site, what content modules should be on them, and how to organize the site is our next step. I like to use visual software like Flash, but a whiteboard or sketchpad works great here, too. Keyword Targeting Now that we have our KW research and an idea of what pages will exist on the site, it's time to determine which URLs go after which terms/phrases. Oftentimes, this means expanding the site architecture, which is fine, but I like to keep in mind that every page targeting a term better also have a reason why someone should link to it that sells itself. Competitive terms won't rank on new sites (or low-link-juice sites) without some serious external link love. Site Design Matt goes to work and makes everything look shiny and beautiful. I'm sure there's a long, complicated, arduous process he goes through here, but I just see a page spec go in and something rapturous come out, so I can't speculate about what goes on in his head or on his monitor. Content Creation Often the most time-consuming part of the process, this is when we author all of the text, images and multimedia that go into making the site great. High quality writers and editors are critical. Development Programming... Glorious, time-consuming programming and lots of it. Luckily, our team is very search savvy, so we don't generally worry about building a site that the engines won't like. However, this is the stage where you need to set the ground rules. It's cheesy and self-promotional, but if all your developers read and trust the guidelines in the Illustrated Search Friendliness Guide, you're going to have a much better time of things later on. Launch Hooray! We're ready for launch. The site goes live, we link to it from a blog post or release an announcement to some prominent bloggers in the relevant field and ping friends to test it out. Social Media Promotion Generally, since our material is what we consider \"Digg-worthy\" we'll send submissions to the relevant social news sites and even build a buzz inside communities where we regularly participate. Standard Link Building Luckily, we almost never engage in this practice, but on occasion, it can be valuable for a particularly high-return keyword term or phrase. Analytics Monitoring your results and finding the weak spots where you can improve is essential. We love Indextools, but often also have separate monitoring on the site to track inbound links (Technorati & Yahoo!), new member signups, contributions, purchases, etc. What does your SEO routine look like? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The SEO Routine"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The SEO Routine"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}