{
  "url": "https://moz.com/blog/the-end-of-consulting-a-new-partnership-our-focus-on-software",
  "slug": "the-end-of-consulting-a-new-partnership-our-focus-on-software",
  "title": "The End of Consulting: A New Focus on SEO Software - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today I have two very big announcements. First, SEOmoz is exiting the consulting business to focus exclusively on our software model. And, second, we have an expanded partnership with Distilled, who'll be taking over many of our consulting clients and opening offices here in Seattle. I'm going to…",
  "content": "The End of Consulting: A New Partnership & Our Focus on Software Moz News By: Rand Fishkin February 1, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 1, 2010 The End of Consulting: A New Partnership & Our Focus on Software Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today I have two very big announcements. First, SEOmoz is exiting the consulting business to focus exclusively on our software model. And, second, we have an expanded partnership with Distilled (new US site: Distilled LLC), who'll be taking over many of our consulting clients and opening offices here in Seattle. I'm going to talk briefly about both of these below, then add detail on why we're so bullish about the SEO software market. SEOmoz started in 2004 as a blog where I could post my struggles and learnings about search engine optimization. By 2005, the business was taking real consulting clients under the SEOmoz name. In 2007, we launched PRO membership, our self-service SaaS product and by the end of the year, PRO was 50% of our revenue. As I noted in the post on our venture capital process, that number has grown dramatically (to 85% of revenue) and in 2010, our goal is to make it the sole focus of the company. As part of our exit from consulting, we've worked hard over the past 6 months with Distilled (note how Will Critchlow has been in a lot of Whiteboard Fridays of late) to help take over our existing clients and transition the handling of consulting leads. As part of this, we determined that Distilled could do the most good by opening an office in Seattle, WA. Duncan Morris is out in Seattle this week (and yes, we're making him watch the Superbowl next Sunday) to help scout locations and begin hiring. If you've got SEO experience and are in the Seattle area, please drop them a line! What Does this Partnership Mean? Distilled will continue to contribute regularly to the blog, Q+A and WB Fridays on SEOmoz (we've dealt with the fact that their accents make every piece of advice sound more credible) We'll continue to work jointly in organizing the London and Seattle PRO Training Seminars each year Distilled will be helping the SEOmoz product & engineering teams to design, build and test great tools and software (thanks for the help on OSE!) Our internal SEO team will be transitioning to focus on product & content development as well as marketing for the SEOmoz site (we're like the cobbler's children over here and that needs to change) SEOmoz's active consulting contracts will be 100% complete by June of 2010; however, we'll continue to provide informal service to non-profits like the United Nations & Seattle Children's Hospital. We'll be recommending Distilled to many of the folks who ask us for consulting (when there's a good fit), but will NOT be changing our protocol of continuing to suggest companies on our Recommended List Why Software? In the late 1990's, companies who wanted detailed reporting on their visitor analytics turned to consultants for sophisticated log file analysis or individual installations of code to track data. At the same time, the field of email marketing was dotted by thousands of individual, hard-to-scale, non-standard solutions. Today, SEO is the same way. Whether you're an external consultant or a in-house operator, you're almost certainly mashing up dozens of web-based tools, possibly with home-grown software and self-built spreadsheets to produce an SEO process that works. While many of us have found ways to do this effectively, there have been no platforms of SEO software to set the standards. That's what we're trying to change. At SEOmoz, we believe that the promotion of ideas on the web needs to be simplified and that it starts with SEO. Small and medium businesses, web-based startups and consultants of all sizes need tools to help make their lives easier and processes that track important data for them, identify actionable metrics and report externally the missed opportunities and competitive landscape we all face. Just look how dollars are spent in the search marketing sphere: (sadly, no 2009 numbers yet, but the distribution is likely very similar, though spending now exceeds $14B) Now compare that to where growth is expected in online marketing over the next few years: This summer, SEOmoz will be releasing our new software platform (and in the meantime, there will be plenty of other releases including an update to Open Site Explorer, a new Keyword Difficulty tool, a dramatically upgraded mozbar and more). We hope you'll join us for this exciting journey. p.s. I also wanted to call out Jon Henshaw's terrific post on software vs. services. After working hard to develop this partnership over the last few months and transition out of consulting, we couldn't help but ponder the old adage of great minds thinking alike. :-) Update from Will: My post on the deal is now live as well over on the Distilled blog. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The End of Consulting: A New Partnership & Our Focus on Software"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The End of Consulting: A New Partnership & Our Focus on Software"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}