{
  "url": "https://moz.com/blog/the-future-of-the-semseo-industry-or-what-kind-of-sem-are-you-going-to-be",
  "slug": "the-future-of-the-semseo-industry-or-what-kind-of-sem-are-you-going-to-be",
  "title": "The Future of the SEM/SEO Industry: What Kind of SEM Are You Going to Be? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The other day I mentioned I needed an attorney for a business matter.  My mom asked why I didn't just call my cousin the attorney.  I explained to my mom that while my cousin is an attorney, she was a medical malpractice attorney and probably knew very little about real estate transactions.The…",
  "content": "The Future of the SEM/SEO Industry: What Kind of SEM Are You Going to Be? Public Relations V By: Vinny Goldsmith November 8, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! V By: Vinny Goldsmith November 8, 2007 The Future of the SEM/SEO Industry: What Kind of SEM Are You Going to Be? Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The other day I mentioned I needed an attorney for a business matter. My mom asked why I didn't just call \"my cousin the attorney.\" I explained to my mom that while my cousin is an attorney, she was a medical malpractice attorney and probably knew very little about real estate transactions. The whole thing got me thinking about Search Engine Marketing (SEM) and where the future of the industry is going. There are a lot of high-dollar professions where you'd be hard pressed to find a generalist, and when you do they probably can't help you too much with your particular problem - especially if it is specialized and or complicated. You might have a family doctor who can give you annual checkups and help to keep you healthy, but if you run into any serious issues he's going to send you to a cardiologist, or a podiatrist, or dermatologist, or any number of medical specialists.The same thing with the accountant who does your books and payroll--they can help you with running your business and filing your taxes, but if things get too complicated they're sending you to a tax accountant, or a managerial accountant, or an accountant who specializes in doing audits for Sarbanes Oxley, etc. The point is you can look back at most of the professional services (e.g. consulting, engineering, etc.) and find loads of specialists - but very few generalists. If you want to go to a one-stop shop for all your current and future needs, you're probably better off with a firm that has at least a handful of different specialists or maybe a few dozen specialists and a large support staff. As the SEM industry matures, what does that mean for the people that practice it? While a vast number of SEOs might claim to be a one-stop shop for all your SEO/SEM needs, we can already see that there are SEOs that specialize in link-building/buying, keyword-analysis, consulting and training, link-baiting, content, country-specific, language-specific, PPC, strictly organic, black-hat, etc. Will the industry be further specialized? After looking at the offerings from SMX, it looks like this might be the case. SMX takes one area of search (Local, Mobile, Social, etc.) and builds an entire expo around it. If there is that much information to absorb and master around each of those niches that you can build an expo around it, does it make sense to be proficient in more than one or two? In the future, it is very likely that Search Engine Specialists will start to define themselves and their client based on an even narrower sense. In the future will we have SEOs who ONLY specialize in local search, or SEOs who ONLY handle a certain kind of client (e-commerce or gambling or real estate)? If this is the future, one thing is clear for the solo SEO/SEM practioner: relationships and networking with other SEOs/SEMs will be even more important in the future than it is today. Otherwise, who are you going to refer to your clients when their website drops a bit in the rankings and you can't fix the problem? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Future of the SEM/SEO Industry: What Kind of SEM Are You Going to Be?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Future of the SEM/SEO Industry: What Kind of SEM Are You Going to Be?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Vinny Goldsmith\n          \n            Vinny Goldsmith"
}