{
  "url": "https://moz.com/blog/the-nature-of-online-communities",
  "slug": "the-nature-of-online-communities",
  "title": "The Nature of Online Communities - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So this weekend I had a bit of free time so I decided to learn how to play go (narrowly beating chess I might add). Now as anyone who's familiar with go will know, it will probably take me more than a weekend to learn how to play but still, you have to start somewhere right!? Of course, being an…",
  "content": "The Nature of Online Communities Social Media T By: Tom Critchlow October 16, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! T By: Tom Critchlow October 16, 2008 The Nature of Online Communities Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This weekend I had a bit of free time so I decided to learn how to play Go (narrowly beating chess, I might add). As anyone who's familiar with Go will know, it will probably take me more than a weekend to learn how to play but still, you have to start somewhere, right? Of course, being an internet junkie, one of the first things I did was Google around to find some information online about Go. It didn't take me long at all to find some Go forums and it was at this point that an idea for a blog post came to me. Online communities are the same whichever niche you're in. There's really nothing different about them. Expanding this train of thought further, I realised that any online community worth its salt has all of the characteristics below. Realising this, I've listed some SEO applications of these facts at the bottom of the post (so keep reading if you think it doesn't apply to you!). Respected Members Communities are, essentially, groups of people who share a common passion. Of course, some people are either more passionate than others or have been passionate for longer. This leads to respected members of the community - those that contribute heavily, are wise beyond their years and generally everyone likes. Moderators (or Mods, as they're affectionately known) Of course, as communities grow inevitably they become too big for one person to control and so often there are appointed moderators assigned to help out managing the communities. Usually these will be responsible for a particular sub-forum each, though the specifics vary. It's interesting to note that mods have a love/hate relationship with the community. While they are loved, if they do a good job generally they also get a lot of abuse whenever they have to implement new rules or ban certain members or delete offensive content. Acting as an arbitrator is no different to real life where the people who have to make the decisions always get some backlash regardless of which decision they choose. God Bless Photoshop One thing which is common to all online communities I've ever seen is photoshops. Taking an image which is relevant to the community and photoshopping some kind of in-joke over the top almost always results in the most popular threads of all time. This happens even in our own dear little SEO community, but it happens a lot more out in the wild. In Jokes FTW Of course, leading very closely off the existence of photoshops is the existence of in-jokes. In-jokes in forums from my experience usually come from one of 3 things: A legendary user (often who existed for a short space of time and doesn't post anymore) who the whole forum used as a scapegoat or was so senselessly idiotic that the whole forum rallied against them. It's interesting that these are the only real times that the whole community unites. It's very very hard to artificially create this unity in the community -- it's just one of those strange things that happens. Grimstarr is one such legendary user from the 2+2 poker forums. He has over 9500 results in Google, including his very own urban dictionary page! Note that even long after the member has disappeared, the memory remains as a forum in-joke. Check out this recent Dow Jones vs Grimstarr thread which is comedy gold, IMHO (note that the poker earnings graph peaks at over $900k - you can easily see how Grimstarr earned a name for himself!). You can see how big a phenomenon this was from Google Trends! A legendary post which was so amusing/outrageous that the whole community remembers and re-uses the trend. Rivalries. These can come in many shapes and sizes. Sometimes it's one user against another, sometimes it's one community against another. Either way, rivalries always get the tempers flaring and are often remembered for years to come. Graphs This is a curious phenomenon and one I didn't fully expect, to tell you the truth. Graphs are an integral part of poker forums (check out this thread where you'll see graphs like this or this), but I didn't expect them to be so big in other forums. Turns out that there's something about graphs that the internet loves. Regardless of which niche you're in, you'll see graphs like this (audio frequency response of someone's room) and this (someone's Go rank charted by number of games played) wherever you go! The interesting application of this is that there is a huge scope for internet marketers who are savvy and niche enough to profit from this (see bottom of the post). Profile Pictures (and gifs) If you're thinking this is just confined to ridiculous forums full of teenage boys providing no value, then you need to revisit the avatars of SEO people on Twitter! Actually - I'm not sure that disproves my point... ah well. The point is that people like to brand themselves with avatars, and often in online communities your avatar is all you've got for people to recognise you. Hence, people like to have something funny and/or memorable. The problem is that, of course, most people are incapable of coming up with something original so if you can, create something funny and/or memorable as a gif or image that members of the community can use as an avatar. Stupid Little Arguments I was in two minds about adding a section for flame wars and arguments, but seeing as they happen ALL THE TIME in online communities I can't really leave it out. What I won't do is link to any, as I'm sure that'll only fuel the fire, but suffice to say that these are always going to spring up and it's often surprising which side of the argument different members of the community come down on. While I've resisted linking to any here, flame wars are, by nature, controversial and hence can be used to drum up links. Use this tactic with caution though - it's on the same level as getting sued for links! Summary So what does that leave us? Hopefully the clever ones among you have already spotted (or already knew about) ways of leveraging these ideas for fun and profit, but here are a few seeds to get you started: Why not sponsor a forum? This happens a fair amount in large forums, but it's a good idea nonetheless - remember to back it up with actual users who will engage with and are respected by the community. Is your brand fun? Why not create a series of amusing/viral profile images or gifs? If they're funny enough then people will use them and you get instant branding. Maybe no SEO benefit, but it gets people talking about you and we all know what that means (hint: the answer is links). Create niche widgets which embed useful information for your community. This could be a poker hand converter or a widget to embed Go games in a forum, but if you use a little imagination I'm sure you'll be able to find something in your industry you can use. T-shirts leveraging the community in-jokes are a great way to get your branding out - especially if you're a fun brand. You might even make a few quid if you do it well! When you're looking to spread content and engage with the community, the trusted members are a better bet than the mods most of the time. Use forums for linkbait content (see my post on Distilled on user generated linkbait). There's so much good content on 2+2 I'm astounded it's not been on the Digg homepage yet - I really feel there's a gap in the market for one of the poker sites to start owning social media pretty hard, it's only a matter of time. Mark my words! Hopefully that will get you started on thinking of ways to engage with forums and online communities to build some links. If you're on the other side, however, and want to grow an online community, remember that the above things are going to spring up whether you like them or not, so better to plan ahead of time and go with the flow. If you're in the business for starting or maintaining an online community, I strongly recommend you check out Feverbee. It's a great blog on exactly this topic! Feel free to leave comments with other ideas and aspects of online communities that I've missed :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Nature of Online Communities"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Nature of Online Communities"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Critchlow\n          \n            Tom Critchlow\n          \n            Tom Critchlow"
}