{
  "url": "https://moz.com/blog/the-real-power-of-twitter",
  "slug": "the-real-power-of-twitter",
  "title": "The Real Power of Twitter - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been suppressing the urge to write this post for a while now. It's not that I don't love Twitter (I suspect my wife is a few days away from scheduling my intervention); it's just that I'm saturated by it. It's not the tweets themselves, but the incessant whining noise made up of every…",
  "content": "The Real Power of Twitter Social Media By: Dr. Peter J. Meyers May 12, 2009 Table of Contents Copied! By: Dr. Peter J. Meyers May 12, 2009 The Real Power of Twitter Social Media I've been suppressing the urge to write this post for a while now. It's not that I don't love Twitter (I suspect my wife is a few days away from scheduling my intervention); it's just that I'm saturated by it. It's not the tweets themselves, but the incessant whining noise made up of every second-rate media personality in the world \"discovering\" Twitter on a daily basis and every self-declared \"social media guru\" regurgitating the same How to Twitter post a thousand times a week. So, why am I still writing this post? I'm writing it because I've experienced something with Twitter that I don't hear many people talking about. The real power of Twitter isn't in easy mass-marketing, driving a few more links, Diggs, Stumbles, or Sphinns, or even in branding and making a name for yourself. The real power of Twitter is in transforming online connections into real-world relationships. For me, Twitter has become the most powerful tool at my disposal to bridge the professional/personal gap and drive offline relationships. If you haven't experienced this, let me share a few tips (and a story or two): (1) The Mundane Matters It's easy to make fun of Twitter for the constant life-streaming, but I think it's one of Twitter's greatest strengths and the key to why Twitter makes the boundary between professional and personal so easy to cross. As you notice your professional contacts talking about their kids, being home with the flu, having a bad day, etc., it's hard not to relate and feel like you know them a bit better. Of course, that's a two-way street. If you're sincere, it's a lot easier to start conversations with strangers on Twitter than on a platform where a professional obligation is implied (like LinkedIn). (2) Harmonic Convergence Twitter is not only a great place for keeping tabs on your local scene, but it's also great for letting you know when people are in your neighborhood. A while back, I saw a tweet from my favorite itinerant SEO, Pat Sexton, that he was in Chicago for an event. Now, if you don't know Pat, you have to understand that outside of conferences, he's a hard man to find (mainly because he lives in a remote hut in Hawaii and only talks to monk seals). When I noticed Pat was in Chicago, I replied back on Twitter, and found out he was just a few blocks away. Two hours later, we were catching up in a local bar. Without Twitter, I would never have known he was just down the street. (3) Cross the A-List Chasm Everyone seems a little bit more human on Twitter, and this has a way of leveling the playing field between the \"A-List\" and the rest of us. Of course, that doesn't mean you should follow every industry celebrity and virtually foam at the mouth every time they tweet, but there's nothing wrong with sincerely replying to a big name when you have something relevant to say or re-tweeting them when you think it's worthwhile. Of course, like any networking activity, it's easier if the A-Lister is only one or two steps removed from you, relationship-wise. Eventually, you may get a reply or two, and down the road, some real opportunities. (4) Round Up a Posse One of my first experiences with bringing Twitter relationships into the real world was also one of the most powerful. Before last year's SEOmoz advanced training, I sent out a couple of tweets saying that I'd be in town the night before and asking if anyone wanted to grab some dinner. With little or no effort, I managed to round up a group of 6, most of whom I'd never met before, and we accidentally bumped into 3 more folks from the seminar. Not only did I get to meet new people, but this little group became my unofficial conference \"posse,\" rounding up other new people and making the networking experience one of the best I've had at an SEO event. I should point out that I'm not naturally inclined to do this sort of thing. I'm a bit of a wallflower, truth be told, but the personal nature of Twitter and the low risk of sending out a tweet that goes unanswered made a potentially awkward situation easy. I used the same tactic at PubCon last year, and had a similar positive experience, meeting another group of new people that I previously only knew online. (5) Don't Be Shortsighted With time and patience, these online-offline relationships become cyclical. Once you meet someone in person, you return to Twitter knowing them a bit better – they're more likely to reply, retweet, and generally engage with you. This can be a powerful cycle, turning people you might only see once or twice a year at conferences into people you correspond with on an almost daily basis.You'll miss out on all of this, though, if you take a short-term view. Instead of obsessing about getting out today's link, or pushing for a reply or retweet, take the time to get to know people. Real opportunities come from building real relationships, and Twitter is a uniquely powerful touch point in that process. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Real Power of Twitter"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Real Power of Twitter"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}