{
  "url": "https://moz.com/blog/the-secret-value-of-attending-conferences-and-why-smx-west-is-a-mustattend",
  "slug": "the-secret-value-of-attending-conferences-and-why-smx-west-is-a-mustattend",
  "title": "The Secret Value of Attending Conferences - and Why SMX West is a Must-Attend - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I know how tough it can be to justify the expense of attending an industry conference. I also know how easy it can be :) In the world of search marketing, ROI is often based on traffic and conversions (or page views if advertising is the primary revenue model) and despite the fact that attending a…",
  "content": "The Secret Value of Attending Conferences - and Why SMX West is a Must-Attend SEO Events By: Rand Fishkin January 10, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 10, 2008 The Secret Value of Attending Conferences - and Why SMX West is a Must-Attend SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I know how tough it can be to justify the expense of attending an industry conference. I also know how easy it can be :) In the world of search marketing, ROI is often based on traffic and conversions (or page views if advertising is the primary revenue model), and despite the fact that attending a conference won't always bring you tons of traffic and conversions (at least not directly), there's far more value to them than most managers or even attendees realize. Hiring & Scouting You may not even realize you're doing it, but at every conference, you're meeting potential employees, co-workers, clients, and business partners. This is different from the standard \"networking,\" which for many has lost its appeal due to a lack of obvious value. The hiring & scouting that you conduct at conferences doesn't require any face-to-face interaction - you can do it purely observationally. When I attend conferences nowadays, I'm always keeping an eye open for talent - not just for myself, but of any kind whatsoever. Knowing who the brilliant minds on any given topic are has infinite benefits as a business owner AND an employee. Competitive Analysis There's no environment like a conference to check out your competitors (direct and indirect) and learn the ins and outs of their success. I can't tell you how many people openly share their traffic stats, marketing tactics, and business plans - I know I personally do it all the time (though I'm also prone to doing so on this blog, which is considerably rarer in the business world). Even if you don't directly interrogate your competitors, simply attending site clinics and panels (especially for Q+A, when folks bring up their specific sites) will give you a wealth of insight. Tactical Brainstorming I often hear folks complain that they didn't get much out of a particular speaker or session, but the beauty of conferences is that if you approach them with the right mindset, you don't need to learn something earth-shattering in the seminars to come away a winner (not that it doesn't help, and as speakers, we certainly try to make sure you do). The trick is to use the time you're at the conference to think about your business and your website and apply everything you hear to the creative brainstorming process. For every trick that you've seen a dozen times on blogs or forums, hearing it again in context can trigger the creative spark you need to have a brilliant application for it. I've found that time and again, I'll hear speakers or audience members or participate in conversations and lie awake that night jam-packed with new ideas (some that don't even correspond remotely to the concepts discussed that day). Conferences are a brainstorming paradise and a terrific opportunity for new ideas to come bubbling to the surface. Elevator Pitch Testing No matter what you do and who you do it for, you need to have an elevator pitch, and there's no testing ground like a conference to refine and perfect it. Whether you're selling something or just yourself, you'll be asked dozens of times every day \"What do you do?\" The next 20 seconds is a golden opportunity to shine and if you can perfect your technique and shine every time, the future will assuredly be bright. Goal Setting & Self Analysis There is perhaps, no better time or place for a marketer or business person to do a little introspective thinking than on the plane ride back from a conference. You've seen the competition, the speakers, the industry luminaries, the trade show booths, and the backroom deals, and now you can begin to look inward and identify the traits about yourself that are valuable, those that need improvement, and where to go from here. If you've been lost and can't see the forest for the trees, the conference is your chance to float 1,000 feet above the canopy and really examine what you've built and how it fits into the broader ecosphere. One Good Tip = Incredible ROI Finally, from a pure SEO perspective, learning the right tip or how to apply a piece of knowledge in the right way could save you thousands or even bring you millions. I've seen and participated in so many examples where a business owner or in-house marketer suddenly awoke from a fog of ignorance on a specific topic and was able to apply that singular tactic to the tune of untold new revenue. I think those are my favorite emails - the ones that start \"Rand, it was great meeting you at SMX Advanced - I took your advice and we've seen our traffic double in the last week and a half. I'm up for a promotion next month and I think, thanks to your advice, I'm sure to get it!\" I promise you that if I'm getting a couple of these, Danny Sullivan and Chris Sherman must get hundreds. That's the beauty of SEO - once you realize that your menu wasn't spiderable or your content was in iFrames, you can clean it up to the tune of drastic improvement. So, why SMX West? What's so amazing about that show - actually, a lot. It's the first big show from the SMX conference series and the organizers are going all out to make it the best conference experience possible. That means: Great Food - if you've been to SMX Advanced, Social, or Stockholm (mmm... Stockholm - just thinking about it makes me hungry), you know that SMX really prides themselves on making sure you're well nourished and well cared for. Great People - with Danny Sullivan, Vanessa Fox, & Chris Sherman choosing the speakers, you're getting the very best of the best. I had heard that there were more than 50 applications for some of the panels, so you can be assured that the cream of the crop is going to be contributing. That doesn't just mean better content, it also means better presentations and better flow. New Sessions - SMX has seriously re-programmed the lineup for SMX West, taking advantage of many new trends in the industry and also re-formulating some of the old standards. This forces speakers to bring new material and high quality stuff as well - if anyone gives a presentation you've seen before, I'll make sure to have Rebecca crucify them in the coverage :) The Right Timing - Not only is February a month when most of us northerners desperately need some sun, it's also a perfect break from work - and a time when no other holidays or deadlines are looming (tax season's months away & New Year's is far behind) The Right Length - I know Danny debated furiously with himself before deciding on three days, and I think it's the perfect decision. Four day conferences are just barely too much and two day shows feel a little too insubstantial (at least when they're not on a singular, specific topic). The Right Location - Silicon Valley is the hub for search activity in the world, and by having the show there, SMX is ensuring that a ton of great minds from VCs to founders to engineers to product managers and search marketing luminaries will all be in attendance. That, and it's sunny and warm, which sounds so nice compared to the usual February/March trek to New York (not that I don't love New York). Holy Crap; They Have Free WiFi! - Yep, the conference actually features completely free wifi (that works) for all the attendees. I know because SEOmoz is sponsoring it :) Built-in After-Hours Parties - Although they have yet to be announced, my understanding is that there will be events that everyone can attend, every night of the show. Breakthrough Content from Everyone - Chris & Danny have built up a lot of terrific relationships over their 12+ years in the industry (each), and now they get to call on many of their friends and contacts at the engines, from startups (Louis Monier from Cuill sounds like he may actually have something truly revolutionary in search - unlike Mahalo or Wikia) to companies and independents, to help give back. I have very high expectations. Am I biased? Yeah, somewhat - Danny, Chris, Michelle, Karen, & other Chris aren't just people I respect and work with; they're friends. Does that make any of this less true - no. I believe you'll be truly impressed by what SMX West has in store. BTW - I'm telling you this now, because there's only 2 more days to get $400 off the $1,595 registration fee. All the registration information is here - SMX West Registration. You'll also note that you can get a hefty discount on SEOmoz premium membership FULL DISCLOSURE: No! We don't make any money if you attend SMX West, and those aren't affiliate links. However, SEOmoz does have a partnership with Third Door Media for which we run banners for their shows and offer discounts to our premium members (20% off the already discounted early bird rate - which means you only pay $956 to attend!). We're also running a booth at SMX West, which is our first time doing so - more on that in a future blog post :) Also - apologies in advance for the somewhat promotional nature of the latter half of this post. I'm honestly just really excited about the show and hope that everyone in the industry turns out for it. That, and I really want to see SMX do well - I think they deserve it. So go register! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Secret Value of Attending Conferences - and Why SMX West is a Must-Attend"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Secret Value of Attending Conferences - and Why SMX West is a Must-Attend"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}