{
  "url": "https://moz.com/blog/the-top-10-chrome-extensions-i-cant-live-without-in-2013",
  "slug": "the-top-10-chrome-extensions-i-cant-live-without-in-2013",
  "title": "The Top 10 Chrome Extensions I Can't Live Without in 2013 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Having recently started a new job in SEO, I have been re-evaluating my favorite Chrome Extensions. Now that I no longer have a large team supporting me, having fast and easy tools at my fingertips has become even more important. So of course I searched SEOMoz to...",
  "content": "The Top 10 Chrome Extensions I Can't Live Without in 2013 SEO Tools By: Caroline Phillips Rodin January 9, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Caroline Phillips Rodin January 9, 2013 The Top 10 Chrome Extensions I Can't Live Without in 2013 SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Having recently started a new job in SEO, I have been re-evaluating my favorite Chrome Extensions. Now that I no longer have a large team supporting me, having fast and easy tools at my fingertips has become even more important. So of course I searched SEOmoz to see the latest article and recommendations, only to discover to my shock that the most recent posts were from 2010. In SEO years, that’s about 1000 years. Although many of the extensions are still useful, after 2 years I think it’s a good time to review. I’ve put together a list of my favorite Chrome Extensions that I couldn’t do my job without; I hope they are useful for you too. 1. Ayima Redirect Checker Hands down, no question, this is the extension that I use the most. Instead of having to remember to check every page for redirects and then manually copying in every URL in order to detect a redirect chain or a misplaced 302 redirect, I simply land on a page and look up at the search bar. Ayima will show what type of redirect exists (if there is one) and when you click on it, it will show you the redirect path, which is handy for fast identification of redirect chains. Fair warning: This is an addictive extension. While it is helpful to see how competitors sites are arranged, you will find yourself analyzing every site you visit and exclaiming “WHAT?” out loud in the library when you realize that you’re favorite shopping or sports news site is losing all of its equity with a badly placed redirect chain. 2. Canonical Inspector 0.2.2 This is a newer addition to my must have list, which makes sense given the increasing importance of correctly using canonical tags for sites. Imagine how easy it will make your life to arrive at a website and automatically know if: 1) there is or isn’t a canonical tag on the page and 2) the canonical tag matches the current page or a different page. In a matter of seconds you will know if you need to spend the time to go in to the coding and inspect the canonical tag or if your page is good to go. 3. Mozbar Always a winner, Mozbar is a great one-stop-shop for a lot of the important information you need or want for a given page. The updated Mozbar lets you customize your searches by search engine and location, as well as easily highlight the different types of links pointed to a page (followed/no-followed, internal/external). As always, Mozbar displays important SEO metrics for the page, root domain and subdomain, including but not limited to the page authority, domain authority and mozRank™. 4. Page Insights (by Google) Although many elements affect a page’s rank and visibility, ensuring a good page speed load time cannot be overestimated. For starters, if a page takes too long to load, you are likely to lose users in the process, which is the whole purpose of the page. Secondly, search engines know this, which is why page speed load time remains an important factor in rankings and page authority. The Page Insights (by Google) extension is the same as their PageSpeed Tools, but instead of going to a different site and copying in URL by URL, you can see the same statistics and recommendations on your page as you analyze it. While this still requires checking your pages manually, it is conveniently located on page. If you don’t have access to the Insights API this is the next best thing. 5. User-Agent Switcher This is a pretty cool extension that I came across recently and is definitely a great new tool. When you click on this extension, a drop down list of common user agents appears (you can see a full list too), which the extension will mimic, so that you can see how your page would look to different crawlers. The great thing about this extension is that it will show you other browsers, search engine bots and even an iPhone or iPad. That’s a lot of useful information sitting in one small extension. Plus, when it is spoofing another agent, the extension wears sunglasses. To be honest, I’d download it just for that. 6. G New Doc Although this extension is not technically an SEO tool, it is one of the most useful that I’ve come across. More and more of the SEO tools I’ve encountered, and many of the clients I’ve worked with, use Google Drive for almost everything. Having the ability to click a button and generate any Google Doc template (or access any of your existing documents) without having to go to your Gmail account and into Google Drive each time is awesome. It saves time and frustration and actually makes me use Google Docs much more frequently, which in turn means I share more with my coworkers and increase efficiency across the company. 7. Social Metrics for Current Page This is the extension that Tom Anthony from Distilled created and discussed in his post last December. It’s pretty basic, but in the best way possible. Instead of adding features that no one really needs, the extension tells you exactly what you want to know: how popular is this page on social media sites? It pulls Google Plus’s, Tweets and Facebook Likes for whatever page you are on. 8. Firebug Lite for Google Chrome™ I’d take a bet that most of you already have this extension installed, but I’ve decided to include it in the list because even though it is not the best tool for technical analysis it is still a staple of my SEO tool library. Firebug Lite allows users to inspect HTML elements and live edit CSS. However, in Firebug’s own words: “Firebug Lite for Google Chrome is not a substitute for Firebug, or Chrome Developer Tools. It is a tool to be used in conjunction with these tools.” I’m inclined to listen to them. 9. Web Developer This is a good example of an extension with which Firebug Lite should be used. Just like its counterpart in Firefox, the Web Developer tools allows you to disable JavaScript & CSS Styles, as well as see lots of other pertinent information all at the touch of a button. It’s a personal favorite for a quick and dirty check of a page’s crawlability 10. Scraper One of the things I’ve learned in SEO is when to know to use someone else’s tools or words instead of your own. In this case, I think Scraper explains itself better than I could: “Scraper is a Google Chrome extension for getting data out of web pages and into spreadsheets.” As you can imagine, there are infinite uses for this tool, including but not limited to keyword research and competitive analysis. Bonus: Privacyfix by Privacychoice Again, this is not an SEO related tool, but it’s a good one nonetheless. As an SEO-er we all know just how much personal information is out there on the web. This nifty extension manages all of your privacy settings in 1 convenient location. Remember, if you can’t manage your own reputation, why will companies hire you to help theirs? Whether you work in-house, at an agency or as a consultant, these tools can really help cut down your copying and pasting and give your more time to focus on strategy and tactics. I’m sure there are tons of other useful tools out there, so please feel free to add your favorites below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Top 10 Chrome Extensions I Can't Live Without in 2013"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Top 10 Chrome Extensions I Can't Live Without in 2013"
    },
    {
      "level": "H2",
      "text": "1. Ayima Redirect Checker"
    },
    {
      "level": "H2",
      "text": "2. Canonical Inspector 0.2.2"
    },
    {
      "level": "H2",
      "text": "3. Mozbar"
    },
    {
      "level": "H2",
      "text": "4. Page Insights (by Google)"
    },
    {
      "level": "H2",
      "text": "5. User-Agent Switcher"
    },
    {
      "level": "H2",
      "text": "6. G New Doc"
    },
    {
      "level": "H2",
      "text": "7. Social Metrics for Current Page"
    },
    {
      "level": "H2",
      "text": "8. Firebug Lite for Google Chrome™"
    },
    {
      "level": "H2",
      "text": "9. Web Developer"
    },
    {
      "level": "H2",
      "text": "10. Scraper"
    },
    {
      "level": "H3",
      "text": "Bonus: Privacyfix by Privacychoice"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Caroline Phillips Rodin\n          \n            Caroline Phillips Rodin\n          \n            Caroline Phillips Rodin"
}