{
  "url": "https://moz.com/blog/the-age-old-question-if-you-inherited-seomoz-what-would-you-do-with-it",
  "slug": "the-age-old-question-if-you-inherited-seomoz-what-would-you-do-with-it",
  "title": "The Age Old Question: If You Inherited SEOmoz, What Would You Do With It? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A couple weeks ago, just for the hell of it, I emailed several SEOs and asked them the question they've waited their entire careers to hear: \nIf you inherited SEOmoz, what would you do with it? Rand Fishkin is out of the picture (he left SEO to pursue his dream of becoming a master chef, he eloped…",
  "content": "The Age Old Question: If You Inherited SEOmoz, What Would You Do With It? Public Relations By: Rebecca Kelley May 4, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley May 4, 2007 The Age Old Question: If You Inherited SEOmoz, What Would You Do With It? Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A couple weeks ago, just for the hell of it, I emailed several SEOs and asked them the question they've waited their entire careers to hear: If you inherited SEOmoz, what would you do with it? Rand Fishkin is out of the picture (he left SEO to pursue his dream of becoming a master chef, he eloped with Mystery Guest, he got sued by Puma, whatever), leaving you to run SEOmoz and a team of five [I excluded Gillian because I wanted to make it more ragtag and entirely Fishkin-free]. What would you do with the site/company? The coolest SEOs (coolest because they actually participated) responded, and I thought I'd share their answers below. (Obviously, this is a meme-esque blog post, and many of the answers are silly, off-the-wall, or downright inappropriate [ahem, Chris Hooley], which is why I saved this gem for a Friday post.) Some of the participants had somewhat lengthy answers, so I'm linking to their responses on separate pages (listed alphabetically by last name): Lisa Barone Andy Beal Guillaume Bouchard Matt Cutts Michael Gray Chris Hooley Kim Krause Berg Todd Malicoat Lee Odden Cameron Olthuis Barry Schwartz SEO Fangirl Aaron Wall Thanks again to everyone for participating, and happy Friday to everyone! Celebrate Cinco de Mayo with a margarita (mozzarita? Maybe we should serve them at SMX...) and a churro. :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Age Old Question: If You Inherited SEOmoz, What Would You Do With It?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Age Old Question: If You Inherited SEOmoz, What Would You Do With It?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}