{
  "url": "https://moz.com/blog/the-best-seo-podcasts",
  "slug": "the-best-seo-podcasts",
  "title": "The Best SEO and Digital Marketing Podcasts in 2024 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "The Best SEO and Digital Marketing Podcasts in 2024 Marketing Industry | Content Marketing | Video By: Jo Cameron Edited By: Melissa Rae Brown September 26, 2024 Table of Contents Copied! By: Jo Cameron Edited By: Melissa Rae Brown September 26, 2024 The Best SEO and Digital Marketing Podcasts in 2024 Marketing Industry | Content Marketing | Video What makes a podcast engaging? Podcasts that I’ll return to repeatedly don't just have decent audio or clear video. They don't just bring on informed guests and cover topics that intrigue and provide perspective. Although all these things are critical. There is something else that sets them apart, and I think I’ve boiled it down to having a little bit of heart. Yes, I want to learn about SEO campaigns and the amazing conversion results these tactics achieve, but I also want to learn about the lives of the people working in SEO. Because it’s relatable, and relatability helps the lessons and learnings stick.Here are the very best podcasts in SEO and digital marketing. Podcasts that have heart and tell stories of SEO and the people in the industry. They keep you informed when you’re working from home or the only SEO at your company. Need a new SEO pod to kick-start your day or jump-start a task? Then read on. MozPod Host: Chima MmejeTopics: SEO, digital PR, eCommerce, marketing strategies, and moreFrequency: Every 2 weeksWhere to listen: YouTube, Spotify, Apple PodcastsLearn more: https://moz.com/mozpodOf course, it wouldn’t be a list that we endorsed without including our very own MozPod. Relaunched in 2024, produced by me and hosted by Chima Mmeje, MozPod tells the stories of people working in SEO. We interview agency founders, consultants, and SEO practitioners to learn more about their experiences working in SEO in 2024. Featuring real-world case studies, like generating $1M monthly e-commerce revenue for a brick-and-mortar brand, insights into the challenges of SEO agency founders, and deep dives into some fun marketing campaigns like the Crocodile Dundee fake ad campaign. MozPod host Chima Mmeje asks guests about their ‘tiny pocket of joy,’ which exposes the real lives, joys, and challenges of the people working in SEO. Watch the talk show-style video on YouTube or listen on Spotify during your daily commute. The SEO Mindset Hosts: Sarah McDowell and Tazmin SulemanTopics: career development, mental health tips, SEO tactics, and moreFrequency: WeeklyWhere to listen: Spotify, Apple Podcasts, YouTube and moreLearn more: https://theseomindset.co.uk/Living up to their tagline “Optimizing your SEO Career,” Sarah and Tazmin are emerging as the podcast queens for SEO and mental health. They bring a comforting, thoughtful arm around the shoulders of anyone slogging in the field of SEO and seeking guidance or coaching. They aren’t afraid to go deep to help SEOs better understand themselves and the challenges facing working in the search industry today. Set aside 40 minutes to soak up the love.Pro tip: the SEO Mindset team record a live session at the fringe events at Brighton SEO, sharing personal sorties and fielding questions from the audience. The SERP's Up Hosts: Mordy Oberstein and Crystal CarterTopics: keyword research, agencies, SEO best practices, local SEO, and moreFrequency: WeeklyWhere to listen: Spotify, Apple Podcasts, YouTube and moreLearn more: https://www.wix.com/seo/learn/podcastThe team that gave Wix credibility in the SEO space covers a wide range of topics, from Google updates to international SEO. For a smallish 45-minute investment, you’ll join your next team sync well-informed and grinning from ear to ear. I will never get bored of the dynamic between Mordy and Crystal, or as I call them, my SEO Mom and Dad. Search with Candour Hosts: Jack Chambers-Ward and Mark Williams-CookTopics: tech SEO, algorithm updates, general SEO perspectives, and moreFrequency: WeeklyWhere to listen: Spotify, Apple Podcasts, YouTube and moreLearn more: https://withcandour.co.uk/blog/category/podcastJack and Mark have created the same vibe as what it would be like sitting down with a few mates or colleages in the pub after work. They provide real world examples and talk through the latest industry news. If you don’t get to lean over and tap another SEO on the shoulder to ask a question, check out these guys that you’d certainly go for a pint with or launch a DnD campaign. I enjoyed their recent episode, Is SearchGPT Better Than Google, and was pleased to see my colleague Tom Capper’s recent article on his findings from the Helpful Content Update research discussed with genuine insight and balance. It really is like well informed office chat that you don’t get working from home. With well-produced audio and well-designed video footage, you could comfortably listen to this on Spotify or watch it on YouTube. SEO 101 Hosts: Ross Dunn and Scott Van AchteTopics: SEO, paid search, SEO fundamentals, and moreFrequency: WeeklyWhere to listen: Spotify, Apple Podcasts, iHeartRadio and moreLearn more: https://www.stepforth.com/seo-101-podcastHailed as the longest-running SEO podcast these guys talk from experience about the challenges they are facing, covering the latest news and providing clear, actionable guidance. Aiming not to overwhelm people starting out in SEO, these guys talk from experience about the challenges they are facing, covering the news with clear guidance. The hosts have good chemistry, and they’ve been at it a while, fast approaching their 500th episode. If you’re just starting out and you only have 30 minutes to level up, it's definitely worth a listen. SEOs Getting Coffee Host: Hosted by Emina Demiri-Watson and Sean CarrollTopics: SEO soft skills, tech SEO, Google industry news, keyword research, and moreFrequency: Every 2 weeksWhere to Listen: Spotify, Apple Podcasts, YouTubeLearn more: https://www.vixendigital.com/seos-getting-coffee/Grab your hot cuppa cha and spend 30 minutes in the glow of SEOs Getting Coffee as they talk about Google updates, well-being, and SEO reporting, among other topics. Emina and Sean have created a warm and welcoming space on the web. The production value is really good, especially for a virtual recorded format, which can suffer from audio challenges with latency. The hosts do a great job of creating content that is nice to listen to to watch on YouTube. Emina wrote an article for the Moz Blog about the Sins of an Agency, which is a testament to her openness to sharing the real-world challenges of SEO agency life. The Authority Hacker Podcast Hosts: Gael Breton and Mark WebsterTopics: SEO, marketing, content marketing, and moreFrequency: Every 2 weeksWhere to listen: Spotify, Apple Podcasts, YouTube and moreLearn more: https://www.authorityhacker.com/podcast/With over 350 episodes, Gael and Mark focus on being practical and actionable, and they sure do deliver. There are a lot of episodes in the backlog, so you’ll never be alone on the daily commute, and you’ll be sure to find the topics that suit you. The average episode length is about an hour, and a personal highlight is Google update coverage and answering practical SEO questions. Adventures in Local Marketing Host: Claire Carlile ReesTopics: Local SEOFrequency: MonthlyWhere to listen: Spotify, Apple Podcasts, YouTubeLearn more: https://www.brightlocal.com/podcast/I defy you to dislike Claire Carlile. She told me recently when we were filming a Whiteboard Friday (and I don’t think it’s a closely held secret) that she used to be a teacher. And boy, does she bring all that Claire-branded upbeat joy to her pod, Adventures in Local Marketing.Topics tend to focus on local SEO but often extend beyond local into broader topics. My particular favorite is Marie Haynes's Embracing the AI Future. Search News You Can Use Host: Marie HaynesTopics: Tech SEO, Google updates and moreFocus: Latest developments in SEOFrequency: MonthlyWhere to listen: SpotifyLearn more: https://community.mariehaynes.com/spaces/12946477/feedWith the same name as her newsletter, Marie Haynes’ established podcast Search News You Can Use does what it says on the tin. Marie is a knowledgeable contributor to SEO perspective and someone I’ll always pay attention to. Guesting on many other podcasts, I always appreciate her take on industry news, which goes beyond outlining what happened and explaining why it matters and how it affects the day-to-day lives of those working in SEO. The Digital Marketing Podcast - Exposure Ninja Hosts: Tim Cameron-Kitchen and Exposure Ninja teamTopics: SEO, PPC, social media, content marketing, eCommerce, and moreFrequency: Weekly Where to listen: Spotify, Apple Podcasts, YouTubeLearn more: https://exposureninja.com/podcast/The team at Exposure Ninja chat about all the things you might talk about with your colleagues if you weren’t WFH. Tune in for office chit-chat that keeps you in the SEO loop, covering a wide range of digital marketing topics with a focus on real-world applications. Unique angle: the pod combines insights from a successful agency owner with practical tips for businesses of all sizes. It’s an easy time investment to accompany your lunch break with 20-40 minute episodes. Tim joined us in the 12th episode of MozPod this year and his focus on bringing value and ROI for these clients really shone through. Search Engine Journal Show Host: Loren BakerTopics: SEO, PPC, social media, content marketing, local SEO, and moreFrequency: Weekly (with a break in 2024)Where to Listen: Spotify, Apple Podcasts, YouTube and moreLearn more: https://www.searchenginejournal.com/category/search-engine-journal-show/Search Engine Journal Show’s extensive backlog is worth a look. They bring in a range of guests across SEO disciplines as well as their own knowledgeable staff, like writer Ben Steele, to bring you the latest SEO updates and strategies. SEJ hadn’t dropped an episode since Jan 2024 until now. In the last week they released what looks like a syndicated episode of Wix’s SERPs up (mentioned above.) Joined by Kevin Indig, Barry Schwartz, Chima Mmeje, and other guests for 100 minutes of AMA. I’m looking forward to what Loren and the team have cooked up for the rest of 2024. Crawling Mondays Host: Aleyda SolisTopics: eCommerce, tech SEO, international SEO, and moreFrequency: MonthlyWhere to Listen: Spotify, Apple Podcasts, YouTube and moreLearn more: https://www.aleydasolis.com/en/crawling-mondays-videosAleyda has an enviable depth of eCommerce and SEO experience that she generously shares with her audience. I love the sharing of first-hand experience based on her real client's situations. As any good podcast host does, Aleyda brings in expert guests to have informed discussions. A highlight is Tom Critchlow and Petra Kis-Herczegh talking about getting SEO buy-in. If you are leveling up in eComm, international SEO, or the broader SEO field in general, Aleyda’s Crawling Mondays is one to tune into.Crawling Mondays hasn't been updated for a couple of months, but I have it on good authority that Aleyda is working on something special. Keep your eyes peeled as it is likely break after we press publish. I can’t wait to see what Aleyda has in store for us! Have a podcast suggestion? LMK And there you have it! My shortlist of the best podcasts I’ve found valuable in my day-to-day that are still actively releasing content. If you have a favorite podcast that you listen to, or host and would like me to consider it for this list please do reach out on LinkedIn. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "What makes a podcast engaging?"
    },
    {
      "level": "H2",
      "text": "MozPod"
    },
    {
      "level": "H2",
      "text": "The SEO Mindset"
    },
    {
      "level": "H2",
      "text": "The SERP's Up"
    },
    {
      "level": "H2",
      "text": "Search with Candour"
    },
    {
      "level": "H2",
      "text": "SEO 101"
    },
    {
      "level": "H2",
      "text": "SEOs Getting Coffee"
    },
    {
      "level": "H2",
      "text": "The Authority Hacker Podcast"
    },
    {
      "level": "H2",
      "text": "Adventures in Local Marketing"
    },
    {
      "level": "H2",
      "text": "Search News You Can Use"
    },
    {
      "level": "H2",
      "text": "The Digital Marketing Podcast - Exposure Ninja"
    },
    {
      "level": "H2",
      "text": "Search Engine Journal Show"
    },
    {
      "level": "H2",
      "text": "Crawling Mondays"
    },
    {
      "level": "H2",
      "text": "Have a podcast suggestion? LMK"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How To Secure an SEO Leadership Role [According to an Ex-SEO Turned Headhunter]"
    }
  ],
  "author": "Jo Cameron\n          \n            Jo Cameron\n          \n            Jo Cameron"
}