{
  "url": "https://moz.com/blog/the-zlist-newsletter",
  "slug": "the-zlist-newsletter",
  "title": "The Z-List Newsletter - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Attention Deficit Problem (That Isn't a Disorder)Michael Gray wrote recently that producing great content without pushing it to the community is like having Will Shakespeare writing alone in a closet. It's sad, but true: in blogging, it's not what you know, but who you know that makes a…",
  "content": "The Z-List Newsletter Public Relations By: Gabriel Goldenberg December 14, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Gabriel Goldenberg December 14, 2007 The Z-List Newsletter Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The Attention Deficit Problem (That Isn't a Disorder) Michael Gray wrote recently that producing great content without pushing it to the community is like having Will Shakespeare writing alone in a closet. It's sad, but true: in blogging, it's not what you know, but who you know that makes a difference. In order to get that prized link from a major-league blogger, you need to have a connection to them first. Thus, a huge amount of high quality content (in absolute numbers, if not necessarily as a percentage of all content that gets produced) goes largely ignored. There's no one in the forest to hear the tree falling. So, we have a problem: good content is not getting the attention it deserves. Actually, that's just one half of a broader problem. In fairness to the A-list bloggers, there is a load of crap that gets written and sent to them. They have a lot to wade through to find those few posts that stand out. After the 10th post sent to you in a day, \"How I made $50 in a Day with Adsense,\" it's understandable and human to not want to look at the 11th, 12th, or others. The solution: the Z-List Newsletter: It's What You Know First, the solution to the A-Listers' problem Tell us what topics you're interested in reading about and/or linking to. Then, make it known on your blog that all future pitches to you must be made through the Z-List Newsletter. Perhaps most importantly, make a public commitment to linking to quality posts you find through the newsletter. Myself and other editors of the Z-List Newsletter will go through all the submissions and produce a newsletter customized to your interests. The newsletter's content will be composed of the truly superior quality content that deserves your attention. We'll get the signal-to-noise ratio of content sent your way as close to 100% as possible. (Is 100% a valid way of expressing signal-to-noise? Heh...) Second, the solution to the Z-Listers' problem We'll have the A-Listers' attention, so your high-quality content won't be limited in its distribution because you're new to the scene and/or haven't built a relationship with a/several high-profile bloggers yet. Now all you need to do is submit your content through the form. The best pieces will make it into the newsletter. The People First, we need to get A-Listers on board with this idea. If you're an A-Lister (or at least a blogger with some interesting level of traffic), please leave a comment here, post on your blog, or let us know some other way that you'll be participating. In no particular order, I'd like to ask the following folks to make that commitment: Rand, Rebecca, and the rest of SEOmoz Joost deValk Matt Cutts Michael Gray Aaron Wall Dan Thies Michael Martinez Maki Mikkel deMib Svendsen Darren Rowse Yaro Starak Brian Clark David Krug Eric Enge Eric Ward Danny Sullivan, Chris Sherman, and SEL's columnists/editors Andrew Shotland Greg Sterling Mike Blumenthal Chris Winfield (at 10e20) Jeremiah Owyang Charlene Li Tamar Weinberg Barry Schwartz Jim Boykin Debra Mastaler Andy Beard (the whole Collective Thoughts crew, in fact) Todd Malicoat Greg Boser Dave Naylor Andy Beal (plus Marketing Pilgrim's Jordan McCollum) Steve Pavlina Jeremy Wright Aaron Brazell Andrew Goodman Owen Thomas (esp. for Facebook ad stuff) Neil Patel Cameron Olthuis Lee Odden Jeff Quipp Vanessa Fox Bill Slawski (although I should say that Bill is very accessible and generous with his links, as can be seen from his blogroll) Muhammad Saleem Rae Hoffman Jen Slegg Jeremy Shoemaker Quadszilla Todd Friesen Lisa Barone Any other big name SEO, internet marketing folks, and related bloggers who might be interested Regarding editors who will contribute to the newsletter, I'm looking for voracious readers to get involved. I'd like to invite those of you I know from your comments here at YOUmoz and on SEOmoz to join in, as well as other people who feel they can contribute. Please leave a comment to let us know you'd like to be an editor, and highlight places you comment a lot (with links, preferably) as well as your own blog so that we can gauge your writing/appetite for reading. I'd like to extend specific invitations to: Vin Goldsmith Sean Maguire The brothers Stitch-blow ;) Doc Pete J. Meyers XCMP, top 20 blackhats under 25 Rishil (What's your last name?) Ciaran Norris Handsome Rob Ivan Brezak Brkan Brent David Payne Frank Watson Slingshot SEO Abbot Sys Discovery (of the SEW forums) David Mihm Lucas Ng ID Barry Welford Ann from SEO Smarty The Tech Side This isn't definitive, but rather a big brushstrokes plan for how the Z-List Newsletter would work. I'll get a form up where people can submit their content, with a max one submission/week. From there, submissions will get sent to an email address that editors will have access to. A wiki will be made available for editors to post their comments on the submissions and put together their top selections and come to a consensus. Their top picks will make it into the newsletter along with the descriptions set out by the editors. Finally, emails will be sent to the A-Listers. I haven't figured out whether these will be drafted by hand (which could add up to a lot of writing if many A-Listers sign up, as I hope), or whether we can get some kind of smart system that filters newsletter content to interests. For example, if Matt Cutts says he just wants to see stuff related to Google, spam, and paid links/Pagerank manipulation, it would be ideal to be able to just punch that into the newsletter software, write the full newsletter, and have the software only send Matt the parts of it tagged/classified with his interests. Perhaps Exact Target (SEOmoz's sponsor/partner) could fill us in on what's possible? Why This Will Work You can see this with one of two paradigms. The first is the cynical \"this is a crummy, glorified blog carnival where everyone who submits will get an easy-pass,\" and won't actually be effective. Well, for one thing, I think that blog carnivals are great for diversifying your link sources (as Vin and a few others have blogged about recently) and have seen good success in SEO thanks to them. But more importantly, editors will be working with a strict, critical eye. A majority of content will be rejected. Not just the crap, but the average stuff too. Probably even the slightly-above-average content as well. This newsletter is going to be a \"Best Of.\" The second paradigm is that of Taxi's successful business model. Taxi, if you didn't know, is a major music industry middleman between independent artists and major labels. They have a staff composed largely of A&Rs and other people with an ear for what the labels want. Taxi publishes listings of what the labels are looking for. Then artists submit their recordings and Taxi's staff listens to them. The better songs get passed on to the labels. The difference with Taxi is that there will be no submission fees. Editors will be volunteers. Their reward will be the ability to contribute one submission a week to a section all A-Listers will get, titled \"From The Editors...\" The flip side is that I may be being naive, and it might make sense to charge for taking submissions in order to pay editors and/or contribute back to the community (have tools programmed to make SEO easier, Z-Listers who make it into the newsletter could win SMX/SES/Pubcon tickets, SEOmoz premium memberships, etc.). I'd like to hear feedback on this point. I personally think it might be simpler with a volunteer approach. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Z-List Newsletter"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Z-List Newsletter"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gabriel Goldenberg\n          \n            Gabriel Goldenberg\n          \n            Gabriel Goldenberg"
}