{
  "url": "https://moz.com/blog/the-adwords-ad-optimization-process-little-changes-have-a-big-effect",
  "slug": "the-adwords-ad-optimization-process-little-changes-have-a-big-effect",
  "title": "The AdWords Ad Optimization Process - Little Changes Have a Big Effect - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "From 2003-2005, I managed several different campaigns for clients on all the major ad platforms - Yahoo!, Google, even an Ask.com campaign. However, since that time, I've been out of the game, and my skills are mighty rusty. In this post, I wanted to show off not only how badly you need an…",
  "content": "The AdWords Ad Optimization Process - Little Changes Have a Big Effect Paid Search Marketing (PPC) By: Rand Fishkin July 16, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 16, 2007 The AdWords Ad Optimization Process - Little Changes Have a Big Effect Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. From 2003-2005, I managed several different campaigns for clients on all the major ad platforms - Yahoo!, Google, even an Ask.com campaign. However, since that time, I've been out of the game, and my skills are mighty rusty. In this post, I wanted to show off not only how badly you need an experienced paid search marketer (even if you're a pretty savvy search guy like me), but how big a difference the little pieces can make. I started a campaign for SEOmoz's premium membership drive in the middle of June and have been refining and rewriting ever since (remember the night I showed our campaign to Mystery Guest?). I bid on terms like \"SEO Consulting,\" \"SEO Tools,\" and \"SEO Training,\" guessing that these were the most relevant phrases related to what the service offers. The process I generally follow with AdWords creatives goes something like this: Author 3-5 ads with different titles and descriptions, generally attempting to prominently use the target search phrase and entice the searcher to click. Prune the ads by replacing anything that receives less than 1% CTR (measured after 2-600 clicks, depending on the variables) Continue to replace lower CTR ads with new creatives Wait until one of the ads \"sticks out\" or overachieves with much higher CTR than previous ads. That's when I know I've stumbled on something that connects with the audience. Take that single ad and refine it with slightly tweaked headlines, descriptives & display URL, testing each against each other (and the original successful version) Continue testing, refining and perfecting the overachiever ad forever (you can't rest on your laurels) Start the process anew every few months to stay fresh and relevant - even the best ads won't draw clicks forever (and especially not in fast-changing industries like SEO) I'll show you what I mean with a few current examples from our campaign: _ _ I'm just starting out with the above ad group. I haven't had much success finding the right headline or creative for \"SEO Consulting\" so I killed off a few of my worst performers and added some new ones, while keeping my top two CTR ads (I know, 0.74% is pretty sad) in rotation. _ _ The above example shows me in phase 4 - I've just found one ad that's really standing out from the crowd, so I've created several versions to test against one another. Usually, one of these will be a clear leader and I can further refine (and test new headline & descriptive modifications as well). _ _ I'm in my final stages - 5 & 6 - above. CTRs over 5% make me pretty happy, but I suspect I can do even better than that, so I'm trying multiple versions of a successful formula. You can see that those tiny little differences in copy can have a monstrous impact on CTR - the only difference between the best and worst performer is the second line of text, yet it's a full 2% CTR difference. Don't let anyone tell you small changes don't have big results. Obviously, I'm running an exceptionally granular campaign, bidding on only a few terms and micro-managing obsessively. However, in my previous experience, this was how it had to be done - take your eye off the ball or stop testing for a second and you'll find your costs up, your traffic down and your competitors running away with your visitors. I'll be the first to admit that there are probably better techniques than the ones I employ above, so I'd love to hear your perspective on both the process of testing and refining and the ways in which you've found success. BTW - Sorry I couldn't share conversion data - it's just too sensitive. In the cases above, you'll have to assume that the conversion rates were all equal (as high CTR doesn't always mean better conversions, though there is often some correlation). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The AdWords Ad Optimization Process - Little Changes Have a Big Effect"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The AdWords Ad Optimization Process - Little Changes Have a Big Effect"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}