{
  "url": "https://moz.com/blog/the-videoblog-industry-and-seo-part-1",
  "slug": "the-videoblog-industry-and-seo-part-1",
  "title": "The videoblog industry and SEO - Part 1 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently, with the success of YouTube, up to 40 videoblog platforms are trying to grasp a part of their marketshare. But what is it all about?\nThe upcoming articles will be trying to identify how the emergence of videoblogging (aka vlogging) can benefit video amateurs and professionals, as well…",
  "content": "The videoblog industry and SEO - Part 1 Content Marketing E By: Ella_D May 18, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: Ella_D May 18, 2006 The videoblog industry and SEO - Part 1 Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Recently, with the success of YouTube, up to 40 videoblog platforms are trying to grasp a part of their marketshare. But what is it all about? The upcoming articles will be trying to identify how the emergence of videoblogging (aka vlogging) can benefit video amateurs and professionals, as well as SEO marketers, journalists and companies. I’ll also explain how this new \"2.0\" industry can become a key factor in reversing global media convergence. David Hallerman, from eMarketer, remarked in Business 2.0 magazine “Vlogs are very targetable. They’re small, but they have a niche audience”. There are at least 3 distinct groups of video content creators: The casual video amateur. This is the typical person who’s on your “forward to everyone” list of people who likes those kinds of funny and not so funny videos. It can also be someone’s in its office taking a break from its underpaid job (it has been reported by a large research firm – someone help me on which one – that 4,9hours were spent weekly surfing the web). This means plenty of time to watch many videos! The youth. Born with a keyboard and mouse, those kids never heard of floppy drives (don’t even mention 5.25’’), love pop stars and are more than aware that behind Google, Yahoo and MSN lie tons of answers to their multiple questions, children seek social tagging and entertainment, having a place of their own to share their favorites movies, clips or personal performances with their friends. So what happen with the not so cool videos? The vloggers. According to MeFeedia, there were 300 reported in March 2005, and 6500 in March 2006, that's 21 times more than a year ago. Those amateurs and professionals vloggers (Rocketboom, which has 250 000 unique visitors daily, having sold five 15 seconds commercials for $40,000 on eBay) are starting to increase in popularity as several of them are now getting associated with the buzzword grassroots media, which is an answer to the media convergence of today. Steve Garfield, who's behind WeAreTheMedia, along with half a dozen other reporters, is a pioneer in the vlogosphere and in grassroots media-making. The video blogging industry had a slow start but is now looking promising with $225 million in Internet video ads for 2005 and an estimated 1 billion for 2008 (eMarketer). This didn't happen overnight; many attempts were made in the early 2000’s and never took off. Wikipedia offers a great historical walkthrough. In my next article, I will be exploring the business models of the actual videoblogs, as well as how they can benefit an organization. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The videoblog industry and SEO - Part 1"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The videoblog industry and SEO - Part 1"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ella_D\n          \n            Ella_D"
}