{
  "url": "https://moz.com/blog/the-five-least-important-ranking-factors",
  "slug": "the-five-least-important-ranking-factors",
  "title": "The Five Least Important Ranking Factors - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This is my first YOUMoz post so please bear with me if I bore you to death.\nEveryone in the SEO industry seems to have this odd fascination with discovering the most important ranking factors employed by search engines. I even remember at SMX Advanced a year or two ago in Seattle that",
  "content": "The Five Least Important Ranking Factors Advanced SEO By: Daniel Deceuster April 20, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Daniel Deceuster April 20, 2011 The Five Least Important Ranking Factors Advanced SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. This is my first YOUMoz post so please bear with me if I bore you to death. Everyone in the SEO industry seems to have this odd fascination with discovering the most important ranking factors employed by search engines. I even remember at SMX Advanced a year or two ago in Seattle that someone asked a panel of experts what they thought was the most important on-page factor and most important off-page factor. Yes, I said SMX Advanced. Call me crazy, but if you have to ask a panel of experts what the most important ranking factors are in SEO, you probably don't belong at a conference for advanced people. After that session, I found Matt Cutts and asked him a different type of question: Me: \"Matt, I think we all know the what the important rankings factors are. My question is what is the least important factor that we spend way too much time on for almost no benefit or value?\" Matt: \"Blink tags. [chuckle]. Actually I would say the meta keywords tag.\" Since this brief conversation Matt has firmly put the meta keywords tag into the non-ranking factor column, so I would not consider it an unimportant ranking factor. For the purpose of this post, I want to look at ranking factors that are (a) confirmed or very solidly suspected to be ranking factors and (b) offer the least tangible benefit to rankings. 5. Header Tags Let's first put to rest the idea that H2 through H6 carry any weight at all with search engines. The H1 tag is the only header tag that still shows any potential for being a ranking factor. If you don't already have an H1 tag, then most people tend to agree that adding a keyword rich H1 tag helps. They then attribute this to the addition of the H1 tag. Have you ever thought that it could just be the fact that you added the keyword on the page? A true test would be to have a sample of web pages. Don't add the keyword or H1 tag to 1/3 of them. Add just the keyword for another 1/3. Then add that same keyword in the same place in an H1 tag for the last 1/3. Observe ranking changes, then revert them all back to their original content and see if the rankings revert with them. I'm sure if you did this test you would find that the H1 tag offers little value, if any. The real value comes in having the keyword incorporated into your content. If you are helping a client or working in-house, H1 tags should not be placed high on the priority list. Get to them eventually, but tackle the bigger issues first. 4. Total Number Of Links If you have been in the SEO industry for a while, then you know how much people obsess over their link totals. The number of links isn't all that important compared to the number of linking domains. Would you rather have 1,000 links from one website or would you rather have one link from 100 websites? If you think number of links is important, you would go for 1,000 of them over 100. But that would be a mistake. Several link metrics count for more than the sheer number of links, including anchor text, relevance, placement, authority and others. Link quality is far more important than link quantity. So don't just focus on getting more links...focus on getting more of the right links. 3. Toolbar PageRank Only Google knows your actual PageRank, and that score is a ranking factor. However, it isn't all that important, and the PageRank that shows in the toolbar isn't even accurate, so that makes it even less important. Toolbar PageRank is only updated a few times each year. You shouldn't base your success on what your website's toolbar PR is and you shouldn't assess link quality based on the page's toolbar PR. In fact, I would just get rid of the toolbar completely so you don't even see the PR. That's how little it matters. 2. Domain Registration Matt Cutts put this idea to rest in a recent Webmaster Video. Many people have thought the time you register your site for is a ranking factor to Google. It isn't. However, looking at your domain registration information is something you should do. If you target users in a particular country, did you register the proper TLD domain? Is your registrar in that country? Is your hosting account and server in that country? Included in this would be the reliability of your hosting. Is your server often experiencing downtime? Do you have a shared IP Address? Is the server slow to load your pages? All of these things can have small impacts on your rankings. Getting the proper domain, registering it and hosting it all have influence on rankings in some way. 1. Blink Tags Social Media By far the biggest craze to take over SEO since PageRank is social media. SEOMoz has done a lot of research into this topic as well. First, we should remember that Matt Cutts has said that social factors are used primarily for real time search. Links from sites like Twitter and Facebook have a lot more influence in real time than normal web search. This doesn't mean they aren't ranking factors for web search. They are, and SEOMoz has done a lot of work to show they are. Getting links from Twitter and Facebook can help your content rank better. However, the effort being put into getting links from social media is astonishing. I know people setting up crazy networks of fake profiles in Twitter, Facebook, Digg, StumbleUpon and other social media sites. All that work may be helping slightly, but if you look at the cost to benefit ratio, there is a lot of time being wasted in social media. I'm still a big advocate of being social and sharing links and liking things and all of that. We should all be actively promoting online content we enjoy. This should and will continue. However, creating your own artificial social network of fake profiles is a little extreme. Spending hours each day in social media is not the best link building tactic. Conclusion Again, I'm not saying any of these are not ranking factors. I believe they are. I believe there is a time and place for them. I just don't think that it should be a lot of time or place high on the priority list. What ranking factors do you think are least important that we spend way too much time on? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Five Least Important Ranking Factors"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Five Least Important Ranking Factors"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Daniel Deceuster\n          \n            Daniel Deceuster\n          \n            Daniel Deceuster"
}