{
  "url": "https://moz.com/blog/the-brand-of-seo-and-the-trend-of-inbound-marketing",
  "slug": "the-brand-of-seo-and-the-trend-of-inbound-marketing",
  "title": "The Brand of SEO and the Trend of Inbound Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The web marketing community, and specifically many folks in the search field have recently been engaging in lots of conversations about the industry's nomenclature. I think these discussions are excellent to have and I'm glad we're openly communicating with one another on the topic. If there's to…",
  "content": "The Brand of SEO and the Trend of Inbound Marketing Branding By: Rand Fishkin March 12, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 12, 2012 The Brand of SEO and the Trend of Inbound Marketing Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The web marketing community, and specifically many folks in the search field have recently been engaging in lots of conversations about the industry's nomenclature. I think these discussions are excellent to have and I'm glad we're openly communicating with one another on the topic. If there's to be a shift or a progression in how online marketers focused on non-paid channels describe themselves and their work, I believe rigorous debate is a great starting point. And, as part of that belief, I want to share my views on the topic. Considering taking the leap and having my official title changed to Inbound vs. SEO — Justin Briggs (@justinrbriggs) February 23, 2012 I've been in SEO a long time; at the end of this year, it will have been a decade since I joined my first SEO forum and attempted to learn how to capture the magical, free traffic that engines like MSN, Yahoo! and the emerging Google could send. In 2005, after experiencing the remarkable, positive impact SEO could have, I went from a practitioner to an evangelist. I loved SEO and I still love it. I love the complexities of search technology, the overwhelmingly vast sea of technical tactics, the individual stories, the packed conference-hall bars, the dark stories of spam and the illuminating tales of white hat triumphs. But, most of all, I love the people. I have met most of my best friends, hundreds of people I wish I saw more of and literally thousands of awesome individuals all around the world thanks to this field. To say I'm a raving, fanatical, lunatic SEO evangelist is putting it mildly. But over the past 3 years, I've been gradually coming around to the viewpoint that in spite of my personal adoration for all things organic search, the outside world of marketing departments, startups, small-medium businesses and individual consumers doesn't see it that way. Last night, a startup friend of mine was over, reviewing a slide deck I'm building for another round of fundraising pain, when he received a spam email trying to buy some links on his site. \"Ha. You SEO guys never quit do you?\" Then today, in an interview with a candidate, I asked her about her background in SEO and she replied, \"I told my husband about SEOmoz and he said 'SEO company? Watch out, those guys are spammy and untrustworthy.\" We talked through it, of course, but if you're in the field, you surely encounter this feedback daily, too. There's the problem. No matter how many cities I fly to, or times I evangelize the great things SEO can do, no matter how many blog posts or retweets or guest articles, it will always carry with it the taint of manipulation and inauthenticity. Even from those who know better. Even from those who've invested in SEO. And always, always from the mainstream and tech media. So what's to be done? Should we give up using the acronym? Perhaps shift to something like \"get found online,\" \"search engine visibility\" or \"content optimization?\" In my opinion, those aren't real options. SEO is an established practice and it's an established, descriptive term. For millions of people around the world, it carries the accurate meaning - the practice of improving a brand's visibility in and traffic from search engines. That meaning may be negatively tarnished by frustrating and inaccurate brand sentiments, but even if we could shift to a new phrase, this new moniker would undoubtedly attract the same sorts of bad actors who cloud SEO's perception today. For better or worse, SEO is here to stay. But I'm not blind to the emerging reality: a shift in terminology is accompanying the growth in responsibilities of professional SEOs. I did some simplistic LinkedIn research recently that's illustrated below: That figure above shows overlap between these various fields and skillsets, and it's my opinion that we're going to see considerably more overlap between them in the years to come. To be an effective social media marketer, you must understand content, analytics and SEO. To be a great SEO, you need social media, content marketing, analytics and CRO skills. The \"specialist/generalist marketers\" - those who excel at a particular facet but have competence in all of them - are best poised to win in the upcoming decade of marketing. We need a way to describe this combination - it's simply too cumbersome and not descriptive enough to say one's job is: \"Content creation, combined with investments in both the technical and outreach-based tactics in channels such as organic search, social networks, blogs and other websites, measured through analytics and tuned with conversion rate optimization.\" That's a mouthful, but it's getting to be a more and more common mouthful, because this process needs to be explained! Some say \"SEO\" already encompasses these: @randfish I still believe SEO encompasses all those things. If not, then Internet Marketing. Remember when that used to sound cutting edge? — AJ Kohn (@ajkohn) March 9, 2012 This is hard, because in many ways, I agree. If you're a modern SEO and you don't also embrace content creation, social media marketing, link outreach for brand and direct traffic value (beyond their algorithmic contributions), PR, CRO and analytics, you're probably not achieving all that you could by combining these practices (at least a little). And yet, there's no way to explain to the outside world (even those in web marketing but not directly tied to SEO) that \"search engine optimization\" also includes \"social media\" or \"conversion rate optimization\" or \"public relations\" or \"content marketing.\" SEO necessarily equates to search engine-based stuff. Social media and other practices may have direct and indirect positive influences, but to an outsider, SEO will never mean all of these things, and saying you do \"SEO\" will never carry the meaning of that bolded sentence above. Hence, we need a term/phrase that accurately describes this combination (but is not \"Internet Marketing\" since that phrase encompasses vastly more than what we're trying to get across, paid channels in particular). I've been a personal fan of the concept behind Inbound Marketing for a long time - that we should earn our customers' attention rather than interrupting them by buying it. I gave a talk about inbound for startups last December in Silicon Valley: If you skip to 7:05 or so in the video, you can see the start of my talk, one of the better ones I've given in the past year. I recognize that not everyone in the marketing and search field feels as positive as I do toward the phrase \"inbound marketing.\" But, I am seeing nearly everyone adopt the principles behind it, which include: Combining the practices of content creation and conversion optimization to earn visitors' trust and their business Jointly leveraging the channels of search, social, blogs, PR, referring links, email and word-of-mouth to promote this content Using sophisticated analytics practices like first-touch and multi-touch attribution to better understand the true value of your content and your visitor sources I asked on Twitter last week about alternatives to \"inbound marketing\" that still mean the same thing - narrow enough to exclusively focus on free channels of web-based customer acquisition (which terms like \"Internet marketing\" or \"digital marketing\" wouldn't), yet broad enough to include the items mentioned above. Two other suggestions seemed widely-adopted enough to consider: \"earned media\" and \"organic marketing.\" I ran a comparison of these across several services: That chart above compares keyword searches on LinkedIn, SimplyHired, Google News, Google's AdWords Tool (for exact matches) and Topsy's Analytics. To be fair, all of these trail behind the individual tactics like \"SEO,\" \"social media,\" or \"blogging,\" (as I noted above, they're not meant to replace those terms, but rather to explain the marketing practice that combines them). Inbound is clearly many steps ahead of the other two, though \"earned media\" has a lot of traction in the c-suites of large enterprises and publishers. Even if inbound marketing isn't the term that wins the lexicon battle, I believe the principles behind it are sound. They work. And they earn outsized returns to investments in most paid marketing channels or myopically singular investments on search, social or content alone. That's a message I've been working to refine and spread for some time now. Many of you reading this blog likely know that I started a personal project with my friend Dharmesh (from Onstartups & Hubspot) called Inbound.org. It's a site that seeks to highlight some of the best content around the marketing world. Along with that, I'm putting more effort into broadening my expertise in fields like content marketing, social media, CRO and PR, and when I talk about it publicly, I call it inbound marketing. Many other organizations, from software firms like Wordstream and Optify to agencies like TrustE, Weidert, Kuno Creative and Volinsky to blogs like Distilled, Kiss Metrics and Search Engine Land are using this language, too. I wouldn't say the terminology has overwhelming adoption, nor that it's necessarily won the market, but I would argue that the concept and principles are unstoppable and need a name. I don't think explaining that SEO means a bunch of other non-search-engine-related marketing practices is viable, nor do I think it's practical to explain the full concept every time you want to refer to it. SEO, in my opinion, isn't going anywhere, but it has tactical allies today that didn't exist 5 years ago, and I hope that some terminology encompassing these techniques takes root. TL;DR - SEO is great as is. It doesn't need a new name. The combination of all free/earned/organic/inbound tactics needs a name of some kind. \"Internet Marketing\" is too broad. \"SEO\" far too narrow. I like \"inbound marketing\" for now. As always, I'm looking forward to your thoughts on the trends of marketers focused on inbound/organic/free channels and the emerging use of \"inbound marketing,\" itself. I'll do my best to contribute to the discussion in the comments, too :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Brand of SEO and the Trend of Inbound Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Brand of SEO and the Trend of Inbound Marketing"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}