{
  "url": "https://moz.com/blog/the-law-and-business-of-online-advertising-conference",
  "slug": "the-law-and-business-of-online-advertising-conference",
  "title": "The Law and Business of Online Advertising Conference Recap - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "May It Please the Mozzers,\n\nMay It Please the Mozzers,\n\nLast Friday, I had the pleasure of attending the Law and Business of Online Advertising, a conference co-sponsored by the Berkeley Center for Law & Technology and Santa Clara’s High Tech Law Institute. ...",
  "content": "The Law and Business of Online Advertising Conference Recap E-Commerce SEO By: Sarah Bird April 22, 2008 Table of Contents Copied! By: Sarah Bird April 22, 2008 The Law and Business of Online Advertising Conference Recap E-Commerce SEO May It Please the Mozzers, Last Friday, I had the pleasure of attending the Law and Business of Online Advertising, a conference co-sponsored by the Berkeley Center for Law & Technology and University of Santa Clara’s High Tech Law Institute. It was a Who's Who of online marketing super stars, including Eric Goldman (my hero), Kim Howell (poor thing had to explain online marketing to liberal, non-technology academics), Hal Varian (kind of a big deal), John Horrigan, Oren Bracha (looks a little like Clark Kent), Peter Swire (looks a little like Greg Kinnear), Rebecca Tushnet, Jeffrey Rohrs (lives and breathes the law AND the business), and Alissa Cooper (heading up technology at the Center for Democracy & Technology). There were lots of other very nerdy folks too. I felt right at home! Here are the highlights: The morning started with a couple tutorials explaining how online advertising works. (I know. Adorable, right?) They brought in the big guns, Hal Varian, to explain how behavioral targeting allows sites to create a unique page for each of the user's visits. It was a little like using a nuclear bomb to kill a fly, but I suppose it's always good to go back to basics. (And Hal, if you read this, thumbs up on your nifty graphics. Shoot me a copy of your deck, would you?) I don't know for certain, but the audience seemed to be primarily lawyers and academics from nearby universities, with some students thrown in here and there. And there was one table right in the mid-center who looked to be composed of people who actually do technology. (It was awfully nice of them to come.) For the most part, the morning sessions focused on search engines and large companies with corresponding behemoth, complex ad campaigns. Varian did give a brief shout-out to SEOs and SEMs. Google's Chief Economist described SEOs as \"highly skilled online marketers.\" He compared SEOs to lawyers in the amount of training and specialization required. He also speculated that in the future, SEOs will be built into the ad agencies themselves. No more rogue independent elements. On the whole, it was a favorable endorsement of the profession from one of Google’s most brilliant minds. Interestingly, the hottest issue was behavioral targeting and its impact on consumer privacy. The audience seemed pretty hostile to behavioral targeting. However, everyone on the panels agreed that behavioral targeting was a good and useful thing, but only if consumers are given a knowing choice to participate. The audience was extremely interested in cookies and how they work. (Awwww...) People were surprised and confused to learn that the NAI’s opt-out program doesn’t prevent advertisers from collecting information about you; it only prevents advertisers from serving you targeted ads. The companies still get to benefit from your information, you still have to see ads, but the ads aren’t targeted towards your preferences. Somehow, I have a feeling that most consumers who bother to use the NAI's opt-out program don't realize this. After all, I have to imagine that it is the tracking itself that bothers privacy-sensitive people, not the targeted ads. The Unanswered Question: What Level of Disclosure Is Necessary in Privacy Statements? So everyone agrees that privacy statements must reveal what information is collected and how it is used. But in practice, privacy statements aren’t really helping to make behavioral targeting more transparent. Why? (1) Because no one understands privacy statements. (2) Further, many sites claim that they will not sell your information, but then they change their minds and fail to notify the users. An interesting issue that was left out of the discussion is the impact of jurisdiction and the global reach of the internet. There was no discussion on harmonizing U.S. privacy laws with other nations. There was also no discussion of methods to enforce privacy or security concerns in a global marketplace. I hope the next conference spends more time on international issues. Orem Bracha Started an Interesting Discussion of Search Engine Bias and the Challenges to Regulating the Net. If you've ever felt that search engines should be held responsible when your client's rank seems to drop inexplicably, or if you've ever wondered whether search engines steer users towards sites with more SE-served advertisements, then you should take a look at the article Bracha co-authored with Frank A. Pasqualle, \"Federal Search Commission? Access, Fairness and Accountability in the Law of Search.\" Rather than do a terrible job trying to summarize the article, I'll quote you the Abstract. Should search engines be subject to the types of regulation now applied to personal data collectors, cable networks, or phone books? In this article, we make the case for some regulation of the ability of search engines to manipulate and structure their results. We demonstrate that the First Amendment, properly understood, does not prohibit such regulation. Nor will such interventions inevitably lead to the disclosure of important trade secrets. After setting forth normative foundations for evaluating search engine manipulation, we explain how neither market discipline nor technological advance is likely to stop it. Though savvy users and personalized search may constrain abusive companies to some extent, they have little chance of checking untoward behavior by the oligopolists who now dominate the search market. Against the trend of courts that would declare search results unregulable speech, this article makes a case for an ongoing conversation on search engine regulation. At this point, I'm not willing to agree that the establishment of a Federal Search Commission is a good idea. However, I do think this is very important work. It may be a dead end, but the road should be mapped. The questions asked by Bracha are important for at least two reasons: (1) Politically conscientious people must never assume that organizations are looking out for their best interests. You have to study the organization before you can draw any conclusions about whether your interests are aligned. (2) The internet increasing permeates our living, practical lives; as the on and off-line worlds blend, there may be a time where regulation is necessary. It would be a mistake to wait until it is clear regulation is necessary to start looking at whether regulation is legally and practically feasible. Potential Privacy Harms Should Be Considered in Anti-Trust Analysis When Behavioral Marketing Companies Seek Merger Approval. Peter Swire is a privacy guru. He gave some very interesting testimony to the FTC about how the Google/DoubleClick merger could be viewed as anti-competitive because of the aggregation of consumer information and other privacy harms. Everyone is intuitively familiar with the idea that corporate mergers should be prohibited where the new company would be large enough to engage in harmful anti-competitive behavior. Typically, the harms include price fixing or a reduction in the quality of available goods. If you think of privacy policies as part of the search engine's \"product,\" then you can start to guess where this is going. Well, Swire seems to have two points: (1) The sheer aggregation of consumer information of both broad and deep searches would result in harm to the privacy-sensitive consumer; (2) The aggregation of so much consumer information in the behavioral profiling industries may effectively block or prevent others from fairly competing in the marketplace. Traditional antitrust analysis examines a proposed merger and often sets conditions on approval—the merger can proceed for aspects that create consumer welfare, but cannot proceed for aspects where harms outweigh the benefits. Where consumers suffer from lower product quality and reduction of consumer welfare, such as through privacy harms, it thus is logically consistent to consider merger conditions that address privacy harms. Swire's presentation is powerful. It breaks new ground by identifying the unique intangible assets, barriers to entry, and competitive challenges for the behavioral marketing industry. Regardless, I don't think Varian was pleased by the argument. He squirmed and objected to Swire, making a slippery slope argument that if you consider consumer information to be potentially anti-comptetive, where will it end? What wouldn't become a reason to prevent a merger? Swire responded that the question shouldn't really be \"what kind of thing should be taken into consideration\"? Rather, the question should be \"what effect does it have on the consumer and the market\"? If the net result is positive for consumer, the merger should go forward. If the net result is bad for consumers, then the merger should be blocked. Here's a short article by Swire in which he speculates that privacy as a form of non-price competition will play out in any yahoo/microsoft merger as well. Holding Intermediaries Liable For Online Conduct: Re-imagining the CDA Tushnet had a lot of interesting things to say, but I was most interested in something she said in passing about re-working the CDA (\"The Communications Decency Act\"). If you read my posts regularly, you may know I have a special interest in the CDA. Despite my unceasing feeling that we have failed to achieve an adequate balance between e-commerce, the First Amendment, anonymous speech, web 2.0, privacy, and reputational interests, I have been unable to reformulate the law in a way that will adequately reconcile these opposing interests. After arguing that there has been some push-back from the broad immunity granted by the CDA, Tushnet brainstormed the possibility of developing a new regime to combat business torts. What if we created a special administrative body to hold hearings on an expedited basis, similar to UDRP? Or an expedited court proceeding? Some mechanism where websites and search engines wouldn't be tasked with resolving disputes regarding user-generated content? Some neutral organization could hear the matter quickly and efficiently and then issue a ruling that the website must follow. I was momentarily excited, but then the realities start setting in...The websites don't have the access to evidence or the incentive to fight for the user generated content. Thus, you would really end up with a de-facto DMCA regime with significant chilling effects on free speech. Perhaps most importantly, the jurisdiction and enforcement issues quickly make such schemes impractical. I guess I'll just have to continue to worry and ponder about the far-reaching effects of the CDA. Finally, The Advertiser's Perspective It was great to have Jeffrey Rohrs on this panel because he is an actual advertiser (there weren't very many of those at the conference) and has legal knowledge to boot! Finally we were talking about trademark, Can-Spam, affiliate marketing, and the potential ROIs and risks involved. In sum, the advertiser panel agreed that there will probably be a lot more trademark litigation in the future as affiliates and technology get more creative at marketing products. Thus, the sellers' ads are likely to end up all over the virtual world (videos, twitter, FB, blogs, sms, social media sites), making it more difficult to identify the parties involved and the chain of liability. The panel agreed that it was important to manage risk by using both (1) a solid contract with your advertisers as well as (2) an affiliate manager to follow up and track how your advertisers are exploiting your brand. All in all, it was a very enjoyable conference. I was surprised at how little time was spent on SEO, trademark, copyright, and international issues. Also, I think more participation by actual marketers would help keep the discussions academically honest and relevant. That wraps it up. If you want to read more about the conference, check out Rebecca Tushnet's blow by blow. Best Regards, Sarah Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Law and Business of Online Advertising Conference Recap"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Law and Business of Online Advertising Conference Recap"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}