{
  "url": "https://moz.com/blog/the-noob-guide-to-link-building",
  "slug": "the-noob-guide-to-link-building",
  "title": "The Noob Guide to Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While savvy content marketers realize that many of Oli’s tactics will naturally attract links, fledgling link builders got to the 63rd page and were still wondering what to do. With this companion piece, it is my goal to grab the baton from Oli and outline a six-month link building action plan for…",
  "content": "The Noob Guide to Link Building Link Building M By: Michael King May 8, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: Michael King May 8, 2012 The Noob Guide to Link Building Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The Noob Guide to Online Marketing is arguably the greatest single post of all time. If you don’t agree, well, it’s at least my favorite. Oli Gardner (of Unbounce) displayed a playful writing style mixed with pixel perfect graphic design, and a GPS of a roadmap to take your site from mile marker zero to one hundred in six months. It’s nothing short of amazing. While savvy content marketers realize that many of Oli’s tactics will naturally attract links, fledgling link builders got to the 63rd page and were still wondering what to do. With this companion piece, it is my goal to grab the baton from Oli and outline a six-month link building action plan for your brand or client’s new web property. Even if the website isn’t brand spanking new, that’s fine, what I really mean is that this is the link building plan for the less savvy looking to do dive into off page optimization. Marketers with long existing sites and more link building experience will be better served downloading the Complete Six-month Off Page SEO Gameplan from iAcquire. Following this guide in concert with Oli’s you will identify your audience, build a list of prospects, plan and execute four successful pieces of content and convince influencers to create content for your site. Since we last spoke I left Publicis Modem to become the Director of Inbound Marketing at iAcquire which is a technology-focused off page seo agency. I encourage you to read the “Quantifying Outreach” study that I released at LinkLove London wherein I examined nearly 300k outreach emails from both our own iRank platform and Buzzstream’s CRM software. The study will help you optimize your outreach emailing tactics and understand why treating people like people rather than prospects is a far more effective tactic than sending form letters. For those keeping score at home this falls under both the Content Strategy/Development and Social Strategy phases of the New SEO Process. For many, link building is a numbers game and it quickly becomes clear why those people would rather put their resources into black hat tactics. Those marketers are too impatient to properly build links because link building is a process wherein you are convincing people who don’t know you to take a real world action that benefits you. To do that at scale requires a budget, great understanding of people, a large outreach team and a commitment to creating content that people will actually be compelled to link to or embed into their sites. In other words, you either have to make friends or make news. In this age of 2pac Holograms, stop motion action figure videos, and augmented reality utilities how do you compete? While that type of content is awesome, it represents the type of big swings that may not be in your wheelhouse or relevant to your brand/client so often people wonder how to build links in their otherwise boring niche. Naturally, there are ways to manually submit your site to millions of forums, blog comments, and directories, but those links are generally very low quality and have been the focus of algorithm updates such as Penguin. That is not to say that these tactics don’t work, but just as you should diversify your traffic sources beyond just Search, you will want to diversify your link building tactics to build a varied and natural link portfolio. Sites with unnatural link profiles create a footprint that is easy to identify from a 10,000 foot view and of course Google has that perspective. Don’t put yourself on their radar by engaging in spammy tactics. Anchor Text Distribution This metric, which is the number of times an anchor in your backlink profile occurs, is best measured using tools like Open Site Explorer, MajesticSEO, Ahrefs, etc., is very important. An ex-Googler told me at SMX Australia to always be sure the highest occurring anchor text for a site is branded otherwise you may trigger an algorithmic filter or penalty. Link Equity The value of the links you build to your site is not a trivial thing. Links are the lifeblood of Search campaigns and therefore the foundation on which every site that is visible in the Search Engine Results Pages (SERPs) must be built. These numbers will not be an exact determination of what you will need to accomplish as there is a sliding scale of worth for links, but this crude explanation will make it clear to higher ups what needs to be done and why. Use the aforementioned backlink profiling tools to determine how many links your competitors have and how many links you have. Whether you only use one tool or all tools, make sure that you stay consistent. Backlink profile tools all measure a different portion of the web and none of them are as comprehensive as Google so it’s important to use the same source(s) to capture a snapshot for every site. Calculate Share of Voice. Share of voice is a traditional advertising term that basically means of the percentage of opportunity that a given brand occupies. If there are 10 TV advertising slots for a given TV show and a company ran ads that filled five of those slots for that show, they have a 50% Share of Voice. For the keyword [ham sandwich] the site HamSandwichMusic.Com has the highest SoV because it’s in the #1 position. The keyword [ham sandwich] has a local search volume of 33,100 which means the largest amount of traffic you can get from that keyword (according to industry standards) is 18.2% which is 6024.2 visits. So if my traffic for that keyword monthly is only 500 visits, I have an 8.3% SoV for [ham sandwich]. Determine the number of links required for you to beat your competitors. That is to say if the first position has 100 links and you have five, make the case that it will take you 96 links to get the share of voice that your top competitor has. Again, this is not exactly indicative of what it will take to beat your competitor because you may surpass them with less links that are higher quality or it may require more links and competitors will continue to build links, but to build an easily understood case use share of voice. Tools The specific tools required for each month are called out in this guide however there are tools that may be used at any point for a variety of reasons. Every tool mentioned in this guide is free or at least has a free tier and/or a free trial that will allow you at least start working. Rapportive – This Gmail Plugin is for identifying what users social profiles are connected to their email address. This is key because reaching out to people via social media first is far more effective than emailing them first. Boomerang – This Gmail plugin allows you to schedule and automatically follow up on emails. Microsoft Excel – This spreadsheet application is in invaluable for collecting, slicing and dicing data. Get to know it well with Distilled’s Excel Guide to SEO. SEOmoz Toolbar – The SEOmoz toolbar is a must-have for a variety of reasons, but in the case of building links you can find out whether a site meets your SEO metric requirements as you go. Scraper for Chrome – Stop copy and pasting data one piece at a time, use this plugin to quickly scrape data off a page and port it right to Google Docs. Google Refine – The data you collect will often be wonky or at least not in the format that you want it to be in and for some things Excel just doesn’t cut it. This tool by Google helps you clean it up. SpyOnWeb – Using this tool you can quickly figure out what domain names or IPs share the same space and what sites have the same AdSense ID. In other words you can use SpyOnWeb to identify whether your prospect is a part of a link farm. Link Detective – This link classification tool quickly lets you determine what types of links you or your competitor has. Take a CSV from Open Site Explorer and throw it into the system and find out the makeup of a link profile. Link Indices – A link index gives you the links that are linking to a given page or site. This is invaluable intel for tracking progress and identifying opportunities and deficiencies. Each of the following link indices has its own strengths and weaknesses, so give them all a try and determine which one fits your needs the best just like Branko Rihtman did: Open Site Explorer MajesticSEO Ahrefs MONTH ONE – PLANNING AND QUICK HITS This month in the Noob Guide to Online Marketing Guide you are setting up your online presence and the tools to measure it. Simultaneously, you should be planning out your link building campaign. PLANNING Oli’s guide talks about launching an editorial calendar at Month Two, but I suggest you start thinking about when you’re rolling your content out before you start anything. You should of course be thinking about what’s hitting the blog when, but content takes time and careful planning to create and then launch. When planning your link building you should do what it takes to differentiate yourself and your content because you are competing with the whole web. Making your content stand out will make building links substantially easier. With that in mind you will be launching the following content: Egobait (Month Two) – This is content that includes and flatters your key influencers to in turn encourage them to participate by linking to or sharing your digital assets. Data Visualization (Month Three) – Everyone’s go-to version of this is an infographic, but consider other ways of visualizing the data such as a book (Storybird), a timeline (dipity) or a videographic if possible. In month three you will be launching your own. E-Book and Guest Post (Month Four) – By the time the fourth month rolls around, the key influencers in your space should know about you or your client and what you bring to the table. At this point an e-book is great way to solidify you or your client’s thought leadership. Much like this guide and Oli’s, you will be coupling that e-book with a blog post on an influential site in your space to be sure that it is seen. The content should have a centralized theme that links back to your business goals, but you want it to be different enough so that your growing audience will want to share all of it. Audience/Influencer Personas – Understand who your target audience is by creating personas. Personas are general representations of your audience. Typically you should create four personas for the whole site campaign and while you can make as you like, four are more easily managed. These personas don’t have to be particularly in-depth (for example we don’t need to determine their need states) nor validated through measurement, they just have to help you create a mental model for content ideation, prospecting and outreach. While a more in-depth form of this falls under the Opportunity Discovery model, for the purposes of link building a basic understanding of who is potentially out there is all that is required. This will make it easier to associate concepts and keywords with one segment of the audience rather than another and then ultimately allow you to tailor outreach specifically to that segment in order to scale the messages. Social Listening – Use tools like Topsy, Social Mention, Amplicate and Google Discussion Search to identify user segments based on keyword searches and usage. Starting from basic keyword searches that you have identified in the Adwords Keyword Tool identify who is contributing to that conversation. In cases where the conversation is particularly spammy, download the tweets and clean them up using Google Refine. Facebook Ad Creator – The Facebook Ad Creator is to audience research what the Google Adwords Keyword Tool is to Keyword Research. It is an invaluable tool to understand the inventory of people that fit a very precise demographic. This tool will be the validation required for the personas you are building. If you hypothesize from social listening that there is a user segment out there between 30 and 40 and is interested in search engine optimization, you can then take that to the Facebook Ad Creator and see how valid that is. The only limitation is that you can’t examine the interests together using “AND.” You can only use examine the inventory using “OR.” Prospecting – Finding people who will be interested in your content has never been easier. Now that you have identified the type of people that you want links from and split them into targets and influencers you have a fairly precise idea of what they are into. Break these into defining keywords and run searches in: FollowerWonk Zerply About.Me You can also prospect specifically for sites within Google by using a variety of search queries. Additionally, there are prospecting tools such as Citation Labs and Ontolo, but these require paid subscriptions. Keep track of these users by persona type so you can later segment your outreach and create more directly tailored form letters — if that is your thing. If you’re prospecting specifically by site you can also keep track of those sites by the segment that those sites target. Original Content Ideation – Even with an incredible Creative team amazing content is not scalable. Even Don Draper’s team had far more misses than makes, but what Sterling Cooper didn’t have is Social Media. GoFish – This is a tool that I built to perform real-time keyword research in order to help identify co-relevant ideas that are already occurring on Twitter and gives you a list of users that have tweeted those keywords. I gave an example in my “Targeting Humans” talk where I put in the keyword “Michael Jackson” and it identified the keywords “Jackson trial” and “south park” as occurring together very often. A content idea with a built-in audience would be “The Michael Jackson Doctor Trial” played out with South Park characters. More information on how this tool works can be found in my “Using Social Media to Get Ahead of Search Demand” post. Facebook Ad Creator – You might be surprised to see this tool twice. In addition to being great for segment inventory it’s also great for inferring content ideas that will resonate with those people. For example if we found that target segment of XXX is interested in [A].[B],[C] can we can infer that they would be interested in a __________________. This is the same idea as with GoFish, but it allows for more evergreen concepts. Pre-Contacting – At this point you have your ideas and a strong list of prospects. Strike up a conversation and tell them about the content you’re working on. Ask them for feedback due to their expertise or interest in the subject matter. Update them regularly along the way to make sure they are still onboard so when the content launches you will have a warm rapport with these people. Keep track of who was interested in your spreadsheet. QUICK HITS The following quick hits can be done at any point in any month. Many of them are one-offs, others will benefit from continued engagement. They are placed here so that you can get wins and show movement to the powers that be in order to get continued buy-in for your link building campaigns. Ask for Links in Mailing List Signups – Encourage users to link to your website when sending out the confirmation email for your mailing asking them or including embed code. Profile Links – Many Web 2.0 profiles allow you to implement a “DoFollow” link or links that pass link equity. When claiming your brand on social networks be sure to include links from your profile. Facebook Fan Page Twitter YouTube Google+ Profile Directory Submission – Directory submissions are generally considered the lowest form of link building and generally won’t help you move the needle. That said you can easily identify directories with keyword searches plus directory type e.g. “3d tv rss directory.” Again, you can show numbers with these, but they are generally not worth your time. RSS Directories Niche Directories Paid Directories Article Directories Blog Directories Design Galleries Better Business Bureau – The BBB has a site with an incredibly high domain authority, it’s a widely trusted site in both the eyes of the search engines and the consumer. Getting linked from this site is fairly easy and very valuable. Chamber of Commerce – Similar to the BBB, the local chamber of commerce provides the same type of value and ease for obtaining links. Join the Conversation – Typically this is called “link dropping,” but that is only in cases where people place links without joining in the conversation contextually. If you are adding to the conversation (as seen on SEOmoz posts) this is a viable tactic for link building. Message Boards/Blogs – Find these with keyword searches in Google’s discussion search and Social Mention. Quora LinkedIn Yahoo Answers MONTH TWO – EGOBAIT This month in the Noob Guide to Online Marketing Guide you are building your social media followings and soon you will be expected to seed users. That’s much easier said than done, but one of the best ways to do that is by getting your influencers to put your content in front of their users. The best way to accomplish this is by launching egobait which is content made to flatter, include or get the attention of specific users while also providing utility to your audience, Crowd Sourced Posts – Reach out to influencers and ask them what they think about current events. This makes them feel important and allows them to voice their opinion on topics without having to write a full post themselves and truthfully allows you to create content with little effort. Best of Lists – Curate a list of the greatest content, writers, things in your space and give props to your target influencers. Another way to quickly make content that will make the rounds and their audience will start to engage with you. Interviews – Have a Q&A session with a popular thought leader over the phone using Google Voice and you will quickly have a transcript of your interview and your influencer will have piece of content they are proud to share and link to. Awards/Badges – Gillian Muessig said it best “no one gave us the authority to launch the Web 2.0 awards, but we did and people still try to enter them to this day.” Launch your own awards in your space and send the people you want to link to you badges that they can use to link back to you. You can take this even further by launching an unbranded microsite and then tricking you competitors into linking to you. X-Factor – There’s an infinite amount of ways to flatter people. Without picking up a copy of the Art of Seduction I’m sure you can creatively figure out how to get influencers to come out to play. Here’s an example from a Credit Card Finder site in Australia where they created a comic book series starring the top financial bloggers in their space. This is a great opportunity to revitalize a dormant content idea that never quite took off. Do you have creative content that fell to the wayside because the characters never took a life of their own? Take your influencers and breathe new life into an old idea by making them the stars. MONTH THREE – LAUNCHING DATA VISUALIZATION The infographic is largely misunderstood as a piece of automatically viral content. The reality is that the infographic has been done to death so unless you have an active built-in community yours requires a substantial launch plan and push. The Noob Guide to Online Marketing Guide places the launch of an infographic at Month Six, but to get the most mileage out of it as a noob, I’m placing data visualization at Month Three. Feel free to launch an additional infographic at Month Six. In 2012, data visualization should be presented as a Maximum Viable Product. A great example of such is an Australian site in the life insurance space called Life Insurance Finder who launched a very impressive and successful piece of link bait called “What Happens Online When You Die.” Don’t just build the infographic, build a data visualization experience that exhausts the available digital assets. Create a video counterpart to that infographic, and highlight the source data to build a higher barrier to entry for those that will look to steal your success. Even right now you’re thinking that’s a lot of work; well think of how competitors will feel once that work is finished. Zappos has over 30,000 videos for its products; it is very difficult to compete with Zappos in video search because they got there first. Be the Zappos of the topic you visualize. Simply put, some people want infographics, some people want a page and some people want a video and the performance of the “What Happens When You Die Online” campaign is very indicative of that. Here are the numbers: Page – 258 Links, 86 Root Domains, 172 Facebook Shares, 145 Tweets, 51 +1s Video – 81,072 views, 2071 Facebook Shares, 69 links, 10 Root Domains, 2601 Tweets, 61 +1s Infographic – 86 Links, 28 Root Domains, 31 Facebook Shares, 99 Tweets, 16 +1s Make it easy to link to you, give the people what they want. TACTICS Seed to Your Influencers – You have pre-contacted influencers for this very reason. Spell out their involvement in your content so they are compelled to link to it, share it and otherwise endorse it. Reach out to your Targets – The list of prospects you’ve created have been waiting for this moment. Ideally, you will reach out to them first in social media and then escalate to email. Contact Those Already Linking to You – Pull your existing links using a link index tool and then inform all of the relevant people that already link to you that you have launched a new piece of incredible content. Leverage Your Mailing List – At this point your mailing list should be full of people that want to find out about your content. Inform them of your new content and include the relevant embed code to make it easy for users to link to you. Add to the Conversation – Head back to the forums, blogs, message boards and Q&A sites and contextually add to the on-going conversation and when it makes sense add a link to your content. MONTH FOUR – RELEASE AN EBOOK AND GUEST POST By now you and/or your team have written the most incredible e-book your niche has ever seen with the best graphic design and interesting if not new insights on your subject. Luckily, you’ve saved some room for your new influential buddies to get a piece of the action and enough tangential or cutting room floor content to spread it around and get the most mileage out of it. TACTICS Exclusive Release – Align with an influential site in your space that gets a lot of traffic and offer your E-Book as an exclusive download. Guest Post – A good guest posting opportunity typically serves two purposes. First, you are writing content for a third-party website wherein you can drop as many exact match anchor text links as you like. Secondly, you have an opportunity to leverage the eyeballs of users that frequent the site. Foreword – Invite a key influencer to write the foreword of the book so their name can be attached to your promotions in social media and on other influential websites. Quotes – Reach out to thought leaders in the space for quotes, similar to the pre-contacting done in the first month asking thought leaders for quotes keeps them aware of the process that you are making a book and once the book arrives you can easily reach out to those influencers and request a link or promotional support. Reviews – Reach out to bloggers that specifically write book reviews in your space. Simply search for “[keyword] book review.” For example, if I were to write an SEO e-book I would certainly reach out to this gentleman, Ian Lurie, since he has reviewed an book about SEO in the past. (I just egobaited Ian here. Now when I tweet about it I can put \"featuring @portenint\" in the tweet) MONTH FIVE – HOST A BLOG CONTEST In Month Six Oli suggests holding a contest in social media. I’m going to move that up one month in order to couple it with the event you will be throwing in Month Six. I’m also going to take another page out of Oli’s book and suggest this be a blogging contest. The concept is quite simple: Reach out to influencers in your space that are awesome writers Convince them to write their best work Offer awesome prizes Decide the winners based on social metrics You may be few thousand dollars lighter from the prizes you pay out, but you also have a ton of great content from thought leaders in your space which then turns into more linkable assets. You also have a ton of social shares that put your content in front of those influencers’ followers in social media. Does it work? Well Unbounce ran the same contest and here’s the leaderboard: The posts led to a combined 20,000 unique visitors during the respective two week scoring periods of each post and twenty one posts that continue to drive substantial traffic and links for Unbounce. TACTICS At this point the content on your site will be robust enough to make linking to you easy and worthwhile. The following tactics will allow you to continually identify contextual prospects and grease the wheels for any ongoing outreach link building: Set up Google Alerts – Use your brand name, the names of people involved in the business and target keywords as the queries that you are targeting in Google Alerts. If someone has mentioned you and not linked to you, quickly ask them for a link. Ifttt– Set up automatic alerts using If That Then This for when the brand, keywords or guest post URLs are mentioned in social media. Reach out to those people and encourage them to link to you. LinkStant – Find out when someone is linking to you as they are writing their post and ask for updated anchor text. Image Search – Google’s image search allows you to search for sites that have embedded your infographic and request that they cite their source by linking to you. Video Search – Sometimes people re-upload videos to YouTube and that causes the views to be split between them. Search for those videos on YouTube and then search for the URL in Google to find sites that have embedded your video and request that they switch videos and link to you. Once the competition is over, revisit your badge strategy by sending all entrants a badge and encouraging them to link back to their post. MONTH SIX – THROW AN EVENT You may have heard that the best way to get someone to link to you is to buy them a beer; throwing an event is the scaled version of that. Throwing a successful event naturally generates a lot of fanfare, promotion and chatter that will also lead to links. First, you must decide what type of event you want to put on: Meetup Conference Party Dinner TACTICS Ask People You Know To Link To You – The people that you specifically invite to your event should be the type of people that you want to link to you. Show them a good time and encourage them to write about your event after the fact. Press Releases - These have been abused by SEOs on PRWeb and Businesswire for content launches and link building but they are most effective in the case of launching an event. Reach Out Directly to Journalists – Find journalists with the keyword searches “columnist for [publication]” and “writes for [publication].”Invite these people out and show them a great time. Handwritten Notes – Follow up after the event is over with handwritten notes so potential linkers remember you and your hospitality. FINAL QUICK HITS The SEER Method - For your grand sendoff use the SEER Interactive method; pull your full list of followers using SimplyMeasured and pull your complete backlink profile with MajesticSEO, expand any shortened URLs and do VLOOKUPs to determine what users are following you, but not linking to you and reach out to them. Find Who Shared Your Stuff – Similarly, using Topsy, pull the profiles for all the people that shared your URLs and perform a VLOOKUP to see what users shared your content but didn’t link to you and reach out to them. CONGRATS! Presumably, you’ve made it through not one, but two guides on how to successfully launch a new web property and ultimately get visibility not just in the SERPs but amongst key influencers in your vertical. I hope now that link building doesn’t seem quite as daunting as it once did and I wish you great success! Remember there are two solid ways to build links: Make News or Make Friends. Which one are you prepared to do? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Noob Guide to Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Noob Guide to Link Building"
    },
    {
      "level": "H2",
      "text": "MONTH ONE – PLANNING AND QUICK HITS"
    },
    {
      "level": "H3",
      "text": "PLANNING"
    },
    {
      "level": "H3",
      "text": "QUICK HITS"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "MONTH TWO – EGOBAIT"
    },
    {
      "level": "H2",
      "text": "MONTH THREE – LAUNCHING DATA VISUALIZATION"
    },
    {
      "level": "H3",
      "text": "TACTICS"
    },
    {
      "level": "H2",
      "text": "MONTH FOUR – RELEASE AN EBOOK AND GUEST POST"
    },
    {
      "level": "H3",
      "text": "TACTICS"
    },
    {
      "level": "H2",
      "text": "MONTH FIVE – HOST A BLOG CONTEST"
    },
    {
      "level": "H3",
      "text": "TACTICS"
    },
    {
      "level": "H2",
      "text": "MONTH SIX – THROW AN EVENT"
    },
    {
      "level": "H3",
      "text": "TACTICS"
    },
    {
      "level": "H3",
      "text": "FINAL QUICK HITS"
    },
    {
      "level": "H2",
      "text": "CONGRATS!"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Michael King\n          \n            Michael King\n          \n            Michael King"
}