{
  "url": "https://moz.com/blog/the-freemium-business-model",
  "slug": "the-freemium-business-model",
  "title": "The Freemium Business Model - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Fred Wilson, a managing partner at two VC firms in New York, had a highly touted post on his favorite business model that a lot of SEOs and Internet marketers will be able to identify with:\n\nGive your service away for free, possibly ad supported but maybe not, a...",
  "content": "The Freemium Business Model Online Advertising By: Rand Fishkin March 24, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 24, 2006 The Freemium Business Model Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Fred Wilson, a managing partner at two VC firms in New York, had a highly touted post on his favorite business model that a lot of SEOs and Internet marketers will be able to identify with: Give your service away for free, possibly ad supported but maybe not, acquire a lot of customers very efficiently through word of mouth, referral networks, organic search marketing, etc, then offer premium priced value added services or an enhanced version of your service to your customer base. It's nothing new to the search marketing community that this is one of the most effective ways to build an online business, but what is new is the name Fred's given it - the Freemium Business Model. This is one of those terms (unlike Sandbox or Web 2.0 or SEM) that actually does a good job of describing the service. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Freemium Business Model"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Freemium Business Model"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}