{
  "url": "https://moz.com/blog/the-seomoz-premium-member-discount-store-is-now-open-for-business",
  "slug": "the-seomoz-premium-member-discount-store-is-now-open-for-business",
  "title": "The SEOmoz Premium Member Discount Store is Now Open for Business - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're officially announcing our newest benefit to Premium Members: the SEOmoz Premium Member Discount Store (note that only Premium Members will be able to access the page). We've partnered with several SEO and SEM companies to provide Premium Members with discounts and deals on various products…",
  "content": "The SEOmoz Premium Member Discount Store is Now Open for Business Moz News By: Rebecca Kelley September 11, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley September 11, 2007 The SEOmoz Premium Member Discount Store is Now Open for Business Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We're officially announcing our newest benefit to Premium Members: the SEOmoz Premium Member Discount Store (note that only Premium Members will be able to access the page). We've partnered with several SEO and SEM companies to provide Premium Members with discounts and deals on various products and services (here's where I channel my inner Rand and explicitly state that we are not receiving commission or affiliate perks from any of the participating companies). Currently available deals include 10% off conference passes to SMX Local & Mobile and SMX Social Media, 50% off your first month of Acquisio's PPC Management Software, $20 off your first month of a Keyword Discovery membership, 15% off all ads at Text Link Ads, and much more. We'll also periodically be adding more vendors, so our members will receive continuous discount offers. If you're a vendor and wish to be included in our Discount Store, you can email me (rebecca-at-seomoz.org) and we can discuss the details (normally Scott handles these, but he's rockin' the Euro Mullet in Prague for the next couple weeks). UPDATE from Rand: If you're a company that provides services to search marketers or webmasters and you'd like to be on the list, please email me. We won't list everyone who offers a discount (we need to do some quality control), but there's certainly a lot of companies out there that we'd love to put in front of our members (and get you some great marketing, too). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The SEOmoz Premium Member Discount Store is Now Open for Business"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The SEOmoz Premium Member Discount Store is Now Open for Business"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}