{
  "url": "https://moz.com/blog/the-6-goals-of-seo-choosing-the-right-ones-for-your-business",
  "slug": "the-6-goals-of-seo-choosing-the-right-ones-for-your-business",
  "title": "The 6 Goals of SEO [SEO Goals and Objectives] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Virtually everyone who's engaged seriously in the practice of search engine optimization has found it to have surprisingly versatile results. Site owners will often start out optimizing in order to rank for a particular term/phrase that's relevant to getting customers, only to find that secondary…",
  "content": "The 6 Goals of SEO: Choosing the Right Ones for Your Business Online Advertising By: Rand Fishkin January 15, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 15, 2009 The 6 Goals of SEO: Choosing the Right Ones for Your Business Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Virtually everyone who's engaged seriously in the practice of search engine optimization has found it to have surprisingly versatile results. Site owners will often start out optimizing in order to rank for a particular term/phrase that's relevant to getting customers, only to find that secondary and tertiary benefits from branding to reputation management to raw traffic all have an impact. Today I'd like to cover the different applications of SEO and talk about how to choose the right SEO objectives for your business. Value-Producing Objectives for SEO: SEO for Raw Traffic Optimizing a site for search engines and creating keyword targeted content produces direct traffic from the engines, which typically expands into content sharing, direct traffic and referring links as more and more people find, use and enjoy the work you've produced. There are thousands of sites on the web that leverage this traffic to serve advertising, directly monetizing the traffic sent from the engines. From banner ads to contextual services like Google's AdWords to affiliate programs and beyond, web advertising has become a massive ($25B+ according to eMarketer) industry. When to Employ Use it when you can monetize traffic without actions or financial transactions on your site (usually through advertising). Keyword Targeting Any and all - the goal here isn't typically to select specific keywords, but instead to create lots of high quality content that naturally targets interesting/searched-for terms. Instead of singular optimization on specific terms, the focus is on accessibility and best practices throughout the site to earn traffic through both high volume and long tail queries. Concentrate efforts on great content, and use keyword-based optimization only as a secondary method to confirm the titles/headlines of the works you create. Page & Content Creation/Optimization A shallow, highly crawlable link structure is critical to getting all your content indexed - follow good information architecture practices and use intelligent, detailed category and sub-category structures to get the most benefit out of your work. You'll also need to employ good on-page optimization (titles, headlines, internal linking, etc) and make your articles easy to share and optimized for viral spreading. SEO for E-Commerce Sales One of the most direct monetization and intent-bases for SEO is driving relevant traffic to an e-commerce shop to boost sales. Search traffic is among the best quality available on the web, primarily because a search user has expressed a specific goal through their query, and when this matches a product or brand carried by the web store, conversion rates are often extremely high. Forrester research estimated the e-commerce market to top $235 billion in 2009 (though the recent economic downturn may affect that number somewhat). With so many dollars flowing over the web, it's little surprise that e-commerce focused SEO is among the most competitive and popular applications of the practice. When to Employ Use it when you have products/services that are directly for sale on your website Keyword Targeting Pay-per-click is an excellent way to test the efficacy and potential ROI of keyword targets. Find those that have reasonable traffic and convert well, then pursue. You'll often find that the more specific the query - brand inclusive, product inclusive, etc. - the more likely the visitors are to make the purchase. Page & Content Creation/Optimization You'll typically need some serious link building along with internal optimization to achieve high rankings for competitive, high-value keywords that bring in conversion-focused traffic. Manual link building is an option here, but scalable strategies that leverage a community or customers can be equally (or even more valuable). SEO for Mindshare/Branding A less popular but equally powerful application of SEO is to use it for branding purposes. Bloggers, social media websites, content producers, news outlets and dozens of other web publishing archetypes have found tremendous value in appearing atop search results and using the resulting exposure to bolster their brand recognition and authority. The process is fairly simple - much like traditional advertising's goals of ad repetition to enter a buyer's consideration set (see Three Laws of Branding for more), so too do online marketers observe that a website's pages consistently at the top of search rankings around a particular subject has a positive impact on traffic, consideration and perceived authority. When to Employ When you have a business that's focused on attracting attention from a market more so than any direct traffic or monetization goals. This is frequently the case with new social communities, blogs or companies that need member acquisition and participation. Keyword Targeting As with raw traffic, your keyword focii is less critical here - you'll likely have a few broad terms that receive high traffic you're chasing, but the long tail may be far more achievable and worth the less intensive effort. Choose keywords that are going to bring you traffic you're likely to be interested in, and remember your site/brand. Page & Content Creation/Optimization The same principles as raw traffic apply - make an accessible site, use good link structure and best practices and focus on links for domain authority more so than specific keywords. SEO for Lead Acquisition & Direct Marketing Although less direct than an e-commerce sale, lead acquisition via the web is an equally valuable and important system for building customers and revenue. Millions of search queries have commercial intents that can't be (or currently aren't) fulfilled directly online. These can include searches for services like legal consulting, contract construction, commercial loan requests, alternative energy providers, virtually any service or product people source via the web. When to Employ When you have a non-ecommerce product/service/goal that you want users to accomplish on your site or are hoping to attract inquiries/direct contact over the web. Keyword Targeting As with e-commerce, choose phrases that convert well, have reasonable traffic and have previously performed in PPC campaigns. Page & Content Creation/Optimization Although you might think they'd be easier than e-commerce, lead acquisition SERPs are often equally challenging. You'll need a solid combination of on-site optimization and external link building to direct pages (with good anchor text) to be competitive in the more challenging arenas. SEO for Reputation Management Those who've dealt with negative or non-existent web information about themselves or their businesses frequently desire to populate the search results with positive links and mentions. SEO enables this process through content creation and promotion via link building. While reputation management is among the most challenging of SEO tasks (primarily because you're optimizing many results for a query rather than one), it's in high demand and has a large number of practitioners (for example, the 214 SEO companies offering reputation management in our marketplace). When to Employ If you're trying to either protect your brand from having negative results appear on page 1, or are attempting to push down already existing negative content, reputation management SEO is the only path to success. Keyword Targeting Chances are, this is very easy - it's either your personal name, brand name or some common variant (and you already know what it is). You might want to use keyword research tools just to see if there are popular variants you're missing. Page & Content Creation/Optimization Unlike every other SEO tactic, reputation management involves optimizing pages on many different domains in order to push results down in the SERPs. This involves using social media profiles, public relations, press releases, links from networks of sites you might own or control along with classic optimization of internal links & on-page elements. It is certainly among the most challenging of SEO practices, especially in Google, where QDD (Query Deserves Diversity) can mean you have to work many times as hard to push down negatives because of how the algorithm employs content preferences. SEO for Ideological Influence For those seeking to sway public (or private) opinion about a particular topic, SEO can be a powerful tool. By promoting your ideas/content in the search results for queries likely to be made by those seeking information about a topic, you can influence the perception of even very large groups. Politicians and political groups/individuals are the most likely employers of this tactic, but it can certainly be applied to any subject from the theological to the technical or civic. When to Employ When you need to change minds or influence decisions/thinking around a subject - think Anonymous' campaign against Scientology or theoretical physicists attempting to get more of their peers considering the possibility of alternate universes as a dark matter source. Keyword Targeting Tough to say for certain, but if you're engaging in these types of campaigns, you probably know the primary keywords you're chasing and can use keyword research query expansion to find others. Page & Content Creation/Optimization This is very classic SEO, but with a twist - since you're engaging in ideological warfare in the SERPs, chances are you've got allies who can rally to the cause. Leverage your combined links and content to espouse the philosophy du jour. Choosing the Right SEO Objectives for Your Business Before you invest in the long term SEO strategy for your business, you should carefully consider which of these can have a major impact on your goals. Putting time and energy towards a single goal, only to later add on others can result in duplicated work and effort. As a business/organization, decide on what you need to accomplish and ask yourself questions like: Does the company need direct sales, traffic, branding or some combination of these? Are there influencers you're trying to reach with a message? Is the organization/brand subject to potentially negative material that needs to be controlled/mitigated? Do you have products/services you sell, either directly over the web or through leads established online? Once you have the answers, you can attack SEO with the right list of goals in mind. Of course, the hard part then becomes executing on that strategy, but we'll save that for other posts :-) p.s. We've got a very exciting announcement coming tomorrow morning, stay tuned! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The 6 Goals of SEO: Choosing the Right Ones for Your Business"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The 6 Goals of SEO: Choosing the Right Ones for Your Business"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}