{
  "url": "https://moz.com/blog/the-shortcomings-of-the-long-tail",
  "slug": "the-shortcomings-of-the-long-tail",
  "title": "The Shortcomings of the Long Tail - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I work for an online marketing agency, and we’ve been working on a paid search campaign with a niche online job board for some time now. Received wisdom suggests that in order to create a cost effective paid search campaign you should focus on long tail search terms as you’ll get more targeted…",
  "content": "The Shortcomings of the Long Tail Paid Search Marketing (PPC) H By: Helene Hall March 24, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! H By: Helene Hall March 24, 2008 The Shortcomings of the Long Tail Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I work for an online marketing agency, and we’ve been working on a paid search campaign with a niche online job board for some time now. Received wisdom suggests that in order to create a cost effective paid search campaign you should focus on long tail search terms, as you’ll get more targeted traffic and cheaper clicks. Now, we work with clients from a wide range of industries. Broadly speaking, the long tail has worked very well for us, particularly for highly competitive sectors like insurance and financial services, but seemingly this just isn’t the case for our niche job board client. We were running job title focused ad groups, type of organisation focused ad groups, even the location focused groups, e.g., ‘job title in London / Manchester,’ etc. were seeing very low volumes and a desperately low click through rate. After a lot of head-scratching we decided to go back to basics, and back into the shoes of those searching. Once you stop and think about it, the answer is pretty simple – it’s all about the intent of the searcher. If I’m looking for a job online, I’m not looking for my preferred search engine to return me my perfect job, I’m looking for the perfect job site. Until I have a look at what’s out there, to be honest I’m not even entirely sure I could define my perfect job. Obviously, there are some things I’d like – e.g., salary, commute not too hellish -- but for a truly fabulous job I’d be willing to compromise on those things. So, a marketing bod like me is far more likely to search for a fairly broad term like ‘marketing jobs’ rather than a very specific term like ‘Head of Marketing within 6 miles of central London’. Once I hit the relevant job site I’ll start narrowing down my search, but at the point that I hit the search engine I’m keeping my search broad. I should probably state now that we’ve not totally abandoned the long tail, but in order to deliver volume we’re back to increasing our bids on the more generic search terms. Now it strikes me that there are probably a few industries like this – real estate, dating, and so on. Anyone else care to share some examples? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Shortcomings of the Long Tail"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Shortcomings of the Long Tail"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Helene Hall\n          \n            Helene Hall"
}