{
  "url": "https://moz.com/blog/the-rich-get-richer-true-in-seo-social-all-organic-marketing",
  "slug": "the-rich-get-richer-true-in-seo-social-all-organic-marketing",
  "title": "The Rich Get Richer: True in SEO, Social + All Organic Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " Many years ago, one of the search marketing industry's early great minds, Mike Grehan, wrote a seminal piece that's been referenced and influenced ever since - Filthy Linking Rich. Mike's point was well encapsulated in a few sentences: The Mathew effect, when applied to networks,...",
  "content": "The Rich Get Richer: True in SEO, Social + All Organic Marketing Online Advertising By: Rand Fishkin December 7, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 7, 2010 The Rich Get Richer: True in SEO, Social + All Organic Marketing Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Many years ago, one of the search marketing industry's early great minds, Mike Grehan, wrote a seminal piece that's been referenced and influenced ever since - Filthy Linking Rich. Mike's point was well encapsulated in a few sentences: The Mathew effect, when applied to networks, basically equates to well connected nodes being more likely to attract new links, while poorly connected nodes are disproportionately likely to remain poor In fact, it has been proposed that \"the rich get richer\" effect drives the evolution of real networks. If one node has twice as many links as another node, then it is precisely twice as likely to receive a new link. For those new to the field of SEO, social media and all forms of organic marketing (content development, blogging, email list building, etc.), it probably comes as no surprise that this same principle applies to each of these. The email marketer with a giant email list has much greater leverage to add 100 new subscriptions through the power of their existing influence than their new competitor, just starting out with those first dozen email addresses. The website ranking in position #1 for a high volume search query likely earns a few, natural, reference links each day, while a struggling competitor, even one who might have better prices, quality, value or content, must struggle out of obscurity before any of those \"links via discovery\" come their way. This principle applies cross-channel equally well. High search rankings can earn you lots of visitors who might subscribe to an email list. Thousands of Twitter followers can mean direct SEO benefit and second-order effects like more links and branding. A popular LinkedIn group can drive traffic that turn into more RSS subscribers, getting you noticed by industry lists, which then feed into more media attention and links, which delivers higher rankings. It's a virtuous circle -- unless you're sitting on the sidelines. Many of the marketers I talk to complain bitterly about this challenge, though not all of them necessarily comprehend why the difficulty is so great. Thankfully, there are ways you can give yourself a step up, even in those early stages: Build Basic Competency Everywhere: Since your email marketing efforts will boost your link building and your social media traffic can turn into RSS subscriptions, make sure you've at least got the basics of every channel covered. An accessible websitee is key to any rankings - and basic keyword targeting is, too. Get a presence on the major social media networks with your brand name and a basic email signup form on your site. Establish a blog, an RSS feed and a presence on some major industry sites (forums, Q+A sites, blog comments, etc). These basics will serve you well no matter what shape your marketing takes. Focus on Your Strongest Channels: Which marketing channel should you choose? It depends. If earning links is hard for you, search is still low ROI and email newsletters are a mystery, don't start with these - go with what you know and build up your social media presence, your research-based white papers or your subscription-worthy blog content. With cross-channel leverage, you can shore up these weaker sectors when you have the strength to take them on. No Matter What, Get Analytics + Conversion Tracking Right: All your efforts, in any spectrum of organic marketing, will be for naught if you can't measure and improve. Analytics and conversion tracking can show you which channels work for you and where you efforts are best spent - these aren't the only consideration, as passion and aptitude should figure into the mix as well, but they're the critical baseline. Get tracking right or suffer. Overtaking a competitor or earning your way into a crowded field with strong existing players isn't just hard, it's getting harder, at a faster pace, every day. I've shared this graphic before (when writing about how SEO Can Be a Competitive Advantage), but it's worth showing again: Don't be discouraged, but do be wary, and do push to start investing in organic now. Like Manhattan real estate in the '80's, it might seem like there's a peak in how hard it is to enter the market, but it's only going to get worse. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Rich Get Richer: True in SEO, Social + All Organic Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Rich Get Richer: True in SEO, Social + All Organic Marketing"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}