{
  "url": "https://moz.com/blog/the-seo-tool-of-the-future",
  "slug": "the-seo-tool-of-the-future",
  "title": "The Future of SEO Tools - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "During the finale of the SEO Pro Seminar in London, Rand presented on  reverse engineering the rankings delivered by the search engines. In my  opinion this was the biggest ‘take away’ as this represented a  practical approach to what we do every day – trying to understand the  weighting of the…",
  "content": "The SEO Tool of the Future SEO Tools A By: Andy Wright December 23, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! A By: Andy Wright December 23, 2010 The SEO Tool of the Future SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. During the finale of the SEO Pro Seminar in London, Rand presented on reverse engineering the rankings delivered by the search engines. In my opinion this was the biggest ‘take away’ as this represented a practical approach to what we do every day – trying to understand the weighting of the important elements in SEO. As SEO’s we’re continually facing the challenge of adapting to Google’s algorithm, with the most important outcome being that we achieve higher rankings for clients. We have to understand in detail which elements within the ranking algorithms are causing fluctuations in our campaigns, so that we can refine them to achieve better results. We also need to change the client perception of SEO, and what an SEO campaign involves. At Bloom Media we’ve found that by using the following type of analysis in a pitching stage, as an ongoing measurement tool and for client performance reviews, we can direct campaigns in a more robust fashion. As well as gaining trust from clients that their SEO campaigns have been created and monitored in a calculated approach, we have found that presenting this type of information to the client in a top level format provides them with a tangible understanding of their site vs. their competitor’s sites. What is LDA? Based on the post by Rand the objective of LDA (Latent Dirichlet Allocation) is to understand how Google is using semantic contextual analysis combined with other factors to define topics or groups in the Google database. It’s about how Google analyses the words on a page to determine how relevant a search query is to pages indexed. For example, how does Google assign relevance to the word ‘Windows’ on a page? It is determined by the relationship to ‘Microsoft Windows’ or to ‘Double Glazing’ by the context on the page. So, how can LDA analysis be used to create more effective SEO campaigns? Well, results that are higher in Google’s results pages generally have more topical content, which shows that the search engines are applying semantic analysis when indexing and determining the intent of a keyword on a page. It’s not about loading keywords onto a page, but about the relevancy of the keywords to the topics within the page. Practical use LDA Our approach for undertaking any analysis is to create a winning SEO strategy, and using the SEO resources (client budget and SEO team) effectively to target areas in a campaign in a calculated manner. Although the LDA analysis provides a detailed overview of a campaign, and is perfect for providing clients with a performance overview, we would use this as a basis for more analysis before any implementation takes place. LDA is the formulation of a strategy that is part of a 3 step process which is explained below: 1. Understanding the competitive landscape 2. Strategy creation 3. Implementation (with other tools) Understanding the competitive landscape The initial stage of the LDA analysis is to understand in detail the search ranking factors. SEOmoz have produced a great article that shows this in more detail. The chart below shows and overview of the weighting that is given to 6 important searching ranking factors: Using the components in the search raking algorithm as the basis for the LDA analysis, the chart below is the combined LDA score. This has been produced from the totals generated from the raw SERPs data for the keyword ‘cheap laptops’. As an example, we can see that some of the sites lower down in the SERPs are lacking or missing out on Anchor Text Links. Strategy creation Having identified one missing key component in the ranking data as anchor text, we need to look at this in more detail to start to formulate a strategy for implementation. As part of the LDA report, the following chart shows the breakdown of the Links and Linking Root Domains that are exact keyword matches for the anchor text in more detail. The basis of the strategy of the SEO campaign would be to build more anchor text links, as we have identified this as the missing gap in the SEO campaign. Before we can move into the implementation stage, we need to do some more analysis on the type of links that we would need to develop. We need to combine several tools to get a broader understanding of the anchor text links. For example, we would firstly look at the quality of the inbound links to the site using the SEOmoz trust factors and Linkscape analysis. Secondly, we need to understand the quality of the links that well need to get - Do we need links from numerous related sites? Or do we need fewer but high quality trusted site links? Following this analysis we can now begin to look at the backlinks of all the competitors using tools like Majestic SEO, so that we can see the cumulative link growth of each site together, with the number and type of back links they have (anchor links, brand links, product links, and URL links). From the charts below, we would compare the overall backlinks over time, looking for growth vs. time and spikes in backlinks. We can see from the charts below that there has been a steady growth of backlinks over time, which would mean that if we were competing against this site then we would need to model something similar in our strategies. It also provides vital data on timescales and expectations for our clients and our link building activity plan. Implementation Using the examples above and a combination of tools, the strategy that we can execute for ‘cheap laptops’ would be focused around anchor text link building from a high number of computer and technology related sites. Also as part of the implementation and client review strategy, continued monitoring of backlinks, and SERP positions is vital to understand the progress made, and to continually refine the campaign. Reporting to the client is of the upmost importance for the duration of this whole process, as it builds up a huge amount of trust for a long lived SEO campaign, and helps them to understand and visualise the bigger picture. This is an exciting time as this approach is driving the future of SEO. I’ve begun to see the benefits by testing the LDA analysis tool, and I encourage all SEO professionals to test it on their client accounts so that this can be developed into THE SEO tool of the future! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The SEO Tool of the Future"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The SEO Tool of the Future"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Andy Wright\n          \n            Andy Wright"
}