{
  "url": "https://moz.com/blog/the-long-tail-of-lego-how-their-site-gets-it-right",
  "slug": "the-long-tail-of-lego-how-their-site-gets-it-right",
  "title": "The Long Tail of Lego & How their Site Gets it Right - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I noticed this well thought-out post today from Chris Anderson at the Long Tail (which is a blog I've been mean...",
  "content": "The Long Tail of Lego & How their Site Gets it Right Moz News By: Rand Fishkin October 21, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 21, 2005 The Long Tail of Lego & How their Site Gets it Right Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I noticed this well thought-out post today from Chris Anderson at the Long Tail (which is a blog I've been meaning to read for some time now). It's on what Lego has done with their website, marketing campaign, demographics and mail order campaign to create a great two-way system of service for their customers. Although Chris really likes the Death Star (which I have to admit is darn cool), I'm a fan of some of the historical Lego sets, like the Baron, here. Actually, everything in their sculpture category is pretty neat. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Long Tail of Lego & How their Site Gets it Right"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Long Tail of Lego & How their Site Gets it Right"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}