{
  "url": "https://moz.com/blog/the-smx-diaries-iv-the-matt-cutts-interview",
  "slug": "the-smx-diaries-iv-the-matt-cutts-interview",
  "title": "The SMX Diaries IV: The Matt Cutts Interview - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In the final interview installment of The SMX Diaries, Rand spends some quality time with Google's own Matt Cutts and learns all the magic behind the buttons, levers, switches and knobs that make the the interweb work.\n\nThis was a long one, so we've broken it into two parts.  Also, although I…",
  "content": "The SMX Diaries IV: The Matt Cutts Interview By: Scott Willoughby June 7, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby June 7, 2007 The SMX Diaries IV: The Matt Cutts Interview The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In the final interview installment of The SMX Diaries, Rand spends some quality time with Google's own Matt Cutts and learns all the magic behind the buttons, levers, switches and knobs that make the the interweb work.This was a long one, so we've broken it into two parts. Also, although I planned to offer this and all of the other SMX Diaries interviews on YouTube, their 10 minute max time limit is prohibiting it. If, next week, I somehow have the time to recut them to fit in that time constraint, I will. Barring that, apologies to those folks who are YouTube dependent. I hope you've all enjoyed these video interviews. No Whiteboard Friday this week, but we'll be back next week with more video action for you.Part I:Part II: Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The SMX Diaries IV: The Matt Cutts Interview"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The SMX Diaries IV: The Matt Cutts Interview"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}