{
  "url": "https://moz.com/blog/the-zeroth-law-of-writing-for-seo",
  "slug": "the-zeroth-law-of-writing-for-seo",
  "title": "The Zeroth Law of Writing for SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google something like SEO Content Writing Tips and you'll get lots of good advice. Most of it boils down to:Write content that's entertaining, engaging, informative, and compelling. Stuff that your readers will love and link to.Do keyword research and optimize your title and your article for those…",
  "content": "The Zeroth Law of Writing for SEO Content Marketing G By: Gil Reich September 18, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! G By: Gil Reich September 18, 2009 The Zeroth Law of Writing for SEO Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Google something like SEO Content Writing Tips and you'll get lots of good advice. Most of it boils down to: Write content that's entertaining, engaging, informative, and compelling. Stuff that your readers will love and link to. Do keyword research and optimize your title and your article for those keywords Which is all good advice, but it still misses the most fundamental SEO Content issue: each article must essentially be the answer to a question that users are asking Google. This may sound trivial, but it's not. The SEO advisors often write things like \"start by writing for your audience\" and act as though user-focused quality is exactly what you need for SEO. It isn't. Consider two articles with which I've been involved, 2005: The Words and the Wordsmiths and Is the Carmen Winstead story really true? The first is a piece I was really proud of, and that got me a lot of positive feedback. I spent about a day writing it. The second is a good answer that I helped edit. Probably took less than an hour to research and write the answer. [From an SEO perspective, everything about the first article is currently broken, but it doesn't really matter]. The first article was unlikely to get much search traffic, no matter how well we optimized the SEO. The second article averaged over 1,000 search visits a day for over a year. Is the second article more entertaining, engaging, informative, and compelling? I don't think so. But the second was a perfect SEO article, and the first was not. The zeroth law of SEO is this: Write an article whose title is a question people are asking Google and whose body is the answer. By question I don't necessarily mean natural language question. Most of the search environment omits questions words in titles. Declawing your cat meets the zeroth law and is a candidate for SEO traffic. The Mets are Done but Season Still Fun is a fun article that does not meet the zeroth law. It doesn't matter (for SEO) which piece is more engaging, etc. Those laws only matter after you pass the zeroth law. This article is somewhere in between. Nobody's searching for \"Zeroth Law of Writing for SEO.\" But if enough other things go right somebody who searches for Writing for SEO might see this title and be intrigued. I'm SEO challenged because I like answering questions that I think people should ask (not the ones that they do ask), and I hate compromising my creative writing for SEO points. At one point I changed the title to Writing for SEO: The Zeroth Law but my creative side rejected that. Last point. On a wider scale, if you're building a business based on content for SEO, don't forget the zeroth law. A site of original poems may be extremely high quality, but don't expect much search traffic, no matter how good your poems or your SEO experts. On the other extreme, even a few years ago when Wikipedia content was generally low quality, its encyclopedia articles met the zeroth law well, which certainly helped it achieve its phenomenal SEO success. Similarly, Q&A sites like our WikiAnswers and Joel Spolsky and Jeff Atwood's StackOverflow are optimized around the zeroth law, which is the foundation of our success. To conclude, we miss a key point when we just say \"Great content attracts SEO\" or \"Just write for your users, the SEO will follow.\" First make sure your article -- or your business -- is built around the zeroth law. Each page must be a question (implicit or explicit) that users are asking, and the answer to that question. Do you agree? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Zeroth Law of Writing for SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Zeroth Law of Writing for SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gil Reich\n          \n            Gil Reich\n          \n            Gil Reich"
}