{
  "url": "https://moz.com/blog/the-brief-history-of-seo",
  "slug": "the-brief-history-of-seo",
  "title": "The Brief History of SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "     Google announces that the public can report paid links...The entire SEO community shits itself...This is why.       The...",
  "content": "The Brief History of SEO Public Relations P By: Patrick Sexton April 27, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! P By: Patrick Sexton April 27, 2007 The Brief History of SEO Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Google announces that the public can report paid links... The entire SEO community shits itself... This is why. The Brief History of Search Engine Optimization Featuring: Bill the Cat as SEO \"experts\" Opus as webmasters Cockroach as spammers and of course... A mystery guest Our story begins... It was discovered that by taking some rather simple actions, search engine results could be manipulated and money could be made from the internet. People who noticed this began talking to each other and using different techniques to manipulate the search engines even more. Search engines discovered this manipulation and sought ways to discourage it. A search engine published the Google webmaster guidelines, which are a list of recommendations for webmasters to follow. This gets the attention of SEO practitioners for a moment. They take stock of things... They decide it does not really matter if you follow the guidelines or not and they continue business as usual... Google sees that their suggestions are not being implemented and decide they need to somehow clean up the search engine results, which are being tainted by spam. Enter (publicly, anyway) Matt Cutts. Meanwhile, the number of people who are practicing SEO is growing... (ACK stands for \"Arrogant Crappy Krap\"; \"THBBFT\" however doesn't stand for anything) They begin to get together in groups, communicating more with each other and even sharing their wisdom with others. Back at Google, they are working hard at a solution... But are finding the SEO community to be unruly... Google goes on the offensive with an update to their algorithm... The SEO community is set back; due to this new update some of their tricks are not working anymore and their pages have stopped ranking well. They notice that if they follow a couple of the Google webmaster guidelines, their pages go back up in ranking. They see that most of the guidelines can still be safely ignored, so major changes are not necessary. Just a couple of new \"tricks\" and they are back to business as usual. Now even more people are starting to learn SEO at conventions, and they start littering the search engine results... Google notices this, and updates the algorithm again... Once again however, the SEO community sees that if they follow just a couple more of the guidelines they can once again have top rankings. Back to business as usual... Google warns that there will be an entire new infrastructure at Google called \"I am your Daddy.\" The SEO community gets scared. The \"I am your Daddy\" upgrade begins... ...and many in the SEO community are affected. A strange disease begins spreading throughout the entire SEO community. The disease is given the name \"why-the-fuck-are-my-pages-supplemental.\" The SEO community tries to do a song and dance with their clients, explaining that this is just like all the other times. But they know in their hearts that this time it is different. They find they can get out of supplemental by following a couple more guidelines, but their ranking still suffers... \"At least we can always buy links,\" they tell themselves. Buying links is against the Google webmaster guidelines, but I mean, come on, are they really going to notice? The End. by Patrick Sexton of Feedthebot.com How to follow the Google webmaster guidelines If you can't beat 'em, join 'em Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Brief History of SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Brief History of SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Patrick Sexton\n          \n            Patrick Sexton"
}