{
  "url": "https://moz.com/blog/the-shift-to-content-marketing-understand-what-is-happening",
  "slug": "the-shift-to-content-marketing-understand-what-is-happening",
  "title": "The Shift to Content Marketing - Understand What Is Happening - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Nearly 2 billion people worldwide are online. When they want a product or service, they don’t pick up a phone book (if you still do, you might want to skip this article). They go to the Internet and search via search engines or social sites because these methods generally provide fast results and…",
  "content": "The Shift to Content Marketing - Understand What Is Happening Content Marketing A By: Arnie Kuenn August 18, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! A By: Arnie Kuenn August 18, 2011 The Shift to Content Marketing - Understand What Is Happening Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Nearly 2 billion people worldwide are online. When they want a product or service, they don’t pick up a phone book (if you still do, you might want to skip this article). They go to the Internet and search via search engines or social sites because these methods generally provide fast results and relevant information —generally. Whether it’s information on a product, service, healthcare or current events, you name it, people are looking for it. In fact, in the USA during April 2011, we averaged 543 million searches per day, that’s 22.6 million per hour or 377,000 searches per minute! But you know this already, right? I think it’s a good idea to revisit briefly the phenomenon of what’s really happening online because we tend to take for granted that the Internet is part of our culture now. And when we take this phenomenon for granted, we tend to miss two important things:The excitement that comes with being at the forefront of technology.The fact that this is still new to 90% of the people, and everyone is trying to figure it out as it changes daily.To some extent we have every right to take the Internet for granted because it’s so embedded in our lives. But if you think about it, the Internet has a relatively short history compared to the radical impact it has had on us, and we’re still in the infancy of this technology. The human race has not yet fully realized the potential of this kind of connectivity. The growth curve for Internet use continues to be sharp, even today; the percentage of people online worldwide increased 14 percent from 2009 to 2010. Driven in large part by the ability of the Internet to deliver more content at faster rates and for lower costs, this explosive change to Internet usage has led to a massive cultural change. Blogging and Social Media Has Redefined Contemporary Life Not only are new users figuring this out and getting on board, but as technologies change seasoned users need to adapt. Take, for example, blogging. In effect, a blog is nothing more than an opinion column democratized so that anyone can have one. Blogging began to take off around 2004. Today, with an estimated 180 million or more active blogs on the Internet, it’s a major source of shared information. Blogging has redefined how we understand our contemporary life, so much so that major cultural events (on or offline) are measured in part by their effect on the blogosphere. Take the Egyptian revolution in early 2011 for example, much of it was credited to the use of social media.With the customer’s attention shifting online, so has the focus of marketers, and it has required new marketing strategies as we begin to understand how users interact with the Internet and how the Internet works for users. The New Marketing Simply put, web users are consumers of content. Therefore, you need to deliver compelling content that will engage your customers and keep them coming back for more. People are calling this “The New Marketing.” Most significantly, web users are searching for content to consume. This is key for any business’s relevance and branding. In fact, Vanessa Fox in her book Marketing in the Age of Google emphasizes, “Those businesses that don’t realize that we’ve experienced a shift in consumer behavior and that customers and customer data are now centered on search will lose market share to those that do”. Fortunately, it isn’t too late to get on board. You haven’t missed the boat, but you don’t have the luxury of waiting to build a content marketing strategy, either. To put it a bit more bluntly, in the words of Brian Solis, you need to “Engage or Die!” Learn – Fun – Socialize People spend their time online, and that’s where your marketing strategy needs to go. Your potential customers are online for a variety of reasons. The public relations firm Ruder Finn conducted a survey asking, why, exactly, do people go online? They categorized their results into the following seven reasons people use the Internet, descending from most common reason to least common: To Learn (self-education, for research, to keep informed)To Have Fun (to pass time, to be entertained, to escape)To Socialize (to connect, to share, to discuss, to be part of a community)To Express Yourself (to opine, to entertain others, to emote, to be creative)To Advocate (to influence others, to activate support, to join a cause)To Do Business (to work, to manage finances, to sell)To Shop (to purchase, to compare) The survey found a key demographic: More than twice as many people go online to socialize (82%) than to do business (39%) or to shop (31%) [http://www.intentindex.com ]. Surprised? Here’s the thing: The shift to reaching out to customers while they’re using the Internet means that you have to engage them in what they’re doing online. From the list above, it’s evident that the critical mass for your content strategy will center on the top three reasons people are online: to learn, to have fun, and to socialize. You may want them to shop on your site, for example, but you connect with them by providing some form of entertaining content that leads them to your site. Users want to engage with the content they find; that is, they want to stay on the page and interact with it. If the content doesn’t engage them, they move on, or bounce, and continue searching. Remember, searchers are either going to engage with you --- or your competitors. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Shift to Content Marketing - Understand What Is Happening"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Shift to Content Marketing - Understand What Is Happening"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Arnie Kuenn\n          \n            Arnie Kuenn\n          \n            Arnie Kuenn"
}