{
  "url": "https://moz.com/blog/the-new-on-site-optimisation",
  "slug": "the-new-on-site-optimisation",
  "title": "The New On Site Optimisation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently there have been a few negative comments about general on-page optimisation. David Pasternack has pooh-poohed it, and Shoemoney has expressed reservations. A couple of years ago I would have joined them – after...",
  "content": "The New On Site Optimisation Public Relations I By: IBrian January 6, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! I By: IBrian January 6, 2007 The New On Site Optimisation Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Recently there have been a few negative comments about general on-page optimisation. David Pasternack has pooh-poohed it, and Shoemoney has expressed reservations. A couple of years ago I would have joined them – after all, what’s so hard about applying keywords to page titles and tags? Especially when raw link building used to be so effective?However, a couple of key changes I think are turning the whole on-page optimisation into something much more high brow.1. GoogleGoogle has continued an absolute dominance of search, but has spent the past couple of years turning up the authority scoring aspect of their ranking algorithm up. This has meant that more established sites can now leverage their content for ranking purposes much better .Additionally, link building has become more content-oriented, with a focus on unique content syndicated to social media outlets to accelerate organic link development.2. PPCThe search marketing industry includes both PPC and SEO, and as PPC marketing matures it’s dragged a lot of overall marketing theory and practice into SEO as well.A focus on conversions and ROI means that SEO itself is no longer able to ignore these aspects in a campaign.SEO EvolutionThe overall effect is that you can make an arbitrary distinction as to two basic types of “on-page” SEO:1. Old SkoolThis is the basic application of search engine friendly processes: proper and relevant keyword titles and tags on pages, URL rewriting where necessary, and good keyword focused content. The general gist is to improve search visibility and focus on ranking.2. New SchoolThis is an extended approach which applies the above, but looks beyond simply ranking to converting through a train of processes: Ranking, Enticement, Action, Sale (REAS).Enticement is considering how the ranking pages look as an excerpt on SERPs for keyword rankings, and treating this like ad copy to try and improve on clickthroughs regardless of position.Once the visitor arrives at the site, there’s the focus on delivering a Call To Action (CTA), and offering secondary options for dedicated visitors – all positioned in key viewed areas. Sometimes simple experimentation of positioning can be used – those who earn from Adsense have usually have had to experiment with positioning and size of ads to find the optimum potential for revenue generation on each site.It doesn’t have to be a blind process, though. Various tools for this include Crazy Egg, eye tracking (where the budget allows), or various Taguchi methods of testing.The Sale aspect is tracking how Ranking and Enticement delivered an Action that resulted in a conversion. This is where key flaws can be isolated – for example, high CTA but low conversions means something is wrong – it could be anything from a coding error to issues of too high pricing.OverallMany SEOs are simply natural problem solvers who stumbled into the industry. As the search industry constantly evolves, SEOs find themselves faced with different problems to solve, then move onto the next.The overall process is that this leads to an evolution of experience and knowledge all too easily taken for granted, as Danny Sullivan said best:I am absolutely sick and tired of the SEO community forgetting that what they know and do is NOT second nature to the vast majority of people. I'm not talking spamming or black hat stuff. I'm talking about that \"simple\" stuff, the loads of things that can make a real difference to how well a site does in the search results. Ignore these things on purpose or accidentally, and you miss out on valuable traffic.Yes, you can invest time to learn these \"simple\" things. But if you know nothing about them, they can see like rocket science. Over the years, I've talked with plenty of people who weren't even aware of the basic tip that every page should have a unique, descriptive title tag. They think \"title\" means the biggest text on the page, not the HTML title tag. Talk of HTML title tags -- that IS rocket science to them.The bottom line is that SEO may have begun as a specific marketing application – but many SEOs, whether they either intend – or realise – it or not, are branching out into wider areas of marketing.A process as simple as a concern for on site optimisation is fast maturing a generation of niche problem solvers into a generation of wider marketing specialists. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The New On Site Optimisation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The New On Site Optimisation"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "IBrian\n          \n            IBrian"
}