{
  "url": "https://moz.com/blog/the-math-of-cro-whiteboard-friday",
  "slug": "the-math-of-cro-whiteboard-friday",
  "title": "The Math of CRO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week we are talking about math.... Don't worry it's not the tough kind that Isaac Newton used to do, but the math behind Conversion Rate Optimization (CRO). This week Rick Perreault from Unbounce joins us to show the value behind CRO and how you can show its value to your clients/bosses. After…",
  "content": "The Math of CRO Whiteboard Friday R By: Rick Perreault February 23, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! R By: Rick Perreault February 23, 2012 The Math of CRO Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week we are talking about math.... Don't worry it's not the tough kind that Isaac Newton used to do, but the math behind Conversion Rate Optimization (CRO). This week Rick Perreault from Unbounce joins us to show the value behind CRO and how you can show its value to your clients/bosses. After watching what Rick has to say, share a comment about your experience with CRO. Video Transcription Hi, I'm Rick Perreault. I am cofounder and CEO of Unbounce.com. Unbounce is a platform that allows marketers to create and A/B test landing pages without having to rely on IT. That is really a part of conversion rate optimization, which is today's subject. When Rand asked me to come up here and do one of these Whiteboard Fridays and he asked me to do it on conversion rate optimization, you know, I run a software company. I am not a conversion rate optimization expert. However, I see hundreds of people do it every day, and I have experienced this through much of my career. So I am going to share with you what I've seen and how I've seen conversion rate optimization actually bring far more ROI to your online campaigns than not doing it. So, let me begin. Let's imagine this as a period of a three-month campaign. In the old days, and to some degree still today, marketers are really concerned about what happens getting people to click an ad. Let's just say I'm using . . . these are all sample numbers. Just to keep the math simple. So, let's just say month one I've got $1,000 budget and I generate 1,000 clicks and I convert, my conversion rate 1%. I get 10 customers at a cost of acquiring that customer of about $100. Now, so month two, I say, \"Okay, that's pretty good.\" Now if I am going to get more sales, generate more customers, I just need to increase how much I am spending on advertising. So I increase that to $2,000 and I get 2,000 clicks. I'm still converting at 1%. The result of that, I get 20 customers at a cost of acquisition of still $100 per customer. That hasn't changed. Month three, now I am going to increase that to $3,000. I get my 3,000 clicks. Again, convert at 1%, generates me 30 customers, again CPA stays at $100. Over a three-month period, a total spent of $6,000 generates me 60 sales. That's pretty good. Now, as time has gone on, something has changes. Smart marketers realized they could actually get even more ROI from this online advertising by focusing on what happens after the ads are clicked and focusing on moving this number higher. This is what we call conversion rate optimization. That's A/B testing, using unique landing experiences, using analytics, and really understanding what happens after somebody clicks your ad. So, in this example, I use the same thing. I spend my $1,000 to get my 1,000 clicks. But this time I am going to spend $200 on conversion rate optimization, and by using analytics and some A/B testing, quite quickly I am able to push my conversion rate up. So now, I push it up to 1.5%. What we see happen here, now I've generated 15 customers, but more importantly, my cost of acquisition has gone down to $80, a 20% improvement on the ROI. So the next month, I continue and I spend my $1,000. I generate my 1,000 clicks. Again, I continue with my budget, my conversion rate optimization budget. Again, I do some more A/B testing, do some more analytics, create some more landing pages, improve it, test buttons, test messaging. I am able to push it up. Get 2% conversion rate. Now, look what happens here, again 20 customers at $60 to acquire them. So, again, even a better saving. Then finally, okay, now I am really going for it. Month three, I am going to spend $3,000. I am going to get my 3,000 clicks, continue with my conversion rate optimization, my $200 here, maintain my 2% conversion rate, generate 60 customers, and the cost of acquiring them somewhere around $53, $53 something. In this case, I spent $5,600 to generate 95 sales. Here I spent $6,000 to generate 60. The reason I was able to generate more sales on relatively the same ad spend is because I stopped worrying about just what was going on here and started focusing on what was going on here. This is the math of conversion rate optimization and this is why it is important. So next time you are talking to your boss or a client and they're trying to understand the value of A/B testing or using a landing page or just spending any time on thinking of what happens after their ads are clicked, the landing experiences, walk them through this exercise. I hope that was helpful. Thank you very much. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Math of CRO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Math of CRO"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rick Perreault\n          \n            Rick Perreault"
}