{
  "url": "https://moz.com/blog/the-seomoz-training-series-continues",
  "slug": "the-seomoz-training-series-continues",
  "title": "The SEOmoz PRO Training Series Continues - Expert Seminar: August 19th & 20th in Seattle - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last year, SEOmoz hosted a sold-out training series in September for 150 guests. That seminar covered the SEO basics - keyword research, building search-friendly sites, algorithms & social media marketing 101. We got fantastic feedback and really enjoyed getting to meet and spend time with our PRO…",
  "content": "The SEOmoz PRO Training Series Continues - Expert Seminar: August 19th & 20th in Seattle SEO Events By: Rand Fishkin June 17, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 17, 2008 The SEOmoz PRO Training Series Continues - Expert Seminar: August 19th & 20th in Seattle SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last year, SEOmoz hosted a sold-out training series in September for 150 guests. That seminar covered the SEO basics - keyword research, building search-friendly sites, algorithms & social media marketing 101. We got fantastic feedback and really enjoyed getting to meet and spend time with our PRO members. Rand Speaks on Title Tags at the 2007 SEOmoz PRO Training Event Scott (SEOmoz's lord of all things video) also worked with professional camera crews to film the 7 hours of training content and package into our video training series. It's been a hot item - over 200 copies have already been downloaded. This year, we're doing something very similar - hosting a PRO Training event at Seattle's University of Washington (the Fishery Sciences Building) geared towards more elite search marketers. Whereas the first seminar in our series was focused on beginner/intermediate level content, this one is geared towards experts. As we crafted the schedule and presentations, we assumed an exceptionally high level of knowledge, and that makes it not only fun for us (though certainly challenging), but we believe, extremely valuable to members who've already nailed down the basics. Yesterday around 12:00pm (noon) Pacific Time, we launched an announcement of the seminar to our PRO members via email. Out of 150 seats, we currently have 70 spots left (3 fewer than when I started typing this blog post - wow). I'd predict we'll be sold out before the week is over, so if you'd like to join us, I'd recommend making arrangements ASAP. Inevitably, the topic of timing is going to come up. Our PRO Training Seminar is scheduled on two of the days of SES San Jose. There are several reasons for this. First, we're running the two days before Gnomedex and have been working with Chris Pirillo and his crew to offer discounted Gnomedex attendance to PRO Training attendees. Second, I'm getting married in September, so pushing the seminar to the same time as last year wasn't possible. Third, and certainly not least, it was our intention to offer an alternative to San Jose. While that show is always very good, it's extremely expensive to attend, and much of the material is more focused to a beginner/intermediate audience. The Training Seminar is not like a major search conference (I'll use a table to illustrate): Major Search Conferences SEOmoz PRO Training Series ~$1800 to attend $499 for PRO Members 4 Days 1.5 Days Multiple Tracks, 100+ Speakers Single Track, 10 Speakers Varying Foci (discussion on whether tactics are OK, which are best, etc) Singular Focus on usable tactics with examples of how to implement Expo Hall with dozens of booths No expo hall Extensive press & blog coverage No press (and bloggers are asked not to share content) Large networking opportunities with thousands of industry folks Intimate networking environment with 150 attendees Opportunity to meet and chat with search engineers No search engine reps I certainly wouldn't be arrogant enough to suggest that our training is categorically better - it's a completely different experience. For many folks, San Jose will be the right choice, but for others, the PRO Training offers a unique option. You can check out the schedule & list of sessions here. It's definitely more expert-level than what you'll find at the major search conferences, but for those who are wondering - NO, it's not blackhat. The folks here at SEOmoz are very talented in white hat marketing & tactics, and this seminar is geared towards in-house SEOs and agency/consulting folks who want to learn strategies they can legitimately employ. Currently, the Training Series is limited to PRO members only. If you're not PRO, you can sign up for 6 months of membership and the seminar for $748 (still less than 1/2 the price of SES). I'd also suggest that if you're planning to come but are more of a beginner to the field of SEO, check out the video from the first seminar as well as the guides (free and PRO) in the articles section. If there are any questions about the seminar, please feel free to leave them in the comments below and I'll try to answer this evening. P.S. For those who are planning to attend, we'll send an email in the next week to everyone who registers with details on hotels, directions, etc. For now, I'd certainly suggest checking out flights to Seattle via Farecast or Kayak to help get the best pricing. Do make sure you stay the extra night at the end (Wednesday night), as we're throwing a big SEOmoz party (probably outdoors with BBQ of some kind) in the late afternoon. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The SEOmoz PRO Training Series Continues - Expert Seminar: August 19th & 20th in Seattle"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The SEOmoz PRO Training Series Continues - Expert Seminar: August 19th & 20th in Seattle"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}