{
  "url": "https://moz.com/blog/the-value-of-attending-conferences",
  "slug": "the-value-of-attending-conferences",
  "title": "The Value of Attending Conferences - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, Jane, Scott, Rebecca and myself (plus Mystery Guest) spent the week in New York attending the Search Engine Strategies conference. This is my 13th SES show, and at this point, I've seen virtually all of the sessions and 90% of the speakers twice. However, like many others, I continue to…",
  "content": "The Value of Attending Conferences SEO Events By: Rand Fishkin April 15, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 15, 2007 The Value of Attending Conferences SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, Jane, Scott, Rebecca and myself (plus Mystery Guest) spent the week in New York attending the Search Engine Strategies conference. This is my 13th SES show, and at this point, I've seen virtually all of the sessions and 90% of the speakers twice. However, like many others, I continue to participate beyond simply speaking - walking the show floors, attending sessions (though I missed most in NYC due to my tourism commitments with Mystery Guest) and hanging out in the speaker and press rooms. Going to SES isn't cheap - particularly in New York where hotel costs alone for the 3 SEOmoz rooms set us back more than $3,500. What value do I see in expending time and money to visit these cities and attend the shows? Community Building The late night parties, the quick chat in the hallway and the whispered commentary during a session all help to build shared experiences that are incredibly powerful. Once I've shared a few meals or a few jokes in several different cities with someone, we're fast friends. If they need me to answer some questions over email or I ask them for input with a post topic or article, we're quick to come to one another's aid. The search community thrives on these kinds of connections - they build business (through referrals and direct requests) and extend your reach. Meeting People There's no opportunity like a conference for interfacing with real people (and building real connections). Meeting face-to-face is far different than chatting over IM, through email, or even on the phone. Once you've met someone in person, it's much harder to ignore their emails, refuse their requests or decline a LinkedIn invitiation... which is why I'm hoping to meet Michael Arrington sometime in the near future. Securing Relationships As I commented above, if you meet a person several times in several different cities, you may as well have worked together. The bond that multiple conferences form is undeniable. The evidence is all around me - from folks who've seen me speak a few times, to those who've become fast friends and members/contributors to the blog. Speaking Probably the most directly monetizable business activityat a conference is speaking - provided you do a good job. My session on social media marketing was OK, but I felt really good about my linkbait presentation this time. I think it was one of my best, and certainly the dozens of email messages and more than 50 business cards I took home with me would indicate similar. New Experiences Even without the financial side, I think that conferences are a chance to have experiences you could never have at home - riding in a limo for no particular reason, spending an evening at a Manhattan penthouse, seeing great bands in small venues, getting beer frozen to your ear, making friends with people you could only dream of and eating and drinking the kinds of food and wine that would make royalty jealous. Sometimes the experiences are glamorous, other times you're freezing in the back of a dirty subway, but in every instance, you're exposed to new things and I think that life's grandest lesson may very well be that in the end, it's all about the stories you make and the memories you keep. Session Q+A Even if you've seen a session a dozen times, the Q+A section is unique each time. In New York, I found the crowd considerably more advanced than ever before, and the questions impressively deserving of attention. Hearing Dave Naylor or Andrew Goodman or Priyank Garg answer a great question is practically worth the admission price on its own, particularly for someone like me who can leverage this information directly in my job and my writing. The Secret Sauce The back alleys, bars, speaker rooms and restaurants at conferences are filled with talented people talking about their best techniques and darkest secrets (all professional, of course). While I'm not allowed to blog 99% of this stuff, it's extraordinarily valuable for re-application, testing and use in client and internal work. At SEOmoz, we've decided to carefully review the value of conference attendance. There's little doubt that it costs a lot of money (especially New York, which is the priciest of the bunch) to go, but this week all of us will be weighing the positive outcomes of our networking, attendance & social connections to determine what level of involvement we'll have for upcoming shows like Toronto, Miami, San Jose, Vegas & Chicago. What about you? How do you weigh cost vs. benefit for conferences? How many do you attend or do you plan to attend over the next 18-24 months? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Value of Attending Conferences"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Value of Attending Conferences"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}