{
  "url": "https://moz.com/blog/the-bizarre-economics-of-search-marketing-services",
  "slug": "the-bizarre-economics-of-search-marketing-services",
  "title": "The Bizarre Economics of Search Marketing Services - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Mystery Guest and I are in San Francisco for a couple days - we flew into San Jose actually and had lunch just off Sand Hill Road (I figured I'd show her where the VC \"magic\" happens) :) We've already got every meal and several coffee meetups booked, which happens when your last trip to the city is…",
  "content": "The Bizarre Economics of Search Marketing Services SEO Basics By: Rand Fishkin July 22, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 22, 2007 The Bizarre Economics of Search Marketing Services SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Mystery Guest and I are in the Bay Area for a couple days - we flew into San Jose actually and had lunch just off Sand Hill Road. (I figured I'd show her where the VC \"magic\" happens) :) We've already got every meal and several coffee meetups booked, which happens when your last trip to the city is cut short. Before we left, Mystery Guest felt the obligation to pick up some high caliber literature for the plane and I, too indulged, with a favorite old topic - economics. As folks who've read my various Internet profiles know, I dropped out of the University of Washington's School of Business two classes away from graduation to work full time on what was to become SEOmoz. My major was finance - a world that fascinated me initially, but eventually fell miles short of the passion I carry for all things web. However, to help reminisce, I grabbed a copy of Tim Harford's The Undercover Economist, and it got me thinking... Harford makes some excellent points in his book about the basics of economic theory - namely that, given the absence of abnormal regulation, corruption, or crime, inefficient industries in a free market primarily exist because of lack of information: buyers don't know what most sellers charge, sellers don't know what buyers will pay, there's no easy way to compare pricing, services, or quality. Of course, I couldn't help but think of our own infamous craft - search marketing. In fact, it's hard to imagine a business service with greater inefficiencies in the market. Some terrific vendors are charging $50/hour and making their clients a mint. Others charge $500/hour and provide nearly valueless services. Links are bought and sold with only a guess at the value they might create for search engines and traffic. Competitive analysis reports, site audits, and keyword research fluctuate from the hundreds of dollars to the tens of thousands of dollars and, many times, the difference in quality is almost nil. Why is the search marketing field such an inefficient industry? It's nearly impossible to compare vendors side by side Sourcing multiple vendors is incredibly challenging Press mentions and fame don't necessarily equate to quality Knowledge of how the industry operates and how to judge vendors is knowledge that's nearly as hard to come by as the search marketing techniques themselves Incorrect assumptions about the practice abound The engines themselves provide little to no guidance on the issue A neophyte has almost no chance of separating fact from fiction in claims of services, value, ROI, effectiveness, etc. Information about effective techniques (and even techniques that are accepted vs. frowned upon) take months or years to permeate through the consulting industry Reliance on references often leads to overpricing Obviously, the industry isn't broken; in fact, it's booming. But, I suspect that a large reason is that even inefficient, overpriced, poor advice, if it at least hits a few of the basics, has enough of a positive ROI at this point to make buyers lazy (and thus, many vendors lazy, too). After all, why bother to learn the proper ways to do SEO if doing a half-assed job still earns a better ROI than the last 50 print campaigns combined? Can it be fixed? Honestly, I'm not sure. I suspect that, much like other business consulting services, there may be years or even decades before any level of true efficiency establishes itself. After all, my understanding of TQM consulting is that it was nearly a monopoly, then became a den of carpet-baggers, before finally turning mainstream and reliable. BTW - Mr. Harford runs a column (and blog) where he answers questions about economics. I'm definitely going to ping him about this one. :) Hopefully, he'll answer my emails... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Bizarre Economics of Search Marketing Services"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Bizarre Economics of Search Marketing Services"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}