{
  "url": "https://moz.com/blog/the-state-of-content-marketing",
  "slug": "the-state-of-content-marketing",
  "title": "State of Content Marketing - SEOmoz MozCon Speakers Interview - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Many SEOs and Web Marketers just (re)discovered the importance of Content, maybe pushed by Google's Panda update and other various changes. Let's discover what the SEOmoz MozCon speakers have to say about the most important discipline in Web Marketing. And please, don't even try to use the \"Content…",
  "content": "The State of Content Marketing: An Interview With the Speakers of #MozCon SEO Events By: Gianluca Fiorelli July 24, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Gianluca Fiorelli July 24, 2012 The State of Content Marketing: An Interview With the Speakers of #MozCon SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This post wraps up the three-part post series that includes the \"The State of SEO\" and \"The State of Social Media\" multi-author interviews. Today, the MozCon speakers share their thoughts, beliefs, and suggestions about an old friend of any marketer that regained its fame over the past few months: Content Marketing. Out of all the disciplines that make up Web Marketing, Content Marketing is surely the oldest. It was an established discipline before the web as we know it was even invented. However, thanks to updates like Panda, it seems that SEOs have finally understood the importance of Content Marketing. As with any new idea, they can't stop talking about content of all kinds, from blogging, to video, to data visualization, to gamification, and more... While this renewed interest in Content Marketing is something I'm absolutely thrilled about, I fear that this craze might open the door for a superficial and not-critical approach to possibly the most difficult web marketing discipline of all: Content Marketing. Question: The first thing I am going to ask is more of a request than a question: may we all try to avoid using the “Content is King” phrase in this interview? Content is at the base of any potential web marketing success, but I consider that phrase chopped, overused, and – worst of all – misused. Content is essential, but that phrase is misleading as content without all the other web marketing disciplines may risk being just that: content. Content might be wonderful and relevant, but ignored without the correct marketing practices. Do you agree with this statement? What is your take? Peter Meyers: I’m honestly not a big fan of arguments over semantics. For every person that uses “content is king” too much, there’s a person wasting too much time complaining about the first person. Let’s just say that no smart SEO strategy in 2012 can fit on a bumper sticker. Paddy Moogan: I’d probably agree and it is something that sometimes gets forgotten. You can have the best content in the world but if no one sees it, then it is a bit pointless. This is where the argument of “build great content and you’ll attract links” fails. Sure this can happen, but for most of us that content needs promotion in order to get traction and succeed. So when people say content is important, yes it is, but for most sites promotion of this content is just as important. Richard Baxter: Content is just content. How it’s promoted is the strategy. I’ve seen bad content do well and great content do badly – because of strategy. That’s where “Content Marketing” comes in to play. Mike Pantoliano: I think you’re exactly right. I can’t stand \"content is king.\" If a blog post or presentation uses the phrase, or any other web marketing platitude for that matter, they’ve lost me. Cyrus Shepard: How about \"Content First?\" The worst job in the world is doing SEO for a site with crappy content or an inferior product. Conversely, when you have a great product, the marketing process becomes a joy. Too often, businesses want to market the hell out of something without making that something great. That’s why I say content first, then marketing. AJ Kohn: Content is hugely important, but it must be marketed. Too many think that they’re Kevin Costner. They believe that if they build it, people will come. Sadly, you’ll be waiting a very long time for traffic to line up if you take this approach. This is real life, not the movies. This is where SEO fits in perfectly. It’s our job to ensure that content gets in front of the right people. Great content makes that job a lot easier. Rhea Drysdale: There’s a word missing from your question — marketing. As in “content marketing” has had a surge of popularity in the past year. Skimming the next questions, it looks we’ll get to this, but my point is: yes I agree, we can’t separate good content from good marketing. When content takes off without marketing, it is an anomaly, not the standard by which all content should be measured. Mike King: First, Michael is King and there can only be one! Ok, now, that I’ve gotten that out of the way, I believe the reality of it is that most brands are not there yet for a variety of reasons. This is largely because remarkable content creation at scale needs to penetrate the general culture of a brand the same way that enterprise SEO only works if the whole team is onboard. Also, there is this issue of compliancy and way too many stakeholders needing to review things before content can go live. It’s a very challenging problem as content is obviously the glue to every channel. I certainly agree that content is not this “if you build it, they will come” situation. Don’t believe me? Look at the graveyard of failed infographics out there. Ian Lurie: If you use the phrase \"content is king\" in the post, I may start crying. The statement cheapens content into a crappy parlor trick, when it’s communication. Marketing, messaging, etc. don’t exist without content. King? Meh. Let’s just talk content :-). Question: Over the last 12 months, Content Marketing has been portrayed as a recent invention. I have never read so many posts written about content in one year, especially in the SEO blogs. I find this occurrence quite funny as Content Marketing has always existed, even before web marketing itself. Do you believe that this focus on content is a sign of maturity that has reached the SEO discipline, or it is because the only way to obtain lasting success both in Search and Social Media Marketing? Worse, is the recent focus on Content Marketing becoming another fashion trend in the SEO world? Peter Meyers: I’m not sure I’d use the word “maturity,” but I do think it’s a natural evolution. Look at analytics – we all chased hits, then page views, then unique page views, then conversion metrics, etc. Each time, the majority of people acted like the current obsession was something they knew all along, even though they still had tunnel vision and were really 3-4 years behind the people who really got it. People paying lip service to content marketing like it’s some brand new discovery don’t get it, and they don’t see the big picture. Paddy Moogan: I think the focus on content marketing has come about partly through necessity. Older SEO techniques that were quick and easy have slowly started to die off and not work as well as before. SEOs have started to realize that to win in the long term, you need to deserve to get links, and you can only deserve to get links by making something cool. Whether it is your product, service, a tool, or a piece of content. Richard Baxter: It’s easier to build links with good content. I think the industry, for the most part, has matured enough to recognize this. Better webpages (usually with a richer, more valuable content experience) tend to rank better now more than ever, with obvious credit given to the search engines for (finally) making this the case. The SEO industry is highly motivated to drive traffic and links and therefore, SEO’s are highly motivated towards learning and mastering the techniques that work. Mike Pantoliano: I think you said it. It’s a sign of maturity of the industry. Something needs to be created in order to get links, just as something needs to be created in order to get mindshare, market share, sales, coverage, tweets, etc. Cyrus Shepard: Not to be cynical, but the answer is simply many SEO ‘tricks’ like link networks and blog commenting have lost much of their effectiveness, and folks don’t know where else to turn. “Oh yeah, maybe we should actually create some content people want to share.” AJ Kohn: I’m not sure why content marketing has become the hot new buzzword. It’s certainly not new. Perhaps the animal rollercoaster ride (Panda and Penguin) has created an opportunity to bring content marketing to a wider audience. Publishing platforms like WordPress and Tumblr, among others, allow more people to produce content. The explosion of content is astounding. So it makes some sense that people would become more interested in content as a strategy. Finally, the Google tax continues to rise. All those small businesses that ignored the Internet for years, and then stubbornly used it while holding their collective noses, are now realizing what it can do for them. But they need alternatives to the rank-high-quick schemes. Rhea Drysdale: I give Google more credit for the growth of content marketing than anything intentional from the industry itself. When Google’s Panda update devalued cheap, spun content farms, everyone took note. If you do a search with Google Insights for “content marketing” you’ll see a massive surge from 2011-present. The industry will mature at the same speed of the major search engines. Jessica Bowman: I believe a lot of it has to do with many things: The infusion of new talent in the SEO space. Many early generation SEOs were not the creative types that come up with innovative, hilarious content we see today. They liked to work with the site, spoof the bots, test to see what worked, etc. They wanted to do as little as possible to get as much as possible, and in that SEO era, it worked! In the last five years, creative types joined the SEO space, bringing a different skillset to the SEO scene – voila, they brought immense creativity that SEO needed to maximize conversions and improve the brand, while simultaneously improving SEO rankings. Non-SEOs in the organization suddenly paying attention to what SEO is doing. In many organizations SEO was the red-headed stepchild, given little attention and free reign to do what was needed to boost rankings. We now have management on board and willing to invest in creative content. We are also starting to see Public Relations departments stepping in with ideas for content that will build the brand AND increase rankings. Mike King: Unfortunately, it's another sad reality. Content marketing is trendy right now and that’s why I decided to speak about how to get buy-in for content marketing at MozCon. There are so many ideas floating around about how everyone should be investing in content and how there are so many cool, agile brands creating remarkable content in this ideal world. However, content creation is a process that no one owns and everyone owns, and it’s incredibly hard to push through. At iAcquire, we’ve bet the farm on content marketing and it’s such a challenge to get a brand to let us place even high quality content on their sites. Brands typically think of their sites as a way to advertise and pull from users rather than a way to answer questions and entertain. Obviously a lot more are coming around and you have brands like Coca Cola, Red Bull, and Old Spice leading the change, but they are not the norm. The other issue is that a lot of times we are championing content as an overnight success done on a shoestring budget (for example, the Dollar Shave Club video), but then we find out that there was some large agency (in this case BBH) with the appropriate budget that pushed the content via a service like Sharethrough and it’s not the organic and viral success that we make it out to be. I don’t think we’re maturing in practice because much like link building a lot of that conversation just isn’t pragmatic at this point. Ian Lurie: I think a lot of really crappy marketers and SEOs suddenly have nowhere else to turn, actually. Sorry, does that sound bitter? For folks like me, who’ve been pushing strong content, strong messaging and smart outreach since, I dunno, 1998 or so, the ‘sudden rise’ of content as a marketing tactic is a little sad. If you’re suddenly talking content now, when you never did before, it means you probably did your clients a pretty serious disservice. Look at the leaders across all marketing disciplines and you’ll see folks who’ve been talking marketing for years or decades. Question: Before starting my career as a web marketer, I spent many years working in the television industry as Head of Programming. My main duty was to decide what movies, series, etc. we would broadcast and at what times. One of the classic disputes was – and still is – what content we needed to buy and produce. Should we follow what Nielsen was telling us was working, or should we emphasize our own opinions to be consistent with our vision and run the content that we wanted people watching. My team finally chose the latter to avoid a leveling in the quality of our programming. I see worrying signs of the same issue (but on a larger volume) in what content strategy businesses decide to follow. If people want infographics, they are given infographics; if people want posts just about two or three topics, let’s write just about those topics; and so on. It seems that the more I surf the Internet, the more I see the same content everywhere. Am I alone, or do you experience the same findings? If so, what should be at the base of a content strategy that a business should follow? Peter Meyers: It’s really tough because we’re content producers, and we’re surrounded by content producers, so when there’s a trend or meme, we see it pounded into the ground. We’re not the end-consumer in most cases. The industry naturally chases trends, and they wouldn’t do that if it didn’t work at all. Obviously there’s a lot of mediocre content out there, but it’s hard to say that chasing the trends is completely wrong. I think it depends a lot on your audience, and it’s a difficult balancing act. Richard Baxter: Every good search marketer needs to understand this and be able to innovate. Anyone who is marketing ever-so-slightly ahead of the game will be able to capitalize on the “seen it all before” fatigue you’ve just described. Mike Pantoliano: I don’t think we have to worry about the web being flooded with shit content. It already is! And yet, the best content still manages to bubble to the top. Consider the trash magazines at the supermarket near the checkout. Have you ever read the headlines? They’re essentially just clickbait blog posts. “10 ways to lose that belly fat for summer!” That will always exist. And for that reason, no one’s making any connections with the producers of that content. It’s transient. I wouldn’t call myself a content strategy expert, but since you asked, I’d tell any business to skip the clickbait lists and create something that is genuine and unique. AJ Kohn: Cookie cutter solutions and bandwagon strategies can be seen in almost any industry. I think it’s more obvious with content because it’s what’s in front of you everyday. There are always those who are willing to simply follow the advice of others blindly without thinking about whether it makes sense or if it’s right for them. So, yes, I’m rather tired of stitched together infographics. I find many of the headlines and formats for blog posts to be rather stale. I believe content should be authentic and tailored to your specific industry and vertical. A highly technical industry may not want infographics but instead want white papers. Videos might be a great match for one industry but lousy for another. Giving users what they’re asking for can be smart, but switching things up can keep users engaged. In the end, it’s the businesses that take risks on new topics or content types that wind up winning. Rhea Drysdale: It’s natural to want to write for your audience. Where I find the greatest issue is in the definition of that audience and our responsibility to them. Just because a certain audience likes kittens, it doesn’t mean your SEO blog should feature a daily kitten. We still have to write timely, relevant content that our community responds to. When it comes to the content strategy of a business, the business should start by identifying who they are (e.g. company values, brand, voice, etc). Then identify their audience (both customers and industry). Identify what your competitors are doing well and not so well. From there I feel like content will naturally fall into place. Jessica Bowman: This is definitely happening. When we define content strategies, we focus on understanding what everyone else is doing and how to differentiate and one-up the competing content, instead of keeping up with the Jones’. Instead of following the trends, focus on the target personas and what they would like to see, in the format they would like to see it. Instead of focusing on the content type that’s hot/trendy, focus on diversification – having infographics and 3 blog posts a week could be right for your business, but that is not likely the only thing you should be doing. Mike King: Well as an artist myself, I’m constantly conflicted with the same issue, but the thing you have to consider is businesses are generally very risk averse and if they do those risks have to be very calculated. Even those brands like Axe that take big risks in creating a video like this have to put those through a series of market tests to ensure it connects with its demographic. By the same token, we are generally locked into doing things that are proven to work. In fact, advertising generally tends to leverage the 7 story archetypes that are known to resonate with consumers when telling those stories. And that’s exactly it. Ultimately, brands need to be committed to telling a story and to that point SEOs need to learn how to sell a big idea and then weaving that thread throughout all of the strategic content that is created. Content should never be an isolated incident, it needs to be a part of a bigger story. Ian Lurie: I think online content strategies suffer from this a little less, because content is so much cheaper on the web. I don’t mean $50/article garbage – I mean really great stuff for $1000-2000. Compare that to the cost of a TV show or ad. It’s mind-boggling. Folks will always jump on the bandwagon – infographics are hot right now. Elf Yourself spawned all sorts of copies and derivatives. Something else will show up later. But that’s how a lot of this stuff evolves. So believe it or not, I think it’s OK, because online these trends happen much faster, and you don’t see folks getting mired in one kind of content (reality TV, anyone?). Question: One of the biggest misunderstandings I see is when people consider “content” a synonym for “written content,” while – in my opinion – everything on a website must be considered content. This includes: The design; The imaginery The videos the site presents Products and services Data visualization APIs and code (if justified) Written content (obviously) Even though there is no obligation to include the above factors in a Content Marketing strategy, small business this side of web marketing are sure to assume a central role, which means more investments and bigger budgets. As a consequence, many small businesses say they cannot fight against big brands. What would you says to businesses owners and marketers who complain about the costs of Content Marketing? Peter Meyers: Although I’m not sure I’d define “content” that broadly, I definitely agree with the concern. Too often, I’ll talk to a small business which is generating fluff to cover up the unfortunate fact that their product or service just isn’t very good. A bunch of words slapped on a page aren’t going to save you if you suck at what you do. Content is an extension of your core business and the value proposition of your product or service. Without that core, you’re building everything else on a very shaky foundation. Paddy Moogan: I’d argue that you can film a good quality video and take good photos on an iPhone. Sure it won’t be as good as a high quality camera, but some of the most popular videos on the web have been filmed on bad quality devices. It is the creativity that is harder to nail but fortunately, everyone has the ability to be creative, even if you don’t think of yourself as a creative person. Richard Baxter: For those people, I explain how SEOgadget was started – on a blog. It’s pure content that opened the opportunities for our growth over the past 2.5 years. Mike Pantoliano: Well, the first thing I’d do is tell them that they’re right. It’s a serious struggle. Then I’d tell them, “Hey, listen. Content is king.” Then I’d bill them. But seriously, I think the best strategy for a SMB is to focus on what makes them unique, target an audience, build something for that audience, make sure that audience knows about it, rinse, and repeat. Cyrus Shepard: In my opinion, content marketing delivers the highest, long-term ROI of any form of online marketing. I also reject the notion that you need a big budget to compete. You simply need something useful or entertaining to offer the world, and a unique presentation style – which may be as simple as your point of view. Every small business has someone on staff that’s an expert at something, even if it’s just in their local area. Finding ways to harness this expertise and get it into the world presents a long term, low-cost content marketing solution. AJ Kohn: What are the costs of not doing it? The fact of the matter is many small businesses fail because they suck at marketing. That’s true offline and online. Creating compelling and authentic content is an investment in your business that can pay long-term dividends. Those are assets. Why go to the trouble to invest in PPC and drive them to a brochure-ware site? Why start to have a social media presence if you’ve got nothing of your own to share? Rhea Drysdale: Any form of marketing should always be driven by both curiosity and business case. If something has a positive ROI, it’s easy to invest in it regardless of the budget. It’s much less easy to invest in intangible assets like brand and reputation, but these can often account for a massive percent of company’s value. With that in mind, do what you can. Determine the resources, timeframe, and budget you have and put together a strategy that fits within that. Putting together a few great pieces of content will matter more than quantity. Jessica Bowman: It’s the cost of doing business online in 2012 and beyond. If you cannot compete with the sites creating compelling, useful, authoritative content, then the business model needs to be assessed because it will not thrive online. I would also challenge a small business to assess where they are spending their marketing time/budget vs. where they are getting the leads. I would talk to them about creative means of getting great content on a shoestring budget – most companies just haven’t brainstormed enough low-cost content generation tactics. Mike King: I would simply say “I don’t want to work with you.” I sincerely would like to see more inbound marketers turning away business when the client does not want to build content. In fact, if your brand is not committed to telling a story and creating content that helps people, then you’re essentially obsolete. Stop complaining about brands. Be a brand. Content Marketing in 2012 is not optional, it’s a reality. Ian Lurie: Business owners complain about the cost of everything. I should know :-). I’ll steer clear of this question otherwise, because the best online content is a tiny fraction of the cost of traditional stuff, and saying it’s too expensive is a little ridiculous. Question: On the contrary, how would you tell big brands that web marketing (and Content Marketing as a part of it) is something that needs velocity and alertness, and that their bureaucracy may kill their web marketer’s (in house and agencies) efforts? AJ Kohn: This can be tough. You point to case upon case of a bigger brand getting beat by the agile upstart. The response is often, \"but we’re different.\" There’s a sense that it won’t happen to them. And, often, when they do realize that it is happening to them, well … it’s too late. Marketing innovation is accelerating and if you’re not keeping up you’re being left behind. Rhea Drysdale: I’d tell them that they need to develop a streamlined, enterprise-level content marketing strategy. That may sound ridiculously corporate, but roadblocks stem from fear — fear that a big brand will lose control because of a poorly timed or inflammatory piece of content. To combat this, establish clear expectations, brand guidelines, content policies, social media policies, approval flow chats for certain topics, response strategies, etc. With these in place it will be much easier to publish content even if it washes some of the originality from the process. Think in baby steps. Once content is being consistently added and promoted, it will be easier to demonstrate results. As trust is gained it will then be easier to push the boundaries. Jessica Bowman: They need to assess their marketing operations for 2012 online marketing needs. In sales “time kills all deals,\" when it comes to online marketing “time kills opportunities.” I would also challenge the in-house web marketers to learn how to work in the reality of the operational limitations. If it takes 3 months to get content approved and out the door, then keep pushing content through and the only lag you have is the first three months. Many in-house marketers are not consistent enough to keep a steady stream of content. When I was an in-house SEO at Enterprise Rent-A-Car, it took us 3 months to launch content changes. It was frustrating, but I was diligent about content planning and kept a steady stream of updates and over time we made efficiencies to address the SEO need for speed. Mike King: I’d tell those brands to look at Procter & Gamble, Unilever, Red Bull, Old Spice, and Coca-Cola. It’s very feasible for big brands to be agile and create content that tells that compelling story. Think about it huge brands invented that. If you recall, big brands are responsible for soap operas. Ian Lurie: You guys are in big trouble. Big brands have had a lot of chances to get moving – they’ve seen Amazon, Woot, Zappos, and others all start eating their lunch in a matter of years. I don’t see many big, traditional companies making smart moves, content-wise. Turf wars between marketing teams, branding teams and others seem to block progress at every turn. Question: I consider a good content strategy one that is able to “recycle” its content production in every possible online channel. It is in that “recyclable” content strategy that I see the secret of inbound marketing. Is this theory correct? If so, what is the process you follow? Peter Meyers: While it’s certainly smart to re-use bits and pieces of what you’ve built, I tend to think that the best content only fits in certain channels. What works for video or an infographic might make a lousy e-book or blog post, for example. I think the best content marketing is paired appropriately to its channel, and not all combinations work. Recycling may be cost-effective and a sound strategy at times, but you can definitely push it too far. Cyrus Shepard: Recycling is key, from large agencies to small businesses. you express your ideas and information through an infographic, you can also express it in an eBook, blog post, video, animated cartoon, song, and social media campaign. Every time you produce something on the web, ask yourself if you can release this same information through another channel. That’s high ROI marketing. AJ Kohn: Content that can be used in multiple ways is valuable. Give a presentation at a conference and you’ve also got yourself a handy SlideShare deck. Write an awesome how-to guide blog post and you can turn it into an eBook. Hold a Google+ Hangout On Air and then you’ve got a YouTube video as a result. Not everything has to fit into this multi-channel model but when you’re mapping out your content strategy you want to take an inventory and think creatively about how to get the most out of your assets. Jessica Bowman: We work with clients to create a content creation worksheet that forces them to think about all of the different ways a piece of content can be used, promoted, repurposed in their world. It contains the email to customers, tweets, Facebook likes, YouTube videos, blog posts, articles, presentations, and more. I know it works because when the SEOinhouse.com team uses it, we maximize potential, when we don’t use it, we leave opportunities on the table, every time. Mike King: Absolutely, always start from a content audit and see what can be repurposed and think of how to build any new content as a maximum viable product to make it hard to copy. Ian Lurie: Definitely! First, you have to define \"content\" as ideas, not writing or video or something else. Then you present those ideas as many ways as possible. Say I do a webinar. I’ll certainly record that and offer it as a screencast. And, if I used slides, I’ll annotate those and turn them into a Slideshare presentation. And, I’ll probably write a blog post to narrate the whole thing. Question: Let’s talk about specific Content Marketing tactics. What do you like and dislike? What are your best tips about: Blogging Video Marketing Images and Data Visualization Content and Social Content Curation Email Marketing Design and Coding Gamification Other tactics of your choice Peter Meyers: I think we all naturally gravitate toward the channels that fit our skill-set, so it can be really tough to compare and contrast. I don’t do much video work, because frankly, I’m not good at it. There are definitely times when I see the appeal and effectiveness, though. In general, I think diversity is important. Too many people bad-mouth email marketing as outdated, for example, but it’s still incredibly powerful, and maybe even more importantly, it’s Google-proof. If you build up a solid list of 10K+ subscribers that regularly read what you send them, it doesn’t matter what the algorithm does. That’s critical in 2012. I also think it’s important not to get carried away and try to fit every round peg into a square hole. The obvious example right now is infographics – people try to turn everything into an infographic, even when it’s not visual, just because they think that’s what’s hot. So, we end up with some real crap, because they’re picking the tool before they understand the job. Every channel has its place. Mike Pantoliano: Related to Data Visualization, my suggestion would be: interactivity. Let people play and experiment. Any good data viz should come accompanied with a writeup and/or press release detailing some of the industry stories the data tells. But some has to be left for the user to uncover themselves. AJ Kohn: My suggestions are these: Blogging: I love it. Do as much of it as you can. Quality over quantity and make it readable. Video Marketing: Get good at editing and pay close attention to retention rates. Images and Data Visualization: Please read something by Edward Tufte before you crank out your next infographic. Content and Social Content Curation: I’m a big proponent of curation. Pointing people to the best content in your industry is a great way to build trust and authority. Email Marketing: There are few things better than having access to someone’s inbox. Design and Coding: Don’t be afraid to break your site by futzing with the code! Think about usability and understand progressive enhancement. Gamification: Be very careful that you are incentivizing the right behaviors. Rhea Drysdale: I’ll keep this short—I like all of those. It depends on the business, but each could/does work wonderfully when implemented in an intelligent and timely fashion. The biggest tip I have is to simply keep things relevant. I hate seeing content placed on a site purely for social appeal even though it has absolutely nothing to do with the brand nor does it even attract their audience. You know who also hates it? Google. They want to see content that is relevant to a domain. Whatever tactic you choose, make sure it makes sense. If we don’t do this, I have a hard time believing that our industry has matured much, because we’re still looking for a shortcut. Jessica Bowman: Blogging is a good marketing tactic, but it’s often un-optimal. Make sure that you are saying something innovative and thought provoking, something that showcases your expertise. Far too often I visit a blog only to find run-of-the-mill content that does not make the company or blogger shine in the best light. It was content created for the sake of creating content (or content created fast). Think of every blog post as your stage at a conference – say something that would make someone say, “I need to work with that person!” Video marketing is very under-utilized. It’s tough to get buy-in for it and companies shy away from things that do not look professionally shot. The reality is that video is the future, and now is the time to test the waters, get experience, and make mistakes. You do not want to get started with video marketing in a few years – your early videos will look very amateur then! Mike King: Here are my suggestions: Blogging: Love it. I have no secrets here; just spend the time to write exhaustively on your topic with great design so everything you right is a definitive resource. Video Marketing; Love it. Use the TubeMogul OneLoad tool to distribute videos to all the video sites and also use a solution like Wistia to host it on your own site. Use your video sitemaps. Own the SERPS! Obviously this isn’t inbound marketing stuff, but considering using solutions like Sharethrough or TubeMogul to kick off shares and experiment with offline advertising with Google TV Ads, it’s cheaper than you think to get on TV. Images and Data Visualization: Love it, but tired of infographics there’s so many other ways to visualize data and get more contextual content around them to distribute the link equity. Thank me later. Content and Social Content Curation: Love it. It’s content marketing for lazy people. It’s a way to prove out content marketing at the price of a copywriter essentially. Start there if the brand says we can’t afford that. Email Marketing: Not crazy about it. Hubspot murders my inbox, but I understand that it is incredibly effective. I think it’s important to realize that flooding someone’s inbox is annoying regardless of what the data says. There needs to be a qualitative look at what we’re doing not just the numbers. Design and Coding: This is my favorite. I love to make beautiful things and focus on innovation. Challenge yourself to do just that. At iAcquire that’s exactly what we’re doing with the new tools I’ll be releasing at MozCon. I think as SEOs we need to think more about what we can do that’s not already out there and weave that into the big idea after you’ve sold in and proved out easier quick hits. Gamification: I’m a sucker for this too. I don’t have any tricks for it, but I get sucked in by it regularly. Events and Community: I think Jen made great points and they work so well in context of gamification. Simply build a community around brands so that your link building is just pressing the publish button. Ian Lurie: This one’s a bit big for me to tackle in one post. Most of what you’re describing above are channels, like games, video, e-mail etc. I think any channel, used wisely, can generate great results. The only tactic I do not like is “get content on the cheap.” That’s a mindset that eventually gets you buried in Panda update, penalized by a Penguin update, or drives away customers because you sound like a moron. Question: This last question is about mobile. We have discussed the importance of mobile for SEO and Social Media in the previous two interviews, but it is also important for Content Marketing. What are the challenges that mobile presents to Content Marketing, and what new approaches to content marketing do you see working? AJ Kohn: I think a lot is currently going on in terms of how content is presented versus the actual content. Mobile applications like Instagram, Foursquare, and even Google+ show the power of feeds and the priority on good visuals. Of course, the current challenge is simply ensuring that your content is optimized for multiple screens: desktop, phone, and tablet. I think at some point we’ll move beyond that to thinking about what kind of content might make sense for those in the mobile context. If they’re on the go do they have less time to devote to content? Are they interrupted more often? As such, should our content be shorter? Should it be even more scannable? It’ll certainly be interesting to find out. Rhea Drysdale: The greatest issue with mobile is finding the balance. How do we make content that is accessible, but not overwhelming? I love seeing apps like News.me or even Twitter’s new summary email that detail the stories that are relevant to me from my networks. LinkedIn is starting to do the same with their email campaigns tailored to my network. It’s much more engaging and will bring users into their sites. Personalization. That’s a big hurdle for content marketing, but one that’s being solved in interesting new ways. Mike King: Mobile and tablet devices are obviously the future. Essentially your portable device is the best way to eliminate the distance between what is happening on and offline. The future is to create content and interfaces that facilitate that. Mobile and tablet are going to revolutionize so many experiences. Think about how we all converse via hashtags during tv shows; now think about how TV networks could leverage that to build collective TV watching experiences and have brands build games relevant to the commercials being aired to keep people further engaged with the ad as it’s being broadcast. Whoever gets the jump on that will the next instant billionaire. In fact…I gotta go. Ian Lurie: I consider mobile a huge opportunity. Folks who are getting good at responsive design are going to rule this category. Folks who rely on apps will do OK. And people who continue to ignore it are going to see opportunities pass them by. I don’t, however, see it as a revolution. Mobile is another channel. The devices are revolutionary, insofar as they can deliver video, audio, photos, etc. from anywhere, and read them anywhere. But the channel is an incremental expansion of the internet. That doesn’t reduce the importance. It just means you don’t have to revamp your whole strategy to capitalize on mobile. Adjust a little, tweak your site to perform well on mobile devices, and you’re set. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The State of Content Marketing: An Interview With the Speakers of #MozCon"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The State of Content Marketing: An Interview With the Speakers of #MozCon"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gianluca Fiorelli\n          \n            Gianluca Fiorelli\n          \n            Gianluca Fiorelli"
}