{
  "url": "https://moz.com/blog/the-10-golden-rules-to-attracting-authority-links",
  "slug": "the-10-golden-rules-to-attracting-authority-links",
  "title": "The 10 Golden Rules to Attracting Authority Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In the world of link building, getting an authority link to your site/blog has been one of the most important aspects of growing your blog. Back in 2009 Page Level Link Metrics and Domain Level Authority Features accounted for over 46% of your pages own authority.",
  "content": "The 10 Golden Rules to Attracting Authority Links Link Building By: Neil Patel February 1, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Neil Patel February 1, 2012 The 10 Golden Rules to Attracting Authority Links Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In the world of link building, getting an authority link to your site/blog has been one of the most important aspects of growing your blog. Back in 2009 Page Level Link Metrics and Domain Level Authority Features accounted for over 46% of your pages own authority: In 2011, that percentage has dropped, but only by 4% [42.58%], suggesting that link building will continue to be a critical factor to your blog/website’s success. But we pretty much know that not just any link will do. The better the site the link is coming from, the better the link. That’s why your link-building campaigns need to be built around attracting authority links. But how do you do that? And what exactly is an authority link? Let me explain. Absolute and relative authority links explained There are two types of authorities. There are the absolute authority sites like Huffington Post, The Daily Beast and Google’s blog. These sites are also labeled “informational” authorities versus navigational authorities like DMOZ. On the other hand, you also have relative authority sites. These are sites run by bloggers or webmasters that are authorities in a niche. Bloggers like Robert Scoble, Dooce or Mashable are authorities in their markets. While the link juice they’ll give you if they link to you is not as high as what an absolute authority site could give you…they are definitely worth attracting. But how do you actually get a link from these sites? Here are the ten golden rules to attracting authority links. Rule 1: Write content that attracts Editorial In-content Links The most fundamental tactic of attracting authority links is to write content that is worth a link. What does this content look like? Cornerstone – this content fills an obvious gap in the web information world that you fill with expert advice, detailed posts and well-reasoned arguments. This content will also define you, so it’s important to establish up front what your blog/site is going to focus on. This is also a large portion of the content you share. Personal content – About a quarter or less of the content should contain personal stories about yourself that helps your readers to understand who you are and where you come from. My How Being a Patel Made Me Somewhat Successful is a great example. It stays within the cornerstone content of the site, but it gives you a peek into my personal life. Spicy content – This is a small fraction of your content and is made up of controversial posts you write about. Typically you attack a high-profile idea or person or explain why something popular is really dumb. These are for linkbait purposes typically, but generally also give your readers an idea of who you are. Building up a blog/site with this kind of content will take time, so you may not pick up a natural authority link out of the gate. Better yet, once you have a solid archive of content, approach these authority sites and ask for a link. Give them a good reason, which could be one of the following: You wrote about the author and now he might be interested in sharing with his circle the blog post that you published. You wrote a post that works well with a series that he wrote our compliments it. You could even critique something he or she did, which might spark an across-blog debate. If that sparks a firestorm of other responses…then you’ve won! Rule 2: Fix other people’s broken links Links die all the time. People shut down website or pull web pages. When these documents or sites vanish all the links pointing to them are dead. For example, if you work through a web page by a publisher who links out a lot and the page is a few years old, you are bound to find at least one or two dead links on that page. Work through the entire site and you could find dozens. Mashable is a good example of a site that links out a lot and will probably have a lot of dead links on older pages since they tend to report on startups that don’t always last. You can easily solve this in 2 ways: Manual - Make a list of all the dead links you find, then approach the author of those pages. It’s better if you focus on one author/one person and offer several options for content instead of having to contact different authors for each dead link. That can become an administrative nightmare. Link validator – Use a tool like the W3C’s Link Checker to find dead links on a website or blog. It’s pretty easy to do. Here are the steps I took to check Mashable. Drop link into sub form: Choose your options: Click “done” and then wait 644.47 seconds: You can then work your way through the status report: From that report you can build a list of dead links, the pages that need to replaced and the authors you can approach if it is a multi-author site like Mashable. Rule 3: Create a desirable image library If you have high-quality images on our site, you can use those images as an incentive to get people to link to you. Imagine you have a gallery of large, high-resolution pictures…well, then offer a contact form that allows a person to grab the file and linking code right there on the page. You don’t have to go all out like a photl.com: Or freepixels.com: But more like a Haw-lin: The last site specialize in photos, for you though being a content publisher looking for ranking juice, you could build a sub-domain devoted to photos like these. Here’s what you have to do, though. Hire a decent amateur photographer - If you are not a good photographer and to keep it inexpensive you could hire a local photographer who is good but not really good to charge outlandish fees. Use your phone - Now a days, however, most cameras on smart phones can take high-quality photos. It’s often the skill of taking a good picture…like having the right angle and light…that a decent photographer should know about. In any case, the better the photos, the more likely you will get interest in the images. And to help you benefit fully from this tactic, keep this in mind when building a library of images: The higher the quality of each image the better link building potential these photos will have. Search out affordable ways to take pictures. This could mean hiring a inexpensive photographer or buying a decent smart phone with a great camera. Each image should be posted on its own page. The delivery service should be as easy as possible. Test different set ups and use the one that makes adoption easy. Add images on a schedule, whether one a day or once a week. Rule 4: Offer to write a column or do a guest post Giving a publisher practical, highly-researched content as a guest post is a great way to get links to your site from him or her. Keep in mind this tactic typically be easier to pull off for those relative authority content sites than absolute authority sites due to their blogging policy. But if you have a guest posting strategy that involves focusing on building links, traffic and exposure via guest posting on a select few relative authority sites, you’ll eventually have an arsenal of content that you can pitch to the absolute authority sites. Some authority sites like Open Forum or Huffington Post have so much need for content that you can usually get a post on there. But you typically still have to provide a portfolio of posts so they can understand what level of writing you are at and not just someone off the street. Here are some resource to help you write, submit and get published guest posts: A Quick and Dirty Guide to Writing Your First Guest Post Neil Patel’s Guide to Writing Popular Blog Posts Write a Guest Post for I Will Teach You to Be Rich (while Ramit Sethi focuses on tips on how to write for his blog…they are valuable for any blog, really.) Why Submit Your Best Posts as Guest Posts? How to Land a Guest Post Without Fail: 21 Secret Tips Rule 5: Go to where your target audience hangs out As bloggers and people of the internet we often forget about all of the face-to-face connections that can provide us with valuable links from relative or absolute authority site publishers. For example, travel to conferences and hook up with some of the people you want to influence and convince to link to your site. Don’t be a pest to these people, but hang out, be cool to them, and then leave them alone for the rest of the events. You then need to go to the after-event event at the bar. This is where you can make things happen by simply buying them a drink or two. If you really want to take it to another level, offer to take them out for dinner and pick up the check. During that dinner suggest they link to you in some purposeful way…perhaps you offer to create an infographics or a beginner’s guide. But even if you don’t get some agreement like that you can say as you grab the check, “No, let me get this. You give me a link or something.” That way the person thinks, “A $50 dinner for a link? You got it.” Rule 6: Fill gaps in content As I mentioned above, when you are talking to content publishers, ask them what content they are missing…and offer to create it for them. It could be a video interview of Guy Kawaski or a periodic table of the fundamentals of link building. It could be an idea they’ve had for an ebook. Whatever it is, offer to create it for them. Once you create the content you will get the credit as a link back to your site. Make sure you offer content that you can create professionally and will attract people who are in your target audience. Creating a weight-loss calculator for a site when you are in real estate will drive traffic to your site…but it will be the wrong traffic. You might as well done nothing. Rule 7: Contact big media at the right time When you are trying to attract the attention of big media sites like CNN or The Economist, knowing when they publish their content is important. For those sites who are less tied to a content schedule, like a Drudge Report, you will not need to know when they publish their links because they do it pretty much as the story breaks. Still, having some kind of bead on when that time is will improve your chances. Here’s a guideline to follow: For many absolute authorities like the one I mentioned above, you can be certain that they will plan Monday’s content on Sunday. Around 6:30 am to 9:30 am, the media staff will put together a list of their top 15 stories for the day. This is the news list. Contacting them during this time is more likely to influence their decision even more than if you called or emailed them the day before. The next step for the media staff is to present the completed list of news stories to a team who will then decide which stories will get front page billing. This usually happens around 9:30 am to noon. This is your last chance to send anything. Do it now, because unless you have something spectacular, sending anything over after 1 pm will end up in the trash. And even if you do get coverage…it won’t be a lot and it probably won’t be a link. Late content entries are typically reduced to the show that doesn’t impact SEO at all. 8. Approach government or education sites A sure sign of an authority site is a .edu or .gov. This could be a link from a college like Harvard or Stanford or a link from the White House or Usability.gov. Getting those links are not always easy. One example is to look for ways you can register accounts with these institutions. For example, Harvard has The Harvard H20 Playlist Project. It’s simply a series of links to books, articles or content that hopes to spark content. Simply create a playlist and add a link to a useful post inside your site. Creating meaningful, researched content or break an interesting story and these sites might naturally attract these sites might link to you. Examples of content that you could write that might actually grab their attention include: Write a solid, thorough review about one of their programs, pulling in information from historical data sets, current events and future predictions. This will likely catch their eye. Sponsor a student event. This will not cost very much. Volunteer to be a guest speaker for graduates. Approach their business school and offer to be a case study. The kind of content you could create that would attract a government link could be: Create a community page/sub-domain on your site that supports some club or event in your city. Create content that supports some sort of charitable cause. Put on an event. Not only the .gov sites will approach you, but the local press will do so as well. Run for an office in your community. The commitment is usually low, so it’s not like you will be consumed with it. In some cases you will just have to approach these institutions. When you do, you are more likely to get an answer however, and a positive one at that, if you inspect their site, identify the content gaps and then offer to fill them. Again, it’s going to be important that you have something to show that you can pull off the content professionally, so don’t try this tactic until you have a good catalog of posts in your archives. 9. Buy links without penalty It’s no secret that buying links violates Google’s policy and the penalty can be very stiff. So you may be wonder why I’m suggesting you buy links. There are ways to buy links that will not be a violation of Google’s policy. Here are two: Donate to a charity – Depending on how much you donate, some organizations will display you name and donation amount on their sites. Offer to pay influential bloggers to post on your site – The content is simple. Give an authoritative blogger some kind of incentive like cash to write a post you can post on your site. In all likelihood they’ll link to it once it’s published. Fund research – Sometimes when you fund research projects people will link back to your website to show people who provided them with the funding. It’s their way of saying “thanks” and showing appreciation. As you can see these examples are based on an exchange of value between two people and their websites that can relate to the relevancy of content…so it’s an ethical way of buying links. Rule 10: Know the difference between a good and a bad site Finally, one of the most fundamental rules to link building is knowing the difference between a good website and a bad one. This might sound obvious but it’s sometimes easy to get tricked into asking a site that looks like an authority but is in reality spammy. What are the elements that determine if a website is a bad one? Here are five ways: Negative PPC – If you come across a site that has SEO links based on pills, casinos or porn, then it’s not a good site to get a link from. Link overload – Also avoid sites that have a high link-to-content ratio. Anything above 20% links to 80% content is probably too high. Keyword stuffing – Some sites that rank high in search engines will be notorious for keyword stuff. You’re first clue is the title description. If it looks like someone treated it like a keyword meta tag, they are probably employing spam techniques elsewhere, too. Perhaps it’s in the footer, behind images or in the source code.: Ad overload – These sites will be like a sore thumb when it comes to the number of ads they have. They’ll have ads down both sidebars, above the header and multiple times throughout the content. Poor content - Another clue this is not a great site is the low content-to-ad ratio. This one can be tricky because even absolute authority sites can push the limits when it comes to displaying ads. Look at Marketing Pilgrim, for example: Ads easily dominate 2/3 of the real estate. But it’s a legitimate website with pretty good content. If that’s the case, then evaluate the copy. Is it well written, heavily researched and specific? Is there an author attached to it? Is there a convincing author bio page? These are all elements you need to look at to determine whether you should write a guest post for them or not. Poor design – Does the site look like they used a free theme? Are the fonts irregular in size or shape? These are usually signs that someone has not spent anyone on the site…which is a signal they could be spammers. Conclusion Trust me when I say that you will not be wasting your time if you invest it in attracting authority links to your website or blog. Remember: nearly half of what determines the rank of your site is based upon the types of links driving to your site. Hopefully this guide has given you the tips and the tools necessary to help you succeed. About the author: Neil Patel is the co-founder of KISSmetrics, an analytics provider that helps companies make better business decisions. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The 10 Golden Rules to Attracting Authority Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The 10 Golden Rules to Attracting Authority Links"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Neil Patel\n          \n            Neil Patel\n          \n            Neil Patel"
}