{
  "url": "https://moz.com/blog/the-dark-side-of-wikipedia",
  "slug": "the-dark-side-of-wikipedia",
  "title": "The Dark Side of Wikipedia - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Biased manipulation runs wild on Wikipedia and the extent to which it influences the pages of that site will probably never be known. In the field of SEO, where every link counts, Wikipedia's reference links at the bottom of articles and their external links in the body text of articles was once…",
  "content": "The Dark Side of Wikipedia Blogging By: Rand Fishkin November 20, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 20, 2007 The Dark Side of Wikipedia Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Biased manipulation runs wild on Wikipedia, and the extent to which it influences the pages of that site will probably never be known. In the field of SEO, where every link counts, Wikipedia's reference links at the bottom of articles and their external links in the body text of articles were once considered search engine ranking gold. Early this year, Wikipedia moved to institute nofollow on all outbound links, and many presumed the controversy would die there. It hasn't. I think the best way I can illustrate this massive problem is to attack the most common questions that come up around Wiki-hacking (yes, I'm inventing a moniker so I don't have to say \"editing Wikipedia from a biased perspective in inaccurate, misleading or mis-representational ways\" every time). Those who frequent Wikipedia would probably consider these edits to be \"vandalism,\" but that's a very inaccurate representation of the actions that are actually happening. Vandalism refers to intentional destruction or damage of property - in the offline world, think graffiti or bricks through a window. These Wikipedia edits are, primarily, intended never to be detected by other Wikipedia editors or the outside world - a better analogy might be the subtle manipulation of a news report to slant in favor of a political party or candidate. Some major questions and issues: Why Edit Wikipedia Pages if There's No Link Juice? Reputation Management - if Wikipedia has bad things to say about a topic, there will almost certainly be someone who wishes to see that information removed. Link Traffic - Wikipedia articles, due to their phenomenal overrepresentation in search engines, can drive a remarkable amount of traffic, so many wiki-hacks are simply attempts to boost click-throughs Promotion - If you were a cellphone company, you might seriously consider editing the Wiki article on cellphone retailers, possibly adding a link to a list of \"highest rated\" stores by consumers according to a bogus study you host on your site (or another site) and then copying that list in short-format on the Wikipedia entry. Other promotional tactics are less obvious, but often more difficult to identify. And, yes, that story is a modified version of a true instance of Wiki-promotion. To Spite - If your competitor is ranking ahead of you on Google, or kicking you around in sales, you might find that Wikipedia is an excellent place to create a page on their company and detail the long list of terrible misdeeds they've committed. What's great (or horrible) about this practice is that generally, they'll be the ones who later come in and look like spammers for erasing the content or trying to have it removed, which actually helps to bolster the veracity of information in the eyes of other editors or administrators. It's a dirty but highly effective tactic to leverage against an opponent. I've even heard a story about using this technique for blackmailing the company referenced in the negative article, and pretending to \"switch sides\" in the editorial debate on the talk page once the money had been paid (it's DMOZ all over again!). For Link Juice - Wait, I thought there was no link juice on Wikipedia... Well, not directly. But, Wikipedia is such a reference resource that if your site earns links on popular pages, you'll find that those links find their way into forums, blog posts, articles, and journalistic publications more often than not. This is probably one of the most clever ways to use Wikipedia, because you'll need to link to something worthy of being spread, anyway, which probably means that even a heavy-handed Wiki-editor won't remove it, as it's typically relevant enough and interesting enough to belong there. One might even argue that this isn't Wiki-Hacking at all (perhaps it's the linkbait of Wikipedia?). To Earn Credit - The Wikipedia hierarchy rewards frequent, positive edits, and for many Wiki-hackers this is a great way to build up a solid, respectable-looking profile and potentially even be rewarded with administrator status. Wiki-Jacking - Since I've written about this topic previously, I won't cover it again in-depth. How Do Malicious Edits Happen? Anonymously - As of now, users can still make edits anonymously without logging in. Granted, Wikipedia will record your IP address, but you don't have to provide any personal information (not even fake stuff). Through Proxies - When one anonymous account just won't do, or you don't want the anonymous account to have any connection to your other account(s), using a proxy IP address lets you connect through to Wikipedia largely undetected (so long as the proxy provides solid anonymity). Through Trusted Accounts - For the more experienced Wiki-Hackers, a trusted account is a must have. Trusted accounts that make dozens of edits each day are much less likely to be accused of manipulation or have their content modified by another editor, even if complaints arise. Via Multiple Accounts with History - The savviest of Wiki-Hackers I've talked to runs more than a dozen unique, trusted accounts with positive history, and can use these What are Some of the Best/Worst Stories I've Heard? The Sock Puppet Betrayer - This is second-hand, so the details might be fuzzy, but the basic approach was sheer genius. Basically, this Wiki-Hacker created several accounts on different IPs, then vandalized a number of pages, mostly small and under-the-radar, appearing to look like a competitor (adding links, references, promotional content, etc). He then \"investigated\" these pages through his trusted account, \"found\" the \"spammers,\" removed their content, and was praised by some other community editors. Later, he used the newfound trust to create subtle, but effective references for his own client. The Account Buyer - Supposedly, this fellow has been tracking down Wikipedia editors and offering to buy their account user names and passwords for the \"trust\" they've earned. According to him, he's only got 4 so far, but these have all been used effectively to help create and then \"back up\" favorable changes to a number of pages in a specific vertical. The Talker - One of the smartest Wiki-Hackers, in my opinion, is barely an editor of content at all, but simply uses a well-liked editorial account on Talk Pages, helping to sway the discussion in favor of keeping/removing links & content. On rare occasion, rather than actually making changes, the Talker will simply suggest that certain edits be made, then use a secondary or anonymous account to complete them if there's no pushback. The Bad Mouther - This particular Wiki Hacker got caught by another editor and in order to save himself, dug through every edit his accuser had ever made, and ended up being able to keep not only his account, but his edits by making it appear that the accuser was actually an \"SEO,\" whose perspective and judgment were biased. Why Don't Administrators Stop this Behavior? They do, actually. You can see this popular project page called WikiProject Spam, where a \"spamstar of glory\" (yes, seriously) is awarded for stopping spammers on Wikipedia. A fairly immense to-do list exists on this page, and it's actually one of the Wiki-Hackers' most feared pages. Unfortunately, it's also a tool - Wiki-Hackers who want information removed or who want to build up the \"trust\" of their own accounts will actually become spam investigators and reporters. One of the best ways to reach administrator level is actually to catch some of the \"trusted\" accounts that are actually other Wiki-Hackers, and thus the community of Wiki-Hackers is not on particularly good terms with one another. Turning in other hackers puts you above suspicion in a way that few other actions on Wikipedia can, and thus, it's one of the holy grails of the infiltrator-style hackers. How do You Know All This, Rand? Two ways, really. First, I've played around first-hand with some of the pages with Wikipedia. In fact, prior to the \"nofollow\" implementation on links, I personally had a few editorial accounts through proxy IP addresses, though I probably haven't actively edited Wikipedia pages in the last 9 months. Instead, I've been connecting over email and in-person with a lot of folks who run reputation management and link building campaigns that do leverage Wikipedia. The number of stories, depth of detail, and actual examples (which I obviously can't share without betraying a lot of trust), including the stories I've recounted above, paint a fairly dark picture of what's actually happening at Wikipedia. Granted, because of my profession, I'm almost certainly getting an overrepresentation of the more manipulative aspects of what happens on Wikipedia. It's only natural. While lots of experienced Wiki-Hackers love to share their favorite stories of manipulating the site, very few of the truly quality editors are A) ever going to meet me at a party or go get some drinks with me at a conference bar, or B) boast about the terrific article they created about 70s-style tube socks as fashion accessories. Please do note that the specific stories I've recounted above have had details removed or even slightly modified to keep the identities of my sources anonymous. A couple, as I noted, are second-hand, as well, so I'm guessing some details may be missing. However, even with the details missing, you can still get a sense of the tactics for manipulation and the extent to which people are willing to go to in order to change Wikipedia in their favor. One Quick Example from the Site This comes from two friends at Wikipedia who really are legitimate editors and spam fighters, Jon Hochman (one of the foremost authorities on Wikipedia & SEO) and Durova (who spoke at SMX Social in October and had this terrificly informative interview over chat with Jim Hedger). From Durova's Talk Page Archives: I just spent 50 minutes playing cat and mouse with a vandal, and WP:AIV still hasn't acted on my block request. I guess its time to ask for the tools. What do you think? Jehochman (talk/contrib) 04:45, 14 May 2007 (UTC) Done, 24 hour block. Sometimes it feels good to have the tools. Thanks for the heads up. Cheers, DurovaCharge! 04:48, 14 May 2007 (UTC) This one is using proxies. He's over here now: 142.179.62.0 (talk · contribs · deleted contribs · logs · block user · block log) Jehochman (talk/contrib) 04:53, 14 May 2007 (UTC)I think we are dealing with a black hat SEO who may be using some sort of script. I see a pattern in the edits. My suspicion is that they want one specific reference gone, and are attacking all of them to create confusion. Can we semi-protect the targeted articles, starting with Traffic Power? Jehochman (talk/contrib) 05:04, 14 May 2007 (UTC) Am I caught up on the blocks? Keep me apprised; I'm working on a complex investigation with another editor atm. DurovaCharge! 05:05, 14 May 2007 (UTC) Semi-protecting. Give me the full list. DurovaCharge! 05:07, 14 May 2007 (UTC)Blocks are good. Here are the targeted articles. I think he'll be back soon. Jehochman (talk/contrib) 05:11, 14 May 2007 (UTC) Obviously, this example above is a very amateur attempt, and Jon & Durova are all over it. Professional-level Wiki-Hacking is much more difficult to rat out. The most frustrating part for Wikipedians has to be that they themselves receive no financial reward for their efforts, yet their opposition, the Wiki-Hackers, benefit monetarily and directly when they have success penetrating the spam police. Do all of these Wiki-Wars Really Matter? The most accurate answer is probably \"it depends.\" It's very hard to gauge how much the public trusts information on Wikipedia. My gut tells me that, sadly, a lot of people simply accept whatever Wikipedia says without checking real sources of information (yes, I'm saying that Wikipedia by its very nature is untrustworthy, even if 95%+ of the information there is factual, which is probably a big stretch). However, I can say with some certainty that businesses and individuals get a great deal of value and suffer a great deal of loss when Wikipedia contains positive/negative information about them (very similar to Google or other search engines). Thus, a secondary \"black\" market will always exist to exploit the site and attempt to change information. Even if Wikipedia went into immediate lockdown mode, there would be auctions for trusted editorial accounts, devious manipulation, and, probably, an even higher price on all of the Wiki-Hacking style activities. There's no real solution to the cat-and-mouse game, unless Jimbo wants to turn Wikipedia into some sort of Mahalo-like resource, where only those invited can edit (and even then, I'm guessing it will just mean higher prices, not an end to hacking). p.s. Yes, the nofollows on all links to Wikipedia are intentionally \"nofollowed.\" Someone should create a blog plug-in to auto-nofollow Wikipedia links so the site stops ranking atop every query in existence. p.p.s. None of the content in this post is intended to suggest that I don't respect the project, its aims, or the lofty aspirations of many of the hardworking people trying to make it a good resource. In fact, I believe quite the opposite - that folks like Durova, in particular, and others like here have a noble, self-sacrificing streak that's both rare and praise-worthy. But, depending on your view of Wikipedia and black/gray hat social media practices as a whole, you might find some of her opponents equally admirable, or at least, impressively creative. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Dark Side of Wikipedia"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Dark Side of Wikipedia"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}