{
  "url": "https://moz.com/blog/the-basics-of-local-seo-whiteboard-friday",
  "slug": "the-basics-of-local-seo-whiteboard-friday",
  "title": "The Basics of Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Howdy mozfans! This week's Whiteboard Friday features the return of Danny Dover, our lead SEO here at SEOmoz. He's going to be discussing the basics of local SEO, a rapidly developing, important niche in SEO land that involves a complex amalgamation of many data sources and metrics. Hey, sounds a…",
  "content": "The Basics of Local SEO Whiteboard Friday By: Aaron Wheeler November 4, 2010 Table of Contents Copied! By: Aaron Wheeler November 4, 2010 The Basics of Local SEO Whiteboard Friday Howdy mozfans! This week's Whiteboard Friday features the return of Danny Dover, our lead SEO here at SEOmoz. He's going to be discussing the basics of local SEO, a rapidly developing, important niche in SEO land that involves a complex amalgamation of many data sources and metrics. Hey, sounds a lot like the regular SEO we know and love! Take a look at what's on Danny's whiteboard here below the video. Danny's Whiteboard: SEO Local: Behind the Scenes: Most important: accessibility and content Second most important: keyword research and targeting Third most important: links Fourth most important: social SEO Local-Specific Features/Considerations Search engine page Local directory submissions Yahoo Local Yelp Citysearch Urbanspoon Trip Advisor Judysbook Insider Pages Niche Data Sources Links Addresses Categories Reviews Other Metrics Worth Considering Title (Business Name) Photos SocialVideo Transcription Hello, everybody. My name is Danny Dover. I work here at SEOmoz doing SEO. For today's Whiteboard Friday, I'm going to tell you about the basics of local search. So, if you've been paying attention to this, you'll notice that there was a big update with this recently. The local search experts that I talked to said this is a tectonic shift, to give you kind of some context. So, let me go over that. First thing is local, behind the scenes. What is going on and what exactly changed? The biggest thing that I see here is visual layouts. If you're looking on a SERP instead of seeing the seven box that we used to see, which was a map with seven different items next to it, we're now seeing the local searches integrated into a normal SERP. The big difference here is, from what we hear from Google, that they have combined their main algorithm with the local algorithm. Where it used to be completely separate, they are now integrated. I don't exactly know what they mean by that per se. An algorithm is a big set of equations. It seems to me that the way that it used to be set up they'd have to be interacting with each other somehow. Apparently that's not the case, but it does make doing local SEO easier in theory. We haven't had enough time to test it out yet, but what it looks like from a preliminary view is that factors that have been useful for traditional SEO are now more useful for local SEO, which is a win. It means that if you are optimizing your website that you're doing well in the local verticals and you're also doing well in the universal search. It's a win/win for business owners and a win/win for webmasters. So it's something I like to see. The other thing that we heard is that now Google is saying that over 20% of searches contain some sort of reference to locality, be it a city, state, or country, something like that. That is a big deal. It means that this is growing. It makes a lot of sense. We see the mobile spaces growing and there's GPS data there and there are also people searching \"restaurant Seattle\" or \"museum Seattle\", that kind of thing. We're seeing that a lot more, and it's growing. By taking advantage of the other things I am going to say, you can get more benefit from local. So, let's talk local specific, right. Well, before I do that actually, let me back up to what are the things that you need to focus on for all of SEO, and then right after that I'll get to local specific. Things for all of SEO, this will go for your website if you're trying to do image search or if you're trying to do video search or if you're trying to do local search, for all SEO is the SEO in pyramids. I've talked about this before and I'll link to it in the post below. What we're looking for here is at the top in a very small degree is social. I don't think at this point that local search is really dependent on social. By social, I mean things like Facebook and Twitter and blogs, all of that kind of thing that you traditionally think of as social. I don't think that's affecting local yet, but it's certainly affecting other verticals and specifically universal search, which is just normal search that you think of. Underneath that is links. Links is absolutely affecting local. Who is linking to you, how popular are they, what does the anchor text in links say, all those factors are extremely important for all of the verticals. Underneath that is keyword research and targeting. What keywords are you trying to target? Is it the name of your business or is it the name of an item on your menu if you're a restaurant? What is it you are trying to search for, and more importantly are people actually searching for it? You can be the highest targeted, the most well optimized result for a phrase, but if no one is searching for it, you're not going to get any traffic. Below that is accessibility and content. Are the search engines able to access your web page and is the content relevant? Is it content that people would actually try to find? The entire reason that people go to Google, Bing, or Yahoo is to find content, find some kind of answer to a question they have. The most important part of SEO is content. You'll hear that over and over again. Let me talk local specific for just a second here. Under local specific you have your search engine page. In Google this is your Places page, in Yahoo it's Yahoo Local, and in Bing it's Bing Local. What this is, is a page from the search engines about a specific business. This is great for business owners if they don't want to have to have their own web page. It's also great for us as SEOs because it makes it a streamline process for optimizing a business online. Google Places you can get a little bit of analytics, although they're, to be quite honest, they're a little bit mediocre. You can also get photos up on your thing and you can aggregate reviews. These search engine pages, the single most important thing you can do for local is creating this local page for your business. Number two is local directory submissions. Let me be very clear with this. I am not recommending traditional directory submission. So, do not just go out to FreeLinks.com, or whatever the website might be (I just made that up) and post links there. That's not what I'm talking about. Instead, I am talking about these well established data sources for local businesses. You have things over here, these are the ones I've seen affecting the new algorithm. Yahoo Local, I am seeing that everywhere when I did a review of it. It looks like other people I've talked to that they are also seeing this, too. So, Yahoo Local, there's some kind of partnership between Yahoo and Google there as far as getting data. Underneath that, Yelp, and after Yahoo Local these aren't really in any particular order. But Yelp is a traditional business thing, and I've seen that show up in Google results for local. Citysearch, Urbanspoon, TripAdvisor, Judy's Book, Insider Pages, and then I'm also seeing a bunch of niche data sources. So, if the search is about schools, you'll find school-specific data sources. So whereas these ones above kind of cover all businesses or at least most of them, there's also these niche ones. The best way to find that is search for your competitors, look at their Places page if it's on Google, and see where they're getting their data from. It's probably going to be some kind of niche thing in addition to the big ones you see here. Underneath that is links. So, I am actually bringing up links twice. I'm bringing it up here and I brought it up in the SEO pyramid. I did that on purpose because links are extremely important. Links, if they're going to your web page or they're going to the Places page it makes a little less of a difference, but specifically to your web page. Google sees links as a vote of popularity. If someone is linking to you, they're vouching for you. Google sees that as a trust metric and as a relevancy metric. They need that in order to want to rank you highly. Links, again. Underneath that is address. If we're talking local search, address makes a lot of sense. If it is preschools in Issaquah, you better have your address be in Issaquah or one of the surrounding neighborhoods at least. Categories is the next one. Google and I know that Yahoo does it and I think Bing does it as well, gives you the option of listing categories associated with your business, be it spa or a manicure. You can actually go through and Google it, I think it is about four or five you can list, and the other ones vary. It is important to go through there and give Google a very clear sense of what your business does. Last in this thing is reviews. This one is, I probably think is more for human readers than it is for the search engine metrics, but this is the way that you can get click throughs. If you're result is listed, the amount of reviews and what people are saying within them. If they're positive, that's probably what you're looking for. Those can help you a lot both in click through and then to a degree in the algorithm as well. The last section I have here is other metrics worth considering. These ones are not as important or well defined as the ones that I mentioned before, but they're ones that you need to consider going forward. The title of the business. Again, if it is Issaquah Preschool, my mom's preschool is names Giggly Wiggly Preschool. Having the addition of the word preschool within there is probably, probably useful, but I cannot say that for 100% fact. Categories would probably be more important than this. The next thing is photos. In Google Places they give you the option of uploading photos. They'll show these if someone goes to your Places page. Again, it's for humans, but it also may be affecting the metrics. It shows Google that, like, \"Hey, this is a serious business. I've taken the time to upload these photos.\" This is kind of a metric of trust to a degree. Underneath that is social. This one, I don't think is here yet for local, but it is certainly something that will happen in the future. We're seeing the Internet kind of shift that way. Social being the social sites, Facebook, Diggs, Twitters, all of those kinds of things. Twitters. Wow. I just sounded like my mom. I brought up the preschool thing, and it was just all downhill from there. Oh boy. So, social, it's not affecting local yet as far as I can tell, but I think it's going to be important going forward. Google is trying to optimize search results for humans, and social is all about humans. It's people talking to people and making real recommendations based on experiences. It's something that Google's invested a lot of money into already and Bing as well. It is something I fully expect to continue to grow. That's all the time I've got today. I appreciate you guys listening. I will see you next week. Thanks. Bye. Video transcription by SpeechPad.com Follow Danny on Twitter! Even more to your benefit, follow SEOmoz! You know what? Why don'tcha follow me too: Aaron Wheeler. If you have any tips or tricks that you've learned along the way, we'd love to hear about it in the comments below. Post your comment and be heard! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Basics of Local SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Basics of Local SEO"
    },
    {
      "level": "H2",
      "text": "Danny's Whiteboard:"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Follow \r\n\tDanny on Twitter! Even more to your benefit, follow SEOmoz! You know what? Why don'tcha follow me too: Aaron Wheeler."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler"
}