{
  "url": "https://moz.com/blog/the-top-10-dumbest-site-design-practices-shooting-yourself-in-the-foot",
  "slug": "the-top-10-dumbest-site-design-practices-shooting-yourself-in-the-foot",
  "title": "Shooting Yourself In the Foot: The Top 10 Dumbest Site Design Practices - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "  Despite some of the posts on SEOmoz, site optimization is NOT a science. Science requires accurate, contestable data. No metrics or analytics deliver empirical data so it ain’t no science. SEO pros don’t even agree on which weighting factors have the most impact on PR and TR.  However, it doesn’t…",
  "content": "Shooting Yourself In the Foot: The Top 10 Dumbest Site Design Practices On-page SEO By: Paul Lalley May 19, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Paul Lalley May 19, 2008 Shooting Yourself In the Foot: The Top 10 Dumbest Site Design Practices On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Despite some of the posts on SEOmoz, site optimization is NOT a science. Science requires accurate, contestable data. No metrics or analytics deliver empirical data, so it ain’t no science. SEO pros don’t even agree on which weighting factors have the most impact on PR and TR. However, it doesn’t take rock solid numbers to identify dumb design decisions – decisions that prevent access, make buying difficult, and make site navigation a wonderland of surprises. Thus, I offer the 10 Dumbest Design Practices (IMHO, of course). 10. Flyouts or drop down menus that cover site text. Umm, yes, I want to navigate to that page, but that flyout covers home page content that I want to read. Dumber still? No way to close the flyout. Duh. 9. Limited payment gateways. DIY site owners happily launch with PayPal as their only payment gateway. A lot of buyers have never even heard of PayPal -- they don’t have an account and they’re not going to the trouble to open one. The more payment gateways, the more orders you’ll receive. Get a merchant account. 8. Spamglish. Yep, it’s still out there on critical pages that, ostensibly, are designed for humans. Keyword density as a factor in PR and TR is losing significance, so why stuff pages with keywords? 7. Critical site information in graphics. Bots can’t read graphics, so important indexing data may be lost if it's tucked in a bitmap somewhere. 6. No telephone number. This one is a poser. As a site owner, you went to a great deal of trouble, time, and money to get that visitor on your site. Wouldn’t it be great to have a telephone number (toll free) so visitors could call with questions or, better yet, orders? 5. Ambiguous navigation. The assumption, here, is that site visitors know what a link labeled “Damsels” means – kinda like those rest room signs in theme restaurants, e.g., “Buoys and Gulls.” 4. No site map. Come on, you guys. You can buy a site map generator for less than $100. And, in creating this link map, you help visitors and bots find their ways around. 3. Dated, duplicate content. We’ve all encountered the entrepreneur who wants a low-ball site populated with public domain and syndicated content...and 1,200 affiliate links. The site is dated the day it launches. 2. The long-form sales letter. I’m sure Dan Kennedy meant no harm, but these endless pages of mixed type faces, heaps of hype, and the never ending (literally) PS, PPS, and PPPS bonuses are insulting to the intelligence of a chimp. 1. Home page opt ins. Are you nuts? I don’t even know what I’m opting for (or against). If I have to give you my email address knowing that you’re going to backsell me to the grave, I want to know what I’m getting. Why place this HUGE stumbling block on page uno? I’m bouncing. webwordslinger.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Shooting Yourself In the Foot: The Top 10 Dumbest Site Design Practices"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Shooting Yourself In the Foot: The Top 10 Dumbest Site Design Practices"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paul Lalley\n          \n            Paul Lalley\n          \n            Paul Lalley"
}