{
  "url": "https://moz.com/blog/the-write-way-to-optimise-your-website",
  "slug": "the-write-way-to-optimise-your-website",
  "title": "The 'Write' Way to Optimise Your Website - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey true believers, this is my first SEOMoz article so be kind! The thrust of the article is to help people new to SEO concentrate on the important areas rather than getting bogged down with the all the advanced information out there. \n\nThis post was inspired by a quote from the profile of Rebecca…",
  "content": "The 'Write' Way to Optimise Your Website Content Marketing By: Marcus Miller June 22, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Marcus Miller June 22, 2011 The 'Write' Way to Optimise Your Website Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Hey true believers, this is my first SEOMoz article so be kind! The thrust of the article is to help people new to SEO concentrate on the important areas rather than getting bogged down with the all the advanced information out there. This post was inspired by a quote from the profile of Rebecca the #1 user here on SEOMoz.org: \"I like writing. A lot of the other stuff tends to get over-thought\" - I think that pretty much sums it my thoughts here up nicely. Getting started with SEO SEOMoz is a great resource for search, possibly the best for pure, actionable information and research data for SEOs but for your average business owner or entrepreneur this granularity is not always needed (to begin with at least). If you were looking to appoint an SEO or just to learn more and stumbled across some correlation data it could terrify a newcomer. This is great for us in the industry who want data to justify our approaches but this type of thing can be really off putting for a newcomer. SEO Starts with great content I am a keen SEO and by that I mean my interest goes way beyond it just being a job. It's fair to say that after spending time with my family and buying games that I don't seem to find the time to play the search engines and internet marketing is probably the closest thing I have to an active hobby (yep, sad, I know, but I am not the only one here!). Being such an SEO geek, I take in as many articles, blogs and participate in as many forums as time allows for - factor Twitter into that and I am often experimenting, reading some new study or research late into the evening (hence my wife's newly instated 'no smart phones in bed rule'). All this reading and time interacting on forums, blog comments and message boards along with the day-to-day work I do with UK businesses gives me an overview of what many people believe SEO is and the common mistakes made by business owners looking to optimise their web site for increased search traffic. The point that I am slowly edging towards is that I often see an obsession with the technical and link building elements of SEO from new clients whilst the simple reality of building great sites with stellar content is seemingly overlooked. Additionally, many smaller companies come to SEO after they have just put together a new site and are now looking for rankings. So, criticism of the site (however constructive) or the content (or lack of) is often not easy to take and there can be a reluctance to go back to the drawing board. Simply put, many prospective clients have done a bit of background SEO reading (usually the bad stuff), know that they need links and are looking for an 'easy' traffic solution. It's just about the links and the tags init? Well, I am sure that your mate down the pub is well-versed in the finer points of SEO and provides sage counsel to all of his chums - does not have a website of his own of course, and it's not what he does for living, but, knows his stuff he does - \"it's all about the keyword tags mate\". No, no it isn't and if you are seeking business and search engine advice from the local know-it-all then really, you should know better. Problem is, there are lots of know-it-alls online and it's just too easy to pick up bad or out-of-date advice. Additionally, there are so many crappy SEO tools, affiliates and review sites for these tools that finding easy answers to SEO problems is all too simple. Additionally, SEO seems that seems to be offered by just about every Tom, Dick and Harry graphic design and website development outfit to generate some extra revenue. To then be the person that has to come along and say 'I am sorry, but it's actually not that easy and you are going to have to work really hard at this' - well, I am sure most of you Mozzers have come up against this before. The Darkside of SEO - quicker, easier, more seductive Of course, it is tempting to think that you can just spend a few hundred pounds or dollars and you will have more traffic and business than you know what to do with. The people selling these tools and services often know exactly how to hook you in and damn, it sounds enticing to know you have discovered 'the number one SEO secret the pros don't want you to know' or one of the many 'too good to be true' claims you often see on sites promoting these tools. Doing it right - AKA - Your competition sucks This is where it gets interesting and there is some good news (hey, I am not all doom and gloom). Your competition, or most of them at least are not doing SEO properly, in fact, they are probably making a god awful mess of it. Why? Most people are suckered into looking for the easy way to get their site to the top of the results and are likely targeting some very general and tough to monetise search terms. With your competition making such a hash of things, if you are practical, and put the work in, you can do so much better. So, who is doing it right? You don't have to take my word for this, there is a wealth of search results out there to back me up and hey, I am not trying to sell you a $99 SEO Tool that will get you tons of FREE Traffic!!!! after all! Do a search for your business area along with your location and see what comes up and ill do the same - there was a little wedding in London recently so let's take a quick look at 'wedding photography london'. There are plenty of sites returned, no problems there, but none of them are really offering much in the way of information beyond a list of their products, services and a few examples of their work. What does Google want? What do your potential customers want? Google is the sheriff around these parts and if you want to drink at the watering hole, then you better well do as they say. Fortunately, they make it pretty clear what they want and that is, in their own words: 'high quality content'. In February this year, this became ever more important when Google rolled out what has become known as the Panda update which has more than ever put the focus on high quality, informative, unique sites whilst burying low quality static and brochure type sites deeper down in the search engine result pages. Google also wants sites to link to you, a link is vote and votes help you climb up the rankings therefore, Google wants you to create, informative, useful content that other people will find, share and vote for. Historically, this system has been open to abuse - 'I just need more links, right?' but it is getting harder and harder to game the search engines and we are at the point where you can swim upstream and try to cheat your way to a brief stint at the top or simply create and promote high quality content for long term wins - one is working with Google and is sustainable, the other isn't. I like to think of the search results as a magazine: you want to be the interesting content at the front of the magazine and not just one of the many advertisements crammed into the back pages. The search engines want to show the interesting content, no one really looks at the adverts after all! What do you need to do? SEO starts with great content - got that? Say it to yourself again and keep saying it till you believe it. Still thinking about short cuts, link building tools and secrets the pros don't want you to know? Well, maybe start meditating, 30 minutes a day with the mantra 'SEO starts with great content' and let's talk again in a week's time. But seriously, get this basic fact straight in your head and you are already strategically ahead of 90% of the competition. Next up you need to create some of this great content. Now... I hear ya, \"I can't write\", \"I don't know what to write\" but please - your smart people, you run a business and solve problems for your clients on a daily basis and you answer the questions of your clients day-in, day-out. You just need to make the shift to doing it online. Do this and suddenly you are positioning yourself directly in front of your market, establishing your credibility and starting a dialogue with an army of prospects way before that initial contact that leads to the new business. You may doubt the power of this now but believe me, the first time you are speaking to a new prospect and they say 'I read your post on X' or 'I found your article on Y' you will realise that not only does this generate more exposure and business enquiries, it makes closing the deal all that easier as the prospect already has a glimpse of your expertise giving your credibility a boost. Six Ideas for Content Generation So, let's assume you are on board, and want to tackle the competition with content rather than cheap (and worthless) tricks, you just need some ideas to get you started and here are some basics to get you started: What are the top five (or 10) questions you answer from prospective clients? Can you write these up and add them to the site? Use a strong call-to-action so you can continue to help people who have benefited from your knowledge. Case studies - how your product or service solves the problems of your customers. This communicates a solution to a problem and you are looking for people with problems that you have solutions for. Keyword Research - as well as the obvious SEO benefits, keyword research will teach you a lot about your prospects, what they are searching for and how they are searching for it - content ideas will organically grow out of this process. Keep a journal of all questions you get asked over the phone, in person and by email and answer these on your website. Brainstorming - simply talking with your staff at all levels of your business will reveal many common questions that can quickly and easily be sculpted into web content. Everyone from the MD to the customer support people have different opinions and all can be valid and useful (ignore the people in the trenches at your peril). Ask your customers what information or help they need - you can do this via email, in person, on the phone or there are several easy to use (and free in some cases) survey tools like survey monkey that make this a simple process. If you are hungry for more small business content ideas there is a great post from Rishil here: https://moz.com/ugc/small-business-seo-content-strategies Errr, I am still not sure I can do this Content is one of those things that seems difficult and scary, but if you start to think it through, you are already creating content on phone calls, emails and in meetings but you are only delivering it to one person at a time rather than broadcasting it to your entire marketplace. You know your customers, you know your products, you already have this content inside of you so it's just a case of getting it out there. Don't feel restricted to the written word either, if you are happier recording your voice as an audio file or creating a video then all power to you! Also, some content is better suited to a certain type of media so give some consideration to delivering your content in the format that is best for your users. Sounds like a lot of effort, will it really work? A couple of huge examples of this in action are this very site here: seomoz.org and hubspot.com. Both of these sites publish boatloads of content and subsequently are regarded as leaders in the SEO & Inbound Marketing fields. These are big guys yet, this applies equally as well to the small and medium players. If you are an individual offering car valeting services, a small business providing accounting services or a large telecommunications company providing a range of mobile phone services this approach works. By providing information that is of real use to your target market you get a chance to engage with your prospects, pimp your credibility and start a dialogue with them before they even know they are ready to buy, buy, buy. Do you like to receive cold sales calls? The crazy thing is, most businesses are not yet clued up to this. Sure, they are still marketing and spending time, money and effort on direct mail, cold calling, print advertising and other such techniques. In the Internet age, where people can find what they want online, these out-of-date approaches are more likely to annoy the hell out of your marketplace rather than turn them into prospects & customers so this is where a little effort, in the right direction can differentiate you from the competition and you can start to win big! Summing it up I waffle a little (a lot), I know that, I am doing it now, so let's just quickly sum up the most important elements of this so you can concentrate your time and effort on the areas that are going to provide the most results for your time and effort. Start adding relevant, quality content to your site on a regular basis. One article a week is more than 50 articles over the course of the year - work it into your schedule and be consistent. 2. Be SEO savvy - if you are just starting out you want to focus on your content and apply tried and trusted SEO basics to the work you do. The seomoz.org beginners guide is a great place to start for this: https://moz.com/beginners-guide-to-seo Avoid quick fixes and things that seem too good to be true - if you get an email promising you '200 white hat, organic, google friendly links for £50\" or a £100 tool that will allow you to 'OWN THE FIRST THREE PAGES OF GOOGLE' then, ask yourself firstly, why you found out by email and secondly, just how many people can 'OWN THE FIRST THREE PAGES OF GOOGLE'? Eat Yourself Thin I like a good analogy to help put the message across and another one that seems apt is the diet craze - want to lose weight? Eat less. Yeah, there is a little more to it but really, just eat less, do a bit more exercise, be consistent and you will get there - the quick fixes, crash diets, pills & potions don't work hence the market sustains itself. Want to do better in the search engines? Add great content, promote your content, interact with your market and help them solve their problems, be consistent and you will get there. One rule for all This article is mainly for businesses or people getting started with SEO but equally, as an Internet marketing consultant it's all too easy to focus on link building and the technical aspects of SEO. It's important to remember that part of our job is to coach site owners and to help extract and publish the valuable content. My goal with this post is that it may inspire you to start writing content and making your site the best it can be and just see how simple SEO becomes once you deserve to be at the top of the pile. If you want more small business SEO and Internet marketing tips with a liberal sprinkling of geek humour and inane babble then you can catch me on twitter http://twitter.com/#!/marcusbowlerhat. Happy writing folks! Marcus Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The 'Write' Way to Optimise Your Website"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The 'Write' Way to Optimise Your Website"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Marcus Miller\n          \n            Marcus Miller\n          \n            Marcus Miller"
}