{
  "url": "https://moz.com/blog/the-wisdom-folly-of-directory-link-building",
  "slug": "the-wisdom-folly-of-directory-link-building",
  "title": "The Wisdom & Folly of Directory Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week's Whiteboard Friday video caused quite a stir in several SEO-focused communities. Looking back, I clearly should have anticipated the backlash – many of the SEO forums are filled with people bu...",
  "content": "The Wisdom & Folly of Directory Link Building Link Building By: Rand Fishkin July 24, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 24, 2007 The Wisdom & Folly of Directory Link Building Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week's Whiteboard Friday video caused quite a stir in several SEO-focused communities. Looking back, I should have anticipated the backlash – many of the SEO forums are filled with people building their own directories, spending money on submitting to directories and selling advertising (or serving affiliate links) for directories. There's a lot of passionate self-interest in having general purpose, pay-to-submit web directories looked upon favorably by blogs (like SEOmoz) that might influence the habits of other Internet marketers. However, these passionate outcries in defense of what I'd consider “low-quality” directories are, sadly, less credible because of their sources. If Stephan Spencer or Bill Slawski or, perhaps even more convincingly, Matt Cutts or Eytan Seidman were supporting the general directories, I'd have a far different view. But, in my experience, those SEOs who are unconnected to the directory link-building game, along with representatives from the major search engines, have held a generally dim view of directory link building value. To help marketers understand why these directories aren't valuable, I'd like to approach this from a search engineer perspective – but, before I do that, I want to clarify exactly what I'm talking about when I say “low quality directories.” Below are my personal criteria for determining the value of a directory: Selective – it's hard to get in, because the editors carefully review the quality and value of including each site that's submitted. Yahoo! & DMOZ would be good examples of selective directories (though DMOZ is often far too picky, and my main strategy at that site used to be bribing editors, so they're not a perfect choice). Other directories may be even tougher to get on, like Nature.com's recommended links or the Forbes Best of the Web and some might be easier, like Emily Chang's eHub or Business.com. My view is that all of these provide solid value. Built for Humans, not Search Engines – Any directory whose primary goal is to help you boost your search engine rankings should be looked at with suspicion. If the list is intended to serve human visitors, there's a far better chance that search engines would want the links to count, otherwise, it would be very tough to argue that the site isn't manipulative by nature. Here's a good, general rule of thumb – if the directory owner is active on SEO forums, blogs & communities, attempting to market to the SEO audience, be wary. Not all of these links will be of low quality, but it should certainly raise a red flag. Well Referenced – Directories that have earned lots of high quality links from editorially robust sources are likely to carry far more value than those whose links stem from directory lists, SEO-centric communities or paid/affiliate links. With links that point to directories, I'd watch for quality over quantity – thankfully, Yahoo! Site Explorer tends to show more valuable links ahead of less valuable ones (though they're certainly not precisely ordered) so it's at least somewhat useful for sorting this out. Specific, not General – Typically, the more specific a directory is, the higher its value. This isn't always true, as general directories like the Librarian's Internet Index can be excellent, but if you find directories that are only for companies in the chemical engineering field or uniquely targeting environmentally friendly travel destinations, chances are that the value will be pretty high. Part of a Trusted Domain – Directories that are built on domains by themselves can be an indication of low quality (though there are plenty of counter examples here, too). Conversely, those that exist side by side on highly trusted, well ranked, notable sites are nearly universally valuable. Unique – Directories that follow the common formula of cloning DMOZ's layout and organization (or even take an entire ODP directory dump and then bolster it with submissions) are typically going to provide low value. Those directories that are completely unique, hand-built from the ground up without “directory” software, on the other hand, are much more likely to carry weight. Useful – Imagine yourself as an Internet neophyte, browsing the web for interesting, relevant content. Would you derive value from the system of organization, content, and links in the directory? If the answer isn't a resounding \"heck yeah!\", you might not Does Not Link to Bad Sites/Neighborhoods – A directory that's linking out to spammy, low quality sites is probably one of the easiest things for search engines to detect, and they're pretty fast when it comes to shutting down the PageRank/link juice passing ability of these domains. Run the MSN command \"linkfromdomain:url.com\" and take a peek through a few dozen pages of listings. If you see domains that you wouldn't want to link to on your site, chances are good that the directory might not be as worthwhile as you hope. Ranks Well – Apparently, this is a somewhat controversial way to detect the value of a link, but in my opinion and experience (both through testing and hands-on with real sites), there's virtually no better indicator that a page will pass link value (and how much) than observing its ability to rank for the terms/phrases it targets. Those that can't rank for their own title tags have almost certainly lost trust, while those who rank highly are nearly sure to provide ranking boosts. If anyone who's argued with me about this criteria in the past has evidence to show refuting my claim, I'd be thrilled to see it and happy to issue a retraction if I'm wrong, but until then, I'm sticking with this. You'll Know it When You See it – Frustrating though it might be, many of the low quality directories carry a number of traits in common that a smart SEO can “get a feel for.” When you visit a list like Bob Mutch's or Aviva Directory's or Strongest Links and start running down the entries, you can't help but absorb a sixth sense about which directories you'd \"count\" if you were a search engineer vs. which ones you'd be more likely to discount. To get an even better sense of what I'm talking about, I dug through some SERPs tonight to find directories to illustrate these points. Below are some good examples of directories that are probably high value: UC Irvine's directory of resources for classicists The William & Gayle Cook Music Library's worldwide Internet music resources Refdesk.com's quick research links Missouri Botanical Garden's botany links And now, a few examples of directories I suspect don't pass much link juice (or, if they do now, may not always in the future): tenthyear.com smittyzweb.com kwikgoblin.com Now put yourself in the position of a search engineer at Yahoo! or Google - can you think of any good reason why these general directories that take $20-$50 to buy a link would be worth counting in your relevancy algorithm? The typical excuse that I hear from low quality directory owners is that it helps to organize the web's content (which carries some logic) and that it shows a site owner is willing to \"work hard to earn their rankings.\" To me, neither of these are nearly as convincing as the idea that weighting these links will yield generally lower quality search results, driving users to other search engines that do a better job of filtering which links count. To wrap up, I'd say that it pays to be mindful of where you're spending your time, effort, and money in a link building campaign. Use your best judgment and do so predictively - even if it looks like the latest PR6 directory is still passing some value, consider what you really think of their chances of staying ahead of the search quality teams at the various engines over the long haul. p.s. Tomorrow I'll try to post on my visits to Yahoo! (in Santa Clara) and Google (in Mountain View) earlier today. :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Wisdom & Folly of Directory Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Wisdom & Folly of Directory Link Building"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}