{
  "url": "https://moz.com/blog/the-anatomy-of-tomorrows-inbound-marketing-strategy-today",
  "slug": "the-anatomy-of-tomorrows-inbound-marketing-strategy-today",
  "title": "The Anatomy of Tomorrow's Inbound Marketing Strategy Today - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There are many schools of thought and methodologies defining what inbound marketing should look like. Most of them position content marketing, social media marketing and SEO as the core of inbound marketing. From a 20,000-foot view, this has definite merit. However, with the right technology,…",
  "content": "The Anatomy of Tomorrow's Inbound Marketing Strategy Today Conversion Rate Optimization (CRO) By: Britney Muller October 18, 2012 Table of Contents Copied! By: Britney Muller October 18, 2012 The Anatomy of Tomorrow's Inbound Marketing Strategy Today Conversion Rate Optimization (CRO) There are many schools of thought and methodologies defining what inbound marketing should look like. Most of them position content marketing, social media marketing and SEO as the core of inbound marketing. From a 20,000-foot view, this has definite merit. However, with the right technology, enough content, well-developed personae and a good understanding of the brand, inbound marketing strategy can be much more stratified and robust. The anatomy of a robust inbound marketing campaign has similarities to the human spine. The human spine has five ordered sections – cervical, thoracic, lumbar, sacrum and coccyx – all of which are required to be in working order to live a pain-free, normal and productive life. An inbound marketing strategy has five ordered sections, too – owned and earned media, landing pages, lead nurturing, sales interaction and retention. And all of them are required to widen the sales funnel, create acceleration through it and to optimize Marketing’s impact on revenue. If there’s a problem with any of the sections Marketing’s impact on revenue will not be optimized and the inbound campaign will be in poor health. Owned and Earned Media This is the section that most marketers equate with inbound marketing – publish lots of owned and earned blog posts and articles frequently, organically distribute them through social media and watch Google drive traffic from its SERPs. This process produces lots of benefits, but without a strategy for the other sections it will be difficult to show real ROI. Purpose: Generate traffic, educate prospects, grow brand, produce thought leadership, build community, produce outside advocates, reduce churn Tip: Publish blog posts with frequency and consistency. According to Kuno Creative’s Content Marketing Manifesto, publishing five to ten posts per week led to a 633% increase in leads versus just two to three posts per week. Landing Pages This is a critical aspect of an inbound marketing campaign. Having lots of good free content is great, but morally bribing website visitors for their email and IP address using gated content is just as important. Once this information is captured, the visitor is no longer anonymous and their content consumption can be tracked and scored. It also allows for future email communication. Purpose: Capture email and IP addresses Tip: Analyze and value the inbound and outbound marketing channels that led to conversion with attribution modeling. Use this data to adjust tactics in the first section. Tip: Deploy A/B or multivariate testing to optimize call to action click-through rates and landing page conversions. Lead Nurturing With email addresses captured and other attributes known (other form fields, website behavior, social media profiles, IP address, etc.) lead nurturing, segmentation and scoring can begin. Delivering the right content on the correct channel at the best time separates the wheat from the chaff and empowers the wheat to organically identify themselves as sales qualified leads over time. It also creates an efficient method for identifying and removing unqualified leads from the funnel. Purpose: Generate more sales qualified leads faster (widens the sales funnel while creating acceleration through it). Tip: If lead nurturing is a new or unrefined tactic access Eloqua’s Lead Nurturing Toolkit for tactical refinement. Sales Interaction Marketing should only deliver leads that are worthy of a sales person’s time. Analyzing and adjusting lead score criteria over time is critical to ensure this happens. However, just as critical is the open flow of communication and lead feedback between Marketing and Sales. If the inbound marketing strategy is effective, Sales should find their prospects to be highly educated, qualified and ready to do business. Purpose: Efficiently generate customers Tip: Connect marketing automation tools with a CRM to help facilitate closed-loop marketing and open communication between Sales and Marketing. Retention A big portion of the retention initiative is accomplished by producing copious amounts of earned and owned media, building passionate communities in social media and being highly visible online. These are all activities that should already be deployed if the inbound marketing campaign is healthy. In addition, Marketing can produce and deliver advanced content created specifically for current customers. This content can be in the form of surveys, guides, cheat sheets, training videos, process infographics, etc. However, this can all be for not if deliverables aren’t fulfilled and expectations aren’t met or exceeded. Purpose: Reduce churn Tip: Marketers should keep open communication with fulfillment and account management in order to feel the pulse of current customers. This can help identify possible future churn to target with content before it’s too late. In high school, anatomy class was a place for students to giggle about the curriculum. However, understanding and implementing the entire inbound anatomy presented above is no laughing matter. In today’s ultra-competitive environment getting inbound right can mean the difference between business success and mediocrity. Getting it right tomorrow may mean the difference between business success and failure. About the Author: Chad H. Pollitt is Director of Marketing at Slingshot SEO. Since 2002, he has played an integral role in designing, developing, deploying, executing and tracking robust web marketing strategies for hundreds of companies and organizations and is an internet marketing expert. He holds a BS in Entrepreneurship from the Indiana University Kelley School of Business, an Internet Marketing Masters Certification from the University of San Francisco's prestigious School of Business and Management and is a Certified HubSpot Partner. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Anatomy of Tomorrow's Inbound Marketing Strategy Today"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Anatomy of Tomorrow's Inbound Marketing Strategy Today"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How Our Website Conversion Strategy Increased Business Inquiries by 37%"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Britney Muller\n          \n            Britney Muller"
}