{
  "url": "https://moz.com/blog/the-effect-of-site-structure-on-organic-traffic-add-categories-ampamp-products",
  "slug": "the-effect-of-site-structure-on-organic-traffic-add-categories-ampamp-products",
  "title": "The Effect of Site Structure on Organic Traffic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I took over our company website, bestbuymetals.com about 2-1/2 years ago. At that point we had practically no visitors, and a non-functional, JavaScript running, terrible looking website. Needless to say, I spent a lot of time designing and implementing a completely new site.From August 2007, to…",
  "content": "The Effect of Site Structure on Organic Traffic On-page SEO By: Nathan Libbey July 29, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Nathan Libbey July 29, 2009 The Effect of Site Structure on Organic Traffic On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I took over our company website, bestbuymetals.com about 2-1/2 years ago. At that point we had practically no visitors, and a non-functional, JavaScript running, terrible looking website. Needless to say, I spent a lot of time designing and implementing a completely new site. From August 2007 to November 2008, the site didn't really pick up many organic visitors, and we relied on PPC for most of our quality traffic. Then, something happened that changed everything. Our site structure had been flat like this: But we needed to add a lot more products. I didn't want to give people a long list of products, so we switched to a tiered structure like this: Except there were more categories and more types of metal roofing in each category. The main purpose for this change was to make it easier for people to navigate, and reduce confusion. We saw great results like people visiting more pages, staying longer, etc. What we did not expect was the increased organic traffic. Beginning the next month, traffic and rankings rose at a rapid rate, and are still rising. The following graph is over a period of about 2 years, from August 2007 until now. (This Google Analytics chart shows only organic search engine traffic.) One important question that rises from this is this: Did the dramatic increase in traffic come from the greater amount of pages added to the website, or the new structure? There are several things that I thought interesting: Traffic from Google rose consistently Traffic from Yahoo rose a while and then fell in a bell shape Traffic from Live/MSN rose consistently until it turned into Bing, when it dropped almost completely. Thus making you wonder if Yahoo places a greater value on new content creation than Google, but tends to discount it within a month or two. And also bringing up the question of how much different the search criteria Bing uses vs. its predecessor Live.com. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Effect of Site Structure on Organic Traffic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Effect of Site Structure on Organic Traffic"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nathan Libbey\n          \n            Nathan Libbey\n          \n            Nathan Libbey"
}