{
  "url": "https://moz.com/blog/theres-way-more-than-2-ways-to-make-money-with-seo",
  "slug": "theres-way-more-than-2-ways-to-make-money-with-seo",
  "title": "There's Way More Than 2 Ways to Make Money with SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Seth Godin is someone I greatly admire, so it was a bit troubling to see him take on the broad subject of How to Make Money with SEO in such a surface-level fashion. However, after a few emails, I feel pretty good that his intentions were solid, and that he's just presenting a viewpoint that many…",
  "content": "There's Way More Than 2 Ways to Make Money with SEO Advanced SEO By: Rand Fishkin April 14, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 14, 2009 There's Way More Than 2 Ways to Make Money with SEO Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Seth Godin is someone I greatly admire, so it was a bit troubling to see him take on the broad subject of How to Make Money with SEO in such a surface-level fashion. However, after a few emails, I feel pretty good that his intentions were solid, and that he's just presenting a viewpoint that many others have on the subject in an easy-to-parse fashion. While that's not necessarily bad, I'm notoriously against surface-level analysis of our beloved profession, so I figured I'd try to expand on Seth's assessment and give the subject a bit more thorough (though hopefully not less usable) treatment. Seth's list of business strategies that can be accomplished with SEO: Get rankings on a very popular, highly competitive keyword that exposes new visitors to your website Get rankings for your branded search terms that bring traffic using the engines as a primarily navigational device My slightly more comprehensive list would look a lot like this post - The 6 Goals of SEO: Choosing the Right Ones for Your Business. But I don't want to dive too deep. Let's stay high level and imagine it this way: There are lots of ways to earn traffic on the web, but not all of them bring income. There are also lots of ways to earn money online, and nearly all of them intersect with traffic acquisition. Wherever these two collide, SEO can help out - either by directly sending conversion-likely visitors or influencing traffic that will eventually turn into revenue. SEO helps in nearly every aspect of online business. From the buying cycle: To the branding & public relations world: To the social activities we perform on the web: The Internet has changed the way the world functions - and this change is accelerating as Internet adoption and usage continue their meteoric rise. There are fewer and fewer commercial events occurring at either the macro or micro level of economic interaction that aren't influenced in both subtle and obvious ways by web search. And guess what? If humans use a search engine to influence their decisions, SEO is a marketing tactic businesses can apply to modify those behaviors in their favor. The practice of search engine optimization may not be ubiquitous, yet, but it's only a matter of time. Either that, or some new technology will have to replace search and, in my opinion, we've not yet crested that horizon. So yeah, there's more than 2 ways to make money with SEO - in fact, the potential count is limited only by the number of ways there are to make money online. p.s. Also see Aaron Wall's examination of Seth's post - Most SEO Strategies Are Not Focused on Hitting Home Runs - Seth left a good comment there, too. p.p.s. For those of you who've been using Linkscape regularly, you may have noticed Sunday night's brief outage (which was fixed around noon on Monday). Apologies for the downtime - all is now back to normal (and we're on schedule for another fresh index update in a few weeks). For those seeking more timely updates, feel free to follow the @seomoz Twitter account, where we'll report on these incidents as they occur (and talk about other cool stuff going on here, too). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "There's Way More Than 2 Ways to Make Money with SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "There's Way More Than 2 Ways to Make Money with SEO"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}