{
  "url": "https://moz.com/blog/thinking-about-offtopic-links",
  "slug": "thinking-about-offtopic-links",
  "title": "Thinking about Off-Topic Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So-called \"off-topic\" links, those which are not directly related by subject matter on the linked-to page, have been getting some bad press lately. One of the problems with rejecting the idea of off-topic links from a search engine's perspective, is that the index of WWW would be unspiderable if…",
  "content": "Thinking about Off-Topic Links Link Building By: Rand Fishkin August 26, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 26, 2005 Thinking about Off-Topic Links Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. So-called \"off-topic\" links, those which are not directly related by subject matter on the linked-to page, have been getting some bad press lately. One of the problems with rejecting the idea of off-topic links from a search engine's perspective, is that the index of WWW would be unspiderable if they didn't exist. Besides that, despite advances in recent search technology, there's still no reliable way to determine what is and isn't 'on-topic'. We're all familiar with the SEs' intent when they say not to buy or get off-topic links - they want to avoid having links to viagra, mortgage loan, casinos, etc. sites on every page of the web. But for everyday linking, there's no reason that a site on SEO shouldn't link to a new article about Lance Armstrong's superhuman body, or even a map of Seattle traffic patterns. These kinds of links may be purely off-topic, but should their link weight really count less because my site or this blog entry isn't on the subject of bicycling or traffic? Those are still valuable links because my intent in linking to them was to provide my visitors an opportunity to see some great content on the web. I've prefaced the link with a relevant statement, fit it into the text of the blog post and used reasonable anchor text - it's hard to see why those links should count towards link pop (considerably) less than if they came from an equivalent on-topic site. The SEs initially had it right when they gave the advice not to build sites for search engines - there's no need to backpedal and say \"oh wait... but don't link to off-topic sites, and especially don't do it for money (unless you use this tag that tells us you did it for the money).\" It's hypocrisy and it will only work if the web content builders of the world agree to it. I hear some folks asking me - what's a better solution? The answer is block-level analysis; the content needs to be seperated algorithmically at which point the SEs can determine for themselves which links the writer \"intended\" to have users visit, and which ones they placed \"for the money\". Appended - Andy from Text-Link-Ads agrees with me, and has some additional ideas on why. Just goes to show that great minds think alike, eh Andy? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Thinking about Off-Topic Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Thinking about Off-Topic Links"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}