{
  "url": "https://moz.com/blog/things-i-hate-about-internet-advertising",
  "slug": "things-i-hate-about-internet-advertising",
  "title": "Things I Hate About Internet Advertising - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When you are a small business, you obviously have to be very careful about where you invest your time and your money.\n\nRecently I have been looking at some further advertising opportunities -- definitely not paid links, but genuine advertising in industry-related portals -- and I came across one or…",
  "content": "Things I Hate About Internet Advertising Online Advertising P By: Paz December 4, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! P By: Paz December 4, 2008 Things I Hate About Internet Advertising Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. When you are a small business, you obviously have to be very careful about where you invest your time and your money. Recently I have been looking at some further advertising opportunities -- definitely not paid links, but genuine advertising in industry-related portals -- and I came across one or two repeated scenarios that have me pulling my hair out. A few examples of what makes me cross: 1. Set pricing structure of x amount per month for different advertising options but no CPM (or cost per impressions), e.g., 1000 pounds/euros/dollars a month run of site, 500 a month top of the category listings, 250 a month basic listing or your own page in some deep dark corner of the hosting site. Now, I am of the opinion that CPM simply has to be offered by any responsible and ethical site. How on earth can they suggest that I pay the same amount for my page that may be seen 100 times a month as someone on a page that will get viewed 1000 times a month? Quite logically, surely I have to be paying 10% of that higher fee...? I am talking about genuine high traffic websites that are starting portals for many users who should be capable of utilising these techniques. Not only are they insulting my intelligence, they're also making themselves look totally greedy and makes them an enemy as opposed to a foe. Not good reputation management from the SEO perspective. 2. Websites with (claimed?) authority in an industry niche. With me being actively involved out here in the 'green ethos', so to speak, I started to notice almost overnight 50% of related industries all suddenly claiming to be practicing by green standards. The trouble is there are not really any actual recognised standards, just many guidelines and a lot of common sense. I looked closely into things to see what councils or organisations may be in the running to become the industry standards compiler. You know, some organisation that would write down the definitive list of requirements and dish out a recognised 'badge' to complying companies. Ha. Seems that overnight there are dozens of these too! Uncached, useless websites with a badge that you can basically buy by filling in a form and sending in your cheque for 1000 bucks. I am aware that one of these may indeed end up being the recognised standard, but until then many innocent eco-concious people are going to spend money on worthless rubbish from the rest of these sites -- not everyone is savvy like us. That leads me to point the finger at 'actual' official entities. In our own niche it may be wise to be a member of at least ten organisations. These would range from local tourist boards to global associations. Again, similar scenario, you fill in yer forms and send off yer cheque and you are given the coveted badge. Now, these businesses do actually check up on all the information (apparently) but why on earth do they have to charge so much money?! Surely these organisations should be non-profit and be there as much as anything for the protection of the consumer, right? How is it protecting the consumer if I am the best company to do something but only the worst company can afford to pay the fees? Ridiculous, in my opinion. 3. False or misleading traffic estimations. Again, this is not just a problem with newish sites that claim 10,000 visitors a month when there is no way on earth that they get more than around 203! I have, on several occasions, checked things out on some very big sites that have tens of thousands of visitors but still claim 100's of thousands. Why do this? Yes, I check out Quantcast and other places to do my background checks, but not everyone does. Why are these bigger sites allowed to get away with it so much? I'm not sure I have ever filled out a spam or complaint form about anyone and am reluctant to start, as I would be picking up holes in so many things! Also, aarghhhhhh, off the top of my head, now this is bugging me so one moment whilst I look at my emails...... Ok. So what does \"We are on the home page of Google, Yahoo, and MSN for all core industry keywords\" actually mean? This portal has 85,000 visitors a month and thousands of pages targeting 'phrases', so what does that statement mean? To me (cos I look) it means they have 2 phrases that are their 'core' 'keywords' because they don't rank for the first twenty phrases I have just entered! I could go on, but I'm quite interested in hearing what really bugs everyone else :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Things I Hate About Internet Advertising"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Things I Hate About Internet Advertising"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paz\n          \n            Paz"
}