{
  "url": "https://moz.com/blog/this-message-will-selfdestruct-in-10-seconds",
  "slug": "this-message-will-selfdestruct-in-10-seconds",
  "title": "This Message Will Self-Destruct in 10 Seconds - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You have anywhere from 4-10 seconds to engage my attention before I’m gone...  Before I click away, close the window and head over to your competitor’s site for a dose of instant gratification. I shouldn’t have to piece together the objective of your page—this isn’t a TV crime drama, and even if it…",
  "content": "This Message Will Self-Destruct in 10 Seconds Design B By: Bud-Caddell February 9, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: Bud-Caddell February 9, 2007 This Message Will Self-Destruct in 10 Seconds Design This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. You have anywhere from 4-10 seconds to engage my attention before I’m gone... Before I click away, close the window and head over to your competitor’s site for a dose of instant gratification. I shouldn’t have to piece together the objective of your page—this isn’t a TV crime drama, and even if it were, the plot would be more obvious than most poorly written pages out there. Give me headlines or give me death The best analogy to how web readers actually view content is how passengers view billboards in a speeding car on the interstate. Give your readers something to lock onto, give them immediate reassurance that they came to the right place to answer that question, read that review or find out more information about your company. It turns out readers scan a page in a big ‘F’ shape, spastically looking for headlines. Like gladiator fights and gossip television, give the people what they want—as soon as you can. The ‘F’ shape also means the user is more likely to read more at the top of the page than the middle. Make the most out of your one opportunity. I can smell a rat Typical ad-speak doesn’t work online—with lower attention spans come lower tolerance to being pitched at. Write objective content for your users—if your product or service really does deserve customer attention, there are enough of us online to give it to you without the car salesman pitch, complete with zoo animals, balloons and low low insanely low prices. Happiness is a warm gun Bullet points are your friend. Readers scan pages for easily digestible content. Use this to your advantage: save your mind-blowing information for introduction in bullet points, or give the reader an idea of what information they will learn right up top in simple bullet points—remember, your third grade teacher was no fool: Tell em’ what you’re gonna tell ‘em. Further Reading: I'd highly recommend picking up Don't Make Me Think by Steve Krug -- it contains some words to live by, and yes, it's actually easily digested. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "This Message Will Self-Destruct in 10 Seconds"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "This Message Will Self-Destruct in 10 Seconds"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bud-Caddell\n          \n            Bud-Caddell"
}