{
  "url": "https://moz.com/blog/this-week-in-search-for-8609",
  "slug": "this-week-in-search-for-8609",
  "title": "This Week in Search for 8/6/09 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "'This week in search' is a compilation of some of the most interesting, newsworthy, and useful stories in and around the world of search over the last 1-2 weeks.",
  "content": "This Week in Search for 8/6/09 SEO Events By: Sam Niccolls August 6, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Sam Niccolls August 6, 2009 This Week in Search for 8/6/09 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. 'This week in Search' is a compilation of some of the most interesting, newsworthy, and useful stories in and around the world of search over the last 1-2 weeks. If you have articles on your own blog or think something is worth mentioning in next week's post, send me a direct message to me on Twitter (@samniccolls) or tweet it and include @seomoz #thisweek in your tweet. Google's Advice on Using Alt Text: Google engineer Peter Linsley discusses alt text with Eric Enge. This is a great, technical, and actionable read for SEOs looking how to further the effectiveness they get from alt text. Web Analytics Manifesto: If you are an avid reader of Avinash Kaushik's blog, which I am, this post is a succinct breakdown of five fundamental concepts that Google's Analytics Evangelist holds. If you are not a reader of Avinash's blog, it is a great summary of things to think about with your company's web analytics. Latency and SEO: If you are wondering how page loads affect your SERP rankings. Or, if you have opinions on how the engines should incorporate latency and user experience in their rankings, Bill Slawski put together a great research intensive post about page latency and SEO. Disney Takes Ad Targeting to Another Level: You know how many visitors click on your banner ads, but what about the 90 plus percent who don't click on the ads? Companies like ESPN, CBS, and Disney are going leaps and bounds beyond traditional heat maps to answer that very question. In an effort to optimize ad revenue these companies are using advanced laboratory methods to monitor things like brain activity, skin temperature and heart rate. Advertisers find Twitter more Valuable Than consumers: Last week eMarketer published IDB data indicating advertisers find Twitter more effective than people who use the service for personal use. As someone who is lucky to tweet once a day and who's followers include folks like BuyVigraNow678, I don't have a hard time believing this is true, nor would the folks over at Smith-Harmon who seem to feel the same. World's Sexiest Job: Statistician?: Forget being a musician or an actor. As the New York Times talks about, with the emergence of online data comes the increased need for statisticians to analyze web data. So math lovers will soon rule the roost. And yes, People Magazine will have to make a new addition to their Sexiest Men Alive list. Why the F**k? Social media?: If you're having trouble getting social media buy in from your boss or wondering why you care about social media, Marta Kagan's slideshare is an engaging and highly visual way to tell the social media story, as well as one of the more original presentations I've seen in long time. Elevator Pitches that don't suck: I'm a big fan of Dave McClure's metrics for startups framework, but for SEOs and startup folks looking to refine VC pitches, his recent post about pitching problems rather than solutions is a useful one. And in typical Dave McClure fashion, the post is both entertaining and colorful. Seth Godin & Bear Shaving?: You can take this as an amusing image or as a lens through which you look at your business. But you see bear shaving all the time in business and in SEO. A specific SEO example is link building where sites often shave bears by trying to garner links, despite not addressing the fundamental design elements that prevented these pages from getting links in the first place. With a little creativity every site can produce great linkworthy content. 33 Great Domain Tools: From getting who is info to coming up with clever and available domain names, MogDesign's list of domain tools includes a number of useful resources for webmasters. Internet Ad Spend Down 5%: Though search faired better than other online advertising channels, according to IDB overall online ad spend dipped by around 5% in the second quarter from $14.7 to $13.9 billion. Delicious New Look and Feel: If you have not seen the changes, the design work Yahoo did to revamp Delicious is, well, for a lack of a better word delicious. It's a massive improvement for those who use the bookmarking service. N/A Thankfully, nothing to see here. Stay tuned. Ignite Media put together a great post that struck a chord and prompted a good dialogue on YOUmoz. The post, What if the economy isn't to blame? What if it's the seo company?, delves into how to find and measure the performance of a great SEO consultant. There is some good advice in the post. And given both the state of the economy and the wide variance of talent among SEOs, there are some interesting takeaways for folks on the client side looking to recruit and retain SEO superstars. Additionally, another solid YOUmoz read this week was Am I an SEO Greenhorn? by Martin81Vette. -- Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "This Week in Search for 8/6/09"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "This Week in Search for 8/6/09"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sam Niccolls\n          \n            Sam Niccolls\n          \n            Sam Niccolls"
}