{
  "url": "https://moz.com/blog/those-pesky-social-bookmarking-buttons-on-blogs",
  "slug": "those-pesky-social-bookmarking-buttons-on-blogs",
  "title": "Those Pesky Social Bookmarking Buttons on Blogs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At the 37 Signals blog, Matt is discussing the efficacy of having buttons for Digg, Del.icio.us, Reddit, etc. listed on the bottom of article pages or blog posts. Here's what he had to say:\n\nGiven the Ebola-like spread of these things they must be reall...",
  "content": "Those Pesky Social Bookmarking Buttons on Blogs Content Marketing By: Rand Fishkin November 1, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 1, 2006 Those Pesky Social Bookmarking Buttons on Blogs Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. At the 37 Signals blog, Matt is discussing the efficacy of having buttons for Digg, Del.icio.us, Reddit, etc. listed on the bottom of article pages or blog posts. Here's what he had to say: Given the Ebola-like spread of these things they must be really effective, right? Not so much. Zero out of Technorati’s top 10 blogs feature those icons. And only two out of the 15 entries in the current crop at Digg’s Top Today page offer “Digg me” icons. This focus on campaigning over content seems like a classic case of misplaced priorities. The reason posts wind up at Digg, Delicious, or elsewhere isn’t because the authors made it easier to vote for them (it’s already easy). A post winds up at these sites because people respond to its content and quality. To me, his post is generally awful. The examples he uses to back up his assertion (that those buttons are ineffective) are overly narrow and show no real data supporting or rejecting the assesment. His primary issue with the buttons focuses on the \"priorities\" of the site owners using them. In essence, he argues that you can either you spend your time placing social bookmarking buttons on the bottom of your pages OR build great content. This is utter nonsense - if you ask for the 15-minute feature addition of social buttons to your blog template from a developer, you are not cutting into content-development time. This is not to say that the point Matt brought up isn't valid - it absolutely is. He just did a terrible job of phrasing the issue. I would contend that adding those bookmarks to the bottom of pages has both positives and negatives. Positives You make it easier for your visitors to bookmark/tag/submit/vote on your content You help to suggest that performing those social actions is desired You make it clear that you're a fan/supporter/devotee of those sites Negatives You're potentially turning off audiences who feel that the buttons are too self-promotional Having the buttons on every page could reduce the value of placing them on certain pages on occassion by giving your readers \"button blinders\" (similar to ad blinders) The 51 comments in Matt's post generally agree with his assertion, but I don't. Despite the potential negative stigma that a select few might attach to seeing the buttons, I personally do use them on other people's sites (particularly the del.icio.us button) and feel that as long as they're well-integrated into the site's layout, they're more of a potential positive than a negative. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Those Pesky Social Bookmarking Buttons on Blogs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Those Pesky Social Bookmarking Buttons on Blogs"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}