{
  "url": "https://moz.com/blog/three-pitfalls-that-every-smb-should-avoid-on-facebook",
  "slug": "three-pitfalls-that-every-smb-should-avoid-on-facebook",
  "title": "Three Pitfalls That Every SMB Should Avoid on Facebook - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There are no doubts that Facebook has been successful in building synergies between what they provided online and what users wanted to do in real life. It has created such an ecosystem that now Businesses, large and small, are actively working out strategies to reach out and engage with users.",
  "content": "Three Pitfalls That Every SMB Should Avoid on Facebook Social Media R By: Rajat Garg September 27, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! R By: Rajat Garg September 27, 2011 Three Pitfalls That Every SMB Should Avoid on Facebook Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There are no doubts that Facebook has been successful in building synergies between what they provided online and what users wanted to do in real life. It has created such an ecosystem that now Businesses, large and small, are actively working out strategies to reach out and engage with users. In our community, we often hear success stories of brands on Facebook even when a lot of campaigns are failing in one way or another – especially in case of SMBs. This is something that negates our hypotheses that SMBs are the utmost beneficiaries of Facebook (as it is a common belief that FB provides an equal platform to compete with large brands). Yes, the differences between what \"experts\" speak and reality was plaguing us as well and we decided to examine on why so many SMBs are not able to leverage Facebook to the extent they should. We identified certain pitfalls, which SMBs should avoid to reap in the maximum benefits: Pitfall 1: Are your fans existing or potential customers? A lot of times, in the initial stages of campaigns, SMBs get so engrossed in acquiring fans that they miss out on the fundamental point that the fans they are acquiring should be their customers or potential customers. Backed by the faith that more fans imply more business value, they keep on spending resources on inorganic fan growth rather than offering value to their existing fans, in turn, losing out on even the fans they acquired organically. A few months back, PageLever published statistics which showed that for pages with ~1,000 fans only ~9.4% of them receive the page updates whereas for ~100,000 fans this figure dives down to ~6%. It is primarily attributed to the EdgeRank algorithm, which has done pretty well to snub out boring content from the user's Newsfeed, and low relevancy of generated content as your fans are actually not your present or future customers. This strengthens the fact that the connection between the SMBs and fans is not strong. They are not even doing enough to create quality and targeted content. Source: PageLever Pitfall 2: Are you truly Social? Now that the page has fans, lack of engagement seemed to be the primary reason for the failure or discontinuation of marketing campaigns. After crossing the initial threshold, SMBs actually fail to create an engaging environment with their fans. They are not really prepared for it with the right tools. Instead of being involved with the fan community and understanding them, they usually end up being in a monologue. This over a period of time leads to almost no response from fans and as a result campaigns lose their fizz. So, what were SMBs doing to engage? We found out that only a few SMBs are running successful campaigns leverage polls, offer coupons, launch sweepstakes, and most importantly, they are generating shareable content. Recent studies have demonstrated that posting 'open' messages significantly boost the engagement rate (up to 50%) e.g. \"What do you think about ____\", \"Click Like if you want us to support ___\". Source: 3,569 wall post sample taken from 200 pages (1000+ fans) powered by SocialAppsHQ Pitfall 3: Are you planning to take them out of Facebook ecosystem? Like everyone else, SMBs also want to leverage their Facebook presence to strengthen their bottom line. To get returns, they try to take the users out of the Facebook ecosystem and that's when it fails. Users don't really want to go out unless there is enough value associated with it. We did some pilots and figured out that campaigns that took users out of Facebook ecosystem had a really high bounce rate. In our pilots, we observed that for Facebook traffic, our bounce rate went up by about ~41% and average time on site dived down by ~56.33%, in comparison to our overall site average. Source: Google Analytics for landing pages with Facebook ads as traffic source To counter this, SMBs should bring some of the conversion steps on web within the Facebook platform. This will give more confidence in the user to go out of Facebook ecosystem and perform necessary actions. Conclusion: Lots of businesses are still figuring out this new form of marketing. It itself is still evolving and results might come as a surprise at first look, but going with Hans Rosling's – \"Let my dataset change your mindset\" – SMBs should gather as much data as possible and try to map it to revenue figures or branding success. We could also infer that an optimum balance is required to form synergies between fan count numbers and actual business value derived out of them. We will continue to deep dive further to bring forth the insights to help SMBs design and implement successful marketing campaigns on Facebook. We will really appreciate the feedback and comments from the community on our observations. About the Author Rajat Garg, Founder and CEO, SocialAppsHQ, graduated from Stanford University in 2005. Before founding SocialAppsHQ, he worked as a General Manager (Real Estate) at DataSphere and Product Manager (Associates Team) at Amazon. SocialAppsHQ is a fast growing social media platform. It enables more than half a million Facebook pages – including that of Cadbury Bournville, Better Business Bureaus, Vin Diesel, RedBus, AARP, and WebMediaBrands – with a suite of 19 apps to deliver rich, engaging and measurable fan experience. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Three Pitfalls That Every SMB Should Avoid on Facebook"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Three Pitfalls That Every SMB Should Avoid on Facebook"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rajat Garg\n          \n            Rajat Garg\n          \n            Rajat Garg"
}