{
  "url": "https://moz.com/blog/three-things-internet-marketers-can-learn-from-tv-commercials",
  "slug": "three-things-internet-marketers-can-learn-from-tv-commercials",
  "title": "3 Things Internet Marketers Can Learn From TV Commercials - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "1. Attention Spans Are ShortThe average TV commercial is around 30 seconds to a minute long, not only because commercial time is expensive but also because that is the optimal attention span for the normal person nowadays (sadly). As you watch a commercial you'll notice that many are mini-stories,…",
  "content": "3 Things Internet Marketers Can Learn From TV Commercials Content Marketing S By: Samirb April 18, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: Samirb April 18, 2008 3 Things Internet Marketers Can Learn From TV Commercials Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. 1. Attention Spans Are Short The average TV commercial is around 30 seconds to a minute long, not only because commercial time is expensive but also because that is the optimal attention span for the normal person nowadays (sadly). As you watch a commercial you'll notice that many are mini-stories, starting with a build up, resolution, and conclusion. It's important to remember your users' attention span when writing a post. I'm not going to say that it should take 30 seconds to read or it should be 200 words long. Research your users' attention span, check your analytics and see how long your average visitor spends on a page. That number is how long your blogs should take to read; longer than that and they may get bored, shorter and they may feel unsatisfied. The problem with finding this sweet spot is that the average time spent on a page will be the average time it takes for your current users to read the posts you've already been writing. You have to make sure that while finding your sweet spot, you randomize the length of your posts. Write a long one and see how many people read it, write a short one and compare the two. It's important to experiment, and recognize your reader base's unique attention span. 2. End With a Call To Action If you watch this commercial you'll see that Burger King splashes their website URL at the end, inviting you to visit their site. Burger King is trying to create and grow a community similar to how a blogger tries to help stimulate comments and subscribers. Comments and subscribers are one of the greatest measures of the value of a blog. The more of these you have, the more robust your community, and the more authority you have as a writer. Also, as your blog grows, a snowball effect begins to take place where a more active community gains more comments and subscribers as those on the outside want to join. It's important to add a call to action at the end of your blog posts because it helps build a community, grow comments and subscribers, and improve your own reputation as an authority in your niche. An example call to action would be an open ended question or a \"What do you think?\" These simple questions lead users to join the community. 3. Branding is Extremely Important Pepsi, Ford, and Best Buy all have one thing in common - they all spend enormous sums of money branding. By branding they make the items they sell synonymous with the name of their company. When I think blogging help, I think ProBlogger.com -- Darren has a very strong brand and it has helped his site grow in popularity. When you write a post and speak about your website, it's important to use the same name consistently. For my blog I had the choice between Left The Box, LeftTheBox, or LeftTheBox.com. I decided on LeftTheBox.com and make sure not to use the others, because it helps reinforce the brand. Creating a memorable name and using it without change helps branding; however, there are a multitude of other tools that can help as well. Along with a name brand, a logo brand is also important. Be sure to create a simple logo that is unique, and add it to each page on your blog. Another easy tool to further your brand is your site favicon. It makes your logo show up on your users' toolbar and bookmarks list, making it a quick way to add more visibility to your brand. What have you done to figure out your reader's attention span? What is your favorite ending to a post? How have you branded your website? Let me know! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "3 Things Internet Marketers Can Learn From TV Commercials"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "3 Things Internet Marketers Can Learn From TV Commercials"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Samirb\n          \n            Samirb"
}