{
  "url": "https://moz.com/blog/throwing-out-the-book-on-seo",
  "slug": "throwing-out-the-book-on-seo",
  "title": "Throwing Out the Book on SEO! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "OK... It's a new day in my office. I am changing my focus away from the standard SEO optimizing stuff and instead putting my focus where it really belongs - getting site visitors to embrace my site. Let's call this SEO for SITE VISITOR ACTIONS. I think that the search engine...",
  "content": "Throwing Out the Book on SEO! Design E By: EGOL August 31, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL August 31, 2005 Throwing Out the Book on SEO! Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. OK... It's a new day in my office. I am changing my focus away from the standard SEO optimizing stuff and instead putting my focus where it really belongs - getting site visitors to embrace my site. Let's call this SEO for SITE VISITOR ACTIONS. I think that the search engines are getting a lot smarter and they can tell when certain SITE VISITOR ACTIONS are happening on a website - they now have tons of data at their disposal from toolbars, context ads, SERP logs, SERP advertising, and other sources. If they are not using the info heavily now I think that they will be using it heavily soon. So, from today moving forward, my priorities, content development, site structure changes, navigation, etc. are going to be focused to yield the site visitor actions specified below. In the past I have spent my time wisely on the optimization stuff (correctly thinking that it will fetch traffic) but now I am gunning for other things which I have always realized were the \"high road\" of website development - but I have focused upon the optimization for economic reasons. I want to say it clearly: I am betting my booty that Site Visitor Actions either are already driving SERPs or will be in the very near future - trumping clever optimization tricks - and ranking right up there with a big load of backlinks. The search engines have EVERY ability to use these things for determining SERP rankings. The usability people will probably be nodding and saying that this is where I should have started and maybe they are right but I think that - at least for me - I am making this call at about the right time. optimization was the traffic driver of the past but site visitor actions are the potent juice now.Bookmarks: When this happens a lot it is a sign of a great site and that should earn a ranking boost.Time Onsite: People don't waste time on spammy sites so I'm doing things to make my sites sticky.Page Views: Present lots of interesting options to people so they really explore your site.NATURAL Links: Links will always be valuable... but don't waste any time on contriving links - the SEs can smell them and are getting savvy about giving them zero or negative value.SERP CTR This is all about sexy title tags. Its a Site Visitor Action that begins in the SERPs.OK... that's my two cents on this stuff... What do you think? Do you think that this make sense? Can you think of other Site Visitor Actions that can be added to the list? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Throwing Out the Book on SEO!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Throwing Out the Book on SEO!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}