{
  "url": "https://moz.com/blog/thursday-roundup-for-the-week-of-1608",
  "slug": "thursday-roundup-for-the-week-of-1608",
  "title": "Thursday Roundup for the Week of 1/6/08 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For our first roundup of the new year, I've decided to change the format a bit and present the links first. I've also included notable YOUmoz entries from the last week, so hopefully you folks will enjoy the weekly YOUmoz roundup in addition to the other stuff.\n\nStories, news, and other notable…",
  "content": "Thursday Roundup for the Week of 1/6/08 SEO Events By: Rebecca Kelley January 10, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley January 10, 2008 Thursday Roundup for the Week of 1/6/08 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For our first roundup of the new year, I've decided to change the format a bit and present the links first. I've also included notable YOUmoz entries from the last week, so hopefully you folks will enjoy the weekly YOUmoz roundup in addition to the other stuff. Stories, news, and other notable items from the past week: Three star links: The Computer Services Sales Tax recently passed in Maryland but may get repealed. It's a 6% sales tax on \"computer services,\" which sounds so nice and vague. Jon Payne, the guy who brought this to my attention, said that \"It will ultimately hurt small businesses b/c they are the ones who outsource and thus will pay the tax... large corporations do their design, programming, etc. in house and thus no tax on it.\" If you live in Maryland and are concerned about this tax, visit votervoice.net for information on how to repeal the Computer Services Sales Tax. NetworkWorld brings us an interesting article called \"Is Gaming Google a Gateway to Crime?\" It poses the question of whether business that are likely to hire black hats are also more likely to engage in \"outright criminal activity\" than companies who employ white hat methods. The article cites an example Matt Cutts gave about a company that got busted for using black hat tactics to manipulate their rankings, and later on the same company had several employees convicted for inflating revenue. It's a bit presumptuous to assume that black hat hirers are crooks and cheats through and through, though the article is an interesting read. SEMpdx has announced Searchfest 2008, to be held March 10th in Portland, Oregon. Last year's Searchfest is where I presented for the first time, so I'm looking forward to going back to my first \"gig\" and reprising my speaking spot (this time I'll be discussing link bait strategies). Plus, Rand is giving the keynote. Try to make it out to Searchfest if you can--it'll be even bigger and better than last year, and we're looking forward to meeting new folks. The NY Times has a checklist of traits both good and bad bosses possess. Good bosses inspire confidence and are humble, while bad bosses don't smile much and talk about themselves a lot. You can even take an exaggerated quiz to see how much of a jerkwad your boss is (the little boss graphic is very amusing)--I'll take this in a little bit after Rand leaves... ;) Tropical SEO brings us a nice little Festivus gift: 9 new niche social media sites. The sites range from sports, design, webdev, shopping, and more, so if you have any clients in those industries or operate in one yourself, give the appropriate site a whirl and see what you think. Muhammad Saleem introduces us to the \"el farol\" problem in social news. He says, \"...if everyone submits at the same time and a large volume, some people are always happy and some people are always unsatisfied. however, if everyone submits in turns and in moderation, everyone gets a chance to have their content promoted and everyone is happy at least some of the time.\" He then compares the ideal scenario (everyone gets a fixed number of submissions) vs. what actually happens (users don't coordinate their submissions, votes are split, the same stories oversaturate the site, etc). Four star links: Ask Kalena presents this week's dumbass: Gene Marks. The man writes a column for Business Week on MSNBC, but he has such horrible advice and seems so grossly misinformed about various subjects (including, yes, SEO) that it's frustrating to think that people actually believe what he says to be actual, useful suggestions and tips. Pew Internet reports an increased use in video sharing sites, and over at Search Engine Land Greg Sterling mentions the U.S. television writers' strike as having \"a negative effect on TV viewing\" and has \"sent many people to the internet for video instead.\" MindValleyLabs brings us a tip on how to increase your conversions: use capitalization more astutely. They ran the same ad, one with strategic capitalization and one without, and the capitalized ad had a whopping almost 200% increase in conversions. Greg Linden foresees a 2008 dot com crash that will be deeper and more prolonged than the one in 2000. It's a little doomsday sounding, but still something to think about... Five star links: Seth Godin is a damn good speaker. Here he talks about sliced bread and how it's the ideas that spread that will win. Good stuff, and very interesting. JUST ADDED: I would be remiss not to include Matt McGee's SEO Success Pyramid. This is a fantastic visual aide that tells you, in order of importance, the absolute SEO essentials for your website. If you haven't seen this already, check it out--very impressive. Sorry I missed this, Matt! Interesting YOUmoz entries: SEO for Joomla Sites. PiperTax discussed issues with Joomla and how to do some SEO fixes on Joomla sites. Online Brand Management by Julius Caesar. Carfeu wrote a post that discussed online reputation management--what it's all about, why it's important, and what you can do to manage your company's reputation. Bebo the Best Social Network? No; It's Just the Best Bebo. Ciarán talked about the recent awarding of Bebo as the \"best social networking site,\" and about how \"best\" is just a subjective term depending on each site's targeted demographic audience. The Long Tail of Search in the Recruitment Business. RichardBaxterSEO shared some dynamic optimization techniques that will help catch the long tail of searches in the UK recruitment business. Keyword Research Tools: An Extended List. Ann Smarty shared her favorite keyword research tools with us. Win a Free SEOmoz Premium Membership. Seanmag is giving away the free month of SEOmoz Premium Membership that he recently won (how nice of him!). Details are in the YOUmoz post. Best of YOUmoz: MariaSEO's Diagrams That Can Help You Define the Proper Anchor Text of Internal Links was such an excellent post that when I came across it in the queue I promoted it straight to the main blog. Great stuff, Maria! The diagrams are very well put together, and it's an incredibly useful and practical post. Check it out if you haven't already. New events added to the Events Calendar: SphinnCon Israel on February 5 at the Jerusalem College of Technology New additions to the SEOmoz Marketplace: Featured job postings: Community evangelist for Wetpaint in Seattle, WA Interactive web developer/designer for Basis in Canada Link builder in Fort Myers, FL An English to Dutch translator in Fort Myers, FL Search marketing analyst for Switched on Media in Sydney, Australia Featured companies: Ozone Search Engine Marketing in Ottawa, ON, Canada SMM Strategic Marketing Montreal (strangely enough, the location says Langley, BC, Canada) Wetpaint in Seattle, WA Concept Interest Denmark ApS in Denmark The SEO World SEO Experts in Hyderabad, AP, India Area 1 Labs in New York, NY Saurus SEO in Chichester, United Kingdom Digital Surgeons in New Haven, CT Metamend Search Engine Optimization (located cryptically in both the U.S. and Canada) Codevibes Inc. in Montreal, QC, Canada PHP Script Lab in the United Kingdom Featured resumes: Vinny Goldsmith (aka our beloved vingold) As always, feedback on our modified Thursday Roundup post is encouraged (except from you, Pat). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Thursday Roundup for the Week of 1/6/08"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Thursday Roundup for the Week of 1/6/08"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}