{
  "url": "https://moz.com/blog/thursday-roundup-for-the-week-of-121607",
  "slug": "thursday-roundup-for-the-week-of-121607",
  "title": "Thursday Roundup for the Week of 12/16/07 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's Thursday, so you know what that means: another installment of Roundup Thursday! This week, I'm implementing a more formal layout that will be executed in every recap post from here on out. Hope you enjoy it! \n\nThat being said...\n\nNew Additions to the SEOmoz Marketplace:\n\nFeatured job…",
  "content": "Thursday Roundup for the Week of 12/16/07 SEO Events By: Rebecca Kelley December 20, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley December 20, 2007 Thursday Roundup for the Week of 12/16/07 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's Thursday, so you know what that means: another installment of Roundup Thursday! This week, I'm implementing a more formal layout that will be executed in every recap post from here on out. Hope you enjoy it! That being said... New additions to the SEOmoz Marketplace: Featured job postings: SEO specialist for the Seattle Children's Hospital in Seattle, WA (hint, hint - SEOmoz is their search agency) SEO specialist for the Latitude Group in London, UK SEO specialist for Rocket Spider in Sheffield, UK E-Services producer in Danville, CA Senior designer in Danville, CA Internet marketing coordinator for On Target in Denver, CO Jr. SEO specialist in Jersey City, NJ PHP web developer for Digitally Imported in New York, NY Account manager for Rise Interactive in Boca Raton, FL Sales consultant and account manager for Rise Interactive in Chicago, IL Application developer for Rise Interactive in Tamarindo, Guana, Costa Rica Featured companies: Rise Interactive Oban Denmark Unleaded Software TechWeb Media Performancing MoveYourWeb Latitude Group Sheffield Marketing SWAY WebpageFX Web Design Rudy Interactive Better Search Engine Rank Featured resumes: Katherine Watier New events added to the Events Calendar: Current Issues in Complex IP Licensing on March 6, 2008 in Phoenix, AR BlogOnExpo January 15-18, 2008 (digital conference) Stories, news, and other notable items from the past week: The NY Times, ReadWriteWeb, and this interview with Peter Norvig, Google director of research, all state that Google admits to using actual, living breathing people for feedback on their search results along with user clicks/their algorithm. Danny Sullivan countered with a \"Yawn, we already knew this k thanks\" response on Search Engine Land - 2 stars (that's right, we're rating the links in our roundups!). Eric Enge interviews Sep Kamvar, engineering lead for personalization at Google. It's a fairly standard interview that covers the definition of personalization and basic factors Google uses, which is why this link gets 3 out of 5 Moz Stars. Stephan Spencer brings us another solid interview for Roundup Thursday, this time with Matt Cutts. Some of their topics of discussion include social bookmarking links, the \"value\" myth of .edu links, are poorly constructed site maps really just doorway pages, and more. It's a good interview, but it's fairly long. Apollo SEM brings us a comprehensive step-by-step on how to expose Adwords keyword data beyond \"other unique queries\" in search query reports. After implementing the changes, you should be able to see the exact search query a user typed in that brought him/her to your ad. FoundRead provides a post about Startup Math, and how 1+1 = 1/2 due to the time and effort it takes to train a new hire. It's a cheeky observation, which is why I give it 4 stars. PBS has a piece about how journalists and bloggers suck at startups. It posits that the failure rate is due to writers thinking they know more than they actually do, and their excitement at being a part of something rather than just covering it or writing about it. It's a pretty interesting (and kind of depressing--guess I'm doomed to never succeed at startups) article. Jon Mendez wrote his top 10 multivariate and A/B testing results in 2007. This is a really interesting list, and a lot of factors that you wouldn't think would make a difference in conversions indeed made a big difference. We may need to test a few of these out for ourselves, as we're in the process of tweaking our landing pages. Portent Interactive had a staff linkbait contest, and the winner created PPC Villain. The \"Internet Marketing Domination Seminar\" video (link to bigger video on YouTube) is very amusing if you're in the industry (which I am, so I thought it was funny, which is why I'm giving it...) (From Rand - had to add this one) Rae Hoffman's blog, as many who've talked to her over the past few months have found out, can't rank for crap. It's in what appears to be a virtual replica of the old \"sandbox effect\" we used to see so often from 2004-2006. Her explanation and walkthrough is brilliant and gives you some good insight into just how remarkably unfair Google's ranking algo can be when they falsely suspect/detect negative attributes on a domain. BTW - Just because Rae's very smart about how black and gray hat practices operate doesn't mean she is one - in fact, looking over her new stuff, there isn't a domain she's working on currently that she'd be afraid to show to the search engineers. Like Rae, I think the problem with her blog is a Google glitch or false positive on spam detection, and nothing personal. Woo, that's quite the roundup I served all of you! Expect something like this every week, and I hope you enjoyed this week's version of web goodness. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Thursday Roundup for the Week of 12/16/07"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Thursday Roundup for the Week of 12/16/07"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}