{
  "url": "https://moz.com/blog/thursday-roundup-for-the-week-of-11308",
  "slug": "thursday-roundup-for-the-week-of-11308",
  "title": "Thursday Roundup for the Week of 1/13/08 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Stories, news, and other notable items from the past week:\n\nThree star links:\n\n\n    David LaFerney (aka DrDave) wrote a post about on page SEO for WordPress. It's a nice, simple, handy guide on what fact...",
  "content": "Thursday Roundup for the Week of 1/13/08 SEO Events By: Rebecca Kelley January 17, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley January 17, 2008 Thursday Roundup for the Week of 1/13/08 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Stories, news, and other notable items from the past week: Three star links: David LaFerney (aka DrDave) wrote a post about on page SEO for WordPress. It's a nice, simple, handy guide on what factors to keep in mind when working with a WordPress powered website. Give it a read if you need some good tips. The NY Times brings us \"Handmade 2.0,\" an article about how handmade goods have gone all web 2.0 with sites like Rand-approved Etsy. I think it's cool how something as seemingly \"old school\" as handmade goods (think knitting, crocheting, and anything else your grandma is particularly adept at [mine kept a rock in a sock in her purse for protection. I'm not lying]) is all \"young and hippified\" with clean sites and user-generated content. Matt McGee, David Mihm, and Logoworks bring us the 2008 SEMMY Awards, a culmination of the year's best posts in SEM. It's a good roundup of posts from this past year, so check them out if any of them slipped through the cracks. Winners will be announced soon, though after the SEJ Awards and Rand's critique about how it was structured, I'm feeling a little blog awards fatigue. Still, if you were nominated, congratulations and best of luck to you. If you'd laid awake at night wondering what John Chow, Jeremy Schoemaker, Guy Kawasaki, and Rand Fishkin drive, read What Do the Top Bloggers Drive? over on DavePit.com and then go to bed. Rand's a little sad that Dave didn't post an image of an empty highway to showcase the imaginary Fishkinmobile. Barry Schwartz confesses that he's not a good sales man. That's okay, Barry, because you're a wonderful blogger and bringer of new SEO developments, and I don't know what the SEO community would do without you. Meanwhile, Andrew Goodman counters back that Barry is \"actually quite a clever salesman.\" Hmm, we're onto you, Barry! Four star links: I received a press release from Hitwise that stated MySpace received 76% of U.S. social networking visits in 2007, while Facebook came in second with a distant 16.03% of visits (Bebo, BlackPlanet.com, and Club Penguin round out the top 5). Conversely, the average time spent on Facebook increased 100% from 2006 to 2007 (19 minutes, 51 seconds in 2007 compared to 9 minutes, 56 seconds in 2006), while the average time on MySpace actually worsened by 2% (29 minutes 36 seconds in 2007 vs. 30 minutes 5 seconds in 2006). The press release states that \"U.S. traffic to all the social networking websites increased four percent year-over-year.\" However, Bill Tancer reported that MySpace moved into the #1 position for all Internet sites. The LA Times has an article called \"Why People Believe Weird Things About Money.\" It's an interesting read--more people would prefer to earn twice as much as someone else than make more but earn less than their peer. Wait, that was confusing. Oh, just read the article. It's full of lots of psychological know-how about why we're neurotic about the Benjamins. The Google Webmaster Central Blog released a Sitemaps FAQ. A lot of questions are answered and it's a great resource for all you webmasters out there who are getting stumped with Sitemaps. Conversation Marketing advises us on how we can double email open rates. Simple testing is all you need! Five star links: KillerStartups.com gets a five star link because it's an interesting concept and a potentially valuable site. The site reviews over 30 startups each work day, and it allows users to vote for the ones they think will take off. The site's great for both discovering new startups and for your competitive research efforts. Interesting YOUmoz entries: Why a Link from a Powerful Blog May Not Be a Powerful Link. Duncan Morris shoves Will and Tom aside to talk about the page rank fluctuations associated with getting a link from the home page of a prominent blog. Kids, Plug Your Ears! I Am Going to Talk About SEO P_rn! Brent D. Payne stirred up quite a frenzy by asking the community if anyone has done SEO for pornographic sites, and if we would if we haven't. At over 130 comments and counting, it's a safe bet that his post has gotten our attention. :) How Can SEs and SEOs Work Together to Improve Understanding and Fight Spam? Bookworm SEO posits whether we can improve the wider community's understanding of SEO and SEM and what we can do to fight our bad rep of \"all SEOs are no good spammy black hats.\" Upping the Ante: Win a One Year Premium SEOmoz Membership - $399 Value! Seanmag and CredoPaul joined forces to improve the stakes for last week's contest, Win a Free Premium SEOmoz Membership. Now the most thumbed up YOUmoz post will receive a free one year Premium Membership, with second place receiving a free month of access. Read the post for more details. Google Sucks at Adwords. Carfeu has a bone to pick with Google, saying that AdWords campaigns designed by Google employees are subpar. Why Initial Rankings Following Quick Reporting Are Key. LukeE discusses how, by being \"vigilant, aware, knowledgeable, and lightning-quick,\" you can hit the ground running with a new or small site and get link and referral traffic. Wordpress vs. Joomla: A Handy Guide. Enemy News does a great job highlighting the pros and cons of both Wordpress and Joomla, and recommends each depending on what sort of site you're operating. Best of YOUmoz: Robots Exclusion Protocol 101 by Sebastian was a YOUmoz entry that we promoted to the main blog. Sebastian does a fantastic job of explaining the REP and various directives. It's a lot of information to process, but it's very smartly written and an extremely useful introduction to understanding what the REP is and how it works. New events added to the Events Calendar: No new upcoming events. New additions to the SEOmoz Marketplace: We had a LOT of new job postings, company profiles, and resumes posted this week, so be sure to check them out if you're looking to hire/be hired! Featured job postings: Real estate-related website content writer for the Real Estate Marketing Blog in Los Angeles, CA User tester: network security/WAN optimization in the U.S. SEO & organic marketing manager for Smilebox in Redmond, WA Link builder in Doylestown, PA Director of SEO products and SEO strategist for Link Experts in New York, NY Search marketing strategist for the Cobalt Group in Seattle, WA SEO director in Seattle, WA SEO manager in Seattle, WA Online marketing manager in Seattle, WA Featured companies: United States: Buildtelligence Web Solutions in Florida Real Estate Marketing Blog in Los Angeles, CA Dito in Virginia Kangamurra Media, run by our favorite Aussie Webmaster, in New York, NY World Wide Internet Publishing in Waco, TX MorePro Marketing in Phoenix, AZ MGP Direct in Clarksville, MD Clicksharp Marketing in New York, NY Search Engine Optimization Portland in Portland, OR Lazworld.com in Belmar, NJ Paul Mycroft and Company in the U.S. Artisan Interactive in Raleigh, NC SiteMadeSimple.com in the U.S. Vertical Measures in Phoenix, AZ DONE! SEO in El Segundo, CA Brandwidth in Indianapolis, IN Wellwrittenwords in the U.S., the UK, and Jordan South America: Genialy Agency in Brazil United Kingdom/Europe: Verbie in London, UK Brand Attention in Hitchin, Herts, UK Browser Media in Colchester, Essex, UK Latitude Group in London, UK Webs&Host in Spain Papangoo AB in Borlänge, Dalar, Sweden Asia: Search Rank Professionals in Baroda, Gujar, India Australia: Websalad in Sydney, Australia Featured resumes: Christelle Stout is looking for an SEO internship, so if any of you out there are in need of a bright-eyed, eager individual to help with any SEO at your company, contact her. She's excited to learn more about our industry, so let's try and find her a temporary home. :) Paul Mycroft is a professional web designer who is available on a contract basis. Mark Bakker is a web developer and SEO who is currently looking for employment. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Thursday Roundup for the Week of 1/13/08"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Thursday Roundup for the Week of 1/13/08"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}