{
  "url": "https://moz.com/blog/tiers-of-transparency-the-ethical-brand-ambassador",
  "slug": "tiers-of-transparency-the-ethical-brand-ambassador",
  "title": "Tiers of Transparency: The Ethical Brand Ambassador - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Final update from Rebecca: Upon various requests, Marty Weintraub's original post has been restored with offending parts redacted. A newer version of his post that focuses more centrally on avatars and persona marketing can be found here: Tiers of Transparency, The Ethical Brand Ambassad...",
  "content": "Tiers of Transparency: The Ethical Brand Ambassador Social Media By: aimClear July 23, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: aimClear July 23, 2008 Tiers of Transparency: The Ethical Brand Ambassador Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Final update from Rebecca: Upon various requests, Marty Weintraub's original post has been restored with offending parts redacted. A newer version of his post that focuses more centrally on avatars and persona marketing can be found here: Tiers of Transparency, The Ethical Brand Ambassador. After my very slightly infamous SMX Advanced “Give It Up” presentation included the “Soy Candle” approach to extending powerful social media profiles to the advantage of SEO (download .ppt here), I had the pleasure of chatting up the tactic with various industry folks who didn’t think much of naming social media profiles on competitive mid-tail keywords and using psychologists to profile corporate brand ambassadors replete with deep personality traits. They categorized it as “social engineering.” It’s true, some of our clients’ brand ambassadors hit the ground running with pseudonyms, predetermined personal “history,” identifiable affinities, behavior patterns, strengths, personality defects, intricate psychological detail, and predictable emotions. Still our bionic avatars invest unselfishly in the communities they participate in, make and maintain mutually beneficial friendships and, frankly, bring much more to the table than most users they encounter. This leads us to ask: “If the (covertly) bionic fireman saves the cat from the tree, who cares that the fireman avatar is bionic-that is part human and part 'enhanced?' The cat ain't dead.” In the physical world, brand ambassadors represent special interests with debatably different levels of transparency, i.e., whether they reveal their biased stripes. On one extreme, the President of the United States has a press secretary who represents the administration’s positions. He or she brings their own face, personality, and personal recommendation of the President’s content to the glare of international media and constituents. The White House does not “own” the press secretary avatar, which can be a liability when said press secretary leaves office. For instance, he could decide to write a “tell-all” book revealing alleged presidential flaws. We call this the ” lovely celebrity press secretary” approach. An example of the opposite is when a “concerned” organization sends an “interested-friend” who does not share their entire life history with new friends at a community meeting. This interested-friend avatar may lurk and observe, participate in the discussion, and/or otherwise attempt to influence proceedings. Yes, she sure does have a personal agenda as does everyone in the room. As a citizen of the community, this person/avatar has every right to participate as an interested individual without having her face and personal recommendation associated with the faction she listens for, interested party or not. There are those who would decry some participation as unethical. By whose ethical structure could one base such a judgment? Judeo Christian values? No …Federal Laws? Nope….The local Ad Club? Not… An interested-friend avatar can bring relevant content to the mob, make true friends, participate holistically, add unquestionable value and, in time, even reveal his specific motivations. Does his intentional pacing of personal information cheapen preceding friendships, given by wholehearted contribution to the dialog? I think not. In online communities our clients’ interested-friends field personal messages on StumbleUpon late at night from the despondent who seeks advice, share joys when a new baby is born, garner freelance writing gig offers, have sexy interactions, and bookmark others’ fascinating content with tireless verve and sensitivity. They unselfishly give, ask for precious little in return, only manipulate to serve, earn authority figure status, behave strictly according to TOS and the very model of altruistic social media participation. Everyone has a “right” to participate. There are those who would lambaste some participation as unethical. By whose moral standards could one base such a judgment? Some social media aficionados preach that all social media participation should be fully transparent with complete personal disclosure. In many cases I agree and recommend that clients create press secretary avatars. However, social media mirrors physical life, and in the real world people bring all combinations of transparency, intent, and participatory models to the table. The same holds true online, and to expect anything different is somewhere between negligent and Pollyanna. Since the Internet was nascent, individuals and entities have taken liberties in how they portray their person or product. Ranging from healthy embellishment and subtle misrepresentations to outright fraud, the phenomena of online spin artists (or downright liars) has become a daunting maze. The Internet’s inherent veil of anonymity is low hanging fruit to tempt because the medium can easily be gamed, exploited, and abused. Reciprocally it’s possible to do tremendous good by authentic and thoughtful participation, truly designed to serve the community unselfishly. Whether one discloses their actual motivation is every person and avatar’s prerogative, the law in America, and a basic “human” right. Where does one draw the line in building “real,” fictional, and hybrid social profiles? How much should be man…how much machine? What does “authentic” really mean? What are the ground rules? What are the golden rules? At what point does any given methodology in creating corporate brand ambassadors cross over to unacceptable, immoral, or unethical? Certainly the tiers of transparency and various approaches to building social media brand ambassador avatars should be carefully evaluated according to the tactics undertaken and the potential benefits and risks. I heard I raised quite a few eyebrows at SES Toronto when I interrupted the moderator and jumped to the defense of social media evangelist Stephan Spencer’s MySpace profile building tactics. The crowd, panelists, and moderator were jumping all over him for recommending mass-friending thousands of high authority users (actors, musicians, “dancers” etc) to quickly build internal link authority and then gradually replacing these placeholder friends with “real” buddies over time from a position a position of algorithmic strength. Stephan’s among most brilliant natural search freaks in the world. As some people Twittered in righteous indignation, I offered the following: “The problem is not fake social media avatars. The problem is fake social media avatars who are not authentic.” Corporate brand ambassador social media avatars will become of the most important PR mechanisms in the world. Good avatars will do great deeds to serve companies, communities, and their own self interests. Malevolent participation will ruin communities. Open your eyes. Early adopters have already arrived with incredible organization and detail to place thoughtful “boots on the ground” in various social channels. “You will be assimilated, resistance is futile.” As social media opportunities and disasters affect companies more and more, marketing departments will be sending avatars into communities with varying tiers of transparency ranging from full disclosure press secretaries to covert interested-friends. Such steps should be taken with the greatest respect for the communities in which participation is undertaken, including risk assessment and intentional care. Marty Weintraub is the CEO of aimClear, a search focused advertising PR company and publisher of aimClear Blog. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tiers of Transparency: The Ethical Brand Ambassador"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tiers of Transparency: The Ethical Brand Ambassador"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "aimClear\n          \n            aimClear"
}