{
  "url": "https://moz.com/blog/tightening-your-ppc-spend",
  "slug": "tightening-your-ppc-spend",
  "title": "Tightening Your PPC Spend - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This post came to mind after a day of further tightening down budgets. See I work in the financial area of the world and as we all know, the recession we are in is hitting there real hard. While some of these tips are more \"financial crisis\" based (and can be loosened in better times to get more…",
  "content": "Tightening Your PPC Spend Paid Search Marketing (PPC) K By: Kate Morris July 10, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! K By: Kate Morris July 10, 2008 Tightening Your PPC Spend Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. This post came to mind after a day of further tightening down budgets. See, I work in the financial area of the world and, as we all know, the recession we are in is hitting there real hard. While some of these tips are more \"financial crisis\" based (and can be loosened in better times to get more long tail traffic), most are just good tips to be used on any campaign at any time. It All Starts with... Tracking I've said it before and I'll say it a million times after this. Tracking your leads from click to end (be it a sale or just lead completion) is worth its weight in gold (if it had a weight). Everything that is \"advanced\" PPC has to do with knowing and manipulating your data. For the following tips to work, you have to know what keywords are bringing you leads. Not how many leads your campaign is bringing you, or what group is doing well. You need to know the keyword and how it's performing. The easiest way of doing this is getting tracking set up with your various accounts. It will require putting a few snippets on your confirmation page, but it's worth it. If you are really cool, you can work with your IT team to implement a system in-house. This would use a code attached to the destination URL of the keyword. All three major PPC systems allow this. Just be sure to use the same structure on every keyword, but make it distinctive so you know what group and keyword it is. And it helps if when the searcher gets to the page, the code doesn't show anymore. But that's another article altogether. Once you get to a point where you know what each keyword cost you in each campaign, then you can do some major shifting. Budget Setting This one can be done without the above, but I had to go over that. ;) Google, Yahoo, and MSN all have budgeting systems in place so that they don't spend more of your money than you want them to. In good days, I usually set this a *little* higher than what I spend on average, just so we don't get turned off partly through the day. When you're in a budget crunch, be sure those engines know how much you want to spend and that you want it spent throughout the day. You don't want all of your $500 gone by noon now, do you? Google: Go to your campaign management screen, checkbox your campaign(s), and click \"Edit Settings.\" NOTE: Be sure the sum of all your campaign's daily budgets x 30 is not more than your monthly budget! Larger accounts with an MCC and on a special payment plan can set monthly budgets, but you gotta be special for that. :) Ask your account rep. Yahoo: For the account level, click on the \"Administration\" tab, and the top right box is your spending limit for all your campaigns. MSN: Can only be set on the campaign level like Google. Click on your campaign, and hit \"Campaign Settings.\" This is much easier if you have the beta desktop platform, but they are being really stingy with it right now. #1 Isn't the Best Are you competitive? This isn't the place for you. :) Kidding. There have been many studies done that have said being first in paid search is not always the best. There are even a few that have said, in some industries, third actually converts better. Well, I'm here to tell you that sometimes, in some keywords, fifth is sometimes better. Really. Your best friend here is testing. If you're getting a LOT of traffic from a keyword, but it's just not bringing in enough conversions to pay for itself, try bidding lower and see if the ROI gets better further down. You'll lose some traffic, but it might be better not to be first. Dayparting Every industry is different. I've said that a hundred times when it comes to PPC, and it stands here too. So think about your end user, your searcher. Are they searching for you at work? When they get home? After they've put the kids to bed? Maybe your target is the college student who is up at 2am researching stuff. If you are in the B2B world, your ads don't need to be running at 2am. You probably have little traffic then and most of it is probably spam. Look at your conversions, check what time they are coming in. If you see a significant drop in number and value at any point in the day, do dayparting. Now dayparting is something Google offers, but none of the others. (Ahem ... Yahoo? MSN? Ahem?) But Google is great at it. You can remove your ads totally at different times, or you can increase/decrease your bids a certain times. Get creative here. GeoTargeting Simple ... are you in one area? Only some states but not all? Use your geotargeting if this is the case (we'll do more here later). Google and Yahoo do it, but MSN only goes by areas, not areas, states, cities, etc. It's a smidge more limiting there. (Cough...MSN, fix it.) Phrase/Exact Match It's easy to start your campaign and just leave everything broad matched. It is. But in hard times, you might just want those people that enter certain key phrases. Be careful with this because you could end up severely limiting your traffic and market share. Don't get me wrong here. Just pay attention to your numbers. If there is one REALLY popular word with tons of impressions, good-ish clicks, but not enough conversion, look at what your broad match terms are. There might be some you don't like. You can either do negatives if you see trends, or you can bring those down to phrase or exact matches. SERoundtable has a good writeup on what they are. Getting Tougher This next one is tougher. Much tougher. The next is worse. Notice how these decisions get harder as we go? This is not easy. PPC is not as easy as some might think. If you are doing the right things it may look easy, but getting that perfect balance mean making hard decisions. 80/20 Rule Okay, 80/20 rule, we all know. 20% of your keywords account of 80% of your traffic. If things are THAT bad, if your long tail just is NOT converting and your company needs to really tighten up, turn off everything that isn't your top 20%. Yes, they may bring you good traffic now and then that will convert in the long run for a decent ROI, but those $5, $10, $20 spends add up in a month. Again, only use this if you really have to because the possibility of losing good traffic is there. The End of All Things And at the end of all things... sometimes a platform just isn't for you. One of the best I've found is not a search engine, but rather another type of PPC platform (DM me if you want details). But I keep a hard look on all ROI, spend numbers, conversions, etc. If after a few months (preferable time period) or weeks (if things are just really THAT hard), the ROI is still negative, turn it off. Not indefinitely, but it might be in your best interests, especially if you are ranking well naturally. Now I don't want to hear down the road, \"But Kate/SEOmoz told me to turn that off!\" These, as with everything on SEOmoz, are just suggestions from experience. Each company and industry is completely different. If you aren't sure, ask someone for help and advice. PPC is the one area you can mess up BAD and really quickly. Do your analysis, think about your company goals, and work from there. Conclusion It's really amazing what you find out you can remove in tough times and probably won't miss later on. Might be one of the best things to come out of this recession for your company. As I said when we were talking about the recession at SMX Advanced, we are probably not getting our budgets cut as much as other departments, but we do need to be a little more careful about what we do with the money we are given. Kate Morris is the In-House SEM for RateGenius. You can find her on her blog and on Twitter. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tightening Your PPC Spend"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tightening Your PPC Spend"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kate Morris\n          \n            Kate Morris\n          \n            Kate Morris"
}