{
  "url": "https://moz.com/blog/tiktok-algorithm-seo",
  "slug": "tiktok-algorithm-seo",
  "title": "TikTok SEO: Understanding the TikTok Algorithm - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In the first chapter of this series, we dug into the search behavior on TikTok and why it should matter to SEOs. In this article, we are going to cover the ins and outs of the TikTok algorithm, and how to leverage it to get more users looking at your brand’s content.",
  "content": "TikTok SEO: Understanding the TikTok Algorithm Social Media | Advanced SEO By: Lidia Infante October 26, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lidia Infante October 26, 2022 TikTok SEO: Understanding the TikTok Algorithm Social Media | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. TikTok has quickly become a viral sensation, with millions of users across the globe spending hours scrolling through the app's endless supply of videos. But for marketers, TikTok's greatest asset lies in its algorithm. In the first chapter of this series, we dug into the search behavior on TikTok and why it should matter to SEOs. In this article, we are going to cover the ins and outs of the TikTok algorithm, and how to leverage it to get more users looking at your brand’s content. The principles behind the TikTok algorithm Before we dig into the algorithm’s ranking factors, a bit of background. In 2020, TikTok’s CEO Kevin Mayer published a manifesto on the importance of transparency for tech companies, especially when it comes to their content algorithms. Mayer committed to being more open than its competitors, indirectly challenging Meta and Google. Luckily for us marketers, TikTok has kept its promise and has some solid documentation on how their algorithm works. In this article, I will be combining that information along with secondary sources and inference based on general social media principles. Surfacing interesting topics A few months ago, I was raving about TikTok to my partner. He is big on privacy and didn’t love the idea of joining the platform, but I convinced him. The moment he joined the app, his feed was flooded with bikini-clad teenagers, crude physical “humor” and what I can just describe as a bunch of British guys acting very lad-y. All the platform knew about him is that he is young(-ish), male, and British. The content TikTok was serving was based on his demographic data. The algorithm hadn’t had time to work its magic then, but when it did, he could hardly put down his phone. TikTok collects data on how users interact with different videos. Based on this information, TikTok can determine a user's interests and serve them related content. TikTok uses the content of each video to understand what topic it pertains to. This is based on the use of hashtags, video descriptions, the TikTok sound used, and the textual spoken audio. Based on what we know about other platforms’ natural language processing capabilities, this is likely more effective in English than in other languages. The platform gets better at tailoring this content for you as you engage with it, but it also bases its recommendations on demographic data such as gender, age, and location. According to their privacy policy, TikTok adds “inferred information” to your profile, such as age-range, gender, and interests. Knowing this, it would make sense that TikTok puts audiences into different interest cohorts. By connecting different topics by how closely related they are, TikTok should be able to surface topics you’re likely to enjoy, even if you’ve never engaged with them on the platform before. Let’s see an example. I like interior design, so I’m likely into IKEA hacks, which means I’m likely into DIY. If I’m into home improvements, I’m likely into crafting. Boom, a cross-stitching video reached my feed, and I love it. @tiktokswithtom Cross stitch 🤷‍♂️ #fyp #fypシ #foryou #crossstitch #crossstitchoftiktok ♬ Che La Luna - Louis Prima with Sam Butera & The Witnesses Bursting the filter bubble effect TikTok’s transparency policy came about after receiving some criticism around how their algorithm creates echo chambers that promote radicalization and the spread of misinformation. Now some platform representatives have spoken about how the platform is trying to prevent that. Youtube and Facebook have come under fire for this before, but the truth is that any platform with a content discovery algorithm that relies on engagement is susceptible to creating echo chambers and promoting radicalization. Human psychology tells us that we’re more likely to engage with content that elicits a strong emotional reaction. This incentivizes content creators to promote content that makes us angry or afraid. TikTok’s answer to the filter bubble effect has been somewhat simple: the platform will show you random content from time to time. In order to avoid homogeneity of content, the app has started showing users content that they don’t usually engage with. This includes surfacing random hashtags, video aesthetics, sounds, and topics. The app tries to keep things fresh by avoiding content repetition, so you’re unlikely to see two videos by the same creator or using the same sound in a row. Another interesting incorporation into the algorithm is showing you fresh content that has not had any engagement yet. If you’re a TikTok user, I’m sure you have noticed this. Is this enough to prevent creating echo chambers? Probably not. Familiarity or the mere exposure effect will make you engage with the content you see most frequently, so there’s still a pretty high chance of developing echo chambers. According to the teachings of one of my favorite psychology textbooks, we’d need to see about 50% of this random content on our feed to break the behavioral learning and bias towards what we already like. Obviously that would be against the business interests of most social media platforms, so it seems unlikely to happen. With this background and context in mind, let’s dig into TikTok’s ranking factors. TikTok ranking factors As I mentioned above, this list of ranking factors is based on a mix of TikTok-confirmed features as well as unofficial sources and general social media practices. 1. Video engagement One TikTok ranking factor is engagement, which includes likes and comments as well as watch time and profile visits. When a TikTok video has a high level of engagement, it means people are taking the time to interact and engage with the content. This also includes replays, follows, bookmarks, and tagging a video as \"not interested\" (which affects your video negatively, of course). Engagement shows TikTok that the content is worth pushing out to more users, thereby helping it rank higher on TikTok's algorithm. Not all forms of engagement are created equal, of course. A comment or share are stronger engagement indicators than a like. We see this on TikTok’s documentation and it’s true in many other social media platforms too. According to TikTok’s documentation, engagement is measured at video level, not at account level. The profiles a user follows on TikTok also contribute to determining the user’s interest profile. Following gardening accounts indicates to the algorithm even further that you’re interested in gardening videos. The follower count or the previous performance of an account doesn’t directly impact the rankings of their videos. However, having a high follower count can indirectly help your videos perform better, as it will expose them to more eyes through your followers. If your followers engage with your content, that engagement can help you reach bigger audiences. This is a big shift from classic forms of social media marketing, were the previous performance of posts on a profile are thought to influence the reach that future posts will have. 2. Discover tab engagement Another way in which TikTok determines a user’s potential interest in a video is by analyzing their interactions with TikTok content beyond just video. Searching, clicking on a hashtag, exploring a trending topic, or viewing videos from a specific sound will weigh towards the video recommendations that users receive on their For You feed. 3. The content of the videos As an SEO, I can’t help but draw a parallel between on-page SEO and the TikTok ranking factors within the video content. For the platform to be able to recommend videos of topics that you like, it needs to understand what each of the videos are about. There are several elements within the uploaded videos that help the app understand what topic and emotional tone each video has. Let’s take a look at what those elements are: The video’s visuals. According to their privacy policy, TikTok can “detect and collect characteristics and features about the video and audio recordings” by identifying objects, scenery, and what body parts are present in your video. This is used for content moderation and to power their recommendations algorithm.The audio. The platform can process the “text of words spoken” within your videos to further understand what they’re about. Text over the video. Using text over the video also contributes to that understanding of the content. Adding the text natively within the platform might provide a stronger signal, based on the way other content ranking algorithms work.Title and hashtags. This is the OG signal for TikTok and it’s the one they’ve publicly discussed the most. The title and hashtags used in the video help tell TikTok what the video is about, but they can also influence rankings indirectly by affecting engagement and discovery.TikTok sounds. The sound being used in a video is a ranking factor on its own, as it helps the platform understand a video’s content. But the biggest way in which sounds affect your content’s performance is jumping on a trend. Trending sounds get a ranking boost for a short while, since they can predict user engagement. 4. Content language There are three language preferences you can set in your account: app language, preferred languages, and translation language. This should be pretty self-explanatory, but there is an interesting aspect to explore here. You can select several preferred languages and TikTok prompts you to select the languages you understand. However, you can only select one language for your app and one for your automatic content translations. It would not surprise me if TikTok used those settings to establish which of your preferred languages is actually your favorite. 5. Device suitability TikTok explains in their documentation that the user’s device matters in the videos that users get shown, but they have not specified exactly how. According to TikTok, the information they receive about your device is anything from user agent, mobile carrier, time zone settings, model and operating system,and network type to screen resolution, battery state, or audio settings. My guess is that older and slower devices get shown shorter and lighter videos more often, to prevent disrupting the user experience if the phone’s performance can’t keep up. 6. Creator locality There is one line on TikTok’s official documentation that really caught my eye: “A strong indicator of interest, such as whether a user finishes watching a longer video from beginning to end, would receive greater weight than a weak indicator, such as whether the video's viewer and creator are both in the same country.” There isn’t a lot of clarity about how location is used as a ranking factor, but we know it exists. We can understand that proximity between viewers and creators helps in ranking, but we don’t know at what level this is measured. TikTok tracks user location through SIM card information, IP address, and, if you give your permission, GPS. 7. Ineligible content TikTok has two ways of moderating content: removing it or making it ineligible to rank. These include your usual suspects such as violence, nudity, and hate speech, along with some others. There are some interesting types of content that are ineligible to appear in the For You page: Content uploaded by users under 16 — so don’t use your company’s actual age to make an account. Content that includes QR codes — TikTok wants to know what you’re linking out to and get a piece of the cake if it’s a product recommendation. Content that manipulates users into engaging with the video or user — all that “tap the screen twice to see something magical” stays on Instagram.Duplicated content from TikTok or other platforms where the user doesn’t add any significant creative edits.Dangerous stunts not performed by professionals.Content that features tobacco. 8. Native content creation I am pretty confident that building content using TikTok’s native tooling can help boost your content ranking. Other social media platforms tend to favor native content and native content creation in their algorithm, so it would make sense for TikTok to do the same. For the sake of transparency, this is just an educated guess and not an official ranking factor. Instagram, for example, has improved their native video creation tools for Reels and Stories while demoting content with watermarks from other platforms. Facebook favors native video over Youtube embeds. LinkedIn favors posts without external links while offering a native blog platform. TikTok’s own analysis shows that companies who used their native creative tools saw 14 times more engagement than those who didn’t. There is an indirect mechanism that could lead to native TikTok videos performing better: the familiarity of users with the type of content the app can produce natively. Users are very quick to spot an overproduced video as an ad and will tend to engage with it a lot less. This blog post on TikTok for Business supports that theory, by telling brands: “don’t make ads, make TikToks”. TL;DR In conclusion, the TikTok algorithm aims to show you content you’ll find interesting while avoiding filter bubbles. Based on the user's interactions with the app, TikTok is able to suggest videos that the user might be interested in. This is done through analyzing likes, comments, watch time, replays, follows, and bookmarks. The app is also able to understand the content of the videos through visuals, audio, text, and hashtags. Additionally, TikTok takes into account the language preferences, device information, and locations of both the user and the creator when suggesting videos. What unique strategies have you implemented to perform well on TikTok? Share with us @LidiaInfanteM and @Moz on Twitter, and be on the lookout for part three of this TikTok SEO series: how to rank in 2022. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "TikTok SEO: Understanding the TikTok Algorithm"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "TikTok SEO: Understanding the TikTok Algorithm"
    },
    {
      "level": "H2",
      "text": "The principles behind the TikTok algorithm"
    },
    {
      "level": "H3",
      "text": "Surfacing interesting topics"
    },
    {
      "level": "H3",
      "text": "Bursting the filter bubble effect"
    },
    {
      "level": "H2",
      "text": "TikTok ranking factors"
    },
    {
      "level": "H3",
      "text": "1. Video engagement"
    },
    {
      "level": "H3",
      "text": "2. Discover tab engagement"
    },
    {
      "level": "H3",
      "text": "3. The content of the videos"
    },
    {
      "level": "H3",
      "text": "4. Content language"
    },
    {
      "level": "H3",
      "text": "5. Device suitability"
    },
    {
      "level": "H3",
      "text": "6. Creator locality"
    },
    {
      "level": "H3",
      "text": "7. Ineligible content"
    },
    {
      "level": "H3",
      "text": "8. Native content creation"
    },
    {
      "level": "H2",
      "text": "TL;DR"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    }
  ],
  "author": "Lidia Infante\n          \n            Lidia Infante\n          \n            Lidia Infante"
}