{
  "url": "https://moz.com/blog/time-for-guest-blogging-with-a-purpose",
  "slug": "time-for-guest-blogging-with-a-purpose",
  "title": "Time for Guest Blogging With a Purpose - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Guest blogging isn't dead. Being a Spammy McSpammer who only guest blogs to build links is dead.",
  "content": "Time for Guest Blogging With a Purpose Blogging By: Jennifer Sable Lopez January 23, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez January 23, 2014 Time for Guest Blogging With a Purpose Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Dear Readers, before getting to the meat of the post about how to make guest blogging work for you and not end up looking like a spammer, I'd like to tell you a little story. A story about when Matt Cutts single-handedly changed the course of my day. The story goes a little something like this... It was a chilly, yet calm Monday afternoon in the Moz office, as I was having lunch at my desk and watching over all the Moz social channels (a task I rarely do these days, as we have a team of awesome ladies who usually does it). As I was checking my personal Twitter feed though, I saw a tweet from Matt Cutts pointing to his latest blog post, \"The decay and fall of guest blogging for SEO.\" New blog post: The decay and fall of guest blogging http://t.co/P0BnRufnKQ — Matt Cutts (@mattcutts) January 20, 2014 Quickly I jumped over to read the blog and… BOOM, this was the first paragraph: Okay, I'm calling it: if you're using guest blogging as a way to gain links in 2014, you should probably stop. Why? Because over time it's become a more and more spammy practice, and if you're doing a lot of guest blogging then you're hanging out with really bad company. \"Oh dear,\" I thought to myself. \"My day just got a whole lot more interesting.\" It didn't take long before people starting asking questions about whether sites like Moz and our YouMoz blog would be in danger. People were unsure as to what exactly his post meant. Was he saying there was going to be an algo change, as Rand predicted in last week's Whiteboard Friday? Was he saying that all guest blogging was dead, or that all guest blogging had become spammy? Did he mean that all links in guest posts now should be nofollowed? Essentially, the SEO world got its crazy on. http://www.latenightwithjimmyfallon.com/blogs/2010/04/tgif-gif-41/ Immediately I was fielding all sorts of questions, from how Moz discourages spam links in guest posts, to how it'd be crazy to ban us from Google. There were also lots of jokes going on… you know, things like letting Keri (our YouMoz manager), stay longer on her vacation. But I digress; let me get back to Matt's blog post. In it, he also has this to say: \"Ultimately, this is why we can't have nice things in the SEO space: a trend starts out as authentic. Then more and more people pile on until only the barest trace of legitimate behavior remains. We've reached the point in the downward spiral where people are hawking \"guest post outsourcing\" and writing articles about \"how to automate guest blogging. \"So stick a fork in it: guest blogging is done; it's just gotten too spammy. In general I wouldn't recommend accepting a guest blog post unless you are willing to vouch for someone personally or know them well. Likewise, I wouldn't recommend relying on guest posting, guest blogging sites, or guest blogging SEO as a linkbuilding strategy.\" I giggled at the \"this is why we can't have nice things in SEO\" line. In fact, I'm pretty sure I'd heard it phrased exactly that way before. But what really caught my eye was this, \"We've reached the point in the downward spiral…\" Wait… hadn't Rand said the exact same thing three days ago in his Whiteboard Friday? Wait… wasn't it called \"Why Guest Posting and Blogging is a Slippery Slope???\" Of course, others caught on to this as well. @CyrusShepard @Moz did @randfish speak to @mattcutts last week before doing the WBF as it is strangely right on topic? — Cauze Marketing (@CauzeInbound) January 20, 2014 But the point really isn't about how Rand can see the future; it's about how Matt wasn't actually saying anything we didn't already know. Right? No, seriously. Ok, ok, so maybe it wasn't totally obvious to everyone, or else the post wouldn't have been written, eh? So how do you proceed if you were using guest posting as a link building strategy? (By the way, guest posting is a tactic, not a strategy.) Guest post with a purpose As with anything, you don't want to be out there trying willy-nilly to get your posts on every blog for the sole purpose of building (probably bad) links. It's important to have this tied to your business and marketing goals, as you would with any other tactic. SEO is only one piece of the larger strategy, and if you focus solely on writing posts for link building purposes, you're missing out on a ton of other possibilities, such as: Branding, branding, branding Build credibility in a specific niche Increased traffic (oh, HELLO) Exposure to new audiences Community building! Authorship: The more legitimate posts you write and connect to your Google+ account, the more likely your lovely face will show up in the SERPs. Imagine if you were to focus on writing an amazing blog post, with actionable information, relevant to the community of the blog you're pitching. No, really—you should do that. Believe me, that's how you're going to get a post on YouMoz. :) As Sir Dr. Pete (I added the Sir, because he's older than me ;) ) so eloquently stated today in an internal thread about this very topic, \"You've got to make sure you're not a one trick link-building pony. I mean, any time you base 80% or more of your link profile on one tactic/gimmick, you're going to eventually be in trouble. The problem isn't guest-posting, it's abuse.\" People, the doctor has spoken. But how, you ask? How do you ensure that you don't come across as spammy or a \"one trick link-building pony?\" For this, I'd like to introduce you to Everett Sizemore. He's an Associate here at Moz, and mostly focuses on helping out in Q&A. But in his real job, he's the Director of R&D, Special Projects, and Moonshine over at seOverflow. (Hey Everett, how does one go about getting an amazing job title like that, anyway??) Over the past few days we've had some email discussions about guest posting. We discussed how Google might determine a post is spammy, how they'd determine one was legit, and ways in which SEOs and all the other online marketers out there should be guest blogging legitimately. Well, Everett had the answer that we all agreed was the best answer, so now I happily present to you... Everett's tips on how to be a better guest poster He stated that seOverflow wasn't panicking in the least because they were changing their internal guest posting guidelines to now include language like this: Develop a relationship with the publisher outside of \"guest blogging platforms\" in order to customize the relationship better. Pitch a series of content instead of one \"guest post\". Describe yourself as an \"expert contributor\" not a \"guest author\", explain the difference if you have to, and explain to the publisher why this is better for their site. Don't contribute to sites that want to publish your content under a general \"guest author\" account. Always insist on your own contributor/author account, and markup with rel author. Work with authors who have Google profiles to which they can add contributor to links. If they don't have one, help them get one. Go back to the same authors for similar content to develop them as experts in a specific niche (e.g. if John Smith did an article for a client on PBX solutions and you have need for another piece of content about VOIP, office phone systems, etc... go back to John Smith again) If the resident authors don't have their bio below/above every post then our content shouldn't have one either. Stop thinking about links. Think about traffic and exposure instead. Links are fine if they are relevant, but don't let a nofollow policy keep you from contributing to a major site with lots of traffic in the clients' niche. Track the right metrics, which starts with aligning our goals with the clients'. Everett also said this in the email: With that said, this 'tactic' is taking a back seat in our arsenal of options in any content marketing strategy. Our goal these days is to find the influencers in any niche and pay an expert to write expert-level content, no matter where it gets placed, to help further our clients business goals, primarily through online customer acquisition driven by good content. That's good stuff right there. Essentially, be a real person, write posts with purpose beyond just building links. How can guest blogging sites stay credible? Since we're on the subject, let's talk about sites like the Huffington Post, Tech Crunch, Smashing Magazine, and even the Google Analytics blog. All of those sites, along with our own YouMoz and Moz Blog, allow guest posts. One thing that's common across all of these sites is that they have rigorous editing. They simply don't allow for just anyone write a post about anything. They read through posts for accuracy, to ensure that links aren't simply \"link drops,\" and to ensure focus on actual, good, helpful content. But let's say you allow guest posts, but you're not quite as strict about things right now? Here are a few tips to make sure your blog stays credible, even with guest posts: Ensure that the content is original. We use both Copyscape and Small SEO Tools to look for plagiarized content. Make sure the author is a real person. Have people create an account on your site and link it to their Google+ page. This ensures that you're getting real people, verifiable on their Google+ and other accounts. See if they've participated in the community before. This is another good way to make sure they know the type of content that your community likes. Double check the links. Now, many links are legitimate and make perfect sense, but be sure to click through to each one. Do you really want to \"validate\" that page? Only allow links with a purpose. This list is really just the beginning. For a more thorough review of a good way to allow guest posts, check out Keri Morgret's post about how to guest post on YouMoz. Guest blogging isn't dead Let me wrap this up by stating again that guest blogging isn't dead by any means. But being a Spammy McSpammer only caring about links, and not caring about real content, community building, branding, and all those other great benefits... is dead. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Time for Guest Blogging With a Purpose"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Time for Guest Blogging With a Purpose"
    },
    {
      "level": "H2",
      "text": "Guest post with a purpose"
    },
    {
      "level": "H3",
      "text": "Everett's tips on how to be a better guest poster"
    },
    {
      "level": "H3",
      "text": "How can guest blogging sites stay credible?"
    },
    {
      "level": "H3",
      "text": "Guest blogging isn't dead"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}