{
  "url": "https://moz.com/blog/time-distribution-for-effective-online-marketing",
  "slug": "time-distribution-for-effective-online-marketing",
  "title": "Time Distribution for Effective Online Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Since we're in the optimization business, I figured it would be valuable to illustrate the ideal use of time for a website owner or a website team. These are, of course, my personal recommendations on the subject, but I believe that to a large extent, a close approximation of these percentages will…",
  "content": "Time Distribution for Effective Online Marketing Online Advertising By: Rand Fishkin September 28, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 28, 2006 Time Distribution for Effective Online Marketing Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Since we're in the optimization business, I figured it would be valuable to illustrate the ideal use of time for a website owner or a website team. These are, of course, my personal recommendations on the subject, but I believe that to a large extent, a close approximation of these percentages will yield the highest return on your invested time. Each of the six activities in my chart are designed to help grow the popularity, quality and profitability of an online venture. This chart applies equally to a professional blog (though content creation might skew slightly higher while features/designs skew lower)or an e-commerce website (where testing/refining based on visitor data might need a bump), to social, Web 2.0-style ventures. Below, I've characterized the specific tasks involved in each process: Building Viral-Worthy, Authoritative Content (40%)The goal here is to create articles, blogs posts, forms, applications, and multimedia content that will provide value to your visitors. I use the term viral-worthy to refer to pieces that have the ability to spread naturally. Even if the content is highly focused, try to picture an interested, passionate visitor finding your work on the site - would they be likely to email it to a friend, save it in their bookmarks or, at the least, return to the site in the future in the hopes of finding more pages like it?Likewise, authoritative resources are those that are unquestionably head-and-shoulders above other available documents on the web. Your coverage, detail, research, writing quality, and entertainment factor should make it impossible for your competitors to catch up. When in doubt, read the Wikipedia article on your subject, then create something 100X better.Content creation deserves the largest devotion of time because it is the anchor of a great site. All of your other efforts, from design to analytics to promotion, will be wasted if your site's material isn't intensely compelling. I think of content in a similar way to conversion rate - if you run a site with a 2% conversion rate, you need twice as many visitors as your competitor with a 4% rate. With content quality, the better it is, the fewer people you need to see your work before it spreads like wildfire across the web._ Developing New Features/Designs (25%)This component is the cousin to content creation. The goal is to never rest on your laurels when it comes to your site's offerings. If you currently have comments in your blog, consider upgrading to a threaded structure. If your e-commerce site has live chat, think about adding video demos. If your lackluster GUI looks and feels like 2002, upgrade it.Development most often is tasked to programmers, designers, and site architects - the people responding for building the backbone of the site. Development is also an item that fluctuates drastically in the time commitment required. During a re-design and launch, it may consume 75-90% of your time for 4 months, then have very little upkeep over the next 6. Don't worry - this is normal, but guard against letting new development wait too long. Even if you're the leader in your field now, the only way to stay there is to consistently stay on the cutting edge._ Keyword, Industry, & Competitive Research (10%)Every week should allow time for, at the least, an evaluation of the changes your competition has made to their sites. Along with classic keyword research to find terms to target, you should also consider: Identifying & researching new players in your market Investigating new opportunities on the web that could be leveraged to the benefit of your site Changes in keyword popularity or the introduction of a new phrase that could spell opportunity Analysis of your industry overall to find undiscovered niches or underserved markets_ Participating in Online Communities (10%)This often has one of the highest rates of returns for informational/resource sites (including blogs). The idea is to find forums, blogs, social media sites, and other communities on the web where other industry mavens gather. Simply by building a positive profile through your comments, posts, and participation, you can reap tremendous rewards in links, attention, and positive reputation._ Testing/Refining Based on Visitor Data (10%)Though this may seem like a task suited primarily to e-commerce sites, it applies to service industry brands, blogs, and informational sites alike. Your visitor data, particularly if it provides action tracking, can show you which links are most valuable, which keywords return the highest value, where to focus your advertising efforts, and how to get more visitors to \"convert,\" however that term may apply in your situation.The act of analysis itself should be less than half the time you invest here. The other portion should be used to make changes to your site based on your theories of performance, test, analyze, refine, and repeat. Ad placement, button use, contextual clues, headlines, calls to action, and hundreds of other factors all play a role. Start experimenting and you'll quickly learn what works for your particular audience._ Manual Link Building (5%)I'm not just making this element the lowest priority because of its distastefulness; I really believe that of the items you can spend your time on, one-off linkbuilding has a particularly low ROI. 95% of the value will come from just a few dozen links that you'll be able to acquire out of a few hundred. Pursue high-traffic, high-relevance links with fervor - devote a great deal of time and effort to obtaining the individual links that you believe will provide the greatest value, and don't spend too much time on the rest. Link building by hand can be demoralizing and unrewarding, but it's too important to ignore completely. Give it your all a couple hours each week and then go back to content. Your capillaries will thank you. Obviously, not everyone is going to agree that this is the best use of time, and there may even be small elements that don't squarely fit into one of the above categories. However, I think that recognizing the relative value of each of your own website development and marketing tasks and scheduling out time for them individually will give you a clear set of goals and schedule you can stick to. p.s. This model scales fairly well to web teams - a copywriter, an SEO/marketer, and a developer can easily split up these tasks for maximum efficiency (and yes, I recommend that all of them contribute to content creation). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Time Distribution for Effective Online Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Time Distribution for Effective Online Marketing"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}