{
  "url": "https://moz.com/blog/tips-and-musthaves-for-your-ecommerce-platform",
  "slug": "tips-and-musthaves-for-your-ecommerce-platform",
  "title": "Tips and Must-Haves for your eCommerce Platform - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Choosing an eCommerce platform can be a terribly frustrating experience because of the options and packages available, the misinformation, the pushy sales reps, the time and money investment, and so on. I want to talk about this decision because of this experience, but I don't plan on making any…",
  "content": "Tips and Must-Haves for your eCommerce Platform Technical SEO By: Mike Pantoliano February 27, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mike Pantoliano February 27, 2011 Tips and Must-Haves for your eCommerce Platform Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Choosing an eCommerce platform can be a terribly frustrating experience because of the options and packages available, the misinformation, the pushy sales reps, the time and money investment, and so on. I want to talk about this decision because of this experience, but I don't plan on making any platform recommendations. No, no. That's really up to you and the resources available to you. But I'm happy to give you a rundown of the SEO elements you'll want to consider in your decision making process. If you're not in the market for a new eCommerce platform, maybe some of these common platform missteps will convince you that it may be time to consider. Proper Product Image Handling Your product imagery can provide awesome conversion benefits and make a strong differentiator in your niche. Unfortunately, a lot of eCommerce platforms don't provide the necessary control and commit a lot of SEO missteps (like generating a new URL when the product images are cycled). Images that create new URLs is a big no-no. Vat19.com's Giant Gummy bear page passes this test as the URL doesn't change when the delicious image is changed. Page-Level Control of Head and Meta content Sure, it makes sense for your title tag, H1, and image alt attribute to default to the product name, but if you don't have the option to create custom meta information you could be in for some frustration. One should be able to edit titles, H1s, image alt attributes, meta descriptions, etc. from every product page in the admin. Additionally, it's important that the content in the HEAD section of each page is editable. If I want to drop a Google Website Optimizer script onto one product page, it shouldn't be impossible. The same goes for adding a rel=canonical, meta robots, or a page-specific JavaScript snippet. Product Reviews Product reviews are awesome for conversion, and it seems like many eCommerce platforms today offer some sort of built-in review system. Reviews can also have a positive impact on your product pages' rankings with the naturally keyword-rich UGC it generates. Unfortunately, tons of product reviews systems utilize JavaScript to call the reviews after the page loads, providing no SEO benefit. Fortunately for Amazon, this review is seen by the Googlebot because it's rendered in HTML To make sure your product reviews are search engine readable, view source on a page with reviews and be sure the text appears in the code. Robust Sitemap and Product Feed Control Most modern eCommerce platforms submit Sitemaps to the search engines, but there's so much more that can be done. For instance, segmented Sitemaps is an awesome way to monitor indexation of different sections of your website. If your platform doesn't allow you to adjust your Sitemaps, you'd be missing out. Additionally, product feeds allow you to submit your products to comparison shopping engines like Google Merchant Center, NexTag, Shopping.com, and many more. Google Merchant Center is the big one; an eComm platform that auto submits to GMC opens up more possibilities to appear for queries that trigger products in blended search, as well as product extensions for PPC advertisements. You want this. Your eComm platform should allow it. 301 Redirects, True 404 pages, and Other Rewrite Control Some of the hosted eComm platforms allow no control over 301 redirects and URL rewriting, and this is a big problem. Similarly, many platforms don't send a proper 404 status for a dead page, opting instead to 302 redirect to a (status 200) 404.html, or worse, the homepage. As products are removed from your catalog, you should be able to 301 redirect that old URL to a related product, or send a proper 404 status message. Anything else will cause confusion for the search engines AND users. Lastly, and most obviously, URLs should be rewritable to allow for keywords-richness. Contrary to the friendly message, everything is not ok. This \"404\" page is seen just like any other resolving URL by the search engines. Header checker courtesy of Andy Stratton's checkmyheaders.com. Filtered Navigation that Doesn't Suck Faceted or filtered navigation is a contentious point amongst eCommerce platforms as very few platforms do it exactly the same. First and foremost, a filtered navigation that relies on parameters and session IDs can be very difficult, if not impossible to build in an search engine friendly manner. In many cases, the Googlebot could waste a ton of your crawl bandwidth crawling in and out of navigational filters. Additionally, it can become a information architecture nightmare, with the Googlebot crawling deeper and further from the homepage to reach product pages. A more modern approach to faceted navigation is through using AJAX to filter products. Just make sure that there's an HTML crawl path to your products, and you're not hiding any really good organic landing pages within your AJAX navigation. There's a lot of ways to approach this issue, and its worthy of its own discussion. See Rand's Whiteboard Friday on the matter. The general rules for a search friendly faceted navigation: Keep the crawlers from crawling endlessly through filters. Remember, rel=nofollow and canonical don't preserve crawl bandwidth. Don't hide great organic landing pages from the crawlers by using AJAX. AJAX is ok, as long as there's an alternate path to pages you'd like to rank. Robots.txt can be used as a solution but must be done carefully (for example, creating a rule to disallow access to URLs with 2 or more parameters/filters). Site Speed At this point I'm really more concerned with site speed from a conversion standpoint, rather than as a ranking factor, but there's reason to believe site speed will see increased importance in the algorithms' future. An advanced cacheing ability is a must for the modern eCommerce platform. A few more SEO elements Automatically generated but manually editable HTML sitemap. Simple breadcrumbs. Preferably generated in a way that triggers Google's enhanced snippet: Navigation that non-JavaScript users (and crawlers) can navigate. Image-based navigation should use alt attributes or css image replacement. See Amazon's approach with css, images, and JavaScript disabled visible on the right: DNS control to allow CNAMEs, content delivery network integration, subdomain usage, etc. Customizable (or no) file extensions in URLs. domain.com/product/ rather than domain.com/product.php. Blog integration on a subfolder. If this isn't possible and your blog has to go on a subdomain (or worse, another domain entirely), that could be a sign of even more frustrating control issues. Some Non-SEO elements There's obviously TONS of non-SEO related features that should be included in a good eCommerce platform. Here are just a few. Strength in Numbers and Extendability - At some point your eCommerce platform will frustrate you for one reason or another, and you'll feel a lot better if there's a vibrant community and developers building extensions behind it to help. Data Portability - Can you export and import all of your data from the admin? If one of your manufacturers makes a change to all of their products that requires a small edit to all of their descriptions, can this be done simply? And what about a few years later when you're ready to move to a new platform? Internal Site Search - Your platform should definitely have a strong internal site search functionality, or at least allow for full integration of a third party's search solution. Updated, but Not Too Often! - When was the last time your platform updated? 3 years ago? Well, a lot has changed since then, I'm not sure I'd trust that. At the same time, updates every other week can be extremely frustrating. Great Checkout Process - We'll leave what \"great\" actually means to the conversion rate experts. Needless to say, this is a HUGE differentiator for eComm platforms. I'll also lump advanced control of shipping rules, gift cards, and coupon codes in here as well. That's Everything! </sarcasm> I don't envy the engineers behind today's eCommerce platforms. They're tasked with building a system that's both simple yet robust, 'just gets out of the way' yet 'all-in-one', user friendly yet secure, and so on. No fun. I don't expect that I've covered every bit of must-have functionality either, but I hope I've got most of it. If you've got any particularly frustrating stories from dealing with your eCommerce platform, follow me on Twitter and let me know, or sound off in the comments. Obligatory \"You Forgot Feature X\" Updates: From @yoast: support for rich snippets. Google recently added eCommerce sites to the list of sites that can utilize rich snippets. Fortunately, if your GMC feed is properly set up, you may not have to do anything to take advantage. From @dergal: Analytics. I left built-in web analytics out originally because I'm a die-hard Google Analytics junkie, but if done well it can be a nice feature to have. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tips and Must-Haves for your eCommerce Platform"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tips and Must-Haves for your eCommerce Platform"
    },
    {
      "level": "H2",
      "text": "Proper Product Image Handling"
    },
    {
      "level": "H2",
      "text": "Page-Level Control of Head and Meta content"
    },
    {
      "level": "H2",
      "text": "Product Reviews"
    },
    {
      "level": "H2",
      "text": "Robust Sitemap and Product Feed Control"
    },
    {
      "level": "H2",
      "text": "301 Redirects, True 404 pages, and Other Rewrite Control"
    },
    {
      "level": "H2",
      "text": "Filtered Navigation that Doesn't Suck"
    },
    {
      "level": "H2",
      "text": "Site Speed"
    },
    {
      "level": "H2",
      "text": "A few more SEO elements"
    },
    {
      "level": "H2",
      "text": "Some Non-SEO elements"
    },
    {
      "level": "H2",
      "text": "That's Everything! </sarcasm>"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mike Pantoliano\n          \n            Mike Pantoliano"
}