{
  "url": "https://moz.com/blog/tips-for-being-a-local-search-superhero",
  "slug": "tips-for-being-a-local-search-superhero",
  "title": "Tips For Being A Local Search Superhero - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Local search doesn’t have to be the arch-villain that you keep fighting but never really beat. With some knowledge, hard work, and a few tools in your utility belt, you can be the local search superhero that you’ve always wanted to be…",
  "content": "Tips For Being A Local Search Superhero Local SEO By: Greg Gifford November 27, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Greg Gifford November 27, 2013 Tips For Being A Local Search Superhero Local SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Greetings, local search fans! I’m here to follow up on my recent Mozinar (How to be a Local Search Superhero) and share some more in-depth info to answer some of the questions that came up during the Mozinar. Local search doesn’t have to be the arch-villain that you keep fighting but never really beat. With some knowledge, hard work, and a few tools in your utility belt, you can be the local search superhero that you’ve always wanted to be… This post is going to cover three areas that seemed to resonate the most with attendees – Google+ Photos, Google Authorship, and Customer Reviews. Nearly every question that came in fell into one of those areas. I also got a pretty good number of questions about multi-location businesses, but since you’re not here to read an epically long blog post, I’ll post a later follow up to concentrate on those questions. But before we dig in, I wanted to answer this awesome question from Stephen Perl: How do you steer clients away from depending upon ranking for reporting for local search? I’ve been asked this question a lot lately, especially with the recent announcement about (not provided). Since we’re losing all that keyword data, it seems like a lot of SEOs are planning on leaning more heavily on ranking reports… and that’s not a direction I’d recommend going. I work almost exclusively in the automotive vertical, and most auto dealers think that ranking reports are the ultimate gauge of SEO success. I’ve actually found an incredibly simple way to show them how unreliable ranking reports are as proof of ROI. Every business is money driven, so you have to show them that ROI can’t be determined by a ranking report. I simply point out that ranking #1 for 500 terms is easy – but that the phrases would be wacky long tail terms that no one would ever search for… so 500 #1 rankings would result in a 0% increase in traffic, leads, and sales. We explain that we’ll monitor ranking, but the important things to really keep an eye on are increases in organic search traffic and increases in website conversions. Sell your clients on the fact that you want to provide useful reports that show actual impact on their business – not pages and pages of useless ranking data. Most business owners don’t really understand SEO, they just know that it’s important and it results in higher rankings. If you briefly explain how it works, how it will affect their website, and why it’s important to track data points that matter, it’s fairly simple to steer clients away from ranking report dependence. People are always asking about the ridiculously ginormous cover image on Google+. The actual dimensions are 2120x1192 – but lucky for you, I’ve got a Photoshop template that you can download right here... In the Mozinar, I spent some time talking about how images work in the new Local Carousel. Sure, there are tons of businesses that don’t show in the Carousel – but that doesn’t mean those businesses will never be in the Carousel… C’mon, it’s Google we’re talking about here – you never know what’s coming next. It’s a safe bet that they could eventually put any locally relevant businesses on Carousel results, so it’s extremely important that you get a phenomenal image loaded for your location immediately. The Carousel is going to drastically change the way that users interact with local search results. In the past, the higher ranked results would perform better – it makes sense that whatever is highest on the page (and whatever shows above the fold) would get the most clicks. With the Carousel, ALL of the results are at the top of the page, so there’s no more “king of the hill.” Sure, the review stars are still displayed – but the real deciding factor is going to be the images. The businesses with the best images are going to get the most clicks. If your image sucks, your clickthroughs will suck. The first image loaded to your location is the image that will be displayed in the Carousel. If you don’t like the image that’s in the Carousel, Google’s solution is to just delete all your photos and upload again, making sure that your first photo is the one you want in the Carousel. Obviously, this isn’t a great solution – if you’ve got hundreds of photos on your account, that will be incredibly tedious… worse yet, if a user uploaded the first photo, you can’t delete the photo. If you’re lucky, the user’s name will be attached to the photo, and you can track them down and ask them to delete it. If it was uploaded by an anonymous user – you’re up the creek without a paddle. Lauren Rockwell asked a question after the Mozinar, saying that her Carousel image isn’t the first photo in the old Places dashboard or her Google+ account. In situations like this, we inevitably find out that the Carousel photo was uploaded by someone else. Lauren, check that image and see who uploaded it – hopefully it’s someone you can track down… I got quite a few questions about Google Authorship as well. In the interest of keeping this post to less than War and Peace length, here are a few quick hits on Authorship: You cannot use a logo instead of a photo for Authorship – Google clearly states that it has to be a recognizable headshot, with only one person in the photo. If you try to use a logo, the image will be rejected. Someone asked how to get Authorship to show up in the map pack. Up until about a week ago, it showed up in the local results automatically, just like it did for organic. As of the time I’m writing this, it’s not displayed in the map pack any more. Google is currently rolling out changes to the local algorithm, so authorship photos have been pulled. We have no way of knowing if this is permanent or not, but if it does return, there’s nothing special you have to do, other than set up Authorship. The most common question on Authorship is from people who set it up, then ask why it doesn’t show up. If you’ve tested your setup with the Google Structured Data Testing Tool (http://www.google.com/webmasters/tools/richsnippets) and it’s showing correctly, you just have to sit back and wait. We’ve seen it take up to 60 days for author photos to start showing up in the SERPs – and it’s important to remember: author photos won’t show for every search result. Also, if you haven’t heard yet, Matt Cutts announced at PubCon that Google is trying to “tighten up” Authorship. They’re going to show approximately 15% less author photos in SERPs to help make the signal more trustworthy. Reviews are a really sticky situation – unless you work in Local SEO often and have done tons of research, it’s really hard to know what’s allowed and how reviews really work. Most importantly – don’t fake reviews. Employees aren’t allowed to leave reviews for where they work. Owners can’t review their own businesses. Spouses and friends can’t leave reviews. If you collect reviews as a survey, then post those reviews to Google AS the customer, those are against the rules too. In fact, all of these examples are against the law! The New York State Attorney General’s office just completed a year-long sting operation that targeted fake business reviews. After all was said and done, 19 businesses got caught in the sting for a grand total of $390,000 in fines! Google wants the reviews on your listing to be legitimate reviews – and they need to be unique. If you copy a great review and paste it onto your home page to share with the world, when Google crawls your site and sees the review there, it will actually REMOVE the review from your listing… I mentioned this in the webinar, and lots of people asked about it. Yes – it’s true, and yes – it happens all the time. Even if you link to Google to attribute the source of the review, it won’t matter. It may not happen immediately, but it will disappear from your listing when Google catches it. Samantha Needham asked about creating an image of the quote instead. That’s actually a great idea if you feel like you absolutely have to share that review. Since the text isn’t visible to Google, you’re not at risk of getting your review pulled. Keep in mind though – people know that reviews that you post on your site are always going to be the best of the best. We always tell our auto dealers that a testimonials page is pretty worthless… Customers know that they’re only awesome reviews. Think of it this way – if you got a really bad review, would you post it on your site? Obviously not – and your customers know this. Reviews on third party sites will ALWAYS be more trusted than anything you put on your own site. I explained in the Mozinar that we like to set up a simple page on every site at domain.com/reviews, so it’s easier to send customers to the right place to leave reviews. We can include direct links to the review sites along with instructions for how to leave reviews. Several people asked if this page should be blocked with robots.txt since it’s a doorway page… and others asked if those links could be construed as enticement to leave reviews. With Yelp, you might need to worry about all of your reviews originating from that page – but for Google, it’s definitely not a problem. In fact, Google WANTS you to link to your Google+ page – that’s how you set up rel=publisher… so why would you be penalized? You have to look at this in the right light. I mentioned in the webinar that when you’re making updates to your site, you can’t look at SEO as “I’m making this update to give the algo and show up higher in Google” – you have to look at it as “I’m providing great info and an awesome user experience for my customers.” Look at this review page strategy – isn’t it the same thing? You’re not putting this page out there to try to game the system, you’re just trying to give your customers a better user experience. That isn’t going to get you penalized. Aren't you not worried that links to reviews might be construed as enticement? They must be able to track the referral link. For customers that don’t have a Google account, it’s even more of a battle to get reviews. We always push our clients to get at least 10 Google reviews before they start to diversify and go after other review sites. Once you’re at that point, it’s usually best to provide options, so if a customer doesn’t have a Google account, they can leave a review elsewhere. Remember though – anyone with a Gmail address or an Android phone has a Google account. John Andrick asked about getting “inappropriate” reviews removed (such as a negative review from a competitor). Unfortunately, it’s pretty tough to get a review removed unless it falls under one of these criteria: it contains unlawful content or links to unlawful content it’s got advertising or spam in the review, or contains links or phone numbers it’s the same review that’s posted on multiple other sites it’s off-topic (doesn’t contain personal experience with that business) it’s a conflict of interest (from the owner or an employee) Unless your competitor was careless enough to leave the review from their own business account, it’s tough to prove that it wasn’t a real review – so you can’t get it removed. As long as you’ve got other good reviews, one or two bad reviews won’t hurt you. In many cases, having at least a few not-so-positive reviews makes you look more “real” – people know that businesses are bound to get a bad review here and there. Make sure that you leave an owner reply in a timely fashion, and that your reply is short, sweet, and doesn’t invite further online confrontation. If you’re 100% positive that the review came from a competitor, you could say something along the lines of “We searched our records, but have no purchase/experience with John Doe. John, please call us and let us know who you are so we can do our best to help you.” Then, go flag the review and list it as advertising/spam. We’ve done this in the past, and many times the review will then be removed. Hopefully I was able to answer most of the questions and give you a little bit more in-depth knowledge about Local Search. Please feel free to message me if you have any other questions, and I’ll do my best to answer anything else. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tips For Being A Local Search Superhero"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tips For Being A Local Search Superhero"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Greg Gifford\n          \n            Greg Gifford\n          \n            Greg Gifford"
}