{
  "url": "https://moz.com/blog/title-tag-showdown",
  "slug": "title-tag-showdown",
  "title": "What Are Title Tags? [Plus FREE Meta Title Preview Tool] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A title tag is an HTML element that specifies the title of a web page. Title tags are displayed in SERPs and are important for usability, SEO, and social sharing. The title tag of a web page is meant to be an accurate and concise description of a page's content.",
  "content": "Title Tag Written for Moz by Miriam Ellis. Updated on July 21, 2023. What is a Title Tag? A title tag is an HTML element that specifies the title of a web page. A page’s title tag can be displayed as part of the search snippet in a search engine results page (SERP). This element forms the clickable headline for the search result and is important for user experience, SEO, and social sharing. The title tag of a web page is meant to be an accurate and concise description of a page's content. Google may rewrite your pages’ title tags when displaying them in the SERPs to fit their own logic of intent and relevance. Need help writing perfect title tags for your website? Use our free Title Tag Preview Tool by entering your title tag text below to see how it's likely to appear in Google's search results: Title Tag Preview Tool loading… For the most accurate results, view on a desktop browser. Note: You may also see title tags referred to as \"meta titles\" or \"meta title tags\" in some cases. While controversial with some, either usage is typically fine. How long should a title tag be? While Google does not specify a recommended length for title tags, most desktop and mobile browsers are able to display the first 50–60 characters of a title tag. If you keep your titles under 60 characters, our research suggests that you can expect about 90% of your titles to display properly in the SERPs. What does the HTML code of a title tag look like? The HTML code of a title tag looks like this: <head><title>Example Title</title></head> If you are working with the raw code of a web page, you will typically find its title tag within the <head> section of the page’s HTML markup. Writing code-free title tags in your CMS Most modern CMS systems will allow you to write and edit your title tags directly in your dashboard fields without needing to write code. Many CMS systems do also allow you to access and edit your title tags in page code as well. What are examples of what title tags look like in the SERPs? When seen in the SERPs, a title tag typically looks like this example of the clickable text reading “Novato, California EV Charging Stations Info”: What are examples of what title tags look like on a live web page? When we click on that tag in the SERP to visit the web page it links to, we can often (but not always) see the title tag’s text of it shown in the top browser tab of the page: What are examples of what title tags look like when links are shared on social media? As seen in this example of a social post on Twitter, the title tag of “Let’s Learn About SEO & Content Marketing” is pulled from the page when the link to that page is tweeted. Different social platforms have slightly different formatting for this type of display: Use Page Optimization in Moz Pro for better title tags Moz Pro's Page Optimization feature can help you identify pages whose rankings could benefit from improved title tags. Take a 30-day free trial on us and see what you can achieve: Start my free trial How important are title tags? Title tags are important for two main reasons: Title tags signal to human searchers the nature of the content they can expect to find if they click through from the SERPs to a web page. For example, suppose a searcher in Novato, California looks up “EV charging station in Novato” and sees a result titled “Novato, CA EV Charging Station Locations.” In that case, a searcher can understand from this preview provided by the title tag that the page will likely have the information they need. It can inspire them to click on that result in the SERP and visit the page.Title tags describe page content to the search engine spiders/bots/crawlers that crawl and index website pages. You want to do everything you can to help the bots understand the nature of your pages so that they can be matched to the intent of searchers’ queries. For example, if a page’s title tag reads “Novato, CA EV Charging Station Locations”, it is signaling to search engines that the contents of the page will reflect the provided title. Suppose the page content accurately matches the title and does a good job of supplying high quality information. In that case, it can help the search engine to show that page in the SERPs when people search for “EV charging stations in Novato” or similar phrases.Because search engine results from entities like Google and Bing provide the online paths via which so many Internet users access websites and web pages, it’s extremely important to write effective and accurate title tags. And, because search engines derive signals of relevance from what appears within the title tag, writing optimized titles is fundamental to search engine optimization (SEO,) which can directly impact how visible a particular web page is for each search phrase. Intelligibility to humans and bots, search engine rankings, and the rate at which people click-through from the SERPs to your site are all key reasons for investing in title tag optimization. Are title tags a Google ranking factor? Yes, what you write in your title tags can impact your rankings in Google. Google’s John Mueller has stated, “Titles are important. They are important for SEO. They are used as a ranking factor.” However, it’s important to know that Google representatives and professional SEOs emphasize that the title tag element is just one of many factors that impact rankings and the degree to which a title tag impacts a given set of rankings cannot be definitively stated. How do you write a good title tag? What does Google say about title tags? Here is a summary of Google’s own guidelines regarding writing title tags: Create unique, accurate titles for each web pageKeep your title tags briefUse the title tag to accurately describe the page’s contentAvoid stuffing the title tag with keywords It’s good to have these ground rules from Google when choosing what to write in your title tags, but it’s also vital to know that best practices surrounding this element have changed over time as SERPs have evolved and search engine behavior has altered. What do you need to know about title tag rewrites? One of the most recent and dramatic alterations to Google’s handling of title tags is the frequency with which they now rewrite them. In other words, you may write what you think of as the best possible title tag for one of your pages, but Google may rewrite it for display in the SERPs. Here’s what you need to know about this behavior. In a Moz study of 57,832 title tags, Dr. Peter J. Meyers found that Google rewrote 58% of them. Please read the full study to understand further nuances of these percentages.A separate study by Cyrus Shepard of 80,959 title tags found that Google rewrote 61%. These studies speculate, based on their findings, that some of the factors which cause Google to rewrite title tags could include: Titles that are too short or too longThe repetition of a keyword or keyword phrase within a titleMissing brand names in titlesSuperfluous brands names in titlesThe use of elements like brackets, parentheses, and pipe marks in titlesThe use of identical “boiler plate” titles across multiple pagesTitle tags that don’t match the contents of a pagePage contents that do match the search query intent, but the original title tag doesn’t reflect this, so Google rewrites the title to better match the queryThe use of superlatives in title tags, like “Best SEO Service” or “Best Restaurant in Town.” You cannot prevent Google from rewriting your title tags. They are free to display whatever they like in their SERPs. It’s just a fact of online website promotion that Google may rewrite your titles, and you can choose to live with that and focus your SEO energy elsewhere. However, if you strongly feel that Google’s rewrites are undermining the success of your enterprise, the studies cited above make some recommendations for habits you can adopt which might decrease the rewrites you’re experiencing: Keep title tags between 51-60 total characters, as this length appears to result in the fewest rewrites; note that Google will typically read your entire title tag even if it exceeds 60 characters, but it may truncate or rewrite it for display.If you are trying to decide between using brackets or parentheses in a title tag, parentheses appear to result in fewer rewrites.If you are trying to decide between using a dash or a pipe symbol as a separator, the dash appears to result in fewer rewrites.Avoid using any keyword more than once in your titles.Experiment with matching your title tag to your header 1 (H1) tag, which typically appears as the title of the main body content on your live web page. Cyrus Shepard’s study found that when these two elements match one another, there was a decrease in title tag rewrites. For further data and tips on understanding and responding to title tag rewrites read: https://moz.com/blog/title-tag-patterns-to-avoidhttps://moz.com/blog/title-tag-rewrite-case-studyhttps://moz.com/blog/ways-google-rewrites-title-tags So, how do you write a good title tag these days? In this section, we’ll walk you through a 6-step process for writing excellent title tags, step by step. Step 1: Good title tags start with good research Effective title tags depend on four types of research: keyword research, customer research, market research, and SERP research. In order to understand what to write about and how to write the title tag for the content you’ve written, spend time:Using keyword research tools like Moz Keyword Explorer to understand how people are searching online for the topics covered by your web pages.Surveying and polling your customers and logging your conversations with them to understand how they talk about the topics covered by your web pages. How your audience refers to things may differ from how your business speaks of itself and its offering. Note the differences.Analyzing your mostly highly-ranked online competitors to see how they are writing their title tags when they cover the same topics your web pages are covering. You can do this work manually or use tools like Moz’s True Competitor. Studying the search engine results for your most important search phrases to see what is already being ranked for them. Don’t just look at your competitors’ title tags, but look at what Google is surfacing in SERP features like the “People Also Ask” and “Related Searches” sections. Taken altogether, these four types of research should help you determine how to optimize each unique title tag with a combination of the most popular phrases you found via keyword research, the most common and intelligible phrases used by your customers, the most highly-ranked phrases used by your top competitors, and Google’s clues as to other ways in which people might be searching for the topics you cover. Combine all this knowledge with the best practices we’ll summarize next. Step 2: Incorporate standard best practices Let’s review what we’ve learned from the studies we’ve cited and incorporate this into how you write your title tagsBe sure the title reflects the page contents accurately.Keep title tags in the 51-60 character limit, unless you’ve decided to write a longer title knowing that only part of it will display and that it may cause Google to rewrite this element.Use each keyword phrase only once per title tag.Use dashes instead of pipes and parentheses instead of brackets.Write a unique title tag for each page. *Note that if you are writing title tags for a local business website, it is a standard best practice to be sure you are including geographic terms in your titles. For example, a chain of Mexican food restaurants should be sure the city name “Novato” is part of the title tag for its Novato branch web page, and that “San Rafael” is included in the title tag of its branch page for that location. Don’t depend on Google to assume the location of your business or customers. Make it clear in your title tags, as well as in your page content. Step 3: Pay attention to Google’s continual emphasis on writing for people, not search engines If you’ve just started studying SEO, it can be a little confusing at first to get your head around Google’s oft-repeated edict that online publishers should create content for people instead of for search engines. After all, you are writing title tags, in part, so that search engines can understand and display the contents of your web pages. So, practically speaking, you will be thinking of the needs and preferences of search engines when you write each title tag. But the point Google is really trying to make with this messaging is that they want publishers to focus on the quality of the content human beings encounter on the Internet, rather than focusing on how to manipulate search engines into ranking their content highly. Take a moment to put yourself in the shoes of an online searcher while encountering these two hypothetical title tags. Which would you trust most? <head><title>Choosing safest first baby shoes, with Podiatrist Mary Jones</title></head> Or <head><title>Best baby shoes, first baby shoes, baby cheapest shoes, safe shoe, baby shoe sale, dangerous baby shoes, safe baby shoes, best article| podiatrist Mary Jones</title></head> Basically, Google wants its results to read like example #1 instead of #2, which is the product of publishers attempting to rank more highly on the basis of confusion and bad advice. Google’s viability as an enterprise depends on human searchers trusting its results and using them while being exposed to ads, and if all of the SERPs read like example #2, few humans would enjoy them. Rather than focusing on spammy tactics, write title tags that read well to people while incorporating your learnings from steps one and two. Step 4: Remember that title tags are a marketing element, as well as a standard part of SEO Writing an ideal title tag goes beyond just making sure that humans can understand what you’ve written. The magic you’re looking to conjure with the phrasing you choose is that your title tag resonates with human searchers and makes them want to click through from the SERPs to your page. There’s no replacement for really knowing your audience when it comes to evaluating which of these title tags will inspire the most clicks: There’s so much to consider in evaluating just three possible title tags. Entry number one has included a year in its article, which may have worked in 2022, but could now be discouraging clicks as the years roll along. It's also rather short and looks as if not much effort was put into using the title tag to describe the page. Entry number two looks like it might be a good fit for searchers wanting advice from a podiatrist about high quality shoes for babies. This title signals great authority on the topic, but the title tag exceeds the length recommendations and could be losing clicks because of that. Entry number three could be a good fit if what your audience most wants is just a list of baby shoe options, but what if they’ve come to associate listicle pieces like this with low quality content? Would a different title look more original and less generic? Titles that maximize click-through rates (CTR) truly fall under the heading of creative writing. They are a marketing element that seeks to persuade visitors to leave the SERPs and come to your site. With practice, you can improve your skills at using titles to pitch your pages to the public with a few well-chosen words that inspire clicks. Step 5: Make use of tools It’s a fairly easy task to write a small number of unique, optimized title tags for a few website pages, but if your project is larger than that, tools can be a huge help in scaling this work. Consider making your title tag research and writing easier with these tools: Download the free Moz Bar to quickly and easily see the title tag of any page. Use the free Moz Keyword Explorer tool to research which keywords customers use most when searching for what you offer so that you can determine which phrases deserve pride of place in your title tags.Use the free Moz SEO Competitive Analysis tool to find your competitors and understand gaps in your own usage of keywords based on what your competitors are using. This knowledge could help you identify new terms to focus on in your title tagsReceive a page optimization score, including tips about your title tags, from Moz’s On-page GraderFinally, many SEOs are experimenting these days with using AI chat features from platforms like Google’s Bard and ChatGPT to attempt to scale the writing of title tags. If you have to write a large number of title tags, you may want to give this a try, but do bear in mind that these products are not SEO tools and are not designed to write optimized title tags or obey guidelines. You must also carefully review the output of AI because of its penchant for formulating nonsense. Step 6: Track your outcomes If you are rewriting your title tags to better optimize them, assess and record your search engine rankings, traffic, click-through rate and conversion rate before you go live with your edits. Then, give a reasonable period of time for the impacts of these changes to be felt. Finally, measure the results. If your metrics were positively affected by your optimization, you’ve made good decisions and learned something important about what works for your enterprise, but you’ll need to revisit this periodically to see if performance is stable or trending upwards or downwards. If, on the other hand, your title tag rewrites result in a drop in performance, you’ll want to re-think your approach and rewrite them again in hopes of a better result. Title tags, like all SEO elements and strategies, should be considered as the grounds for ongoing experimentation. Keep learning The Beginner's Guide to SEO9.5 Ways Google Rewrites Your Title TagsSEO Master Class: Advanced Title Tag Optimization (for Any Site) - Webinar7 Title Tag Hacks for Increased Rankings + Traffic - Whiteboard FridayTitle Tags SEO: When to Include Your Brand and/or Boilerplate Use Page Optimization in Moz Pro for better title tags Moz Pro's Page Optimization feature can help you identify pages whose rankings could benefit from improved title tags. Take a 30-day free trial on us and see what you can achieve: Start my free trial FAQs What is a title tag? A title tag is an HTML element that specifies the title of a web page. It is displayed as part of the search snippet in a search engine results page (SERP) and forms the clickable headline for the search result. It is significant for user experience, SEO, and social sharing. What is the recommended length for a title tag? While Google does not specify a recommended length, it's suggested to keep your title tags under 60 characters for optimal display in the SERPs. How important are title tags? Title tags are crucial because they inform users and search engine bots about the nature of the page's content. Effective title tags can increase click-through rates from the SERPs to your site and improve your search engine rankings. How do title tags look in SERPs? In the SERP, a title tag is displayed as the clickable text of a search result. Additional Articles on On-Site SEO On-Site SEO On-Page Ranking Factors What Are Meta Descriptions and How to Write Them Show More Alt Text Duplicate Content Robots.txt Robots Meta Directives Schema.org Markup HTTP Status Codes Page Speed Conversion Rate Optimization Domains URLs Canonicalization Redirects Core Web Vitals Performance Metrics: Opportunities & Diagnostics H1 Tags The Ultimate Guide to Image SEO: Optimizing Your Visuals for Search Show Less",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H5",
      "text": "Categories"
    },
    {
      "level": "H5",
      "text": "Moz Tools"
    },
    {
      "level": "H5",
      "text": "Additional Resources"
    },
    {
      "level": "H1",
      "text": "Title Tag"
    },
    {
      "level": "H2",
      "text": "What is a Title Tag?"
    },
    {
      "level": "H2",
      "text": "How long should a title tag be?"
    },
    {
      "level": "H2",
      "text": "What does the HTML code of a title tag look like?"
    },
    {
      "level": "H2",
      "text": "Writing code-free title tags in your CMS"
    },
    {
      "level": "H2",
      "text": "What are examples of what title tags look like in the SERPs?"
    },
    {
      "level": "H2",
      "text": "What are examples of what title tags look like on a live web page?"
    },
    {
      "level": "H2",
      "text": "What are examples of what title tags look like when links are shared on social media?"
    },
    {
      "level": "H3",
      "text": "Use Page Optimization in Moz Pro for better title tags"
    },
    {
      "level": "H2",
      "text": "How important are title tags?"
    },
    {
      "level": "H2",
      "text": "Are title tags a Google ranking factor?"
    },
    {
      "level": "H2",
      "text": "How do you write a good title tag?"
    },
    {
      "level": "H3",
      "text": "What does Google say about title tags?"
    },
    {
      "level": "H3",
      "text": "What do you need to know about title tag rewrites?"
    },
    {
      "level": "H3",
      "text": "So, how do you write a good title tag these days?"
    },
    {
      "level": "H4",
      "text": "Step 1: Good title tags start with good research"
    },
    {
      "level": "H4",
      "text": "Step 2: Incorporate standard best practices"
    },
    {
      "level": "H4",
      "text": "Step 3: Pay attention to Google’s continual emphasis on writing for people, not search engines"
    },
    {
      "level": "H4",
      "text": "Step 4: Remember that title tags are a marketing element, as well as a standard part of SEO"
    },
    {
      "level": "H4",
      "text": "Step 5: Make use of tools"
    },
    {
      "level": "H4",
      "text": "Step 6: Track your outcomes"
    },
    {
      "level": "H2",
      "text": "Keep learning"
    },
    {
      "level": "H3",
      "text": "Use Page Optimization in Moz Pro for better title tags"
    },
    {
      "level": "H3",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Additional Articles on On-Site SEO"
    }
  ],
  "author": ""
}