{
  "url": "https://moz.com/blog/to-flash-or-not-to-flash",
  "slug": "to-flash-or-not-to-flash",
  "title": "To Flash or not to Flash? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While conventional SEM wisdom says to minimize the amount of flash used on any given site, there are specific industries where the imagery that can be conveyed through flash goes a long way towards getting and keeping a web audience.  For example in the ski resort industry, pretty much type in ski…",
  "content": "To Flash or not to Flash? Whiteboard Friday E By: Eric Myers July 19, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! E By: Eric Myers July 19, 2007 To Flash or not to Flash? Whiteboard Friday This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. While conventional SEM wisdom says to minimize the amount of flash used on any given site, there are specific industries where the imagery conveyed through flash goes a long way towards getting and keeping a web audience. This presents a basic contradiction for SEM -- what if your client insists (*for good reason*) on using flash to help convey their brand and still wants to maintain a great organic listing? Maintain text on the homepage in balance with Flash 100% flash on the homepage can be a fundamental 'no-no' in the SEM world. Keeping the pages high in HTML content and taking the basic steps of having an HTML sitemap with proper linking can go a long way to overcoming the issue of having flash in your site. Do not use flash-based navigation Alternative (text/DHTML) navigation can enable crawling and will improve load times, and working with a designer that can balance this will enable more search friendly navigations while still using flash in other aspects of your site. Work the tags The SERP listings can be influenced by proper use of tags and copy on the homepage, and while the debate over proper use of meta tags is not the purpose of this post, getting your tags and text copy in balance with flash can get you a good SERP description along with the power of flash imagery. Establish an excellent PPC Campaign Flash in general is not for the weak of heart or the weak of pocketbook. I have seen successfully implemented flash sites overcome by strong presence in the PPC campaign. Get engaged with your PPC early on and this can be overcome, but be aware that this can break the bank. Think through your URLs Consult with an organic specialist to come up with sound URL structure for implementation. There are ways to implement 'deep linking' that is having a sound URL that links directly to a flash movie; while it may not be easy to implement, it can help a lot for maintaining your link community. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "To Flash or not to Flash?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "To Flash or not to Flash?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Myers\n          \n            Eric Myers"
}