{
  "url": "https://moz.com/blog/to-www-or-not-to-www",
  "slug": "to-www-or-not-to-www",
  "title": "To www Or Not To www - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I took over the development of my employer's website paradiserooms.com, about 6 months ago, and in the past few months we've begun optimizing the site to compete in our regional market of sunrooms, patio enclosures and other home improvement services.  In the process, we began to speak with SEO…",
  "content": "To www Or Not To www Technical SEO March 20, 2007 Table of Contents Copied! March 20, 2007 To www Or Not To www Technical SEO I took over the development of my employer's website about 6 months ago, and in the past few months we've begun optimizing the site to compete in our regional market of sunrooms, patio enclosures, and other home improvement services. In the process, we began to speak with SEO firms about what our site needed to compete in the serps. One issue they never failed to point out is our site's duplicate index in Google due to the www and sans-www index. I didn't understand what the problem is with this, and I still don't. Question 1: Does it matter if you have two indexes? Not really understanding the issue but trusting the advice was sound, I set up a 301 redirect and used Google's webmaster tools to set my preferred domain. I opted to set up the redirect and the preferred domain to paradiserooms.com, and I dropped the www. The domain is about 2500 days old, and we do have a spattering of incoming links (most of them are pointed to www.paradiserooms.com). Question 2: Was it a mistake to drop the www? I'm completely new to SEO, so I apologize if this issue has been cover countless times already. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "To www Or Not To www"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "To www Or Not To www"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": ""
}