{
  "url": "https://moz.com/blog/too-busy-to-blog",
  "slug": "too-busy-to-blog",
  "title": "Too Busy to Blog - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This conference is insane. I'm literally too busy to share information with you. I have fantastic notes from every session, and Si is reporting from a completely seperate set of sessions - together we're trying to cover as much as possible in a meaningful way.The events of today includ...",
  "content": "Too Busy to Blog SEO Events By: Rand Fishkin March 1, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 1, 2005 Too Busy to Blog SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This conference is insane. I'm literally too busy to share information with you. I have fantastic notes from every session, and Si is reporting from a completely seperate set of sessions - together we're trying to cover as much as possible in a meaningful way.The events of today include announcements from Yahoo!, including the rollout of the API (with 5000 queries per day allowed). Since Yahoo! offers much more relevant results, even GoogleGuy (Matt Cutts) told me today that if SEOs or their clients want link information, they should go there and use their site.I've had other phenomenal conversations and meetings today, including Dr. Garcia (orion from SEW), Ignacio Hernandez (Nacho from SEW), Danny Sullivan himself and dozens of others. I can barely begin to grasp the social and networking aspects of this conference, but I believe it will be highly relevant for the future. Of note is the continued disrespect for the mathematical/scientific/analytical approach to SEO. I heard people commenting during the search algorithms session that they were 'falling asleep' or 'reading information about the next session' - tragic.I hope to return on Thursday night/Friday with a phenomenal amount of information, both here and on the forums. In the meantime, I am answering email, but it is slower than usual. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Too Busy to Blog"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Too Busy to Blog"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}