{
  "url": "https://moz.com/blog/tool-review-wordstreams-ppc-grader",
  "slug": "tool-review-wordstreams-ppc-grader",
  "title": "Tool Review: Wordstream's PPC Grader - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In paid search there are a lot of rough Adwords accounts out there. You've seen them I'm sure. I know I've worked on them. We get brought in to assess the situation and make some big decisions around whether an account has potential or whether it would be better just to start fresh. This is one of…",
  "content": "Tool Review: Wordstream's PPC Grader Paid Search Marketing (PPC) By: Joanna Lord January 3, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord January 3, 2012 Tool Review: Wordstream's PPC Grader Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In paid search there are a lot of rough Adwords accounts out there. You've seen them I'm sure. I know I've worked on them. We get brought in to assess the situation and make some big decisions around whether an account has potential or whether it would be better just to start fresh. This is one of the most common questions we get asked -- how am I doing? I'm always looking for tools that can help advertisers answer that question. Usually I have to log in and pull reports myself to get to a point where I feel comfortable enough to jump on a phone call and give my opinion. Needless to say that ends up costing time on both ends which of course costs money on both ends. Recently, Larry Kim, founder of Wordstream, dropped by the Moz offices and a few of us Mozzers were able to explore what their team has been working on. We checked out Wordstream's PPC Grader pretty closely and I thought it would be worth running through what we found. I can honestly say it offers us paid marketers a unique snapshot that can be really useful when first getting started with a company or client. Their Google Adwords PPC Grader tool (report w/ some blurring pictured above) runs by looking at your AdWords account and grading against averages and best practices they've seen from analyzing thousands of other AdWords accounts. To help show off some of the tool's benefits I am going to go ahead and share some actual data (and screenshots) of the tool's analysis of our Google AdWords account. The big deliverable from the tool is a lengthy report page that shows a bunch of data about your account, but the first number you see is a rough \"score\" comparing your AdWords campaign's performance to other accounts in your spend range. It's worth pointing out that a concern we had with the PPC grader was the \"spend range\" component. The range SEOmoz fell into was \"$15,000 to $99,999,999.00.\" Our monthly budgets run on the low end of that but we are compared to huge companies with huge branding budgets. You can see where that might affect some data. With that said, the tool is still a great way of showing a client or company the potential PPC has as a channel. It makes the case that with time and resources there is a profitable place to grow this account to. Below are the sections included in the PPC Grader (as you can see this is some seriously awesome data!): Account Diagnostics - An overall score and rundown of your account compenents & counts. Wasted Spend - A look at your negative keyword list and projected spend waste calculation. Quality Score - A graph of your quality score distribution, which is often overlooked by too many paid search marketers. Impression Share - A share of voice view that helps you understand how often your ads are appearing for relevant searches. Click Thru Rate - Analysis to help you compare your CTR to competitors in your spend range for both Search and Display networks. Account Activity - A snapshot to help you better understand the volume of recent activity in your account and comparitive views. Long-Tail Keyword Optimization - Helps you understand if you are holding your own in the long-tail arena, which holds huge potential for PPC-ers. Text-Ad Optimization - Quick glance of how many text ads you have running, and how many per ad group to better understand how tailored your ads are. Landing-Page Optimization - Helps you see how many this account has, and how that compares to your competitors in this spend range. PPC Best Practices - A pass/fail audit whichs helps you quickly identify any low hanging fruit to go after on the best practices list. Overall Grade - A reminder of your account grade and performance summary. Phewwww. That sure is a lot huh? This snapshot is an epic first view for paid search marketers. I'm not going to go through each of the sections in depth because that would take forever, but I thought I'd run through some of my favorite pieces to start. After that I'm going to mention some other feedback and feature requests we have. Let's start off with what we think is really awesome... PRO #1 : Depth & Breadth of Summary A report with both such a broad view and such a deep view is really hard (if not impossible) to come by in PPC. One of my favorite sections of the Wordstream PPC Grader is the PPC Best Practices checklist. It gives you a top-level view of how well you are doing. Below you can see what came back when we ran the SEOmoz account through the Grader: You can see we are doing well on every section, except for \"Modified Broad Match Type.\" This is 100% accurate, we have yet to play around too significantly with match type strategy at SEOmoz, and have instead focused on long-tail expansion. This is a great reminder that we are leaving an excellent option on the table, and we can better prioritize match type expansion in 2012. PRO #2: Impression Share View I love this section. This view helps us understand how often our SEOmoz ads are showing up. We can see if our budgets are where they need to be and if our ad ranks are sitting in the right places. This can help with a really common conversation paid marketers have with advertisers around budget. Most times advertisers want to improve PPC performance without increasing budgets. While optimization should always be happening, there is a time and place for budget changes. Bid management and budget management need to be revisited often. Wordstream's Grader helps make the case for this. You can see that SEOmoz scored in the 58th percentile which is pretty decent, but there is still so much more we can be doing. This sort of view helps us make a case for more budget, as well as helps us prioritize some ad position management internally. This means we need to set aside more time to work on quality scores, and targeting. A view like this can tell us so much. Okay those are just a couple of the PROs we found by running the Wordstream Grader for the SEOmoz PPC account. I do want to run through some of the concerns we had, and lace in some feature requests the team over here would love to see. Concern #1: Competitive Spend Range I mentioned this above but since the competitive bucket we are in is so large, we really need to take this audit with a grain of salt. The budget spend of an account is indictive of big differences in how an account will perform, and be managed. Let's look at an example: If we were to just glance at our CTR summary without considering the above limitation we would think we are doing horribly on our CTRs. It shows us performing at the 10th percentile. Yuckkk. If you take a closer look though, we are at a 1.39% CTR and our \"competitors\" at a 5.34%. The baseline for CTR success is a 1.00%, so we feel pretty great about out 1.39%. Seeing that our competitors have a 5.34% makes it quite clear we are being bucketed with advertisers who have large (in the millions) budgets who likely bid on brand terms (in the hundreds). We only have a few brand terms and those perform at the 4.00% level. Feature Request #1: It is absolutely awesome that Wordstream has collected these audits across thousands of advertisers, but we would love to see a budget drop-down filter that had more bucket ranges to help us better categorize ourself appropriately. As a side request to this it might be cool to see some place where we as advertisers can add in \"how long this account has been active\" to help further categorize the advertisers so the comparison carries more description. It would be cool to know if that average lifetime of the accounts I'm being compared to is 6 months, or 3 years, you know? Just some ideas. Concern #2: Industry Non-Specific Data Just like in SEO, PPC performance varies greatly depending on both your industry and your site's purpose. By not having an \"industry or site type\" filter in the Grader, all of my data is compared to advertisers with such different goals, resources, etc. Below is a great example of how this can hurt the data cause: Knowing how I am doing on my landing page optimization (LPO) is key. I really appreciate Wordstream building this in, as I believe it's one of the most valuable pieces to PPC success. Unfortunately given the data is not industry specific, and the competitive spend range issues, this data isn't very useful for me. It shows me with 23 landing pages, and my competitor having 543 landing pages. Having over 20 unique landing pages given our limited PPC spend, and the size of our keyword list is pretty good. That is the score I'd love for them to show me somehow, like a \"size of account\" to \"#of landing pages\" ratio. By showing me that my competitor has over 500 pages built out, its safe to assume I am being compared to an ecommerce site, or at the least a site with big budgets and lots of resources (most likely a CMS that has a PPC template system in place). I can't really gauge from this if I am doing well in LPO. Feature Request #2: I'd love the ability to bucket my site into an industry like a \"software\" or \"tech\" bucket, and then have them show me how I am doing compared to them specifically. At the very least I'd like to be compared to other SaaS companies, or B2B companies. I'd also love a score that shows me something like -- a \"size of account\" to \"#of landing pages\" ratio for my account and then shows me industry standard. I am really impresses that Wordstream has included LPO in their audit, but I'd love to see them push this a bit further. So What's the Good Word? While the tool has a few caveats, I think it's safe to say the Wordstream Grader is the best of it's kind out there. I haven't highlighted all the features of the tool here (as it would make this a monster of an unreadably long blog post), and I would encourage anyone with a Google AdWords account to give it a spin, particularly since it's totally free. The report is great for quick snapshorts, and benchmarking your progress. I'd love to hear your experiences with the tool and feedback - I'm a fan of the folks at Wordstream and of the metrics-comparison methodology in general. So feel free to leave your thoughts in the comments below! Sidenote: Wordstream also has a great keyword research tool and Rand is planning to do a follow-up post at some point, so stay tuned for that! He'll be digging into their keyword research tool to gauge its value for SEO folks. If you've got any thoughts, experiences or suggestions there, that's also much appreciated. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tool Review: Wordstream's PPC Grader"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tool Review: Wordstream's PPC Grader"
    },
    {
      "level": "H2",
      "text": "PRO #1 : Depth & Breadth of Summary"
    },
    {
      "level": "H2",
      "text": "PRO #2: Impression Share View"
    },
    {
      "level": "H2",
      "text": "Concern #1: Competitive Spend Range"
    },
    {
      "level": "H2",
      "text": "Concern #2: Industry Non-Specific Data"
    },
    {
      "level": "H2",
      "text": "So What's the Good Word?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}