{
  "url": "https://moz.com/blog/toolbar-pr-of-seomoz-users-profile-pages-a-case-study",
  "slug": "toolbar-pr-of-seomoz-users-profile-pages-a-case-study",
  "title": "Toolbar PR of SEOmoz Users Profile Pages: A Case Study - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've noticed for a while that my profile page on SEOmoz has no Toolbar PR. Actually, I noticed it more since I reached the 100 mozpoints mark - because when you reach 100, the link to the site on your profile page becomes \"follow\" instead of \"nofollow\", as you can read here. And it's always great…",
  "content": "Toolbar PR of SEOmoz Users Profile Pages: A Case Study Technical SEO N By: Nuno Hipólito June 16, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! N By: Nuno Hipólito June 16, 2008 Toolbar PR of SEOmoz Users Profile Pages: A Case Study Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I've noticed for a while that my profile page on SEOmoz has no Toolbar PR. Actually, I noticed it more since I reached the 100 mozpoints mark - because when you reach 100, the link to the site on your profile page becomes \"follow\" instead of \"nofollow,\" as you can read here. And it's always great to have a link from such a great site as SEOmoz. Ok, so my link was kinda useless because my profile page was not indexed and it had no Toolbar PR. I didn't think more about it for a couple months, mainly because I thought it had something to do with me not having that much participation on SEOmoz, or something like that. But a couple weeks ago, I saw other \"big\" SEOmoz users with no PR on their profile pages, and it intrigued me. Why was this happening? I compiled the following list to get started: Rank / Nick / Profile Page / Toolbar PR 1. randfish / https://moz.com/users/view/63 / 5 2. rebecca / https://moz.com/users/view/14097 / 5 3 . Jane Copland / https://moz.com/users/view/19465 / 5 4 . ciaran / https://moz.com/users/view/19450 5 / 5 5. great scott! / https://moz.com/users/view/21348 / 5 6. Sean Maguire / https://moz.com/users/view/51055 / 4 7. Oatmeal / https://moz.com/users/view/30 / 5 8. rishil / https://moz.com/users/view/39345 / 4 9. Dr. Pete / https://moz.com/users/view/22897 / unranked 10. willcritchlow / https://moz.com/users/view/21379 / unranked 11. bookworm seo / https://moz.com/users/view/17249 / 4 12. feedthebot / https://moz.com/users/view/30107 / unranked 13. identity / https://moz.com/users/view/16534 / unranked 14. vingold / https://moz.com/users/view/27043 / unranked 15. Ann Smarty / https://moz.com/users/view/54095 / unranked 16. vangogh99 / https://moz.com/users/view/21641 / unranked 17. EGOL / https://moz.com/users/view/446 / 5 18. Brent D. Payne / https://moz.com/users/view/50042 / 4 19. davidmihm / https://moz.com/users/view/17566 / 5 20. lorisa / https://moz.com/users/view/22018 / 4 98. Aaron Pratt / https://moz.com/users/view/13511 / 4 - As you can see, in the top 20 users (on 9th June 2008), 7 don't have any PR on their profile pages. These are all \"heavy traffic\" users, people who comment and post a lot on SEOmoz. We all now that PR works something like this: PAGE A links to PAGE B, and Google considers that link as a VOTE. So, in theory, MORE VOTES = MORE PR. Of course we all know that a lot of extra factors come into play: the quality of the page that votes, the PR of that page, the kind of link, the content of the page, etc... but in a nutshell PR works like that. So... PROFILE PAGE WITH NO PR = PAGE WITH NO VOTES (LINKS) This made sense, if not for one simple reason: all profile pages are linked (with a dofollow link) from the SEOmoz Users Page. So I thought it could have something to do with how they were being linked. All the links to users in that page have this format: <a href=\"/users/view/31721\">nicknick</a> I could be on to something. Could it have something to do with the fact that the URL was shortened? \"/user/\" instead of \"http://www.seomoz.com/user...\"? No. Because all links are like that. And some profile pages have PR and others don't. So back to square one. Could it be that some users got to the main blog and other didn't? No. And the links on the blog posts (YOUmoz or main blog) are nofollowed. So the comments are nofollowed and the link to the profile is nofollowed. The conclusion was that the PR wasn't flowing from inside SEOmoz - in fact, no PR flows to user pages, as far as I can tell, because comments and blog post author links are nofollowed. PR could only flow from the main User Page, because all links there are nofollowed (at least at the top). So I started analysing backlink information. I used \"link:\" on Google, and don't kill me for that, but I found it more simple to analyse. And yes, I know it's only a sample: ciaran (ranked 4) has no external links to his profile, only SEOmoz links. Oatmeal (ranked 7) has a couple of external links, from low PR pages. rishil (ranked 8) also has a couple of external links, from low PR page. My theory (that only profiles with external links have PR) was destroyed... Conclusion??? I really don't have one. Only an educated guess about what is going on: I think external links are helping some profile pages, but not enough to get a PR 4 or 5... so the answer must be that some of the links in the Users Page are being followed, but because that page has so many links (Google advises 100 per page), Google must be sampling the links, probably choosing based on other external factors. I would REALLY REALLY appreciate your input. And don't beat me to death if I missed some obvious detail! Thanks in advance for reading! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Toolbar PR of SEOmoz Users Profile Pages: A Case Study"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Toolbar PR of SEOmoz Users Profile Pages: A Case Study"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nuno Hipólito\n          \n            Nuno Hipólito"
}