{
  "url": "https://moz.com/blog/tool-of-the-week-pingdom",
  "slug": "tool-of-the-week-pingdom",
  "title": "Tool of the Week: Pingdom - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEOmoz isn't perfect.  We, like a lot of other websites, do occasionally experience down time.  It's part of the the uglier side of running a server.  A lot of your time is spent maintaining things that break, tool scripts that get too rowdy and nock over furniture and the sudden influx of traffic…",
  "content": "Tool of the Week: Pingdom SEO Tools J By: Jeff Pollard May 15, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! J By: Jeff Pollard May 15, 2008 Tool of the Week: Pingdom SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. SEOmoz isn't perfect. We, like a lot of other websites, do occasionally experience down time. It's part of the the uglier side of running a server. A lot of your time is spent maintaining things that break, keeping tabs on tool scripts that can get rowdy and knock over furniture and handling the sudden influx of traffic that happens with a Digging. The \"is the site up?\" question can fly around a lot. Yet thankfully, there is a simple web service that makes your life (and ours) a lot easier. Pingdom is an internet service that will try to ping your server every so often (you can configure it to look between every five and sixty minutes) and see if it responds. It's very customizable. Aside from HTTP checks, it can do all sorts of network (TCP Port, Ping, DNS, UDP) and email (SMTP, POP3, IMAP) checks. You can also customize how you want to be notified. You can be notified via SMS and/or email, as well as how many notifications you'd like to receive at a time. The result is you get something like this in your inbox. This particular notification is due to our twice-daily database backups happening at 4PM and locking the site for 3-5 minutes while they export. The other really cool part of Pingdom is their quite extensive reporting system. You can receive day by day reports of your uptime, as well as summary data or data for custom date ranges. Again, the ~10 minutes of down time a day is due to our database backups locking the site. There is also graphing built in so you can see in a visual form how well your site is doing with its uptime. Pingdom also tracks your server's response time, letting you see detailed information about how long certain Pingdom mirrors took to reach your site. You can also subscribe to daily, weekly, and/or monthly reports to be delivered to your email box. And if you're so inclined, you can also make some of your reporting public to let others know how well you fare with uptime. The bottom line in all of this is that if Pingdom watches your site, you'll know that your site is down before anyone else. You're better able to get ahead of potential issues before they become big problems. And with the detailed reporting you can monitor your up time and help diagnose potential issues affecting your crawling and SEO performance. While it is $9.95 a month for the basic account, trust me when I say that it's well worth it. We tried other similar services like Montastic and Pingdom is, by far, the best and most accurate. It's become invaluable. Give it a shot and try the 30 day free trial. You'll be very impressed. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tool of the Week: Pingdom"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tool of the Week: Pingdom"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jeff Pollard\n          \n            Jeff Pollard"
}