{
  "url": "https://moz.com/blog/tools-or-fools",
  "slug": "tools-or-fools",
  "title": "Tools or Fools? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "BACKGROUNDRecently I've been bombarded with a slew of SEO tools and thought it would be best to share those here and see what experiences others have had. This list, of course, is not a complete list of such tools / services, but these are the ones I have seen most recently. Morever, I have not…",
  "content": "Tools or Fools? Social Media R By: Ryan O'Donnell April 23, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! R By: Ryan O'Donnell April 23, 2008 Tools or Fools? Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. BACKGROUND Recently I've been bombarded with a slew of SEO tools and thought it would be best to share those here and see what experiences others have had. This list, of course, is not a complete list of such tools / services, but these are the ones I have seen most recently. Moreover, I have not used all these tools / services, so if you have, feel free to share your thoughts. Many of you may already be familiar with several of these listings, so bear with me... TRAFFIC GEYSER CLAIM: \"Our User are Getting FRONT PAGE Google Listings...in Just a Few Hours\" MECHANICS: Traffic Geyser is a video blasting tool you can use to automate content submission to video hosting sites, podcasting sites, blog sites, and social bookmarking sites. Once you have entered your login info and uploaded your video content, Traffic Geyser does the rest and submits to a very large collection of sites. COST: $97 / month TUBE MOGUL CLAIM: \"TubeMogul is a free service that provides a single point for deploying uploads to the top video sharing sites, and powerful analytics on who, what, and how videos are being viewed.\" MECHANICS: Offers a robust video subitting and tracking system. The only drawback is the limited number of video services you can submit to. However, they cover the heavy hitters. COST: Free VIDEO POST ROBOT CLAIM: \"With The Simple Click Of Your Mouse, Magically Activate A 'Raging River' of Video Traffic, So Powerful... And So Lucrative... Generating Hordes Of Traffic Will Seems Like Child's-Play!\" MECHANICS: I have not used this service. COST: $197 COMMENT KAHUNA CLAIM: \"Get MORE Traffic at ZERO Cost!\" MECHANICS: Scours the net for opportunities to include your URL in comment sections on sites with high PR. Moreover, the tool automates the process by letting you blast out your comment to multiple sites simultaneously. COST: Free TRAFFIC KAHUNA CLAIM: \"Wanna Know How To Get A Community Of 1,268 Webmasters And 663 Blog Owners To Instantly Promote YOUR Websites, Send You Unlimited FREE Highly-Targeted Traffic, Give You One-Way Links At Anytime, Publish Your Articles & Videos Whenever You Want... And Ask Almost Nothing In Return?\" MECHANICS: I have not used this service. COST: $97 / month SOCIAL MARKER CLAIM: \"It can help you spread a link on 46 of the best social bookmarking sites in under 15 minutes!\" MECHANICS: Offers semi-automated social bookmarking. It does not auto-log in so that slows things down considerably. Be sure to have all your user names and passwords 'remembered' and that will speed up logging in a bit. COST: Free TRIAL I tried sending out a video via Traffic Geyser and found the video showed up on Google in position #3, #4, #5, #6, and #9 for '[PRODUCT NAME] video' and #24 for '[PRODUCT NAME]'. I HIGHLY doubt most people would ever search for '[PRODUCT NAME] video' so that isn't all that valuable. Regardless, I was quite surprised to see all those sites jump up to the front page. SUMMARY While I think it is a great idea to share your content through social networking sites and content hosting sites, I have a couple concerns: Several of these sites look so ridiculous, it just 'feels' like a scam. A lot of this type of activity seems really 'spammy' and poorly targeted - and makes me nervous from a brand standpoint. That being said, my limited experience has certainly piqued my interest. Has anyone else leveraged these tools? If so, what kind of results have you seen? BTW, I'm not including links to these tools as I am NOT trying to promote them here in any way. Any decision to try them rests on your shoulders. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tools or Fools?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tools or Fools?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ryan O'Donnell\n          \n            Ryan O'Donnell"
}