{
  "url": "https://moz.com/blog/tool-of-the-week-keeping-visitors-with-lijit",
  "slug": "tool-of-the-week-keeping-visitors-with-lijit",
  "title": "Tool of the Week: Keeping Visitors With Lijit - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At their purest for, search engines hope to use the wisdom of crowds to accurately sort pages across the internet. They pay attention to the words a page uses to talk about another page and adds up some numbers. This is obviously a wonderful idea for a system until people figure it out and begin to…",
  "content": "Tool of the Week: Keeping Visitors With Lijit SEO Tools K By: kung_fu_mike May 8, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! K By: kung_fu_mike May 8, 2008 Tool of the Week: Keeping Visitors With Lijit SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. 5-8%. It doesn't sound like a huge amount of most things. What if I told you it was 5-8% of the visitors to your site? Would you be more interested then? What if I told you it was 5-8% of the visitors you coveted the most? The visitors you spent the most time worrying about? The most energy on? The visitors that don't stay. That's right. What if I told you there was a way to get 5-8% of the people who returned to the search engine results page to stay on your page? Keep reading. Lijit is the brain child of Stan James, stemming from his master's thesis project Outfoxed. Outfoxed was social network combined with a browser plugin. It worked by appending markup to your search results pages telling you who might know whom, and how much they trusted an individual result. Obviously a social network that only works when there is a bunch of people on it combined with a browser plugin is a tough business model. Lijit was born of one of the primary values of Outfoxed, trust-based searching. Lijit allows you to create your own network of pages including social network profiles, blog, delicious tags, and many other things all searchable from the Lijit widget placed on your page. The setup is easy, and it leads us to the 5-8%. The 5-8% is the figure reported by Micah Baldwin of Lijit as the average percentage of visitors who click on one of Lijit's suggested links, which come from what I believe to be Lijit's finest feature. First we start with a Google search for \"term sheets\". Down at the 10th link position you will see \"Term Sheet Series Wrap Up\" by Brad Feld. I am headed there 1) because he has the Lijit Widget installed, and 2) because he a friend and I like his page. When you click on the link to his page, notice the lijit display at the top labeled \"Looking for more about term sheets?\" This is where Lijit has made its mark. It has given the visitor another place to go besides back. Lijit is wonderful tool to keep more traffic not just in your site, but in your content. I highly recommend checking them out. If you have questions, feel free to post them below and maybe Micah will be paying attention. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tool of the Week: Keeping Visitors With Lijit"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tool of the Week: Keeping Visitors With Lijit"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "kung_fu_mike\n          \n            kung_fu_mike"
}