{
  "url": "https://moz.com/blog/tool-of-the-week-disk-usage-analysis-with-baobab",
  "slug": "tool-of-the-week-disk-usage-analysis-with-baobab",
  "title": "Tool of the Week - Disk Usage Analysis with Baobab - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Working as a tech at an SEO company isn't always about SEO.  Behind the scenes there are servers to support, tools to debug, and interoffice technical problems that arise all the time.  The developers at SEOmoz have picked up a few tricks  & tools along the way that have helped us solve all sorts…",
  "content": "Tool of the Week - Disk Usage Analysis with Baobab Technical SEO By: MelGray May 1, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: MelGray May 1, 2008 Tool of the Week - Disk Usage Analysis with Baobab Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Working as a tech at a SEO company isn't always about SEO. Behind the scenes, there are servers to support, tools to debug, and interoffice technical problems that arise all the time. The developers at SEOmoz have picked up a few tricks & tools along the way that have helped us solve all sorts of problems. We're going to start making it a weekly habit of posting interesting tools that could help developers and administrators at other small / medium businesses. This week's tool is \"Baobab.\" It is a Linux based tool that helps analyze disk usage. If any sys admins out there have any experience with Ubuntu Linux, they may already be familiar with Baobab (it's listed as \"Disk Usage Analyzer\" in your 'Accessories' toolbar). Below is a sample image of the output you get after you first start Baobab: The above output is very pretty and makes identifying what's taking up the most disk resources a snap. However, the above snapshot is a view of local disk usage. The killer feature of this tool is that it allows you to view disk usage on remote servers using protocols like ssh, ftp, webdav, etc. If you're at risk of running out of disk space on your web server, you can plug in your log in information and get a visual representation of what's eating up all them gigabytes. I'll illustrate the usefulness of this with a real scenario we faced at the Mozplex a while back. We have an Intranet file server that we use to store the valuable information that is used to power SEOmoz (like articles, legal documents, and the entire Wu-tang Clan discography). One day I came into work and was greeted with an urgent email saying that nobody could save any new documents on the Intranet. I quickly logged in and discovered that the disks were completely full. I calmly thought to myself, \"OMG WTF?\" I began solving the problem by plugging in my ssh credentials and grabbing a cup of coffee while Baobab worked its magic. After a short while, the entire scan was complete and I was able to pinpoint the problem: That's a whole lot of rock! Come with me as I journey further into the ROCK! that powers SEOmoz. Well well well, what do we have here...... DREAM THEATER?!? 3.4 GB OF DREAM THEATER?! Only 2.7 GB of The Cure In just a few minutes I was able to determine that Dream Theatre and Robert Smith were partly at fault for our Intranet file sharing problems. After a few more minutes, I was able to really dig into the Baobab report and trim down disk usage significantly. As you can see, Baobab allows you to view your disk usage in a very convenient way. Other visualization formats are available, so if you get a chance play around with it, it's very cool. Baobab is currently Linux only (although there have been reports of it working with Mac OS X). If you don't have access to a Linux machine, VMware is a nice compromise. I recently made the switch to OS X and am running Gutsy on my Macbook using VMware fusion. If anybody out there has any other recommendations for tools that can analyze disk usage on remote machines, please say so! That's it for this week! Next week we'll be back with another tool that can help make the tech in your company less technical. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tool of the Week - Disk Usage Analysis with Baobab"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tool of the Week - Disk Usage Analysis with Baobab"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "MelGray\n          \n            MelGray"
}