{
  "url": "https://moz.com/blog/top-seo-tips-2024-whiteboard-friday",
  "slug": "top-seo-tips-2024-whiteboard-friday",
  "title": "Top SEO Tips for 2024 — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's no surprise that in 2024, the main theme that we're going to see is how to manage SEO in an AI landscape. Crystal shares her top SEO tips to navigate this.",
  "content": "Top SEO Tips for 2024 — Whiteboard Friday Whiteboard Friday | Marketing Industry | AI and SEO By: Crystal Carter Edited By: Emilie Martin March 1, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Crystal Carter Edited By: Emilie Martin March 1, 2024 Top SEO Tips for 2024 — Whiteboard Friday Whiteboard Friday | Marketing Industry | AI and SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's no surprise that in 2024, the main theme that we're going to see is how to manage SEO in an AI landscape. Crystal shares her top SEO tips to navigate this. Click on the whiteboard image above to open a high-resolution version in a new tab! Hi, my name is Crystal Carter. I'm the Head of SEO Communications at Wix, and today I'm going to talk to you about SEO tips for 2024. Anybody who's been paying attention to the SEO space, to the tech space, to the world at large has probably noticed that AI has been on the top of everyone's minds in the last sort of 18 months or so. 2022 was stormin’, 2023 was normin’, and 2024 will be performin’ So it's no surprise that in 2024 the main theme that we're going to see is lots of reasons and lots of ways to manage SEO in an AI landscape. I think that this is something that we're going to see coming to more maturity this year because, in 2022, it was kind of storming. We had lots of new ideas from AI. It's been in the landscape for a while, but in 2022, it became much more mainstream and much more available to most people, and so has become a lot more of a hot topic for lots of marketers, and people were figuring out what we can do and how we can manage that. In 2023, we started seeing AI becoming more commonplace and becoming something that was integrated into lots of tools that we use really regularly and becoming something that both customers and marketers expect to see in their day-to-day work. And I think in 2024, we're going from a storming area to a norming and now to performing. So we're going to see lots of marketers who are really savvy with some of these SEO tools and who are doing some really sophisticated things with these AI SEO tools, and I think that it's going to change the way that we manage SEO. So here are my tips and my predictions for this new landscape: AI content optimization So, first of all, we're going to see a lot more AI content optimization strategies, and they're going to be mostly around bulk publishing. Bulk publishing was something that was previously something that bigger content teams were able to do, and smaller content teams maybe didn't have as much facility or resources to do. But pretty much everyone has the ability to do that now. So as well as being able to bulk publish, people are going to need more strategies for how they bulk publish and how they create new content at scale. This will also mean that people will need to learn how to update at scale, because if you're able to publish 20 articles at once, you're also going to need to be able to optimize those articles at once and make sure that you're optimizing all of your links and all of your keywords and all of that stuff so that it all works really well together. So building those skills will be something that you should think about. But within that, my top tip for that is to learn how to balance bulk content creation and optimization with differentiation because while you're going to be able to create content, try not to make it just copy-and- paste, cookie-cutter content. You want to make sure that you are still emphasizing the differentiation that's really important for SEO and for SEO to perform in the SERP. AI powered competition Along with this bulk content optimization thing, you're also going to see a lot of your competition are doing this as well. So AI-powered competition is going to change the way that SEOs are able to rank and how often they are able to rank. So we're probably going to see more content volatility from your competitors. So for instance, if you had a piece of content that maybe you had, that maybe you were updating maybe every six months or something, it might be that, because there are more competitors coming into your space, into your particular SERPs, that you need to update it more frequently. It's also the case that other competitors are going to be able to update their content more frequently because they have access to so many new AI tools. So within this landscape, I think it's important to think about trending topics. Trending topics are really, really useful because they offer opportunities to differentiate, but also because trending topics are less covered by LLMs. LLMs tend to rely on historical content. They tend to rely on historic information. So if you are able to lead the conversation to become a primary source of information, then you're more likely to be able to manage in this newly competitive space. Cyborg content The other thing I think it's worth thinking about when we think about differentiation and competitors is cyborg content. And what do I mean by this? When I say cyborg content, I don't necessarily mean that you need to be robocop. However, I think that we should be thinking about the way that we balance user-generated content, UGC, and AI content in the SERP. It's going to be something with hidden gems that becomes more apparent as users search. It also means that users are going to see different ways of connecting with user-generated content. I've seen this on Quora, for instance, where they're able to use a bot, and it says at the top of their content that there's a bot that's sort of summarizing the conversation that people are having. So that's one way to do it. I've also seen on LinkedIn, they have their advice articles where they say, \"Here's a piece of content that's created with AI,\" and the AI will give the prompts and the questions, and then they'll have users who are answering the questions with their own human experience. When people are able to balance that UGC with AI content, they are getting some great results. So if you're able to do that with some of your own content, that's a great win. Additionally, communities are going to be driving content distribution and content creation. With the rise of so much content coming through AI and the competitive landscape changing so rapidly, people are still going to need answers, and people are going to be looking for answers in places that they trust. Communities that they know are going to be great sources for that. And whether the content itself comes from an AI source or is handwritten, bespoke, artisanal content, I think that the fact that you're able to share it within the communities and for people within the communities to be able to vouch for that content is going to mean a lot more in this space. And as a result of all of that, I think E-E-A-T is going to become a bit of a blueprint for human-led AI content in the next few months. The reason why I think this is so important is because Google has pretty much told us this. They added the extra experience E onto the E-A-T information last year, and I think that that's not a coincidence. So the experience that people are able to illustrate is really, really important because bots don't have opinions. Bots don't own bicycles. They don't have pets. They don't have actual real-world experience. So I think that where we're able to demonstrate that real-world experience and able to format it with great AI tools, I think that's going to be a great win for content creators in the next little while. So that's content creators and how they're going to be managing this AI space there. AI vs search engine We should also be thinking about how search itself is going to be changing in this time and how we can respond to that. So with AI content and all of this bulk content, that's a lot of new content that's coming online this year, and Google is trying their very, very best, and lots of other search engines are trying their best to keep up with this tidal wave of content. So they're doing this in a few ways. One of the things that they're doing is indexing by type. So you'll notice that there's a lot of content within Google Search Console, which is now managed by feeds. So if you think about, for instance, like product feeds, blogs are managed with RSS, they're also managing jobs with different feeds, and they keep adding more and more. Content video pages are now being indexed in this particular way as well. So when you think about that, that's because they're trying to have you help them with organizing your content by type. So think about how you can do that, how you can organize your content to make it easier for search engines to find it amongst all of this other content. I think also within the space, I think domain age is going to be carrying a little bit more weight during this time. So this is something to consider with your backlinks and with the sort of partnerships that you might be creating. This is because those are going to have more pages that have been historically ranking and have been historically indexed. So I think that that's going to be very important during this space. And as a result and when you think about your own domain, the thing that's really important to think about is your pillar pages. So pillar pages, if people aren't aware, have to do with topic clusters and things like that, and you should use those strategically. So if you are having a situation where maybe you're not having so many pages be indexed because there's so much content and Google is trying to index it all, think about your pillar pages and try to make sure that you're able to organize your content in a way where the pillar page is definitely indexed, and everything comes off of that in a nice, tidy, organized way. This is something that will allow you to get great value for your customers and also to balance the way that the index is sort of changing right now. AI in the SERP AI in the SERP is also evolving this year. So we've heard about SGE, and there's Bard, and there's new Bing, and there's all of these different things that have been happening in the last year, and I think that going forward, Google keeps making more announcements. They recently announced about Gemini and other things that are coming through to the SERP. And I think that the way that people are going to be searching in the SERP is going to be very, very dependent on user journeys. So the way that people talk to something like Bard or talk to the SGE, they ask follow-up questions and follow-up questions and follow-up questions. So if you have a cohesive user journey within that, then you're more likely to show up as part of the journey for a particular query. And I think that also with this brand entity will impact your visibility. What Google and what LLMs understand about your brand and the entities around your brand will make them more likely to surface your brand, your products, the things that you do in those conversational SERPs as we go forward. So it's worth doubling down on long-tail queries that are associated with your brand because of this conversational space and because of this user journey as we go forward. AI tools as search engines The other thing that's worth thinking about is that users are now having more opportunities to use search and use AI tools as search engines. So we've started to see a more platformization of ChatGPT, particularly ChatGPT-4, with custom GPTs and other tools like that. And essentially, this is going to change the way that users think about how they search for information. Users can search more conversationally. They can say, \"Hey, what should I do about this particular situation because I don't know what's going on,\" that sort of thing. So they'll be able to have more conversation, and they'll expect to be able to have more conversation in the SERP. So think about that when you're thinking about your long-tail queries, for instance. And users are also going to sort of expect UGC as a sort of parallel to that. So we talked about the cyborg content, and I think that users are going to expect to be able to see like, okay, this is the polished content that's maybe generated by AI and maybe solves my query and that sort of thing, and this is the more sort of user-generated information. Think about it like when you search for a hotel, and you see the hotel images, and you think like, okay, this is the vibe they're going for with the swimming pool, and then you see the actual like user images, and maybe they're not exactly as shiny as the other ones, but you can still find the balance in between. So I think that when users are using the AI tools as a search engine, it means that they're going to expect user-generated content on the site in order to validate the information and in order to act as a sort of foil for them to find this sort of balance in between. So I think that platformization will offer new opportunities to unlock value within some of that space, and it also will offer you opportunity to unlock value from your own corpus of content. So I know, for instance, there's a lot of companies who have a lot of legacy content that's still on PDFs, for instance. It might be that you can use some of these LLMs, some of the things like custom GPTs, for instance, to unlock some of that content and to make that content more available for people who are using AI tools as search engines. I think it's going to be a fascinating year in 2024, and I wish you all the best. Transcription by Speechpad Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top SEO Tips for 2024 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top SEO Tips for 2024 — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "2022 was stormin’, 2023 was normin’, and 2024 will be performin’"
    },
    {
      "level": "H2",
      "text": "AI content optimization"
    },
    {
      "level": "H2",
      "text": "AI powered competition"
    },
    {
      "level": "H2",
      "text": "Cyborg content"
    },
    {
      "level": "H2",
      "text": "AI vs search engine"
    },
    {
      "level": "H2",
      "text": "AI in the SERP"
    },
    {
      "level": "H2",
      "text": "AI tools as search engines"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Crystal Carter\n          \n            Crystal Carter\n          \n            Crystal Carter"
}