{
  "url": "https://moz.com/blog/top-ten-twisted-trends",
  "slug": "top-ten-twisted-trends",
  "title": "Top Ten Twisted Trends - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm fairly sure this is exactly what the Google programming team had in mind when they created Trends - a list of geeky searches that produced humorous graphs. Here goes:\n#10 - Spending Christmas by YourselfFolks seem to be getting lonely around t...",
  "content": "Top Ten Twisted Trends Search Engines By: Rand Fishkin May 21, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 21, 2006 Top Ten Twisted Trends Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm fairly sure this is exactly what the Google programming team had in mind when they created Trends - a list of geeky searches that produced humorous graphs. Here goes: #10 - Spending Christmas by YourselfFolks seem to be getting lonely around the holidays. The spikes at the end of 2004 and 2005 for these two searches can help to back that up. #9 - Overworked & SoberHere's an easy way to tell that Americans are working harder and playing less. #8 - A Long Time Ago in a Galaxy Far, Far Away...The also rans from Star Wars vied for top honors in search. #7 - The Son of FameNo one said it was easy making it in the shadow of greatness, but this is ridiculous. I've actually seen both these guys in concert and at least with Jakob, you can make out lyrics. #6 - The Three Amigos Ride AgainI'm shocked at who garners more searches on this one. Too bad El Guapo doesn't get a listing. #5 - To Buttle or Not to Buttle, that is the QuestionIt looks like people are finally getting the message about Jeeves' retirement - either that or they're giving up on Ask entirely. #4 - A Girl's Gotta Keep in ShapeWhen two search spikes match up like that, it can only mean one thing - that these two keywords go together like peanut butter and jelly. #3 - What Happens on Vacation Stays on VacationIf you're seeking to have a truly memorable, completely non-disclosable time while traveling, you can't do much better than the OC. How is Las Vegas not on this list? #2 - Web 2.doh!Although I'd like to believe the web industry has learned from its mistakes, it appears that while one movement gains traction, another is grinding to a halt. #1 - Equality is AchievedThere may still be a glass ceiling in the workplace, but in social lives, at long last, men and women have achieved some parity. Got any favorites of your own to share? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top Ten Twisted Trends"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top Ten Twisted Trends"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}