{
  "url": "https://moz.com/blog/top-local-search-ranking-factors-explained",
  "slug": "top-local-search-ranking-factors-explained",
  "title": "2023’s Top 7 Local Search Ranking Factors, Illustrated and Explained - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today, we’re going to look at how to set the local businesses you market apart by mastering the top of the list of ranking factors, with lots of practical tips for improving your rankings so that you’re earning greater visibility.",
  "content": "2023’s Top 7 Local Search Ranking Factors, Illustrated and Explained Local SEO By: Miriam Ellis May 8, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis May 8, 2023 2023’s Top 7 Local Search Ranking Factors, Illustrated and Explained Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Learning to be the best in town at the top seven elements experts feel impact your rankings in Google’s local packs is a smart strategic foundation. Thanks to Darren Shaw who has been running the Local Search Ranking Factors survey since 2017, we all benefit from this respected annual report in which local SEO professionals get to pool their practical knowledge of what they see impacting clients’ rankings most. Today, we’re going to look at how to set the local businesses you market apart by mastering the tippy-top of the list of factors, with lots of practical tips for improving your rankings so that you’re earning greater visibility. But, first, what is a local pack? This is the umbrella term for the local business results Google displays when it feels a searcher’s query has a local intent. Local packs have a variety of formats, like this one with the large map and lettered results: And this one, also with the large map, but no letters and no links to the website or driving directions: And this one, with the map above the results, and again, no letters or website/directions links: There are many variations, based on query, industry, and device. Frequently, local packs appear above the organic results, but they can also be displayed further down the page. Mostly, local packs contain three results, but this number can sometimes change and they may also contain paid ads. Aspects of your Google Business Profile, as well as other sources like your own website and third-party websites, have a demonstrable impact on whether or not you show up in Google’s local packs and the extended listings they click to that are called the Local Finder results. Now that we’ve got that covered, let’s look at this year’s 7 most influential local pack ranking factors. 1. Primary Google Business Profile category It’s a local search fact of life that you can’t rank for your most important search phrases unless you’ve selected the right GBP category, and the primary category matters most. Usually, Google displays the primary category on your Google Business Profile (see “Italian restaurant”, above), but not always. You select your primary category by logging into your Google account, searching for your business by name, and then clicking on the Edit Profile tab in the New Merchant Experience editor: Your primary category is the one you enter into the primary category box, and you can add a total of ten categories: To discover the best category for your business, follow these steps: Search for the #1 phrase for which you most need to rank in the local results and look at which categories the top-ranked businesses are using.If you see diverse categories represented amongst the top 3 businesses, note which one most closely matches your business. For example, is your broadest and most accurate category “Italian restaurant” or “Fine dining restaurant”? If the listing you are creating isn’t for your main business but is for a practitioner within a multi-practitioner company (like a legal firm with three lawyers or a dental practice with five dentists), try to diversify the categories you choose so that they don’t compete with the main listing for the practice. If the listing you are creating is for a multi-location business, it’s okay to use the same primary category across all your listings, but if the close proximity of one branch to another appears to be causing one of your locations to be filtered out and invisible in the local packs, consider diversifying your primary categories. If your market research indicates that your local market is extremely competitive/crowded for a particular category (think personal injury attorneys in Los Angeles), make a decision about whether you can reasonably compete for local pack visibility for the same category the top competitors are using, or whether you want to try to earn business from a less competitive category while you work to establish the brand you are marketing. Note how most of these businesses have chosen the primary category “Italian restaurant”, but one has chosen to be more specific with “Northern Italian Restaurant”: That small difference could either positively or negatively impact the restaurant’s ability to rank for its most desired search phrases. So, pick a primary category, but don’t be afraid of changing it at a later date if you feel it might be holding you back. Testing is a smart practice. We’ll be returning to the topic of choosing categories when we get to factor #7, below. 2. Keywords in Google Business Profile business title Local SEOs keep a running agony column of spammy GBP business title examples, like this tweet from Darren Shaw. Unfortunately, seeing that keywords in the business title is such a powerful ranking factor can mislead business owners and marketers into believing they should be putting something other than their real world business name in this field of the New Merchant Experience editor: The field is meant to contain only your real-world business name as it appears on your street signage with no extraneous keywords. In this screenshot, you can see that the name is just listed as “Moz”. Not “Moz Vancouver” or “Moz Seattle” or “Moz best SEO software company in America”. Unfortunately, a weak spot in the algorithm Google uses to order results causes them to reward listings with spammy business titles. It’s probably the least-sophisticated aspect of Google’s system that it can be fooled by keyword-stuffing business titles. You can flag businesses with spammy names, and sometimes Google will edit them, but the penalties are never severe and, in my experience, the spammy names often simply re-appear shortly thereafter. This problem with the system has business owners and marketers wondering whether they should be honest or try to game the system. Of course, the former is the best policy for companies that plan to build a lasting good reputation, but here are a few tips to help you work amid a rather messy scenario: If you are trying to understand how to write the business title for something other than a single location business (such as a co-located business, solo practitioner, or multi-practitioner business), consult the Guidelines for Representing Your Business on Google for detailed instructions.Feel free to report competitors in your market with spammy business names. Google may or may not act on your reports, but if they do, it can help decrease the ranking power of spammers and help your listing with its legitimate name move up.Don’t name your business something that could limit its future growth. For example, think carefully before calling your new restaurant “Tacos San Diego” if there is any possibility that you may someday open branches in San Jose, San Francisco, and Santa Rosa. If circumstances have made you realize that your real-world business name appears to be holding you back, you do have the option to legally change your name. If you decide on this course of action, try to choose a name that will stand you in good stead for many years to come. Be wary of trendy fads. For example, some local businesses have gone viral, as in the case of a NYC restaurant named “Thai Food Near Me”, but be careful you aren’t dubbing yourself with a phrase that could look dated three years from now. If your company does rebrand, be sure to update all legal registrations, local business listings across the local search ecosystem, all social media profiles, and all references to the old name on your website and third-party websites 3. Proximity of address to the point of search Back in 2017 when Darren Shaw first noted that the distance between the person searching and the thing being searched for had become the #1 local search ranking factor, he created the above graphic to illustrate this phenomenon. Your business may be situated on Jasper Avenue near the center of Edmonton, but each of your customers is in a different location, on a different device. In 2023, proximity of address to the point of search may have slipped to number 3, but it is still every bit as important to understand that there are no static number 1 local search rankings because Google shows each of your customers different results based, in part, on the location of their mobile phone, laptop, or other device. You can witness this in action by walking or driving around town, searching for the same keyword phrase. Local market research involves either engaging in this process manually to assess your overall visibility throughout your market, or using a local rank checker like the ones offered by Whitespark, Local Falcon, or Mobile Moxie’s Serperator. You can’t control where your customers are and the only option you have if you discover your physical address is limiting your ability to meet goals is to move to a new location (a daunting prospect). What every local business marketer can and should do, however, is to observe how Google is behaving for each desired search phrase. For example, you might discover that when you search for “tacos”, Google is casting a very narrow net for local results, showing restaurants mainly clustered in a single neighborhood of your city. But when you change your search to “organic vegan tacos”, suddenly Google is widening the net to encompass the whole city or even reaching beyond city boundaries. That’s amazing business intelligence because it shows you opportunities to optimize for more specific terms and show up for more distantly-located customers. Use this knowledge in choosing your: CategoriesServicesPhoto and video subjectsAttributesWebsite topics While you can’t control Google’s heavy emphasis on proximity, you can respond to it with a smart local search strategy. And this segues nicely into the next factor. 4. Physical address in city of search Look up your city in Google and click on the map. The red border, as shown above, indicates Google’s concept of the perimeters of your town or city. The reason this matters to local SEO is that businesses located beyond the border often have a much harder time becoming visible for searchers located within the border or for search phrases that contain the name of the town or city. “I want to rank beyond my location,” has got to be one of the commonest requests local SEOs hear from clients (so common that I wrote an entire column about this in 2019 you might like to read). If you come to suspect that your physical address is severely limiting the number of customers who are finding you online, you have three main options: Moving to a new location inside Google’s bordersRe-optimizing your presence to compete for less-competitive terms, as described in relation to factor #3Making a substantial investment in multiple aspects of your local search marketing so that your Google Business Profile becomes so strong that it overcomes Google’s city border bias. There is no guarantee that the third option will work, but it is often the best bet. To undertake this work from an informed stance, you will need to conduct a competitive local business audit of the top competitors for each of your most important search phrases. By using the free spreadsheet included in that article, you will be able to identify multiple factors that are likely contributing to the high visibility of the top-ranked competitors, and determine what you need to do to surpass their efforts. You may find yourself investing in review acquisition and management, local business listing development, link building, content development, and other areas. Sometimes, you can find sweet spots in which Google is willing to go beyond the borders for strong brands, so studying the maps and Google’s behavior is an essential local search marketing habit. 5. Removal of spam listing through spam fighting Four years ago, I wrote a column on Simple Spam Fighting: The Easiest Local Rankings You’ll Ever Earn and I’m sorry to say that the tactics I covered for recognizing spam are every bit as necessary today as they were back then. Google’s listing spam problem is massive. Both novice and bad actors have filled up the index with results that mislead the public and violate Google’s guidelines. It’s a sad story that’s as old as local search, and every year is a new year to hope that Google will give more attention to protecting businesses from misrepresentation and unfair competition, while protecting consumers from disinformation. Perhaps the challenges now being posed by AI, like ChatGPT, and competitors for attention, like TikTok, will put some healthy pressure on Alphabet to defend the relevance of Google’s local results. In the meantime, local business owners and their marketers have the toilsome (yet, perhaps satisfying?) option of reporting spam listings so that they can move up in the local pack rankings if/when the spammers are removed. To do this effectively, you need to know what constitutes spam in Google’s environment. This can range from: Fake business namesIneligible business modelsMultiple ineligible listings for the same businessFictitious businessesFictitious locationsFake reviews Learn the Guidelines for Representing Your Business on Google like the back of your hand, and you will become adept at spotting listing spam. When you believe you’ve encountered a spam listing, your best bet is to use the business redressal form to report it. If you come across a widespread pattern of spam in a given results set and use of the form isn’t getting any traction, you may need to use your marketing skills to bring public attention to the problem in hopes of inspiring Google to act. Want more spam fighting tips? Sterling Sky has a good piece on this. 6. High numerical Google ratings Your average star rating isn’t just a top local pack ranking factor, but it’s also a top conversion factor. In our report on the Impact of Local Business Reviews on Consumer Behavior, respondents cited the star rating as the most important component of reviews: Meanwhile, a majority of 51% say a business must have at least 4 stars for them to consider choosing it. Chances are, if your reputation is below 4 stars, you’ll have some work ahead of you in both improving customer experiences and in actively seeking reviews so that a small number of negative reviews isn’t having an outsized impact on your average rating. For a complete tutorial, read How to Repair and Improve Local Business Reputation via Google Star Ratings and Reviews. Embrace the welcome news that 37% of customers may still give your business a chance, even with a less-than-four-star rating, and this may give you the time you need to make strategic business changes to raise your rating and start winning better rankings and more customers. 7. Additional Google Business Profile categories The fact that two of the top seven local search ranking factors relate to categories emphasizes just how important these small elements are. Once you’ve selected your most influential primary category, you have nine more chances to help Google understand your relevance to specific customer intents. Inspiration for filling in those category fields is easiest to find if you either download the GMBSpy Chrome extension or fire up GMB Everywhere to see all of the categories your top local competitors have chosen. If they relate to your business, add them to your profile. Then, read How to Choose GBP Categories (With Cool Tools) for further suggestions on researching and implementing the right identifiers of your business. Over time, keep an eye on Sterling Sky’s running tally of new business categories, in case Google adds something that was previously missing and helps further describe what your business is. And that’s it for today! Once you’ve gotten a great handle on perfecting your management of the top 7 local search ranking factors, move on to tackle the rest by reading WhiteSpark’s full report. Meanwhile, if you’ve got a new tip or tactic for climbing up the local pack rankings, please don’t hesitate to @ Moz on Twitter! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "2023’s Top 7 Local Search Ranking Factors, Illustrated and Explained"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "2023’s Top 7 Local Search Ranking Factors, Illustrated and Explained"
    },
    {
      "level": "H2",
      "text": "But, first, what is a local pack?"
    },
    {
      "level": "H2",
      "text": "1. Primary Google Business Profile category"
    },
    {
      "level": "H2",
      "text": "2. Keywords in Google Business Profile business title"
    },
    {
      "level": "H2",
      "text": "3. Proximity of address to the point of search"
    },
    {
      "level": "H2",
      "text": "4. Physical address in city of search"
    },
    {
      "level": "H2",
      "text": "5. Removal of spam listing through spam fighting"
    },
    {
      "level": "H2",
      "text": "6. High numerical Google ratings"
    },
    {
      "level": "H2",
      "text": "7. Additional Google Business Profile categories"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}