{
  "url": "https://moz.com/blog/top-25-moz-blogs-2021",
  "slug": "top-25-moz-blogs-2021",
  "title": "Hit Me With Your Best Blogs: The Top 25 Moz Blogs of 2021 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In case you missed anything, we’ve compiled the top 25 most-read pieces from the last 12 months! You’ll find Whiteboard Friday episodes, technical SEO insights, search engine updates, and tips for analytics, among several other topics. Enjoy!",
  "content": "Hit Me With Your Best Blogs: The Top 25 Moz Blogs of 2021 Moz News By: Morgan McMurray December 29, 2021 Table of Contents Copied! By: Morgan McMurray December 29, 2021 Hit Me With Your Best Blogs: The Top 25 Moz Blogs of 2021 Moz News 2021 was a big year for Moz: we joined the Ziff Davis family, held our second all-virtual MozCon, added a technical SEO certification to Moz Academy, released new and improved guides for topics like local SEO, link building, and Google Analytics, and launched exciting betas for Moz Pro — Performance Metrics and True Competitor. We also published 186 posts on the Moz Blog this year, and as is tradition, it's time to look back at the most popular ones! You’ll find Whiteboard Friday episodes, technical SEO insights, search engine updates, and tips for analytics, among several other topics. Enjoy this look-back, and have a safe and happy new year, Moz friends! See you in 2022. *The top 25 Moz Blog posts published between January 1 - December 28, 2021, in order by pageviews generated during that timeframe. 1. 21 Smart Google SEO Tips Author: Cyrus Shepard | Published: January 8, 2021 Moz SEO expert Cyrus Shepard shares his top 21 tips for successful Google SEO, including what to prioritize and what to look out for in the year(s) ahead. He's also included a bunch of helpful resources for your reference in the transcription! 2. The Definitive Guide to JavaScript SEO (2021 Edition) Author: Pierce Brelinsky | Published: February 9, 2021 The web is in a golden age of front-end development. JavaScript and technical search engine optimization are experiencing a renaissance. In this article, Pierce Brelinsky of Go Fish Digital shows you how to optimize your JS-powered website for search in 2021 and beyond. 3. SEO Forecasting in Google Sheets Author: Tom Capper | Published: February 1, 2021 After the success of a 2015 article in which he shared a free forecasting tool, Tom has created a new, free spreadsheet template to forecast how your SEO efforts will affect your site traffic. In this post, he shows you how it works and how to use it, and then how to build your own (better?) version. 4. UTM Tagging for Google My Business Author: Claire Carlile | Published: August 6, 2021 Guest host and small business SEO expert Claire Carlile walks you through the what, why, where, which, and who of UTM tagging for your GMB profiles. 5. 3 Vital Click-Based Signals for SEO: First, Long, & Last Author: Cyrus Shepard | Published: April 7, 2021 This post shows you how to optimize for click signals to improve your SEO, regardless of how Google might use them as a ranking signal. 6. When & How to Disavow Backlinks in 2021 Author: Tom Capper | Published: April 28, 2021 It’s been nearly nine years since Google rolled out its Disavow Tool. This guide covers how and when to use it, and the potential risks and benefits. 7. Beginner's Guide to Google Business Profile: What It Is, How To Use It, and Why Author: Miriam Ellis | Published: March 15, 2021 Reference this simple, comprehensive guide to get off on the right foot with one of Google’s most important digital assets for local businesses. 8. 7 Emerging Technologies in SEO and Their Applications Author: AbdulGaniy Shehu | Published: February 22, 2021 As an SEO professional, you need to know the latest industry trends to keep up with its ever-changing demands. In this post, you’ll find seven emerging technologies in the SEO industry, and how they impact your work as an SEO expert. 9. How to Calculate Your SEO ROI Using Google Analytics Author: Adriana Stein | Published: September 6, 2021 Measuring ROI for your SEO efforts involves two factors: KPIs and the cost of your current SEO campaigns. With GA, you can pinpoint where your audience is coming from, set goals to stay on track, and incorporate the most attractive keywords to rank better in search engines. 10. How to Write an SEO-Focused Content Brief Your Writers Will Love Author: Kameron Jenkins | Published: February 10, 2021 The right content brief can help you maximize organic search traffic. Learn what to include in your content briefs, what to avoid, and tips for getting your writers bought in. 11. How to Explain Domain Authority to a Non-SEO Author: Andy Crestodina | Published: February 19, 2021 Do you ever have to explain the importance of Domain Authority to clients or co-workers who have little or no SEO experience? If so, Andy Crestodina walks through how to get your message across successfully. 12. How to Measure the Quality of Your SEO Traffic Using Google Analytics Author: Adriana Stein | Published: November 23, 2021 To get a better understanding of what’s considered “quality traffic”, we’ll look into various Google Analytics metrics that will help you create a rock solid SEO strategy. 13. 100% Free Technical SEO Site Audit Checklist (& Beyond) Author: Cyrus Shepard | Published: June 7, 2021 Learn the tools and tactics you'll need to pinpoint technical issues on your site and turn them into wins for your users and your rankings with this free technical SEO checklist from Moz. 14. 7 Actually Smart Tips to Reduce Bounce Rate Author: Cyrus Shepard | Published: March 26, 2021 Is a high bounce rate bad? The answer is: it depends, but yes, sometimes it can be. Is a high bounce rate bad for SEO? That’s where it gets a little more complicated. In this week’s episode of Whiteboard Friday, Cyrus gives you seven easy SEO tips to address your bounce rate, and increase engagement and satisfaction to make your users happier. 15. 9.5 Ways Google Rewrites Your Title Tags Author: Dr. Pete Meyers | Published: August 31, 2021 In August, Google released a title rewrite update that may have left you feeling confused and more than a little frustrated. But why is Google rewriting titles, and what can we learn from it? Dr. Pete explored over 50,000 <title> tags to find out. 16. Featured Snippets Drop to Historic Lows Author: Dr. Pete Meyers | Published: March 1, 2021 On February 19, MozCast measured a dramatic drop (40% day-over-day) in SERPs with Featured Snippets. This is the lowest prevalence rate of Featured Snippets in our data set since summer of 2015. What's driving the losses, and who is most affected? Also be sure to read the follow-up piece from March 22: Featured Snippets: Not Gone, Just on Holiday (Apparently) 17. According to the Experts: 5 Technical SEO Trends to Watch in 2021 Author: Morgan McMurray | Published: March 9, 2021 To find out more about the current state of technical SEO we asked seven industry experts for their thoughts and advice. Here's what they had to say. 18. Long Tail SEO in 2021: How You Can Have It All or Die Trying Author: Dr. Pete Meyers | Published: April 21, 2021 Due to Google’s advancements in Natural Language Processing, the long tail of search has exploded. However, I will argue that NLP has also imploded the long tail, and understanding how and why may save our collective sanity. 19. 8 Unconventional Ways to Generate Qualified B2B Sales Leads Author: Nadya Khoja | Published: January 18, 2021 It’s time to take an unconventional approach to lead generation, especially for B2B companies, because B2B is a different ballgame than B2C — and your strategies need to reflect your audience. 20. 6 Steps to Executing an Efficient SEO Clean-Up Strategy Author: John Allen | Published: April 27, 2021 In this article, learn how to successfully execute an SEO clean-up strategy to ensure your site aligns with your business goals, keeps you in Google’s good books, and yields an excellent user experience for visitors and customers. 21. The Three Bosses of SEO Author: Ola King | Published: September 10, 2021 In SEO, there are three main “bosses” with different needs: your business, your searchers, and your search engines. How do you answer to all of them? 22. The ROI of SEO Author: Kavi Kardos | Published: October 15, 2021 Search marketers can't get our important work implemented if we can't prove that it's worth the investment to our higher-ups. With that in mind, Kavi Kardos gives you the numbers and the talking points you need to justify the return on investment of your SEO work. 23. How We Increased Our Client’s Leads by 751% on Less Than £1K Per Month [Case Study] Author: Lydia German | Published: January 27, 2021 The team at Tao Digital Marketing breaks down how they were able to go above and beyond for their client, Fleetcover, using four strategies that increased leads by 751%, keywords by 259%, and impressions by 535% — all with a small SEO budget. 24. Technical SEO Implementations to Increase the Impact of Your Link Building Campaigns Author: Crystal Carter | Published: April 26, 2021 In this blog, examine some of the technical SEO strategies you can use for your site before, during, and after your link building campaigns in order to optimize the performance and long-term impact of each campaign. 25. Announcing the New Technical SEO Certification Series: What It Is & How to Get Certified Author: Kavi Kardos | Published: February 2, 2021 The Moz Learning Team has put in many, many hours of work to develop a technically focused, in-depth training series that hones in on the nuts and bolts of technical SEO. We’re thrilled to announce the launch of the Technical SEO Certification Series through Moz Academy. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Hit Me With Your Best Blogs: The Top 25 Moz Blogs of 2021"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Hit Me With Your Best Blogs: The Top 25 Moz Blogs of 2021"
    },
    {
      "level": "H2",
      "text": "1. 21 Smart Google SEO Tips"
    },
    {
      "level": "H2",
      "text": "2. The Definitive Guide to JavaScript SEO (2021 Edition)"
    },
    {
      "level": "H2",
      "text": "3. SEO Forecasting in Google Sheets"
    },
    {
      "level": "H2",
      "text": "4. UTM Tagging for Google My Business"
    },
    {
      "level": "H2",
      "text": "5. 3 Vital Click-Based Signals for SEO: First, Long, & Last"
    },
    {
      "level": "H2",
      "text": "6. When & How to Disavow Backlinks in 2021"
    },
    {
      "level": "H2",
      "text": "7. Beginner's Guide to Google Business Profile: What It Is, How To Use It, and Why"
    },
    {
      "level": "H2",
      "text": "8. 7 Emerging Technologies in SEO and Their Applications"
    },
    {
      "level": "H2",
      "text": "9. How to Calculate Your SEO ROI Using Google Analytics"
    },
    {
      "level": "H2",
      "text": "10. How to Write an SEO-Focused Content Brief Your Writers Will Love"
    },
    {
      "level": "H2",
      "text": "11. How to Explain Domain Authority to a Non-SEO"
    },
    {
      "level": "H2",
      "text": "12. How to Measure the Quality of Your SEO Traffic Using Google Analytics"
    },
    {
      "level": "H2",
      "text": "13. 100% Free Technical SEO Site Audit Checklist (& Beyond)"
    },
    {
      "level": "H2",
      "text": "14. 7 Actually Smart Tips to Reduce Bounce Rate"
    },
    {
      "level": "H2",
      "text": "15. 9.5 Ways Google Rewrites Your Title Tags"
    },
    {
      "level": "H2",
      "text": "16. Featured Snippets Drop to Historic Lows"
    },
    {
      "level": "H2",
      "text": "17. According to the Experts: 5 Technical SEO Trends to Watch in 2021"
    },
    {
      "level": "H2",
      "text": "18. Long Tail SEO in 2021: How You Can Have It All or Die Trying"
    },
    {
      "level": "H2",
      "text": "19. 8 Unconventional Ways to Generate Qualified B2B Sales Leads"
    },
    {
      "level": "H2",
      "text": "20. 6 Steps to Executing an Efficient SEO Clean-Up Strategy"
    },
    {
      "level": "H2",
      "text": "21. The Three Bosses of SEO"
    },
    {
      "level": "H2",
      "text": "22. The ROI of SEO"
    },
    {
      "level": "H2",
      "text": "23. How We Increased Our Client’s Leads by 751% on Less Than £1K Per Month [Case Study]"
    },
    {
      "level": "H2",
      "text": "24. Technical SEO Implementations to Increase the Impact of Your Link Building Campaigns"
    },
    {
      "level": "H2",
      "text": "25. Announcing the New Technical SEO Certification Series: What It Is & How to Get Certified"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    }
  ],
  "author": "Morgan McMurray\n          \n            Morgan McMurray\n          \n            Morgan McMurray"
}