{
  "url": "https://moz.com/blog/top-five-seo-excuses",
  "slug": "top-five-seo-excuses",
  "title": "Top Five SEO Excuses - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Having been an active participant at various website forums over the years, I’ve come across many a new site owner who makes one excuse or another about why they can’t or won’t search engine optimize their site. If there IS a legitimate reason not to optimize a site... I’m definitely not aware of…",
  "content": "Top Five SEO Excuses Public Relations By: Melanie Nathan March 14, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Melanie Nathan March 14, 2007 Top Five SEO Excuses Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Having been an active participant at various website forums over the years, I’ve come across many a new site owner who makes one excuse or another about why they can’t or won’t search engine optimize their site. If there IS a legitimate reason not to optimize a site, I’m definitely not aware of it. Therefore, here are my picks for the top five SEO excuses I've heard, in no particular order. Add ‘em if you got ‘em! 1. Not Enough Time: How does a website spell love? T-I-M-E. Hopefully, you didn’t get into the website game thinking it would be easy. Just as conceiving, planning, and building a website takes time, so does optimizing and promoting it. Whether it’s adding a page of content per week or begging for just one link per day, it’s really important to make SEO a priority. After all, you’re not Ron Popeil and you can’t just “set it and forget it.” 2. Don’t Know Where to Start: Like any politician will tell you, a good campaign begins with a solid plan. An SEO campaign should be approached with the same attitude. Get on that campaign trail by reading some of the many SEO resources that are available on-line while keeping a list of everything you want to accomplish for your site. Now join a few forums and ask some questions. You’ll find that many of the posters are eager to help. Be careful whose advice you take, though, without doing the research first. 3. Don’t Know Which Keywords to Use: You presumably are an expert at what you sell. Armed with this expertise, you should be able to brainstorm a list of words and phrases that are important to your industry. Once you do this, you’ll begin to see a pattern emerging as similar words keep coming up again and again. These are your “core” words and where your keyword research should ideally begin. Plug your core words into a few keyword tools and you’re on your way to finding phrases that your target audience might search for. And don't forget to check out your competitors' sites for tips and ideas, too. 4. I’m Scared I’ll $#%& Something Up: There is an abundance of information on-line regarding what NOT to do when optimizing your web site. Simply avoid these tactics like the plague and you’ll do fine. Again, don’t be shy to turn to the forum and blog community for answers to your burning SEO questions. If you’re still worried about adversely affecting your site though, buy a test domain and muck around on there instead. It's an excellent, non-threatening way to get your feet wet. 5. I Just Don’t “Get” SEO: Don't feel bad. Many site owners struggle while learning the SEO ropes. It’s an ever changing, ever growing, ever evolving industry. Try to keep up with new developments and put what you read about into action. Through trial and error you’ll eventually get there. Just the fact that you know what SEO is and what it stands for puts you leaps and bounds ahead of most! If all else fails, definitely consider hiring the services of a professional SEO consultant. Especially if you're serious about the long term success of your on-line venture. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top Five SEO Excuses"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top Five SEO Excuses"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Melanie Nathan\n          \n            Melanie Nathan"
}