{
  "url": "https://moz.com/blog/top-stories-7-pack",
  "slug": "top-stories-7-pack",
  "title": "Top Stories 7-Pack Tops the SERPs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google's recent Top Stories redesign introduced a new 7-pack of news results, marking a big jump in SERP real estate. We dig into the MozCast 10,000-keyword daily tracking set to get you the full story.",
  "content": "Top Stories 7-Pack Tops the SERPs Search Engines By: Dr. Peter J. Meyers February 9, 2022 Table of Contents Copied! By: Dr. Peter J. Meyers February 9, 2022 Top Stories 7-Pack Tops the SERPs Search Engines Back in December of 2021, Google launched a redesigned version of Top Stories on desktop that got relatively little notice. At first glance, it appeared that Google introduced a two-column design, such as this Top Stories pack for “Nerf”: Over time, SEOs spotted a rarer but more interesting variety, the 7-pack. Here’s one for “snow” (a topic very much on my mind in Chicago as I’m writing this post): Beyond the redesign itself, this 7-pack occupies a huge amount of screen real-estate, especially compared to previous Top Stories lists and carousels that were limited to three stories. Should we panic yet? It’s easy to focus on the most extreme examples, but how often is this 7-pack variety actually occurring? Across the MozCast 10,000-keyword daily tracking set on February 3rd, we captured 2,121 page-one SERPs with Top Stories. Here’s the breakdown by story count: In our data set, the 7-pack is pretty rare (<1%), with a bit under half (44%) of Top Stories packs containing four stories. Interestingly, there is a design break between three and four stories. Top Stories packs with three or fewer stories are presented in list format, like this one from a search for “dog breeds”: Top Stories packs with four or more stories (on desktop) seem to switch to the newer, two-column format. While we don’t currently have data on the CTR impact, it will be interesting to see how the two formats impact CTRs and other searcher behaviors. Is news a search intent? While the 7-pack is still relatively rare, it represents a qualitatively different SERP — one where news is not just a SERP feature but looks more like a dominant intent for that search. Consider the fuller SERP context of my search for “snow”: Sorry for the vertical scroll, but these are just the features before the #1 organic result. Obviously, weather SERPs have some unique features, but there’s also a 7-pack of Top Stories, Twitter results, and the new “Local news” pack (launched in December), all suggesting time-sensitive, news-style intent. This is a search where even the most evergreen informational content isn’t going to compete. Note that, because the news itself is always changing, even the presence of Top Stories packs is very dynamic. Their presence across SERPs follows a cycle that peaks around Wednesday or Thursday and falls off into Sunday and Monday. Some searches may shift intent only on special occasions. For example, consider my search for “groundhog” on February 2nd: This was not a search for “Groundhog Day” — simply for “groundhog” the animal. Outside of the holiday timeline, this SERP is very likely to be informational. While these dramatic shifts are somewhat unusual, it’s important to remember that search intent is not a static concept. Is Google testing the waters? As always, Google giveth and Google taketh away. These Top Stories packs could increase, disappear, or evolve into something entirely new. I do think that Google is testing how searchers interact with news results and trying to separate news as a part of a SERP (when multiple types of content are useful) versus news as a primary intent. For now, it’s worth monitoring your own results to see where news content may be outshining informational content. In 2022, organic SEO is as much about the searches you don’t pursue as the ones you do and putting your time and money where the ROI makes the most sense. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top Stories 7-Pack Tops the SERPs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top Stories 7-Pack Tops the SERPs"
    },
    {
      "level": "H2",
      "text": "Should we panic yet?"
    },
    {
      "level": "H2",
      "text": "Is news a search intent?"
    },
    {
      "level": "H2",
      "text": "Is Google testing the waters?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}