{
  "url": "https://moz.com/blog/top-ten-ways-to-get-more-customer-feedback-whiteboard-friday",
  "slug": "top-ten-ways-to-get-more-customer-feedback-whiteboard-friday",
  "title": "Top Ten Ways To Get More Customer Feedback - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Customer feedback is arguably one of the best ways you can grow and expand your products and services. In today's Whiteboard Friday, Joanna Lord shares some ideas for getting feedback good and bad, and explains how it may be important in ways you just might not know.",
  "content": "Top Ten Ways To Get More Customer Feedback Whiteboard Friday By: Joanna Lord October 5, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord October 5, 2012 Top Ten Ways To Get More Customer Feedback Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Customer feedback is arguably one of the best ways you can grow and expand your products and services. Being able to obtain that feedback and then apply it to your business effectively can mean the difference between a good year and a great year. In today's Whiteboard Friday, Joanna Lord shares some ideas for getting feedback good and bad, and explains how it may be important in ways you just might not know. There also may or may not be a little surprise at the end. :) What's your best tips for getting customer feedback? Share you thoughts in the comments below. Video Transcription \"Hey everyone, I'm Joanna Lord, the VP of Growth Marketing over here at SEOmoz, and today we're going to be doing our Whiteboard Friday on Ten Ways to Get More Customer Feedback. I think we all know why it's super important to have a large volume of customer feedback, but today we're going to be talking about some of the more common places that you find it and some of the less common places, so places that maybe you could suggest to teams to go look at so that we're constantly hearing from our customers and we're constantly trying to improve on the experience that we're giving them. Jumping right in, some of the common ways that people go looking for customer feedback, obviously help tickets, right? So any place you have a customer service team or a help team. We do a great job of this at SEOmoz. Our Help Team is always on top of what are our customers feeling? What are they saying? How are they feeling about something being down, or what are they suggesting for us to do? Taking that information and operationalizing it or putting a process behind it so it can be circulated with a grander team is an excellent way to know what your customers are saying and to better serve them. I think a lot of people are on top of this, and if there's ever any room for improvement there, it's definitely the first place to start. It's like your front line with your customers, and you want it to be the most beautiful experience possible. Then the second one is surveys. I think most marketers we think to ourselves we're going to survey every couple of months or maybe we're constantly in a style of surveying and we're using Survey Monkey or we're using KISSinsights. There's a lot of great reasons to give surveys to your customers. I think sometimes marketers do bias towards this idea of like, \"I need to know something right now for this one project, so I'm going to go survey them for a limited time.\" I challenge you to think more of like an ongoing rolling basis. How can you be surveying them for what they'd like to see or what they may not have found on a page? Avinash does a great blog post of this, on the things that you should ask someone in a survey, the top three questions. They tend to be very simple, like: Did you find what you were looking for? If you didn't find what you were looking for, what were you looking for? That sort of surveying is really critical to constantly improving what you put on your pages and what story you're giving your customers. Surveys is really huge. The third one is reviews. If it makes sense for your business, small businesses also, today there's a lot of ways that companies can be reviewed, whether it be an actual customer review on a product or a company. You can also do that on LinkedIn, where people recommend companies, on Facebook where people are giving sort of reviews on how they were treated or what the product looks like. You should be constantly data mining those reviews so that you have the best sense of how people are discussing you and how they're describing you and what they're asking from you for next time that they have an interaction with you. So reviews is a really common one, but one that I think sometimes only a couple of people at the company might look at, and it's a great thing to circulate more company-wide. The fourth one is in person. We try to do this at a lot of our events. You've probably been asked by some of us at some point: How do you feel about SEOmoz, or how do you feel about the product that we put out? It's a great way to get a large volume of data. I think sometimes it can be so qualitative that it's not actionable, and one thing to think about when you're talking about in person is it doesn't always have to be at an event. It can be a phone call. You can put together kind of smaller projects or campaigns around just calling up people and asking them questions kind of out of the blue. It seems somewhat outdated, but it can still be very personable and very authentic and a great way to get a ton of feedback. So thinking about in person, how you can leverage that, is really great. It's an authentic way to build the community and hear exactly what they're saying straight from their mouth. The fifth one is blog posts. I think we all know that, at this point, having a blog post go out that's kind of like, \"Hey, we're looking for feedback. We want to hear what you think,\" is a great way to get a ton of comments, a ton of great suggestions from people that really want to have a voice, and you want them to come along with the story. You want them to feel part of the story, and I think that can be done really well with leveraging the customer feedback that you might get in a blog post interaction. Whether it's a CEO that puts up a post, or whether it's just from the team, \"Hey guys, we're thinking of building this,\" or, \"Hey guys, we're thinking of expanding here,\" and getting some feedback, I think it's a great way to get some of that. So those are the five most common. I think marketers today, we do have a lot of this in our process. So we're either doing it on some level at any given point, or we're doing it quarterly or semi-annually. That's really great and awesome, and if that's all you can get to, it's still better than nothing. But I really think there are some other, less common ways for customer feedback that if you can start to lace them together you get a much fuller picture of what's going on. So let's talk about some of those, some of the bonus customer feedbacks that we're going for. This one is huge for us, and it was actually somewhat surprising, but Feature Request Forms. Whether you're a SaaS company or even if you just have a \"Contact Us With Suggestions\" type experience on your website, if you go looking at those regularly and you're pulling out trends and you're starting to see, what do they want from us time and time again or how are they describing us time and time again, it can be really huge. Feature request forms for us here have been this gold mine of data and customer feedback that we weren't really expecting at first. Now we've put it straight through to product, and they're constantly checking this, and it's really great information when you're trying to figure out: What should we build next? What should we do next? What should we invest in next? This is a great place to look. Number seven, the cancellation survey. On the exact flip side, a lot of people tend to ignore that people that leave you for whatever reason, those reasons are really important, and they're super insightful. For us, we've kind of added a layer when you go to cancel, just one quick question that's like, \"What's your reason for canceling today?\" Some people go with our default options, which tends to be things like maybe a technical problem, or maybe I just don't need this service right now, or the price point is a little high. But we also offer this opportunity to just tell us in your own words why you're leaving, and the Help Team does an amazing job of surfacing, along with our retention marketer, what those trends are. If you start to react to those and you start to really take them to heart as a company, you tend to be far more agile in how you're solving for their problems. It really does help produce churn. It really does help increase positive sentiment. So it's a great place to look when you're starting to ask yourself, \"Where could we be doing better?\" This one - social platforms - might seem like a little large of an idea, but our Community Team does an amazing job of this, and it's something as simple as going to Facebook and asking, \"Hey guys, if you could only describe us in one word, what would it be?\" When you have a community, or when you're building a community, or you have customers and they start to respond to that, it is gold because you use those words, and those words resonate better with your potential leads than anything else could. It also really shows the customers that you're really interested in what they have to say, and that how they're describing you is exactly the way that you want to be describing yourself. We also ask them just simple questions like: What's your favorite thing about our service? Or what's the one thing we don't have that you would like? We could do all sorts of internal data mining to try to figure that out, or we could simply go ask on social platforms, whether it be Facebook or Twitter, or even opening up our own Q&A on Quora or something like that. It's a great place to start thinking, \"What can we ask them that can really help inform our decisions internally?\" This one's really fun for us. It's a new thing we've started in the last six months. It's a customer board. We call it our CAB - Customer Advisory Board - and what we've done is we've collected a group of people randomly to represent many demographics of our customers, and we've put them together and we've engaged in a long-term interaction with them, where we show them new things, and maybe they're on an email conversation with us as we shape new messaging, or we shape new products, or we're just looking for general feedback about acquiring another product or something like that. It's really going to our customers and being like, \"You've been with us since the beginning. You know all this just as well as us. What do you think of this?\" It is such a great conversation to have. Yes, you have to be aware that it somewhat only represents a small portion, but you can extrapolate a lot of insights from those conversations, because they tend to get very deep. They tend to be very robust, so you can take a lot of adjectives or a lot of sentences and find out great information. So thinking about building a customer advisory board and giving that place a home in your company is really big. It's been super valuable for us, and huge thanks to those on the Customer Advisory Board, in case you're looking. The last one is other teams. This one, again, is something I think marketing can very often become somewhat siloed, or maybe we're just doing our own ways of data mining for customer feedback. But something as simple as setting up a meeting with someone on the Help Team - me grabbing Joel from the Help Team and jumping in a room and saying like, \"What are you hearing right now? How are you feeling about it all?\" The conversations he's having on the phone are far more insightful than anything I could get from looking at our mass data files, because that is anonymous, and it's somewhat removed from the true problems that tend to be compounding on each other to cause these bigger trends. Asking the other teams, \"Hey, you went to a meet-up last week, and you talked to a bunch of Seattle engineers. Did any of them give any interesting feedback on SEOmoz?\" It's amazing what comes back. I think that opening those conversations regularly is such a great thing to do for the health of a company and the customer feedback. I think that these ten things are the things that we're trying to really improve on here at SEOmoz and the things that we really want to develop into more of true channels, constant channels of feedback, so that we don't do it once a quarter, or when something goes wrong, let's go see what people are saying, but so that we're constantly getting this influx of information. I did throw up here: Why? What are you going to do with all this? I think it probably warrants its own Whiteboard Friday at some point. But in general, I think you're really trying to look for trends. I think that's pretty obvious, trends and what they're saying. It's a great place to start for a benchmark of sentiment. If we were to really ask all the teams here from what they're hearing from all these different channels, it's almost like an internal net promoter score. You get a real sense of how people are seeing you right now. Planning, there is no better way to plan what you should be doing as a company than to ask your customers what they need and then tracking, right? Because if you don't start all this now, then in three or six months, you're not going to have those three or six months of data to start building on. I think the sooner that you start to really address these and bring them in and start working on them or get a lot of people invested company-wide, I think the better off you'll be. So that's my spiel on customer feedback. I definitely look forward to hearing what other suggestions you have in the comments below. It's been super fun, and I'll see you next time. Have a good day.\" Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top Ten Ways To Get More Customer Feedback"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top Ten Ways To Get More Customer Feedback"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}