{
  "url": "https://moz.com/blog/top-10-web-apps-we-love",
  "slug": "top-10-web-apps-we-love",
  "title": "The Top 10 Best Web Apps We Love - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We often get asked, \"What apps do the SEOmoz team use?\"  To answer this question, we decided to put together a video and blog post with the Top 10 Web Apps We Love here at SEOmoz.",
  "content": "The Top 10 Best Web Apps We Love SEO Events J By: Jamie Steven December 30, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! J By: Jamie Steven December 30, 2010 The Top 10 Best Web Apps We Love SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We often get asked, \"What apps do the SEOmoz team use?\" To answer this question, we decided to put together a blog post with the Top 10 Web Apps We Love here at SEOmoz. The SEOmoz team decided on the Top 10 apps below (in no particular order). However, we found we liked so many apps that we decided to include another 15 that are definitely worth mentioning. Take a look at our list and let us know your own favorite apps in the comments. The Top Ten List (in no particular order) #1 Google Analytics Web Analytics Google Analytics is an excellent free web analytics tool. Even if you have another analytics application, we think it's worthwhile to add Google Analytics to your site-- it's that good. We use Google Analytics to report on the performance of the SEOmoz website and our online marketing campaigns. Our only requests? Real-time reporting, a referral report with complete URLs and the option to pay for a service level agreement. Also Recommended: Yahoo! Web Analytics, Adobe SiteCatalyst, WebTrends #2 KISSmetrics Funnel Reporting Does your website require users to go through multiple steps? If so, you need good funnel reporting; we like KISSmetrics. Simple to setup and configure, but with plenty of options for segmentation and customization, we use KISSmetrics to monitor and report on the key user experiences of our site. It even provides details on the conversion funnel performance of each of our organic keywords-- a big plus for SEOs. Also Recommended: Adobe Discover,Google Analytics (limited funnel capability) #3 Google Website Optimizer Conversion Rate Optimization These days, Conversion Rate Optimization seems to be more popular than Harry Potter. Google Website Optimizer is a free way to do simple conversion rate optimization testing on your website. You can test varied landing pages using an A/B test or determine the ideal combination of elements using a multivariate test. Google's tool is free, and capable enough to get you well on your way with CRO. Also Recommended: Unbounce, Visual Website Optimizer, Adobe Test&Target #4 MailChimp Email Campaign Manager MailChimp, oh how we love thee. MailChimp is one of the most intuitive and simple email marketing packages around. And yet, it remains incredibly powerful with detailed analytics, great social media integration and an adorable chimp, Freddie. MailChimp offers both free and affordable plans that work well for low-volume and high-volume email campaigns. Stay awesome, MailChimp. Also Recommended: ExactTarget #5 HasOffers Affiliate Program Management SEOmoz re-launched our affiliate program this fall and we chose HasOffers as our new platform. Our marketing team has collectively used several other platforms in the past and none are as capable and intuitive as HasOffers. Based in the cloud, HasOffers has plenty of capabilities and is designed to enable you to self-manage your own affiliate program (or even your own affiliate network). #6 Wistia Video Hosting Wistia is video hosting on steroids. Not only does this video hosting platform support HTML5, which makes your videos viewable on a slew of non-Flash enabled devices, but the platform is inherently designed for SEO. Try searching Google for \"Top 10 Web Apps We Love\" and you'll likely see the above Wistia-hosted video that's included with this blog post. Their tracking and analytics are also the best we've seen in video hosting. See a sample report here. Also Recommended:Delve Networks, Vimeo (not recommended for commercial videos) #7 Google Webmaster Tools SEO Insight from Google Google Webmaster Tools is SEO insight straight from the horse's mouth, and a must-have for any website. Get information on how Googlebot sees your site, view (some) links to your site and edit preferences for how your listing appears in the Google search results. While not as comprehensive as we'd like, it's still a welcome set of capabilities. Also Recommended:Yahoo Site Explorer, Bing Webmaster Tools #8 SEOmoz PRO SEO Campaign Management We may well deserve criticism for adding our own app to this list, but we really are proud parents. The SEOmoz website is large enough that the crawl diagnostics help us find issues we haven't fixed, the rankings report manages our large list of keywords, and Open Site Explorer provides invaluable data on backlinks. These features just scratch the surface of what you get with SEOmoz PRO. It's a toolset our marketing team uses everyday. Take a 30-day free trial of SEOmoz PRO. #9 CoTweet Twitter Account Management CoTweet provides an excellent interface for managing your Twitter account, especially if you need multiple people to manage it. Jen, who manages our community, approves of CoTweet-- and that means a lot! CoTweet makes it easy to access multiple Twitter accounts and keep an eye on your mentions. Even better, CoTweet integrates with our #10 App, Bit.ly Pro. Also Recommended: HootSuite #10 Bit.ly Pro URL Sharing and Analytics While most people only use a URL-shortening service for tweets, we like to use Bit.ly URLs wherever possible. Bit.ly Pro permits you to use a custom domain (we use seomz.me) and provides useful analytics for each URL you create. SEOmoz uses the data from Bit.ly Pro to determine which tweets generate the most clicks. Pro Tip: add a + to the end of any Bit.ly URL to see a detailed report, like so: http://seomz.me/hXrmAU+. Other Apps We Love Below are more of the apps we use and love. While they all can't be in our Top 10, they're definitely worth mentioning: Dropbox -- Awesome file syncing, backup and sharing. Google Apps & Google Docs -- Email, calendar and productivity apps. Feedburner -- RSS feed analytics. PostRank -- Analytics for your blog, guides and articles. ZenDesk -- Help desk software. SnapEngage -- Online chat software. Good Data -- Business intelligence and visualization. Geckoboard -- Business analytics dashboard. SurveyMonkey -- Online surveys. Box.net -- Online file sharing and collaboration. UserTesting.com -- Affordable usability testing. Silver Back App -- Usability testing software. Five Second Test -- Quick usability testing. Google Local Business Center -- Search management for small businesses. Pandora -- Keeping the marketing team sane! What are your favorite apps? Are we missing a must-have app for your website? Please let us know in the comments! We'd love to know what you're using to make your work easier, more productive and fun. Update: Reader and PRO member shanedj created a Google form to collect your favorite web apps. He plans to write a YOUmoz post once he's got enough votes. Vote for your favorite apps here. Happy New Year! We're taking a few days off to celebrate the New Year, so things might be a little quieter around here than usual. We'll be back first thing next week to begin our most exciting year yet! From all of us at SEOmoz we hope you have a very Happy New Year! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Top 10 Best Web Apps We Love"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Top 10 Best Web Apps We Love"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jamie Steven\n          \n            Jamie Steven\n          \n            Jamie Steven"
}