{
  "url": "https://moz.com/blog/top-25-moz-blogs-2023",
  "slug": "top-25-moz-blogs-2023",
  "title": "Here Are the Champions: 25 Top Moz Blogs of 2023 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sit back, grab a cuppa, and check out the top 25 Moz blogs of 2023",
  "content": "Here Are the Champions: 25 Top Moz Blogs of 2023 Moz News | Marketing Industry By: Emilie Martin Edited By: Emilie Martin December 27, 2023 Table of Contents Copied! By: Emilie Martin Edited By: Emilie Martin December 27, 2023 Here Are the Champions: 25 Top Moz Blogs of 2023 Moz News | Marketing Industry We published 176 posts on the Moz Blog this year, and as is tradition, it's time to look back at the most popular ones! You’ll find articles on the latest in AI, setting yourself up for success with GA4, learning how to navigate search engines, and Google Discover, among other key topics such as content marketing, local SEO, and more. Have a safe and happy new year, Moz friends! See you in 2024. 1. How to Drive Traffic in Google Discover: The Ultimate Guide By Lily Ray | November 2, 2023 Lily knocked it out of the park with her ultimate guide on how to drive traffic in Google Discover, a queryless search product launched by Google in 2018, but tested on their desktop homepage in October 2023. Perhaps a sign of things to come? She shared ten actionable tips to navigate the evolving landscape of Google Discover to help boost your website’s visibility: Ensure technical eligibility for DiscoverUnderstand user affinities and entitiesManual actionsAvoid inappropriate contentGet the image rightTitles, headlines, and OG titlesWeb stories and videoArticle lifespanImpact of Google updatesUnderstand article syndication 2. ChatGPT Won’t Replace Google Search (Yet) By Dr. Peter J. Meyers | January 24, 2023 By now, you’ve probably seen an infinite number of examples of ChatGPT using the GPT (Generative Pre-training Transformer) deep learning system. The current models are genuinely impressive, so what does all of this have to do with Google Search and our jobs as search marketers? In this article, Dr. Pete, Moz’s Marketing Scientist, emphasized that despite ChatGPT's ability to produce coherent and informative responses, it lacks the attribution and trust that Google provides through linking to source pages, ultimately suggesting that it is not an immediate replacement for the functionality and scale of Google Search — yet. 3. Pillar Pages: Why and How You Should Add Them to Your Content Strategy By Lauren Fox | January 31, 2023 In their recent study, Lauren Fox found that Brafton’s pillar pages are magnets for links, organic traffic, and newsletter subscribers — especially compared to regular blog posts. Lauren detailed the results that both types of SEO content generated over the course of a year. She concluded that we really can’t have one (pillar pages) without the other (regular blog posts), noting that it all comes down to content mapping. 4. How to Create an SEO Strategy [Plus Free Tools & Templates] By Zach Edelstein | April 18, 2023 Zach, Moz’s SEO Director, brought us back to the basics with his article on how to create an SEO strategy. He discussed that a strong SEO strategy will: Improve your website’s rankings for any existing keywords for which you are currently ranking in search engine results pages (SERPs).Increase the awareness and influence of SEO within your organization. Prescribe some combination of SEO initiatives, including widening the scope of your ranking organic keywords, fixing any technical website issues, and increasing the number of backlinks from high-quality domains to your site.Imply or explicitly state priorities or beliefs that guide future action. 5. How to Earn Topical Authority in 2023 and Beyond By Zoe Ashbridge | August 28, 2023 Topical authority isn’t a new concept, but as Google’s drive for helpful content shows no signs of slowing down, it’s not something to ignore. Zoe took a deep dive into topical authority, letting us know what it is, how to earn it, and, importantly, how to develop topical relevance strategically. You can expect topical authority to weigh into your chances of ranking. Whether you’re reporting on the news or not, there are a lot of crucial takeaways for all sites on the subject of authority and how to rank higher. 6. 6 Ways ChatGPT Can Improve Your SEO By Zach Edelstein | July 24, 2023 From on-page optimizations to technical SEO, AI can do more than create content. Zach covered six ways ChatGPT can help us improve our SEO: Create Schema markupKeyword clusteringGenerate meta descriptionsCreate frequently asked questions (FAQs)Topical researchSEO content briefs 7. 20 Google Analytics Alternatives By Jess Joyce | February 22, 2023 The analytics space is changing, and there are many alternatives — both free and paid — that take into account privacy, cookie-less tracking, GDPR compliance, core web vitals, and more. In this article, Jess shared 20 alternative tools to Google Analytics. 8. How to Make AI Your Writing Sidekick for Content Marketing By Tasmin Lofthouse | September 13, 2023 Artificial Intelligence (AI) has blown up like a supernova. Conversations about AI are happening everywhere. Some marketers see AI as a threat. But that doesn’t have to be the case. You can learn how to work with AI. Building AI into your processes will future-proof your marketing skills if AI takes over the world. Tasmin showed us how AI can be our marketing sidekick. You can use AI to support your writing process, be a fresh pair of eyes for proofreading, or act as a second brain. These all make AI a powerful companion for content marketing 9. AI for SEO and Content Marketing: A Friend, Not a Foe (for Now, at Least) By Ann Smarty | April 3, 2023 The phenomenal rise of ChatGPT this year raised quite a few scary questions, and Ann was quite confident with her following predictions: AI technology will change the way we are doing just about everything.It will change the way people go about looking for (and finding) answers. But it won’t kill human-created content; we strive for personal touches, personal styles, personal experiences, etc.It is not leaving, and we are at the very birth of this new AI-driven world. There’s no going back. 10. 2023’s Top 7 Local Search Ranking Factors, Illustrated and Explained By Miriam Ellis | May 8, 2023 In this article, Miriam, Moz’s Local Search Scientist, looked at how to set the local business you market apart by mastering seven top local search ranking factors: Primary Google Business Profile (GBP) categoryKeywords in GBP titleProximity of address to the point of searchPhysical address in city of searchRemoval of spam listing through spam fightingHigh numerical Google ratingsAdditional GBP categories 11. I’ve Optimized My Site, But I’m Still Not Ranking — Help! — Next Level By Jo Cameron | May 24, 2023 You’ve optimized your pages, written delightful title tags, concocted a gorgeous description to entice clicks, and used your target keyword in your copy with similar words. Your content is good, like really good. As far as you’re concerned, you’re doing everything you can on that page to say to Google, “This is relevant content!” But, lo and behold, you’re not ranking. Jo, Moz’s Director of Content Marketing, refreshed this key article, showing you how you can discover what’s holding you back and how to make sure your site is a lovely big target for visitors. 12. 9 Years of the Google Algorithm By Dr. Peter J. Meyers | February 27, 2023 If it feels like Google search is changing faster than ever, it’s not your imagination. Google reported an astonishing 4,367 “launches” in 2021, up dramatically from 350—400 in 2009. On average, that’s nearly a dozen changes per day. While we can’t predict future changes, we can try to learn from the patterns of the past and read between the lines of Google’s messaging. Thanks to our MozCast research project, we have daily algorithm flux data going back to 2014. The visualization below shows nine full years of daily Google “temperatures” (with hotter days representing more movement on page one of rankings): 13. SEO Recap: ChatGPT By Tom Capper | February 1, 2023 Tom, Moz’s Senior Search Scientist, relayed a question on all of our minds: “Does GPT-3 mean the end of SEO as we know it, or are there ways to incorporate the AI model into our daily work?” Tom tried to tackle this question by demonstrating how he plans to use ChatGPT, along with other natural language processing systems, in his own work. 14. How Social Media Can Supercharge Your SEO By Hannah Waye | May 31, 2023 When working in social media, it can feel like you exist worlds away from SEO. And as an SEO, social media may feel like something that isn’t quite relevant in your day to day. But as with all things marketing, both of these digital marketing tactics have the potential to boost collective success. Our very own Social Media Marketing Manager, Hannah, showed us exactly how social media can supercharge your SEO. 15. 5 Times ChatGPT Steered Me Wrong in Local SEO By Miriam Ellis | January 12, 2023 ChatGPT may be a major search disruptor and a threat to Google, a useful tool, a source of inspiration, and a societal ill, all rolled into one, but what Miriam wanted to highlight in this piece is that there is a very good reason the content generated by this system comes with lots of disclaimers. Miriam conducted an experiment to see what happens when we ask ChatGPT some of the most common local SEO questions and imagined what would happen to local business owners if they built their marketing strategy on the advice they received. 16. How to Use Digital PR to Improve E-E-A-T Signals By Rebecca Moss | May 1, 2023 Towards the end of 2022, Google updated three key areas of the algorithm that it uses to judge where it ranks websites within search engine results pages, including the helpful content update, link spam update, and E-E-A-T. In this article, Rebecca shared the digital PR tactics you can use to help improve your E-E-A-T signals, explaining why building trust and credibility needs to be at the top of your list if you want to have greater visibility in the search engine results. She ends the piece with success stories that showcase how these tactics have led to commercial gains for brands in typically untrusted sectors. 17. Alternative Search Engines: Why They Matter and How to Rank on Them By Louise Persson | February 8, 2023 While Google still holds more than 80% of the market share, ignoring search engines such as Bing, Yahoo, and DuckDuckGo can make you lose out on relevant traffic.In order to grow in the digital economy, we must diversify our efforts. What better way to do that than by ensuring you rank on all the top search engines relevant to your audience? Generally, there are two reasons why your audience would choose an alternative search engine over Google: geopolitical reasons and/or privacy concerns. As such, in this article, Louise categorized search engines by global market share and by data privacy. 18. Diving for Pearls: A Guide to Long Tail Keywords — Next Level By Jo Cameron | March 8, 2023 One of the biggest obstacles to growing your business online is being able to rank well for keywords that people are searching for. Getting your URLs to show up in those precious top positions — and gaining a good portion of the visitors behind the searches — can feel like an impossible dream, particularly if you’re working on a newish site on a modest budget within a competitive niche. Jo refreshed this ultimate guide, taking you through the bronze, silver, and gold levels of finding, assessing, and targeting long-tail keywords so you can start getting visitors to your site that are primed and ready to convert. 19. How to Avoid Duplicate Conversions and Recreating the Conversion Funnel for GA4 By Robin Lord | March 20, 2023 While GA4 is improving all the time, there are quite a few things that people are used to seeing in old versions of Analytics, which, at the very least, take a bit of creativity in the new world. In this post, Robin took us through how to: Avoid double counting in GA4. Automatically ignore suspicious conversions (like people landing directly on the conversion page). Recreate the kind of funnels we expected in Universal Analytics. 20. 2023 Local SEO Success: Human Power in a Year of Change By Miriam Ellis | January 4, 2023 As we rang in 2023, Miriam shared insights from industry professionals that showed why the developments we’ve seen over the past few months indicate greater change ahead — driven by Google’s attitude toward and handling of local and general search philosophy. Miriam offered three areas of local search marketing she recommended focusing on in 2023:Shortcut the path to a real human in every way you can Let good tools come to your rescue in tough times Faced with facelessness, buck trends 21. Google Bard vs. the New Bing By Tom Capper | March 29, 2023 Before we’d heard of SGEs, Google’s main entrant in the AI arms race of 2023 seemed to be its chat interface. Tom compared Google’s Bard and the New Bing and shared his first impressions of both AI integrations. “The new Bing” is the product of Microsoft’s alliance with OpenAI, makers of the now infamous ChatGPT. Tom noted that this development promises to have seismic effects on the search ecosystem, and Google has become extremely concerned about the threat ChatGPT technology poses as an alternative to their core search business. Of course, only 2 months later, that prediction looked solid as Google rolled out its “SGE” labs test in search results. The SGE experiment is scheduled to end at the end of 2023 in its original markets, so we’ll soon see what happens next. 22. How to Earn High-Authority Links That Drive Rankings By Kelsey Libert | July 31, 2023 Kelsey shared four of the most important lessons she learned over the last decade that will help you execute newsworthy research that publishers love to link to:Your success relies on your ability to educate your client on how to create truly newsworthy research.Level up your research by adding actionable quotes from clients or industry experts. Always pitch an ‘exclusive’ and preferably password-protect your landing page.Invest in relationship building by personalizing your pitch vs the ‘spray and pray' approach. 23. After Google: Should SEOs Jump Ship? By Tom Capper | January 17, 2023 People have talked for a long time about existential threats to Google's dominance and often, implicitly, by extension, SEO. You’ll have heard the claims that Amazon or YouTube are now preferred engines for certain kinds of search or that Google is going to struggle against the unique technological advantages of Apple, AI chatbots, the regional advantages of Baidu, or the unique format advantages of TikTok. This post was not about the health of Google search or the implications of improving AI products for your SEO strategy. Instead, this post was about which of these threats, if any, actually stand a chance of unseating Google’s dominance. 24. The Ultimate Guide for Taking Full Control of Your Google Business Profile and NMX By Miriam Ellis | January 18, 2023 With estimates as high as 70% — 80% of local business leads happening right within Google’s interface, you can’t ignore GBP. Instead, you’ve got to learn to control every bit of it that you can. This article showed us the most common features of these listings, explained what you can and can’t control, and taught us how to manage controllable features in the New Merchant Experience (NMX). 25. How and Why You Should Create Informational Content with POVs By Victor Ijidola | June 19, 2023 Informational SEO content, by itself, only drives traffic. It’s the ideas you put inside that determine whether it’ll drive anything else besides that (say, conversions, revenue, etc.). But unless you’re a media outlet where the goal is to get views and clicks for ads, you don’t just want traffic. You want your content to persuade your readers to do something — whether it's to sign up for a product trial, buy your product, or contact you for a consultation. That's where points of view (POVs) come in. Victor defined POVs and went into great detail about how POVs help your informational content drive sales. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here Are the Champions: 25 Top Moz Blogs of 2023"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here Are the Champions: 25 Top Moz Blogs of 2023"
    },
    {
      "level": "H2",
      "text": "1. How to Drive Traffic in Google Discover: The Ultimate Guide"
    },
    {
      "level": "H2",
      "text": "2. ChatGPT Won’t Replace Google Search (Yet)"
    },
    {
      "level": "H2",
      "text": "3. Pillar Pages: Why and How You Should Add Them to Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "4. How to Create an SEO Strategy [Plus Free Tools & Templates]"
    },
    {
      "level": "H2",
      "text": "5. How to Earn Topical Authority in 2023 and Beyond"
    },
    {
      "level": "H2",
      "text": "6. 6 Ways ChatGPT Can Improve Your SEO"
    },
    {
      "level": "H2",
      "text": "7. 20 Google Analytics Alternatives"
    },
    {
      "level": "H2",
      "text": "8. How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H2",
      "text": "9. AI for SEO and Content Marketing: A Friend, Not a Foe (for Now, at Least)"
    },
    {
      "level": "H2",
      "text": "10. 2023’s Top 7 Local Search Ranking Factors, Illustrated and Explained"
    },
    {
      "level": "H2",
      "text": "11. I’ve Optimized My Site, But I’m Still Not Ranking — Help! — Next Level"
    },
    {
      "level": "H2",
      "text": "12. 9 Years of the Google Algorithm"
    },
    {
      "level": "H2",
      "text": "13. SEO Recap: ChatGPT"
    },
    {
      "level": "H2",
      "text": "14. How Social Media Can Supercharge Your SEO"
    },
    {
      "level": "H2",
      "text": "15. 5 Times ChatGPT Steered Me Wrong in Local SEO"
    },
    {
      "level": "H2",
      "text": "16. How to Use Digital PR to Improve E-E-A-T Signals"
    },
    {
      "level": "H2",
      "text": "17. Alternative Search Engines: Why They Matter and How to Rank on Them"
    },
    {
      "level": "H2",
      "text": "18. Diving for Pearls: A Guide to Long Tail Keywords — Next Level"
    },
    {
      "level": "H2",
      "text": "19. How to Avoid Duplicate Conversions and Recreating the Conversion Funnel for GA4"
    },
    {
      "level": "H2",
      "text": "20. 2023 Local SEO Success: Human Power in a Year of Change"
    },
    {
      "level": "H2",
      "text": "21. Google Bard vs. the New Bing"
    },
    {
      "level": "H2",
      "text": "22. How to Earn High-Authority Links That Drive Rankings"
    },
    {
      "level": "H2",
      "text": "23. After Google: Should SEOs Jump Ship?"
    },
    {
      "level": "H2",
      "text": "24. The Ultimate Guide for Taking Full Control of Your Google Business Profile and NMX"
    },
    {
      "level": "H2",
      "text": "25. How and Why You Should Create Informational Content with POVs"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    }
  ],
  "author": "Emilie Martin\n          \n            Emilie Martin\n          \n            Emilie Martin"
}