{
  "url": "https://moz.com/blog/top-eleven-social-media-startups-id-give-my-first-born-for",
  "slug": "top-eleven-social-media-startups-id-give-my-first-born-for",
  "title": "Top Eleven Social Media Startups I'd Give My First Born For - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The explosion of social networking sites in the last year has brought us countless social networking sites for every walk of life, yet there remains niches untapped.  So here’s a roundup of the TOP ELEVEN niche social media sites that I believe could just be the next Hugg killer (because a top ten…",
  "content": "Top Eleven Social Media Startups I'd Give My First Born For Social Media L By: LindaBustos July 23, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! L By: LindaBustos July 23, 2007 Top Eleven Social Media Startups I'd Give My First Born For Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The explosion of social networking sites in the last year has brought us countless social networking sites for every walk of life, yet there remains niches untapped. So here’s a roundup of the TOP ELEVEN niche social media sites that I believe could just be the next Hugg killer (because a top ten list is not enough to get Dugg anymore). Law Enforcement Social Networking Hi5-O -- Social networking for the men and women in blue. Upload your surveillance videos to your Hi5-0 profile, subscribe to your favorite radar channels, and create badges for your blog. Similar services include Holstr and Copster. Inmate Social Networking ClinkedIn -- ClinkedIn is a networking tool that helps convicts discover inside connections and strengthens and extends your existing network of trusted inmates. Other networks in this space include Etscape, which is similar to ClinkedIn but focuses more on connecting with the “outside,” and Mobster, which has quite an impressive jobs board. News Rigg -- Rigg is all about user corporate sponsored content. Everything is submitted and voted on by the Rigg “community.” Sock puppet accounts are not frowned upon. In fact, they’re downright encouraged. College Keggslist -- Keggslist provides local campus classifieds announcing upcoming keg parties across the country and forums for recovering items left behind at parties. Faithbook -- Faithbook is a social utility that connects Bible College students with friends and others who work, study, and live around them. Faithbook hath opened up its scriptures to the discipleship community to make their own applications. Sports and Entertainment FumbleUpon -- The FumbleUpon Firefox Add-on is a collaborative surfing tool for finding and sharing great sports bloopers on the ‘net. A worthy opponent is competitor Bloopr (rumored to be funded by the owner of the Miami Dolphins). Speedoo -- Speedoo is the world's most popular site for people who want to build a page about their passion for swimming. Users can create their own Speedoo Goggle on their favorite aquatic event. Consumer Reviews GrumbleUpon -- Users write negative reviews on various products and services and share which companies provide the best restitution for professional complainers. GrumbleUpon, now with local search and a Google Maps mashup. Ask Questions -- Though a late entrant into the community advice arena, the Web’s 4th favorite search engine, Ask.com, has launched own version of Yahoo Answers with a twist. Questions must be answered with a question, and the asker must choose which question most makes him think. Ask Questions is highly popular amongst first year philosophy students. Social Bookmarking Blanklist -- Finally, a social bookmarking service for people who are never going to actually use it, anyway. Love and Relationships StagNation -- An online community for grooms-to-be to plan their stag weekend, cuz you know your bride ain’t gonna help you. Other marital networks include WikiVow (the nuptials that anyone can edit), Hitchipedia, and the Bridezilla browser. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top Eleven Social Media Startups I'd Give My First Born For"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top Eleven Social Media Startups I'd Give My First Born For"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "LindaBustos\n          \n            LindaBustos"
}