{
  "url": "https://moz.com/blog/top-1-seo-tips-for-2013",
  "slug": "top-1-seo-tips-for-2013",
  "title": "Top 1 SEO Tips for 2013 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was going to write a long list of SEO tips for 2013, but I realized that I can sum them all up in just one point. Actually, just one word. No, I'm not going to tell you right here in the teaser. That's why it's a teaser.",
  "content": "Top 1 SEO Tips for 2013 Advanced SEO By: Dr. Peter J. Meyers December 13, 2012 Table of Contents Copied! By: Dr. Peter J. Meyers December 13, 2012 Top 1 SEO Tips for 2013 Advanced SEO If we’ve learned anything in 2012, it’s that Google isn’t letting up on low-value tactics. We’ve had the Penguin update, 13 Panda updates (so many that we needed a new naming scheme), and a crackdown on low-quality Exact Match Domains (EMDs), to name just a few. While I can’t tell you Google’s next move, I can tell you one thing with absolute certainty – there’s more to come. So, how can you protect what you’ve built in 2013? I was going to write a long list of suggestions, but I realized that they almost all boiled down to just one idea. I’m not going to toy with you – my top tip for 2013 SEO is this: If at any point in 2012 you asked “What’s the best [X] for SEO?” (link-building tactic, tag, directory, etc.), you’re already in trouble. Any single-tactic approach is short-term at best. Real companies, real link profiles, and real marketing are rich with variety. So, what does that mean, practically? I’m going to cheat a bit and split my one tip into five kinds of diversity that I think are critical to your SEO success in the coming years. 1A. Diversify Anchor Text Let’s start with an easy one. We’ve all known for a while that overly aggressive inbound link anchor text was pushing the envelope, and the Penguin Update definitely reinforced that message. If every link to your site reads “buy best Viagra cheap Viagra today!”, it might as well read “spam spam spammity spam,” especially if it’s in a sentence like: If you’re looking for the best price on the new iPad and iPad cases, then buy best Viagra cheap Viagra today! and get a free bag of Acai berries. It’s not natural, and you know it. What’s the best way to make your anchor text seem “natural?” Stop obsessing over it. Yes, anchor text is a signal, but any solid link profile is going to naturally use relevant text and appear in the context of relevant text. If you want to tweak the text on some of your high-authority links, go for it, but I wouldn’t break out the spreadsheets in 2013. 1B. Diversify Your Links Are guest posts the one true answer to all of life’s questions or are they a scourge on our fragile earth? To read the SEO blogosphere in 2012, it’s hard to tell. Any link-building tactic can be low quality, if you abuse it. The problem is that someone reads a tip about how guest posts make good links and then they run off and publish the same slapped-together junk on 15,000 sites. Then they wonder why their rankings dropped. Nothing screams manual link-building like a profile that’s built with only one tactic, especially if that tactic is too easy. At best, you’re eventually going to be doomed to diminishing returns. So, take a hard look at where your links came from in 2012 and consider trying something new next year. Diversify your profile, and you’ll diversify your risk. 1C. Diversify Traffic Sources There’s an 800-lb. Gorilla in the room, and we’re all writing more SEO blog posts to avoid talking about it. Most of us are far too dependent on Google for traffic. What would you do if something changed overnight? I know some of you will object – “But ALL my tactics are white-hat and I follow the rules!” Assuming that you understood the rules 100% accurately and really followed them to the letter, what if they changed? The more I follow the Algorithm, the more I realize that the changing search UI and feature landscape may be even more important than the core algorithm itself. What happens if your competitor suddenly gets site-links, or you’re #8 on a SERP that drops to only 7 results, or everyone gets video snippets and you have no videos, or your niche shifts to paid inclusion and you can’t afford to pay? Even if you’ve followed the rules, your traffic could drop on a moment’s notice. You need to think beyond Google. I know it’s tough, and it’s going to take time and money, but if you’re dependent on Google for your livelihood, then your livelihood is at serious risk. 1D. Diversify Your Marketing There’s been a very positive trend this year toward thinking about marketing much more broadly – not as a tactic to trick people into liking you, but as the natural extension of building a better mousetrap. I think this is at the heart of RCS (not to put words in Wil’s mouth) – if you do something amazing and you believe in it, everything you do is marketing. If you build crap and you know it’s crap, then marketing is sleight of hand that you hope to pull on the unsuspecting. You might score twenty bucks by stealing my wallet, but you’re not going to gain a customer for life. Stop taking shortcuts and make a real resolution in 2013 to think hard about what you do and why it has value. If you understand your value proposition, content and marketing naturally flow out of that. Talk to people outside of the SEO and marketing teams. Find out what your company does that’s unique, exciting, and resonates with customers. 1E. Diversify Your Point Of View I recently had the pleasure to finally see Michael Dorausch (a chiropractor and well-known figure in the local SEO community) speak. Dr. Mike arrived in Tampa for BlueGlassX and built his presentation from the ground up, using photography to tell stories about the neighborhood and local history. It's hard to explain in a few sentences, but what amazed me was just how many ideas for unique and original content he was able to find in less than 48 hours, just by having a fresh perspective and passion for the subject. I'd like to say I was inspired by the presentation, but to be totally honest, I think the emotion was embarrassment. I was embarrassed that he was able to generate so many ideas so quickly, just by coming at the problem with the right attitude. In 2013, if you tell me your industry is \"boring,\" be warned - I'm going to smack you. If you're bored by what you do, how do you think your prospects and customers will feel? Step out - have someone give you a tour of your office like you've never been there. Visit your home city like you're a tourist coming there for the first time. Get five regular people to walk through your website and try to buy something (if you don't have five normal friends, use a service like UserTesting.com). The New Year is the perfect time for a fresh perspective. 1F. Happy Birthday, Erica! Ok, this has nothing to do with the post, but today is Erica McGillivray's birthday. If you don't know Erica, she's our Community Attaché here at SEOmoz. So, diversify your communications today and wish her a happy birthday. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top 1 SEO Tips for 2013"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top 1 SEO Tips for 2013"
    },
    {
      "level": "H2",
      "text": "1A. Diversify Anchor Text"
    },
    {
      "level": "H3",
      "text": "If you’re looking for the best price on the new iPad and iPad cases, then buy best Viagra cheap Viagra today! and get a free bag of Acai berries."
    },
    {
      "level": "H2",
      "text": "1B. Diversify Your Links"
    },
    {
      "level": "H2",
      "text": "1C. Diversify Traffic Sources"
    },
    {
      "level": "H2",
      "text": "1D. Diversify Your Marketing"
    },
    {
      "level": "H2",
      "text": "1E. Diversify Your Point Of View"
    },
    {
      "level": "H2",
      "text": "1F. Happy Birthday, Erica!"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}