{
  "url": "https://moz.com/blog/top-10-must-have-seo-extensions-for-google-chrome",
  "slug": "top-10-must-have-seo-extensions-for-google-chrome",
  "title": "Top 10 Must Have SEO Extensions for Google Chrome [SEO Chrome Extension] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Every few years I make a browser switch and my web use evolves sometimes for the better, and sometimes for the worse. My particular evolution went something like this: Netscape, IE, KDE Konquerer (switched from Windows98 to Debian - so no more IE), Mozilla Phoenix (early Firefox), IE (what do you…",
  "content": "Top 10 Must Have SEO Extensions for Google Chrome SEO Tools P By: Patrick Ahler December 2, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! P By: Patrick Ahler December 2, 2010 Top 10 Must Have SEO Extensions for Google Chrome SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Every few years I make a browser switch and my web use evolves sometimes for the better, and sometimes for the worse. My particular evolution went something like this: Netscape, IE, KDE Konquerer (switched from Windows98 to Debian - so no more IE), Mozilla Phoenix (early Firefox), IE (what do you know... went back to Windows), Firefox, IE, Firefox, and over the last year Chrome. My latest switch to Google Chrome has had the biggest affect on my daily web usage, particularly from the amazing assortment of extensions. The browser is also light and stylish with cool themes. If you haven't tried it already I highly recommend you do. With Chrome quickly gobbling up market share, it's clear I'm not the only one who's recognizing this. Ok, enough of this Google fanboy madness... let's talk about some SEO tools. Google Chrome's Extensions, much like Android's Apps, are full of garbage with a few gold nuggets hidden amidst the madness. 1. MozBar Yes, this is SEOmoz, so you might expect this to be top of the list. However, SEOmoz has done an exceptional job with this tool. Before becoming a Pro Member I used it daily and now that I'm a pro member it's always on it. Note: I'm not just saying this to get my blog post boosted to the main blog (wink wink), but it really is the best tool out there and an essential for tool any aspiring SEO. 2. SEO Site Tools SEO Site Tools is an all inclusive powerhouse of SEO information. It includes 6 main sections: External Page Data Page Elements Social Media Page Terms / Tools Server / Domain Info Suggestions Some of the unique features and enhancements include highlighting your domains in Google search, trend data in Google webmaster tools, and Social Media stats in Google Analytics. A close second to MOZbar, this tool is an absolute must. 3. Note AnyWhere I don't know if I'm the first to break news of this tool. But even if you hate Chrome, this tool makes it all worth it. It's basic, it's simple, but it has already completely changed the way I work. As the name says you can leave a note... that's right, anywhere. On any page, on any site... leave... close your browser and come back 2 days later. I just left a note on my home page with new keywords I want to target and a note on my Fantasy Football page with all the players I need to drop (sorry Randy Moss). 4. Firebug Get down and dirty with your code or your competitors code. You'll be able to find the tweaks and tags that can boost your rankings. Not for the beginner but an absolute must for the OCD expert. 5. IE Tab Another holdover from Firefox, IE Tab allows you to browse the web as if you were using IE. I use this extension at least twice a day to confirm page appearance, double check a ranking, or if Chrome is having an issue with loading a page. 6. SEO SERP I've found this tool to be slightly buggy. However, the usefulness is there and I'm sure they'll iron out the issues soon. Basically what it does is it allows you to check your search rankings per term. Quick and simple, definitely saves time for those of us that occasionally get addicted to checking rank. 7. Goo.gl URL Shortener Shorten URLs on the fly, add them to history, integrate with social media... do I really need to explain this further? It's a time saver. 8. Screen Capture (by Google) No more CTRL+ALT+PRTSCN, this simple tool by Google let's you highlight the section of the page you want, highlight the visible area, or highlight the whole page (can't do that with PRTSCN - that I know of). After you select, annotate, highlight, mark it up however you'd like and then email it to that lazy coworker who can't find the broken link or misspelled keyword. It's like slapping them... nicely. 9. Google Reader Let's face it, there's a lot of information out there for SEO, it's a highly dynamic industry and you need to be on top of your game to stay in it. Google reader is the essential tool 10. Stay Focused Ever spend 3 hours trying to figure out which who to trade Randy Moss for on Fantasy Football? Nah, me neither... this little tool will help with all that though. Get back to your link building, get back to your analytics, and StayFocused. OK, honesty time... I ended up disabling this tool... but you shouldn't, it's awesome and works better than you think it will. Well as I'm sure you know by now there's a ton of tools out there, and while Chrome and its extensions are just one of them, I think they're worth a try... and no... I don't work for Google. I'd love to hear your recommendations as well. Cheers, Patrick Ahler - www.NinjaWeb.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top 10 Must Have SEO Extensions for Google Chrome"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top 10 Must Have SEO Extensions for Google Chrome"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Patrick Ahler\n          \n            Patrick Ahler\n          \n            Patrick Ahler"
}