{
  "url": "https://moz.com/blog/top-15-web-metrics-for-a-classified-website",
  "slug": "top-15-web-metrics-for-a-classified-website",
  "title": "Top 15 Web Metrics For a Classified Website - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In present times when the word “crisis” is repeated so often, tracking the performance of the website is getting even more important. Working a lot on SEO & web analytics of different classified businesses all over the world, I try to sum up what web metrics are really crucial to evaluate website…",
  "content": "Top 15 Web Metrics For a Classified Website SEO Analytics M By: Maciej Gałecki August 31, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Maciej Gałecki August 31, 2009 Top 15 Web Metrics For a Classified Website SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In present times when the word “crisis” is repeated so often, tracking the performance of the website is getting even more important. Working a lot on SEO & web analytics of different classified businesses all over the world, I try to sum up what web metrics are really crucial to evaluate website properly. The advantage is, you can also measure them with free tools such as Google Analytics. SEM METRICS 1. Search engine traffic share If you have this piece of information referring to your website, you can easily compare it with a global search engine market share at the market. Doing such a comparison for each search engine will tell you whether its global popularity is reflected in a volume of traffic driven to your site. If not, it probably means that the website doesn't perform well enough in SERPs of this specific search engine which is a potential opportunity to gain more traffic out of it. 2. Number of keywords driving traffic This number will inform you about the “Long Tail friendliness” of the website. A lot of unique keywords and phrases will assure you that different areas of the website perform well in search engine listings. If one or two word keywords generate visits it probably means you rank well for general keywords with your classified website homepage or category pages. On the other hand if you can see plenty of longer phrases on your list you can feel comfortable with the organic exposure of your ad details pages, search listings and other subpages with a very niche content. 3. Volume of branded and non-branded traffic By “branded” traffic I mean the one coming from brand related keywords as well as their misspellings. If there is little of non-branded traffic it means that the website is unable to rank well for generic keywords. The low volume of branded traffic clearly shows that brand awareness needs a strong support – users do not even make navigational queries to reach the website. I strongly recommend to track the branded traffic trend as it may be a kind of summary on efficiency of brand building marketing activities. 4. Traffic volume provided by Universal Search Image, local, video or mobile search – undoubtedly they are all gaining popularity. If you can confirm a growing user interest in any of these channels it’s definitely worth exploring it further. Classified content has a great potential – not only you can make use of images (to rank well in Google Images or similar services) and videos or other multimedia content but it’s perfectly localized. I perceive it as a great opportunity for the future and one of the factors to gain competitive advantage at the market. INTERNAL SEARCH METRICS 5. Volume and characteristics of internal website searches Number of searches as well as more detailed studies on what are users searching for is a great feedback for further website development. Knowing the volume of searches gives a possibility to estimate revenues of contextual advertising (such as Google Adsense) because search results listings are often monetized this way. If you analyze keywords and identify general topics or subjects you may find particularly interesting niches worth attention and development. 6. Number of results returned per search When searching on site users expect to find the relevant content – that’s obvious, isn’t it? I have learned that internal search is still an unappreciated functionality on classified websites. Take a look on “Nokia” vs “Nokja” search results on Craigslist.org. The first one works very well while the second returns no results. Ratio of “no results” pages is particularly important here – it negatively affects user experience and immediately raises the question “what to do with such a user behavior?”. There are at least two options: usability improvement (e.g. handling misspellings) or… monetizing by contextual advertising again. 7. Number of page views of search results pages There are lot of researches that prove users tend to stay on first page of search results on global search engines like Google. The same behavior looks slightly different on classified websites – users prefer to go deeper and browse more search results listings because they are more interested in browsing all the relevant offers to find the best deal. Having the information on ratio of searches going to 2nd, 3rd and following search results pages may help to evaluate e.g. if the default number of results per page is optimal or the results are presented in the right order and are of high quality. GENERAL METRICS 8. Leading source of traffic Do you know where the most users come from? How much traffic (share) does the most important channel provide you with? The more dependent your website is from a specific traffic source the more risky it’s for your business – in particular the e-commerce one. It’s no mystery that the market leaders are usually sites with the biggest audience. In classifieds “the biggest” usually means “generating most of the content & revenues”. Now imagine what would happen if you suddenly lose this traffic – a big drop in visits, placed ads and revenues. To avoid such a disaster keep a healthy ratio of several traffic sources so that none of them will kill your business. 9. One-time vs returning visitors Loyalty of people is extremely important in the era of communities. During the hard times they sell houses and cars of look for a job more frequently not to mention all other goods that are sold on even more regular basis. If you have a relatively small community of loyal users or it is going down every month, you probably face the problem of lack of content and its quality. Unless you are unquestionable leader in your area or niche a small group of newcomers may mean you are not reaching new target groups and your business isn’t growing. 10. Average number of page views per ad details page It’s probably one of the most uncomfortable questions, but from the seller’s point of view it’s obviously one of the most important to ask – it’s about a real value of the classified site. There are few others worth considering: How many pages impressions were done on my item I want to sell? How many people were interested in my offer? Finally, do I pay the right price for an exposure at this portal? Is it worth buying a premium listing there? The conclusion is obvious – the more page impressions the better while it increases the chances of a completing a transaction for both sides. 11. Traffic sources for ad details pages If you want to make deeper analysis on quality and quantity of traffic coming to ad details pages I suggest to investigate which channels generate the most impressions of ad details. While search engines should play a major role in direct access to ads due to the characteristics of the “Long Tail”, indirect access (e.g. through category listings) may be driven by lots of other channels. Having no direct visits on ad details pages raises the question of SEO friendliness level and if you have a relatively small number of other ad impressions it may rise the question of website usability or relevant content presentation (“see similar ads” modules, etc.) 12. Bounce rate & exit rate on ad details pages The reason why people leave ad detail page is particularly important. Either they find the good deal (which is not happening too often) or they are not encouraged enough to proceed to browse other offers. From the website owner point of view this is a lost chance of generating more page views and more importantly less value provided to the seller (remember point 10?). 13. Lifetime cycle of the ad This is another more sophisticated factor yet still worth analyzing. Having information on number of daily ad details page views on 1st, 2nd, … the last day of its online presence may give you new business ideas how to convert it into revenues with additional premium packages. 14. Bounce rate of different page templates Bounce rate of ad details pages (see point 12), homepage, category pages or search results – they are all different and should be analyzed separately. All of them will clearly tell you whether people are interested in the particular content and if the layout is eye-catching enough to make them stay on site. 15. Number of landing pages This metrics sheds the light on how users enter the website and start their visit: whether it’s very few pages (home page, some category pages) or a large number of them (search listings, ad details, etc.). I believe this metrics is also closely related to point 2 because large number of unique landing pages cannot be achieved without the “Long Tail” SEO-friendly website. THIS IS JUST THE BEGINNING... This is just a part of metrics which in my opinion should be used by the classified industry. They are certainly more useful than just a standard “number of visits”, “number of page views” or “average time spent on site” which don’t tell too much about a specific case. I hope it’s also a good starting point for more advanced analyses in the future. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top 15 Web Metrics For a Classified Website"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top 15 Web Metrics For a Classified Website"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Maciej Gałecki\n          \n            Maciej Gałecki\n          \n            Maciej Gałecki"
}