{
  "url": "https://moz.com/blog/top-25-moz-blog-2019",
  "slug": "top-25-moz-blog-2019",
  "title": "They're the Best Around: The Top 25 Moz Blog Posts of 2019 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We've put together the list of the most-read Moz Blog articles of 2019. See what made the cut for most popular and read the best posts you may have missed!",
  "content": "They're the Best Around: The Top 25 Moz Blog Posts of 2019 Blogging | Moz News By: Felicia Crawford December 26, 2019 Table of Contents Copied! By: Felicia Crawford December 26, 2019 They're the Best Around: The Top 25 Moz Blog Posts of 2019 Blogging | Moz News Well, folks, it's that time of year again. It's hard to believe we've already gone another turn around the ol' sun. But I've consulted my analytics data and made my SQL queries, and I'm here today to present to you the list of the top Moz Blog posts of 2019! For a little perspective, we published 207 blog posts, averaging out to about 4 per week. Out of those 207, the twenty-five I'm sharing with you below were the most-read pieces of the year. If you're strapped for time (and who isn't in our industry?), survey says these are the articles that aren't to be missed. And bonus — a good chunk of them are videos, so bring out the chocolate popcorn and settle down to watch! (If chocolate popcorn sounds new and unfamiliar to you, I implore you to check out the Cinerama in Seattle's Belltown neighborhood the next time you're in town for MozCon. It is life-changing. Get the mix of regular and chocolate and never, ever look back.) I'll be sharing the top keywords each post ranks for according to Keyword Explorer, too, to give you some idea of why these posts have continued to be favorites throughout the year. Gotta love that \"Explore by Site\" feature — it makes my job way too easy sometimes! ;-) (For the Keyword Explorer nerds in the audience, I'll be filtering the rankings to positions 1–3 and organizing them by highest monthly search volume. I want to see what we're ranking highly for that gets lots of eyeballs!) Ready to get started? I sure am. Let's dive in. The top 25 Moz Blog posts of 2019 1. On-Page SEO for 2019 - Whiteboard Friday Britney Muller, January 4th 57,404 reads Top keywords according to Keyword Explorer: seo 2019 (#3, 501–850), seo best practices 2019 (#3, 501–850), homepage seo 2019 (#1, 0–10) On-page SEO has long been a favorite topic for y'all, and the top number-one winner, winner, chicken dinner post of 2019 reflects that loud and proud. In this expert checklist, Britney Muller shares her best tips for doing effective on-page SEO for 2019. And if you want a hint on one reason this puppy has been so popular, check out #10 in this very list. ;-) 2. The 60 Best Free SEO Tools [100% Free] Cyrus Shepard, June 10th 51,170 reads Top keywords according to Keyword Explorer: seo tools (#1, 6.5k–9.3k), free seo tools (#1, 1.7k–2.9k), free seo (#1, 501–850) This post is a testament to the power of updating and republishing your best content. Cyrus originally authored this post years ago and gave it a sorely needed update in 2019. There are literally hundreds of free SEO tools out there, so this article focused on only the best and most useful to add to your toolbox. 3. The Ultimate Guide to SEO Meta Tags Kate Morris, July 24th 42,276 reads Top keywords according to Keyword Explorer: seo meta tags (#1, 501–850), 1-page meta (#2, 501–850), what are meta tags (#3, 501–850) Here's another vote for the power of republishing really good content that you know your audience craves. Originally published in November 2010, this is the second time we've asked Kate to update this article and it continues to deliver value ten years later. SEO certainly changes, but some topics remain popular and necessary throughout all the ups and downs. 4. The One-Hour Guide to SEO Rand Fishkin, throughout 2019 41,185 reads for the first post (143,165 for all six combined) Top keywords according to Keyword Explorer: moz seo guide (#2, 201–500), moz beginners guide to seo (#3, 101–200), moz guide to seo (#2, 11–50) A \"best of the Moz Blog\" list wouldn't be complete without Rand! His six-part video series detailing all the most important things to know about SEO was originally published on the Moz Blog as six separate Whiteboard Fridays. We've since redirected those posts to a landing page in our Learning Center, but the first episode on SEO strategy earned over 41k unique pageviews in its time live on the blog. 5. A New Domain Authority Is Coming Soon: What’s Changing, When, & Why Russ Jones, February 5th 38,947 reads Top keywords according to Keyword Explorer: moving a 60 da to a 90 da seo (#1, 0–10), moz da update 2019 (#1, 0–10), upcoming domain change (#1, 0–10) When we upgraded our Domain Authority algorithm in March, we knew it would be a big deal for a lot of people — so we put extra effort into education ahead of the launch. Russ's initial announcement post introducing the coming changes was the foremost source for information, earning ample attention as a result. 6. How Google Evaluates Links for SEO [20 Graphics] Cyrus Shepard, July 1st 38,715 reads Top keywords according to Keyword Explorer: free google picture of created equal (#2, 0–10), google 1 page 2 links (#2, 0–10), google top rankingillustrations (#2, 0–10) All right, I admit it: we did a ton of content updating and republishing this year. And it seriously paid off. Cyrus revamped a perennially popular post by Rand from 2010, bumping it from ten graphics to twenty and giving it a much-needed refresh almost a decade after the original post. The top keywords are kind of weird, right? Check out the title on the original post — looks like we've got a little work to do with this one to get it ranking for more relevant terms! 7. Do Businesses Really Use Google My Business Posts? A Case Study Ben Fisher, February 12th 32,938 reads Top keywords according to Keyword Explorer: google my business posts (#2, 201–500), how to post on google my business (#3, 101–200), google business post (#3, 51–100) Even a couple of years after Google My Business Posts became an option, it wasn't clear how many businesses are actually using them. Ben Fisher asked the important questions and did the legwork to find the answers in this case study that examined over 2,000 GMB profiles. 8. Announcing the New Moz SEO Essentials Certificate: What It Is & How to Get Certified Brian Childs, May 1st 32,434 reads Top keywords according to Keyword Explorer: moz certification (#3, 101–500), moz seo certification (#2, 51–100), moz academy (#3, 51–100) One of our most-asked questions from time immemorial was \"Does Moz offer an SEO certification?\" With the launch of our SEO Essentials certificate in May of this year, the answer finally became yes! 9. Optimizing for Searcher Intent Explained in 7 Visuals Rand Fishkin, March 23rd 29,636 reads Top keywords according to Keyword Explorer: user intent moz (#2, 0–10) What does it mean to target the \"intent\" of searchers rather than just the keyword(s) they've looked up? These seven short visuals explain the practice of intent-targeting and optimization. 10. 7 SEO Title Tag Hacks for Increased Rankings + Traffic - Best of Whiteboard Friday Cyrus Shepard, June 7th 26,785 reads Top keywords according to Keyword Explorer: title tags for landing page (#2, 11–50), moz free hack (#1, 0–10), title tag hacks (#1, 0–10) Title tags can have a huge impact on your click-through rates when optimized correctly. In this Whiteboard Friday, Cyrus shares how to use numbers, dates, questions, top referring keywords, and more to boost your CTR, traffic, and rankings. 11. E-A-T and SEO: How to Create Content That Google Wants Ian Booth, June 4th 25,681 reads Top keywords according to Keyword Explorer: eat seo (#2, 201–500), eat google (#2, 51–100), eat google seo (#1, 11–50) Ian Booth covers the three pillars of E-A-T and shares tips on how to incorporate each into your content strategy so that you can rank for the best search terms in your industry. 12. 10 Basic SEO Tips to Index + Rank New Content Faster - Whiteboard Friday Cyrus Shepard, May 17th 24,463 reads Top keywords according to Keyword Explorer: how to index a link faster (#2, 11–50), blog seo index (#1, 0–10), fast on-demand seo (#2, 0–10) When you publish new content, you want users to find it ranking in search results as fast as possible. Fortunately, there are a number of tips and tricks in the SEO toolbox to help you accomplish this goal. Sit back, turn up your volume, and let the Cyrus Shepard show you exactly how in this episode of Whiteboard Friday. 13. Page Speed Optimization: Metrics, Tools, and How to Improve - Whiteboard Friday Britney Muller, February 1st 24,265 reads Top keywords according to Keyword Explorer: page speed optimization (#1, 51–100), page speed metrics (#3, 11–50), optimize page speed (#1, 0–10) What are the most crucial things to understand about your site's page speed, and how can you begin to improve? In this edition of Whiteboard Friday, Britney Muller goes over what you need to know to get started. 14. How Google's Nofollow, Sponsored, & UGC Links Impact SEO Cyrus Shepard, September 10th 24,262 reads Top keywords according to Keyword Explorer: how to send my publishers no follow links (#1, 0–10), moz nofollow links (#2, 0–10), rel= sponsored (#2, 0–10) Google shook up the SEO world by announcing big changes to how publishers should mark nofollow links. The changes — while beneficial to help Google understand the web — nonetheless caused confusion and raised a number of questions. We've got the answers to many of your questions here. 15. How to Identify and Tackle Keyword Cannibalization in 2019 Samuel Mangialavori, February 11th 21,871 reads Top keywords according to Keyword Explorer: keyword cannibalization (#2, 201–500), ahrefs keyword cannibalization (#3, 11–50), what is keyword cannibalization (#3, 11–50) Keyword cannibalization is an underrated but significant problem, especially for sites that have been running for several years and end up having lots of pages. In this article, learn how to find and fix keyword cannibalization before it impacts your SEO opportunities. 16. How Bad Was Google's Deindexing Bug? Dr. Pete, April 11th 17,831 reads Top keywords according to Keyword Explorer: google de-indexing again (#2, 11–50), google index bug (#3, 11–50)On Friday, April 5, Google confirmed a bug that was causing pages to be deindexed. Our analysis suggests that roughly 4% of stable URLs fell out of page-1 rankings on April 5, and that deindexing impacted a wide variety of websites. 17. What Is BERT? - Whiteboard Friday Britney Muller, November 8th 16,797 reads Top keywords according to Keyword Explorer: what is bert (#2, 11–50), moz wbf (#2, 0–10)There's a lot of hype and misinformation about the newest Google algorithm update. What actually is BERT, how does it work, and why does it matter to our work as SEOs? Join our own machine learning and natural language processing expert Britney Muller as she breaks down exactly what BERT is and what it means for the search industry. 18. How Do I Improve My Domain Authority (DA)? Dr. Pete, April 17th 16,478 reads Top keywords according to Keyword Explorer: how to build domain authority (#2, 501–850), how to increase domain authority (#2, 501–850), how to improve domain authority (#1, 11–50)Written to help research and inform his MozCon 2019 talk, this article by Dr. Pete covers how and why to improve a Domain Authority score. 19. How to Get Into Google News - Whiteboard Friday Barry Adams, January 11th 16,265 reads Top keywords according to Keyword Explorer: how to get on google news (#3, 101–200), google news inclusion (#3, 51–100), getting into google news (#3, 11–50)How do you increase your chances of getting your content into Google News? Barry Adams shares the absolute requirements and the nice-to-have extras that can increase your chances of appearing in the much-coveted news carousel. 20. Topical SEO: 7 Concepts of Link Relevance & Google Rankings Cyrus Shepard, April 1st 15,579 reads Top keywords according to Keyword Explorer: link relevance (#2, 0–10), read more on seo (#2, 0–10),relevant links (#2, 0–10)To rank in Google, it’s not simply the number of votes you receive from popular pages, but the relevance and authority of those links as well. 21. The 5 SEO Recommendations That Matter in the End Paola Didone, March 26th 13,879 reads Top keywords according to Keyword Explorer: seo recommendations (#1, 11–50), 10 seo recommend (#1, 0–10), seo recommendations report (#1, 0–10)What are the most steadfast, evergreen SEO recommendations you can make for your clients? These are the top five that this SEO has encountered that consistently deliver positive results. 22. An SEO’s Guide to Writing Structured Data (JSON-LD) Brian Gorman, May 9th 13,862 reads Top keywords according to Keyword Explorer: json structured data (#3, 0–10), seo json content (#3, 0–10), seomoz structured data (#3, 0–10)This guide will help you understand JSON-LD and structured data markup. Go beyond the online generators and prepare your web pages for the future of search! 23. A Comprehensive Analysis of the New Domain Authority Russ Jones, March 5th 13,333 reads Top keywords according to Keyword Explorer: does post clustering build domain authority (#2, 11–50), who invented domain authority (#3, 11–50), domain authority curve (#1, 0–10)A statistical look at Moz's much-improved Domain Authority. Find out how it performs vs previous versions of Domain Authority, competitor metrics, and more. 24. The Practical Guide to Finding Anyone's Email Address David Farkas, November 26th 13,263 reads Top keywords according to Keyword Explorer: N/A in positions #1–3The never-ending struggle with link building begins with finding contact info. David Farkas outlines a few simple and easy ways to discover the right person to reach out to, plus some tips on which tools and strategies work best. 25. How to Use Domain Authority 2.0 for SEO - Whiteboard Friday Cyrus Shepard, March 8th 12,940 reads Top keywords according to Keyword Explorer: domain authority 2.0 (#2, 11–50), thought domain authority keywords (#1, 0–10), domain authority for seo (#2, 0–10)Domain Authority is a well-known metric throughout the SEO industry, but what exactly is the right way to use it? In this Whiteboard Friday, Cyrus Shepard explains what's new with the new Domain Authority 2.0 update and how to best harness its power for your own SEO success. That's a wrap for the top posts of 2019! Did we miss any that were on your own must-read list? Let us know in the comments below. We can't wait to see what 2020 has in store! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "They're the Best Around: The Top 25 Moz Blog Posts of 2019"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "They're the Best Around: The Top 25 Moz Blog Posts of 2019"
    },
    {
      "level": "H2",
      "text": "The top 25 Moz Blog posts of 2019"
    },
    {
      "level": "H3",
      "text": "1. On-Page SEO for 2019 - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "2. The 60 Best Free SEO Tools [100% Free]"
    },
    {
      "level": "H3",
      "text": "3. The Ultimate Guide to SEO Meta Tags"
    },
    {
      "level": "H3",
      "text": "4. The One-Hour Guide to SEO"
    },
    {
      "level": "H3",
      "text": "5. A New Domain Authority Is Coming Soon: What’s Changing, When, & Why"
    },
    {
      "level": "H3",
      "text": "6. How Google Evaluates Links for SEO [20 Graphics]"
    },
    {
      "level": "H3",
      "text": "7. Do Businesses Really Use Google My Business Posts? A Case Study"
    },
    {
      "level": "H3",
      "text": "8. Announcing the New Moz SEO Essentials Certificate: What It Is & How to Get Certified"
    },
    {
      "level": "H3",
      "text": "9. Optimizing for Searcher Intent Explained in 7 Visuals"
    },
    {
      "level": "H3",
      "text": "10. 7 SEO Title Tag Hacks for Increased Rankings + Traffic - Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "11. E-A-T and SEO: How to Create Content That Google Wants"
    },
    {
      "level": "H3",
      "text": "12. 10 Basic SEO Tips to Index + Rank New Content Faster - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "13. Page Speed Optimization: Metrics, Tools, and How to Improve - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "14. How Google's Nofollow, Sponsored, & UGC Links Impact SEO"
    },
    {
      "level": "H3",
      "text": "15. How to Identify and Tackle Keyword Cannibalization in 2019"
    },
    {
      "level": "H3",
      "text": "16. How Bad Was Google's Deindexing Bug?"
    },
    {
      "level": "H3",
      "text": "17. What Is BERT? - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "18. How Do I Improve My Domain Authority (DA)?"
    },
    {
      "level": "H3",
      "text": "19. How to Get Into Google News - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "20. Topical SEO: 7 Concepts of Link Relevance & Google Rankings"
    },
    {
      "level": "H3",
      "text": "21. The 5 SEO Recommendations That Matter in the End"
    },
    {
      "level": "H3",
      "text": "22. An SEO’s Guide to Writing Structured Data (JSON-LD)"
    },
    {
      "level": "H3",
      "text": "23. A Comprehensive Analysis of the New Domain Authority"
    },
    {
      "level": "H3",
      "text": "24. The Practical Guide to Finding Anyone's Email Address"
    },
    {
      "level": "H3",
      "text": "25. How to Use Domain Authority 2.0 for SEO - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Felicia Crawford\n          \n            Felicia Crawford\n          \n            Felicia Crawford"
}