{
  "url": "https://moz.com/blog/top-takeaways-whiteboard-friday-2023",
  "slug": "top-takeaways-whiteboard-friday-2023",
  "title": "Top 10 Takeaways From Whiteboard Fridays in 2023 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Discover the top 10 takeaways you won’t want to miss from the Whiteboard Fridays we published in 2023.",
  "content": "Top 10 Takeaways From Whiteboard Fridays in 2023 Whiteboard Friday | Marketing Industry | AI and SEO By: Emilie Martin Edited By: Emilie Martin December 22, 2023 Table of Contents Copied! By: Emilie Martin Edited By: Emilie Martin December 22, 2023 Top 10 Takeaways From Whiteboard Fridays in 2023 Whiteboard Friday | Marketing Industry | AI and SEO As we bid farewell to 2023, it's time to reflect on the invaluable insights and top takeaways shared in our Whiteboard Friday episodes this year. 2023 brought forth transformative lessons that are guaranteed to shape the strategies of marketers and SEOs in the coming year. Take these lessons into 2024 to start your year off strong. 1. Use AI to aid you at work You guessed it right: artificial intelligence (AI) is our first top takeaway to round out the year. What would this year be without it? We have seen an enormous shift in the SEO and marketing industry as a result of the rise of these technologies, and our Whiteboard Friday presenters helped us figure out how to utilize these tools in our day-to-day duties. In your SEO strategy Title tag testing is a great way to get started with SEO testing. They're a particularly powerful form of SEO test, as your title can affect what you rank for and where you rank. Title tags can also affect the click-through rate you get in search results because they tend to show up right there in the snippet. Will showed us how to use ChatGPT to create 8 million SEO test ideas. Chris discussed five different ways SEOs can use ChatGPT to aid them at work. For example, you can use ChatGPT to optimize for featured snippets, provide feedback on content, enhance your knowledge base, help you with Screaming Frog extractions, and even create custom tools. In content creation Ross started us off strong in April, touching on the topic of how content is evolving, thanks to AI. He shared how our workflows, processes, and content creation would positively evolve, introducing a “new way” of content marketing, including using AI for research, actually creating content, and optimizing content for SERPs. Later in the year, Alisa showed us how to harness generative AI for SEO and content success. We learned how to create content briefs via ChatGPT-4 with Seer’s framework, ‘PARS’: Populate, Activate, Retrieve, and Scrutinize. Generative AI (GenAI) has its pros and cons, its successes and pitfalls. As marketers, we can use tools such as OpenAI’s ChatGPT and DALL-E to aid our content strategies. However, we must proceed with caution when creating content with GenAI. It is likely that in the coming year, the internet will be full of unhelpful AI-generated content; Roxana Stingu predicts it could be over half of the web’s content by the end of 2024. As a result, Google will probably figure out a way to penalize websites that are abusing this new way of content creation, so watch out. Learn more about using AI for content creation in other articles published on the Moz Blog: How to Make AI Your Writing Sidekick for Content MarketingHow to Leverage Content and AI-Powered Tools in Your Content WritingWhen Not to Use Artificial Intelligence in Digital PR 2. Set yourself up for success with GA4 It’s a no-brainer that anything to do with Google Analytics 4 (GA4) would be another top takeaway from this year. There are many interesting features in GA4 — some that were sort of in Universal Analytics but are now better. One of those features is Audiences, which many people may only be using for their ads. In this episode of Whiteboard Friday, Dana showed us why Audiences can also be useful for reporting on other areas of your marketing efforts. Get more out of your GA4 data by connecting your Google Analytics account to your Moz Pro account. View your data in one dashboard; sign up for a Moz Pro free trial to try it out! Learn more about how to set yourself up for success in The Beginner’s Guide to Google Analytics – GA4: The Next Generation of Google Analytics. Discover other articles on GA4 on the Moz Blog: How to Collect & Use Your GA4 Data to Transform Your Content StrategyEnsure a Flawless GA4 Setup and Ongoing Tracking FunctionalityGA4: Leverage the Power of Custom Reports to Enhance Your Reporting 3. Measure your brand Measuring your brand became a hot topic in 2023, and we published lots of content on the Blog to keep you all updated on the latest. Dominic let us know that we’re likely measuring our branded SERP wrong, giving us the exclusive on how to actually measure rank on a branded SERP. The goal is not to rank with one URL, but many, for your branded keywords. You should then measure the percentage of the SERP that you own to analyze how well this strategy is working for you. Moz launched a new metric at MozCon 2023, Brand AuthorityTM, to help support you in measuring the success of your brand online. Brand Authority is on a scale of 1—100 and can be used to help you better assess your strength as a brand and identify opportunities for improvement. Tom touched on why SEOs should measure their brand in his Whiteboard Friday: Learn more about navigating brand success: Brand Entity SEO — Whiteboard FridayHow to Create a Brand SEO Strategy — Whiteboard FridayHow to Use SEO to Build Long-Term Brand Recognition and VisibilityAI Risks: Can Artificial Intelligence Affect Your Brand Equity? Find out how your brand measures up by checking your Brand Authority in the Domain Overview tool. And be sure to check out the top 500 US brands by Brand Authority. 4. Focus on creating high-quality content With the influx of AI-generated content, it’s more important than ever to produce high-quality content that your audience and Google will love. In late 2022, Google rolled out the Helpful Content Update, an ongoing effort to reward sites with “people-first” content, and we saw the importance of this continue into 2023. Along with this update, you should always be considering E-E-A-T (Experience, Expertise, Authoritativeness, and Trustworthiness) principles at the forefront of your content creation. While E-E-A-T is not a direct ranking factor but rather a component of Google’s Search Quality Evaluator Guidelines (SQEG), applying these factors to the content you create will signal to Google that it is high-quality, relevant information. Chima touched on six money-making content formats SaaS companies should prioritize: “best of” content, sales engagement content, competitor comparison pages, pricing pages, modifiers to download something and personalized landing pages. Ross showed us how to repurpose old content into valuable assets that drive results and boost brand authority through text, video, and audio content. Read more about creating high-quality, people-first content: Map Your Keywords to the Buyer's Journey and User Intent — Whiteboard FridayDiversify Your Content Strategy — Whiteboard FridayHow to Generate Top-Shelf Content with Budget Constraints 5. Explain the value of SEO effectively Being able to explain the value of SEO to stakeholders in your company or clients you’re taking on can sometimes be half the battle when attempting to get your suggestions implemented. In his Whiteboard Friday episode, Larry discussed how you can translate the SEO work you do for your clients into how executives think of value — specifically, business value. SEO forecasting can be one of the best ways to demonstrate the value of your SEO efforts. Tom showed us how to create an SEO forecast to quantify predicted SEO value, close performance gaps, and calculate ROI. Don’t forget to grab his free template while you’re at it! Learn more about SEO forecasting and auditing in Aleyda’s Whiteboard Friday on SEO Auditing Success. Want to explore how you can better communicate the benefits of SEO, the potential for ROI, and the advantages of hiring an SEO to a client? Moz Academy can help you brush up on the skills you need to do just that. Check out: Selling the Value of SEOSEO Client Prospecting and Pitch 6. Google’s Search Generative Experience is not to be ignored Google launched its Search Generative Experience (SGE) this year, an experimental SERP feature that incorporates AI-generated responses into search results. SGE attempts to synthesize web resources into a succinct response to a search query. View a comparison of a standard SERP versus an SGE SERP below. Tom shared some key statistics with us in his Whiteboard Friday episode. SGE includes links, ads appear underneath the SGE, suggested questions are included, as well as just raw text. Discover more about SGE on the Moz Blog: How Will SGE Impact Your Organic Traffic?Google SGE: Early Local Search Data 7. Ensure your local SEO content strategy is streamlined If you’re a local business, ensuring your local SEO content strategy is streamlined is an essential way to stay fresh and relevant in the SERPs. Amanda showed us how to create kick-ass local landing pages in her Whiteboard Friday. She mentioned some of the most popular features to include in your local landing pages: reviews, a unique value proposition, sales, and awards. The Local SEO Content Marketing Guide can help you build a robust strategy for localized content. It includes tips for content creation, publication, promotion, and refresh to make sure you're meeting your customer's needs all along the sales funnel. Read the Local Business Content Marketing Guide Check out our other articles about local SEO content strategy: The Local Landing Pages Salad Bar: Making Smart Local Business Content Choices in 2024Local Business E-E-A-T: Real-world Examples of How This Works30 Google Business Profile Photos Your Local Business Can Easily Take — Illustrated 8. Link building is still important for SEO Link building is still an important ranking factor in SEO, as evidenced in some of our most recent Whiteboard Friday episodes. Paddy showed us three ways to evolve our link building in 2023: using the customer journey to generate ideas, moving beyond campaigns, and aiming for links you didn’t ask for. Debbie gave us some top tips for non-spammy link building: understand your target audience, provide value, know what works in your industry, do your research, and do more targeted link building outreach. You can use the free Domain Analysis tool to discover your Domain Authority score. Domain Authority scores range from one to 100, with higher scores corresponding to a greater likelihood of ranking. Discover more on link building on the Moz Blog: Easy to Implement Tactics for Local Link Building — Whiteboard FridayHow to Earn High-Authority Links That Drive Rankings 9. Help Google effectively crawl your website What’s the point in doing all of the above… creating high-quality content, working on your link building strategy, explaining the value of your work… if Google cannot effectively crawl your website? Jes shared with us the fundamentals of crawling for SEO. She showed us why no indexing issues doesn’t necessarily mean no issues at all and how — when it comes to crawling — quality is more important than quantity. Shawn Huber helped us help Google navigate our sites more effectively in his Whiteboard Friday. He talked us through the ways our site structure, our sitemaps, and Google Search Console work together to help Google crawl our websites and what we can do to approve Googlebot’s efficiency. Discover any technical issues with your website using Moz Pro’s Site Crawl. When you set up your Campaign, we will crawl your site every week, seeking out any issues that may impact your rankings or the ability of search engines to crawl and index your site. Sign up for a Moz Pro free trial to try it out. Check out more from the Moz Blog: Crawled — Currently Not Indexed: A Coverage Status Guide 10. Focus on developing your SEO skillset Quite often, we focus on the technical part of our jobs while neglecting the fact that we need to build our skillset to keep up with the everchanging industry of search. With the threat of AI potentially taking our jobs, we must ensure we are trained up in the latest critical information and technological developments. As SEOs, we know how to optimize websites, but what about our careers? In this episode of Whiteboard Friday, Noah shared his insights from his own search marketing career path, with tips for those in the beginning and middle stages of their career. In Helen’s Whiteboard Friday, she showed us how to find and address gaps in our SEO skills so we can continue to evolve and develop into our best SEO selves. The first step is identifying what skills you need; then, you need to focus on what skills you need to improve and finally discover how you go about improving those skills — and repeat. Discover more content on developing your skillset: 5 Soft Skills SEOs Should Build — Whiteboard Friday What should you expect in 2024? 2024 SEO and Marketing Predictions from Moz2024 SEO and Content Trends: Top Predictions From 27 Industry ExpertsAs we enter 2024, armed with these lessons, I wish you a year filled with success and growth. Let the knowledge gained from these Whiteboard Fridays be your guiding light in the dynamic world of SEO and marketing. Whether you're fine-tuning your SEO strategy, mastering GA4, or navigating the ever-changing landscape of content creation, these lessons will be your compass for a successful year ahead. Cheers to a year of innovation, strategic insights, and unparalleled achievements Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top 10 Takeaways From Whiteboard Fridays in 2023"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top 10 Takeaways From Whiteboard Fridays in 2023"
    },
    {
      "level": "H2",
      "text": "1. Use AI to aid you at work"
    },
    {
      "level": "H3",
      "text": "In your SEO strategy"
    },
    {
      "level": "H3",
      "text": "In content creation"
    },
    {
      "level": "H2",
      "text": "2. Set yourself up for success with GA4"
    },
    {
      "level": "H2",
      "text": "3. Measure your brand"
    },
    {
      "level": "H2",
      "text": "4. Focus on creating high-quality content"
    },
    {
      "level": "H2",
      "text": "5. Explain the value of SEO effectively"
    },
    {
      "level": "H2",
      "text": "6. Google’s Search Generative Experience is not to be ignored"
    },
    {
      "level": "H2",
      "text": "7. Ensure your local SEO content strategy is streamlined"
    },
    {
      "level": "H2",
      "text": "8. Link building is still important for SEO"
    },
    {
      "level": "H2",
      "text": "9. Help Google effectively crawl your website"
    },
    {
      "level": "H2",
      "text": "10. Focus on developing your SEO skillset"
    },
    {
      "level": "H2",
      "text": "What should you expect in 2024?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Emilie Martin\n          \n            Emilie Martin\n          \n            Emilie Martin"
}