{
  "url": "https://moz.com/blog/top-12-moz-pro-q1",
  "slug": "top-12-moz-pro-q1",
  "title": "Top 12 Moz Pro Enhancements in Q1 — Plus a Glimpse Into the Future - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We've been busting out updates and enhancements to Moz Pro in Q1 and we're super proud to tell you all about 'em! Adam Feldstein's here to give you the low-down on how we've bettered our SEO product and what we've got planned in the future.",
  "content": "Top 12 Moz Pro Enhancements in Q1 — Plus a Glimpse Into the Future Moz Tools | Moz News By: Adam Feldstein April 13, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Adam Feldstein April 13, 2016 Top 12 Moz Pro Enhancements in Q1 — Plus a Glimpse Into the Future Moz Tools | Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 6 minutes] Just a few months back I wrote a blog post reviewing Moz Pro in 2015 and shared some of our lofty goals for 2016. Now that we're a quarter of the way through the year, I wanted to share some of the progress we've made and offer a glimpse into other great SEO features we'll be working on over the next three months. Want to learn more about Moz Pro? Campaign rankings leveled up We overhauled Moz Pro's rankings architecture, dramatically improving response times and unlocking all kinds of new features. For the full scoop on the core release, check out Jeremy’s excellent post. Below are some improvements included in the bigger release, as well as some additions we made after the fact. #1: See your rankings data over any timeframe For years we collected your rankings data over time, but, confoundingly, we were never able to make that data fully accessible in the product. We're pleased as punch that this is now supported on top of our more stable and flexible architecture. This is great for those looking for deeper comparisons, analyses, and reporting. #2: Advanced sorting and filtering Those same architectural limitations made it slow and laborious for us to build in new filters and sorting. You can now filter to your heart’s content by location, label, and text string. For example, you might quickly create a filter to show only your branded keywords, with a location of Seattle, and that include the word “coffee.” This is especially powerful when you have a long list of keywords, where sorting and filtering was once slow and unmanageable. Oh, and you can sort your keywords alphabetically now too. Thanks for your patience! #3: Google algorithm overlays on your graphs Dr. Pete has done some amazing work in tracking Google algorithm updates with Mozcast. You can now leverage that data to get more value out of your rankings reports. If you go to one of your campaigns and look at your last year or two of rankings data, you'll see vertical lines on the graph corresponding to major algo updates. Hover over the little icon at the bottom to learn more about what happened. If you’ve seen your organic search traffic suddenly increase or decrease, this is another great diagnostic in your toolkit. #4: Improved performance and UX Our new, better-organized, cleaner interface makes it easier to read and customize your reports. Faster pages are pretty nice, too. #5: New weekly email updates This is another improvement that I’m pretty psyched about. Our new emails are cleaner and more informative, and now include both ranking updates and important insights that we discover for you each week. We plan to add more timely information to these as we continue to improve our datasets and refine the logic behind Insights. On-page analysis is much better with Related Topics In March we launched a new feature that can help you make sense of how search engines understand topics and phrases. You can use this data to build deeper content, improve your topical authority, find keyword ideas, and generally better understand the SERP. It uses machine learning and topic modeling to mine related topics from the SERPs. #6: Topical analysis report See the topics that your SERP competition is writing about. This can help you understand what kinds of keywords signal topical relevance and provide good ideas for how you can make your content more robust and relevant to searchers. I’m not going to go too deep here, but check out Jon White’s fantastic post for some great tips and examples to get the most from this feature. #7: Quick access to on-page and topical analyses from Rankings Page Optimization scores are now included in your rankings views, so you can see which landing pages have potential for optimization and jump directly to the report for keyword targeting suggestions and topical analysis. We’ve made Insights better A long while back, we dabbled with a new section in campaigns called Insights. This mini-dashboard is tasked with surfacing interesting problems, statuses, and insights from across all sections within a campaign. This section is still a work in progress, but we made some nice additions in the last couple of months. #8: \"To do\" and \"done\" We heard feedback that many of you are using the Insights as to-do list items. Now you can check them off your list once you've read them, or when they're complete. A new workflow improvement allows you to dismiss an insight you're done with. This allows for better tracking of work progress. #9: Add to Trello If you need a more robust workflow, we’ve added a way to quickly add insight tiles to Trello. Trello is a power task management solution, which also happens to be free. I’ve used it quite a bit myself, and happily recommend it. #10: Rankings Summary tile A new tile providing a quick look at your latest rankings, including your most significant improvements and declines. Reporting got some needed attention Outside of the more obvious features I’ve shared, we’ve also been working quietly behind the scenes to make our reporting and exports better. #11: Customizable CSV exports for rankings When we launched the ability to select custom timeframes in rankings, one feature that lagged was the ability to export data specific to that timeframe. We recently launched updated CSVs in that section that will respect filters as well as time frames. #12: Revamped interface for custom reports Adding and managing custom reports is easier to use and easier on the eyes. A glimpse into the future We have a few other tricks up our collective sleeves. Keyword Explorer! Yup, this long-anticipated keyword research tool is literally just around the corner. Be wary. Keyword analysis page revamp When you click on a keyword from a campaign, you will very soon be presented with a much cleaner and more informative analysis to help you understand your history with that keyword and its SEO potential. Keyword volume in campaigns We’ve been working on a more accurate keyword volume metric that offers a volume range built on multiple data sources, instead of a very precise but often incorrect number. You'll find this soon on the keyword analysis page, and a bit later along with your keywords rankings, so you can better gauge the value of the keywords you track and the rankings you earn. SERP features A high organic ranking is excellent, it's true. However, with an increasing number of ads, packs, and answers on many SERPs, your visibility might still be low. We plan to include the top SERP features that SEOs can act on along with your rankings. This can help you better understand visibility and inform strategic choices. On-page reports from the Mozbar Kick off a page analysis report directly from the MozBar as you review the page on your site. “Real” PDF exports Our current PDF export solution is functional, but pretty rough. It converts page modules into images and then encapsulated them in a PDF. Yeah… not so great. We'll soon launch an updated method for creating PDFs so that they include text as text and images as images, offering better editing, copying, and image quality. New & improved site crawl Expect big improvements to the interface and the data surfaced. On top of that, this update includes a rewrite of the crawler itself, allowing for faster and more reliable crawling. We are targeting a beta in Q2 and a full launch in Q3. In conclusion... We’re keeping busy and trying to bring more value to our products. If you aren’t a customer and want to check things out, go ahead and give Moz Pro a spin with a 30-day free trial. As always, please share your thoughts. We count on your candid feedback to help us guide our priorities build better products. Before I go: I want to give a shout out to our sisters and brothers at Moz that are working tirelessly on focused offerings for content marketing, influencer marketing, local search, and API data access. If you find yourself in need for such tools, check them out! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top 12 Moz Pro Enhancements in Q1 — Plus a Glimpse Into the Future"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top 12 Moz Pro Enhancements in Q1 — Plus a Glimpse Into the Future"
    },
    {
      "level": "H2",
      "text": "Campaign rankings leveled up"
    },
    {
      "level": "H3",
      "text": "#1: See your rankings data over any timeframe"
    },
    {
      "level": "H3",
      "text": "#2: Advanced sorting and filtering"
    },
    {
      "level": "H3",
      "text": "#3: Google algorithm overlays on your graphs"
    },
    {
      "level": "H3",
      "text": "#4: Improved performance and UX"
    },
    {
      "level": "H3",
      "text": "#5: New weekly email updates"
    },
    {
      "level": "H2",
      "text": "On-page analysis is much better with Related Topics"
    },
    {
      "level": "H3",
      "text": "#6: Topical analysis report"
    },
    {
      "level": "H3",
      "text": "#7: Quick access to on-page and topical analyses from Rankings"
    },
    {
      "level": "H2",
      "text": "We’ve made Insights better"
    },
    {
      "level": "H3",
      "text": "#8: \"To do\" and \"done\""
    },
    {
      "level": "H3",
      "text": "#9: Add to Trello"
    },
    {
      "level": "H3",
      "text": "#10: Rankings Summary tile"
    },
    {
      "level": "H2",
      "text": "Reporting got some needed attention"
    },
    {
      "level": "H3",
      "text": "#11: Customizable CSV exports for rankings"
    },
    {
      "level": "H3",
      "text": "#12: Revamped interface for custom reports"
    },
    {
      "level": "H2",
      "text": "A glimpse into the future"
    },
    {
      "level": "H3",
      "text": "Keyword Explorer!"
    },
    {
      "level": "H3",
      "text": "Keyword analysis page revamp"
    },
    {
      "level": "H3",
      "text": "Keyword volume in campaigns"
    },
    {
      "level": "H3",
      "text": "SERP features"
    },
    {
      "level": "H3",
      "text": "On-page reports from the Mozbar"
    },
    {
      "level": "H3",
      "text": "“Real” PDF exports"
    },
    {
      "level": "H3",
      "text": "New & improved site crawl"
    },
    {
      "level": "H2",
      "text": "In conclusion..."
    },
    {
      "level": "H3",
      "text": "Before I go:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Adam Feldstein\n          \n            Adam Feldstein\n          \n            Adam Feldstein"
}