{
  "url": "https://moz.com/blog/topical-hubs-whiteboard-friday",
  "slug": "topical-hubs-whiteboard-friday",
  "title": "Teach Google About Your Entities by Using Topical Hubs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We don't need to create heaps of pages to target long-tail keywords. In today's Whiteboard Friday, Moz associate (and long-time community member) Gianluca Fiorelli explains how we can use topical hubs and an entity-based approach to tell Google about connections it might otherwise have missed.",
  "content": "Teach Google About Your Entities by Using Topical Hubs Advanced SEO | Whiteboard Friday By: Gianluca Fiorelli September 12, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Gianluca Fiorelli September 12, 2014 Teach Google About Your Entities by Using Topical Hubs Advanced SEO | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm not so sure it's correct to say—as is so common lately—that today's SEO is a new one, especially with regard to on-site SEO. Many of the things that are necessary today were also necessary in the past: a well-designed information architecture, a great navigation structure, good internal linking, etc. We should talk instead of a new emphasis we must give to some factors as old as SEO itself. Today I'll talk about one of these factors—Topical Hubs—that, although it has been important in the past, is even more so today with Hummingbird and the increasing weight Google gives to semantics and thematic consistency of the sites. [Disclaimer about my accent in the video: I swear, my English is not so bad, even if it really sounds Italian; just the idea that I was in Seattle shooting a WBF stressed every cell in my body]. For reference, here's a still of this week's whiteboard! Video Transcription Hola, Moz fans. I'm Gianluca Fiorelli. Finally, you are going to see my face and not just my picture or avatar. I'm here not to talk about how to snap faces, but about topical hubs. What are topical hubs? We are going to discover it. Why are we talking about topical hubs? We are going to talk about it because of Hummingbird. Hummingbird, we know that it's not a really well-known algorithm, but it has really changed how Google works. One thing we know is that it is simplifying the results [SERPs]. One thing that is not working anymore, that was really, really a goldmine for SEO, was working on long, long tails. You can remember maybe many sites targeting millions of pages about every kind of long queries possible. This is not so anymore because Hummingbird has simplified [everything]. If query A, query B, and query C are the same when query D, Google will always show query D [SERPs]. In order to optimize your site for this kind of new semantic understanding that Google has of the queries - especially conversational query - we must understand that we have to think in entities and not in keywords. We have to think about the connection between the entities, and we have to be really sure about the context of the content that we are creating. All these three things then will guide our keyword research. How can we do this? We should start our job not from keywords but from entities. These are a few tools that we can use, like directly using the Freebase APIs, which is directly using a Google source (as Freebase is Google), or we can use the AlchemyAPI, which can make our job easier. There are also other tools, like ConceptNet, Yahoo Glimmer, and Bottlenose. Bottlenose... I suggest it to you if you are going to create or craft a site about something which is really mainstream, but has concepts stemming especially from social. Bottlenose is really good because it's taking care also of entity recognition in social media. There is RelFinder, which is a really nice tool for free. It is relying on the dBASE, the Wikipedia database. From there, using these tools, we can understand, for instance, let's say we are talking about pizza because we are a pizzeria (I'm Italian). Using these tools, we can understand what the concepts are related to pizza: What kind of pizza (thin, crunchy, regular pizza, with tomatoes, without tomatoes, Neapolitan or Romana, so many kinds), but also the history of pizza, because Pizza Margherita was named from an Italian queen. We can discover also that pizza can be related to geography also because pizza is Italian, but the World Championship of Acrobatic Pizza (which is a sport) is Spanish. We can understand many, many entities, many, many facts around the concept of pizza that can populate our site about pizzas. Let's say that we are a pizzeria. We have a local site, and we are maybe in Tribeca. We shouldn't just focus ourselves on the entity search of \"pizzas,\" but we should start also thinking about entity searches for entities related to Tribeca, so New York Movie Festival, Robert De Niro, etc. Once we have all of these entities, we should start thinking about the ontology we want to use, that we can extract from these entities, how to group them and create our categories for the site. The categories of a site substantially are our topical hubs. Going to another kind of website, let's think of a classical real estate classified site. We usually have in every classified site the homepage, then the category and product pages. People always say, \"How can we make our category pages rank?\" Consider them to be topical hubs. A good site for topical hubs could be a microsite. We have just to think of our site as if it was a composition of microsites all contextually connected. So the category page in this case should be considered as a new site all about, for instance, Tribeca or all about Harlem, or Capitol Hill in Seattle, or any other neighborhood if we are talking about real estate. From there, once we have decided our categories, we can start doing the keyword research, but using a trick, we must credit Dan Shure for the tip, which is to find keywords related to the entities. Now Dan Shure is suggesting to us to do this: going to Keyword Planner and instead of putting a few keywords to retrieve new ones, use a Wikipedia page of the entity related to the content that we are going to optimize. Goggle will start suggesting us keyword groups, and those keyword groups are all related to a specific subset of the entity we are talking about. So we can start optimizing our page, our content hub, with the keywords Google itself is extracting from the best SERPs of entities (Freebase or Wikipedia). In doing so, we are creating a page which is really well optimized on the keywords side, but also on the entity side, because all of those keywords we are using are keywords that Google relates to specific entities. But that's not all, because when we talk about topical hubs, we have to talk, again, about the context, and the context is not just writing the classic, old SEO text. It's also giving value to the category page. So if we have done a good audience analysis, maybe we can understand that in Capitol Hill, there is a certain demographic. So we can organize the content on the hub page focusing on that demographic, and we know that we will have our text talking about the neighborhood, but we also have our initial listings. Maybe we can see, for instance, if a neighborhood is really appreciated, or if the demographic is young families with two kids and so on. Maybe we can add values, like Zillow is doing: has school close to or in the neighborhood, or parks close to the neighborhood, or where to go to eat in the neighborhood, or landmarks in the neighborhood. All of this content, which is adding value for the user, is also adding contextual value and semantic value for Google. One tip. When you are optimizing a page, especially category pages, let's say you have the category page Capitol Hill, Seattle for your real estate site. Tag it with the Schema.org property sameAs, the Capitol Hill word, and link that sameAs to the Wikipedia page of Capitol Hill. If it doesn't exist, write yourself a web page about Capitol Hill. You are going to tell Google that your page is exactly about that entity. So when we have all of these things, we can start thinking about the content we can create, which is contextually relevant both to our entity search (we did a keyword search related to the entities) and also to the audience analysis we did. So, returning to my pizzeria, we know that we can start doing recipes and tag them with recipe micro data. We can do videos and mark that them with a video object. We can do short forms, and especially we can try to do the long forms and tag them with the article schema and trying to be included in the in-depth article box. We can start writing guides. We can start thinking about UGC and Q&A. We can try especially to create things about the location where we are set, which in my pizzeria case was Tribeca, creating a news board to talk and discuss about the news of what's happening in Tribeca, what the people of Tribeca are doing, and if we are lucky, we can also think to do newsjacking, which we know is really strong. For instance, do you remember the Oscar night when the guy with the pizza was entering on the stage? Well, maybe we could do something similar in Tribeca, because there's a movie festival there. So, maybe during the red carpet show our person goes to all of the celebrities and starts giving pizza to them, or at least a Coke? So doing these things we are creating something which is really, really thought about in a semantic way, because we are really targeting our site to all of the entities related to our micro-topic. We have it optimized also on a keyword level, and we have it optimized on a semantic search level. We have created it crossing our search with the audience search. We're creating content which is responding both to our audience and Google. And doing so, we are not going to need to create millions of pages targeting long, long tails. We just need really strong topical hubs that stem content, which will be able to respond properly to all the queries we were targeting before. I hope you enjoyed this Whiteboard Friday. And, again, I beg your pardon for my accent (luckily you have the transcript). Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Teach Google About Your Entities by Using Topical Hubs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Teach Google About Your Entities by Using Topical Hubs"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gianluca Fiorelli\n          \n            Gianluca Fiorelli\n          \n            Gianluca Fiorelli"
}