{
  "url": "https://moz.com/blog/tracking-your-viral-video-campaign",
  "slug": "tracking-your-viral-video-campaign",
  "title": "Tracking Your \"Viral\" Video Campaign - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This one is for anyone who has ever had the pleasure of doing a viral video marketing campaign.As we are all aware there are so many hurdles to getting either a client or an in house CEO to sign off quality \"viral\" video content. Two of the most difficult of these hurdles are \"can you guarantee…",
  "content": "Tracking Your \"Viral\" Video Campaign Social Media M By: marv1983 July 29, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: marv1983 July 29, 2008 Tracking Your \"Viral\" Video Campaign Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. This one is for anyone who has ever had the pleasure of doing a viral video marketing campaign. As we are all aware, there are so many hurdles to getting either a client or an in-house CEO to sign off quality \"viral\" video content. Two of the most difficult of these hurdles are \"Can you guarantee results?\" (e.g., numbers of views, etc.) and \"How do we track this?\", both resulting in a tedious ROI conversation which normally ends up with the proverbial plug being pulled from the whole project. Having been very fortunate to work on some fantastic viral campaigns, I have always found the tracking of viral videos something I must know more about so we can validate our SMM viral campaigns better. I got an email today asking \"If you created a \"wildly successful\" video that got spread around, is there a way to check on which pages your video's been embedded?\" So here is how it could be done. I'm not saying this is the holy grail of ideas, but I believe that in order to track a video and not pay for a \"fancy\" tracking system (increasing ROI for your boss or CEO), this is a way of doing it! Create fantastic content Upload your video SEO your video Make a note of the unique section of your video's URL and the equivalent unique part of your video's embed code Market your video Search (Googley thing sounds like it is a good one) for the unique section of your video's URL and embed code to track how many posts/videos/links are out there on the web (as you would a keyword) Now does this create a good ROI indicator? Well no, but whoever said, in a serious voice, that social media and viral videos could offer ROI values? One thing it does do is allow to show a change in the number of indexed pages on the web which have your video's unique URL or embed code link information. Here is an example of the unique bits you require to track a video like this (In bold): http://uk.youtube.com/watch?v=H3eLUdKl9II <object width=\"425\" height=\"344\"><param name=\"movie\" value=\"http://www.youtube.com/v/H3eLUdKl9II&hl=en&fs=1\"></param><param name=\"allowFullScreen\" value=\"true\"></param><embed src=\"http://www.youtube.com/v/H3eLUdKl9II&hl=en&fs=1\" type=\"application/x-shockwave-flash\" allowfullscreen=\"true\" width=\"425\" height=\"344\"></embed></object> Whilst you are having a look into this check, out my colleague Kiwi Dave and our office prank on him. P.S Please be kind: this is my first YOUmoz post and I don't want a Golden duck. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tracking Your \"Viral\" Video Campaign"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tracking Your \"Viral\" Video Campaign"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "marv1983\n          \n            marv1983"
}