{
  "url": "https://moz.com/blog/tracking-temporal-trends-in-content-and-link-growth",
  "slug": "tracking-temporal-trends-in-content-and-link-growth",
  "title": "Tracking Temporal Trends in Content and Link Growth - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Since Google released their patent application on historical information way back in March of 2005, search marketers have recognized that trends in temporal link and content analysis do have a real impact on rankings. What isn't quite clear is how this concept functions, and it's the subject of…",
  "content": "Tracking Temporal Trends in Content and Link Growth Content Marketing By: Rand Fishkin March 15, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 15, 2007 Tracking Temporal Trends in Content and Link Growth Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Since Google released their patent application on historical information way back in March of 2005, search marketers have recognized that trends in temporal link and content analysis do have a real impact on rankings. What isn't quite clear is how this concept functions, and it's the subject of tonight's stay-up-until-2am-blogathon. The engines are trying to measure patterns - they're looking for indications of increasing or decreasing relevance and authority that temporal trends provide. There's several specific items they want to identify: Content growth patterns - how often does a particular site tend to add new pages Content update patterns - how often are documents edited and updated Link growth patterns - how often are new links pointing to the site Link stagnation patterns - does the number of links to the site stagnate or decrease There's also some calculus here - they're not just interested in how many links pointed today vs. yesterday (or how many pages have been added), there's a fundamental interest in tracking patterns over time. Below, I've drawn some graphs showing the rate of new external links (and in the last two instances, pages) created over time, with some speculations about what the trends might indicate. These assumptions don't necessarily hold true for every site or instance, but the graphs make it easy to see how temporal link and conten growth information can be used by the engines to make guesses about the relevance or worthiness of a particular site. Let's look at some guesstimates of a few real sites and how these trends have effected them. Wikipedia has had tremendous growth in both pages and links over the last 5 years. This success shows itself in the search engines, who reward Wikipedia's massive link authority with high rankings for much of its content. DMOZ has experienced a relative decline in popularity. While they were once a default reference link for many sites, their relative influence has waned. My experience has also seen them appearing in far fewer competitive rankings that 2-4 years ago they dominated. SEOmoz itself has a relatively steady rate of content additions, but the number of new links pointing to the site on a weekly or monthly basis has continued to rise over the last few years. The results have been high rankings for some competitive queries in a very competitive sphere (Internet marketing). (BTW - the graphs are obviously not to scale with one another) This metric makes me think that many forms of spam and manipulative link building are going to stand out like a sore thumb when put under the temporal microscope. When a large gain in links relative to a site's sphere, influence and historical link growth appears, the engines can take a closer look at the source of the links or even trigger a manual review. Common sense would dictate that a small-time local real estate site doesn't usually attract a few thousand new links in a week unless they've done something news or link-worthy. There's little limit to what the engines can do with data like this, and no reason they shouldn't be analyzing it (since it's easily available). I'd invite you to consider how the link and content growth patterns for your own sites may affect the engines' perspectives on your rankings. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tracking Temporal Trends in Content and Link Growth"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tracking Temporal Trends in Content and Link Growth"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}