{
  "url": "https://moz.com/blog/tracking-traffic-from-google-places-in-google-analytics",
  "slug": "tracking-traffic-from-google-places-in-google-analytics",
  "title": "Tracking Traffic from Google Places in Analytics for SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google has gone to great lengths lately to incorporate local data wherever it can. Google Place Search rolled out in late October and services such as Google Tags and Google Boost offer increased visibility, for a price. It’s only natural that we would want to know if investing in these add-ons is…",
  "content": "Tracking Traffic from Google Places in Google Analytics SEO Analytics By: Rebecca Lehmann January 4, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Lehmann January 4, 2011 Tracking Traffic from Google Places in Google Analytics SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google has gone to great lengths lately to incorporate local data wherever it can. Google Place Search rolled out in late October and services such as Google Tags and Google Boost offer increased visibility, for a price. It’s only natural that we would want to know if investing in these add-ons is actually worthwhile. Most of us naturally would turn to Google Analytics for the answer, but what can you do when your referral URL says only that it’s from Google? That’s a rather vague answer with a lot of different possibilities. How can we narrow it down to traffic referred only from Google Places? To better justify the time and money spent on Google Places for our clients, I set out to find an answer. Method #1: Redirected Landing Page My search for a reliable tracking method began with a question: How can we track Google Places without manual tagging? I wanted to avoid tagging initially since, as an agency, my company manages hundreds of profiles. Tagging all of them would be a huge multi-departmental project. Obviously I was going to look for a simpler way first. One method suggested to me was to use a nonexistent page on the website as the URL, then 301 redirect it to the index page. It wasn’t going to solve my “huge multi-departmental project” problem, but it was an interesting thought. Pros: It would be relatively easy to set up, easier than manual tags. The resulting URL would be clean, visually speaking. Cons: Given the nature of the new blended algorithm, I’m reluctant to 301 the primary landing page I’m presenting to Google. It could be downgraded at best, and regarded as a doorway page at worst. Ultimately, we didn’t test this method. The risks were simply too great. Method #2: Manual Tagging So I tested manual tagging instead. The Google URL Builder is a terrific tool: In the example above, I’m using the Content field to differentiate one office location from another, but this could also be done in the Campaign field. The resulting URL is then added to the Google Places profile. Pros: Not only is the setup relatively easy, the data presentation in Google Analytics is really clean and easy to slice up. Different business locations are easily segmented out for deeper analysis of which locations are the biggest drivers. Isn’t it beautiful? The first thing I did once I had this was to add keywords to the mix: Oooh… ahhh… Cons: It appears that adding a tracking URL triggers the dreaded “Pending Review” status instead of immediately going Active. Luckily, the change was approved within a week of submission when tested. Phew! I can’t guarantee such a short wait for everyone, of course, but the Google Places team does seem to be on top of things at the moment. A second con is that tagging can only be used to track listings which you control. We often run up against Google Places profiles which were claimed by our predecessors who are no longer contactable, or which the clients claimed once upon a time but can’t find the login info for, or which are controlled by third parties who are still working with our client on other sites… you get the idea. In a perfect world, this wouldn’t be an issue. But it is, and until those others are magically relinquished to us, we can’t track them. A third con is that it’s impossible to tell the difference between traffic which came from the Places profile versus traffic that came from the 7-pack search results. Google sometimes pulls the URL from its index, and other times pulls it from the Places profile. To see this in action for yourself, run a search for “Houston Breast Augmentation” and hover on the first result. It goes to a “naked” URL, with no tracking on it, exactly as you would expect. Now take a look at the SERPs for “best plastic surgeons in Houston” where you find the the same business: Aha. So this isn’t going to filter out all traffic from the SERPs. And it’s kinda ugly, too. Method #3: Capturing The Full Referring URL + Advanced Segmentation Or On-Page Filtering Manual tagging wasn’t going to provide me with exactly what I was after, but I remembered seeing David Harry refer to a method of capturing full referring URLs. It occurred to me that Google Places listings probably have a unique element in their URL structure which I could segment out from the rest of the noise if I (a) had the full URL and (b) knew what that unique element was. I’m not going into how to set up the full referrer capture filter. Go to Reuben Yau’s post (linked in the paragraph above) to see how it’s done. Once that has been set up, create an advanced segment or an on-page filter to pull out the Google Places referrals. It turns out that there are two ways a Google Places listing can render. One version uses \"maps\" in the URL, while the other uses \"place\". At least on the surface, it looks like the difference between a normal search and a mobile search. My filter looks like this: Pros: Since the filtering works on the basis of the URL structure, profile control is unnecessary. Cons: It took me awhile to figure out why the manual tagging method and full referrer methods were putting up different numbers, but finally I realized that the full referrer method does NOT include the 7-pack results. If you want to include 7-pack clicks, the full referrer method won’t do it for you. The data isn’t presented in such a pretty, clean way, and there’s no simple way to segment out traffic coming through different office locations. It can be done, it’s just a bit of a headache since it involves filtering for specific “cid” numbers from the URLs and knowing which insanely long number belongs to which location. The setup is a little more intense, too. Method #4: Using Both Manual Tagging and Full Referrer Methods Together Using both is how I got to this: Between the two, you have almost everything you could ever want to slice and dice. I used a simple filter grab Google Places and manually tagged URLs and exclude SERPs traffic: The filter works because it relies on the full referring URL to provide the bits to be filtered in and out. Once it’s in place, you can slice and dice your Google Places referral data to your heart’s content. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tracking Traffic from Google Places in Google Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tracking Traffic from Google Places in Google Analytics"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Lehmann\n          \n            Rebecca Lehmann\n          \n            Rebecca Lehmann"
}