{
  "url": "https://moz.com/blog/tracking-the-roi-of-social-media",
  "slug": "tracking-the-roi-of-social-media",
  "title": "Tracking the KPIs of Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Social media receives a massive amount of attention on the web and attracts a great deal of interest from marketers, too. The primary complaint of those who invest seems to be consistent: it's hard to measure the impact to the bottom line. On this point, I must concede - while social's an exciting…",
  "content": "Tracking the KPIs of Social Media Social Media By: Rand Fishkin September 7, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 7, 2011 Tracking the KPIs of Social Media Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Social media receives a massive amount of attention on the web and attracts a great deal of interest from marketers, too. The primary complaint of those who invest seems to be consistent: it's hard to measure the impact to the bottom line. On this point, I must concede - while social's an exciting new area for online marketers, its value isn't always commensurate with the effort required and even when it is, it's tough to prove that point to clients or executives asking for justification. This post is here to help. In it, I'll try to take a brief look at the topics surrounding this problem and offer some solutions, tools and methodologies to make things easier. Why + Where Social Matters Social media has an analytics problem. Whereas many other sources - ads, organic search, referrals, bookmarks - all drive traffic that directly converts (i.e. results in a purchase/signup action), social traffic is very temporal. Visitors from Twitter, Facebook, LinkedIn, Google+, StumbleUpon, et al. are known to visit a page and quickly depart. This leaves marketers struggling to understand the value of these channels. High bounce rates, low browse rates and awful conversion rates make social the black sheep of the referring traffic sources. I'll try to explain the problem, and the reason why social still matters, despite these poor metrics, in visual form: On the web, visitors are rarely buyers (or \"conversion action\" takers of any kind) on a first visit. The web's a tool for discovery, research and investigation and people employ it that way. They browse around, find things that are interesting, discover potential needs or desires, further examine the options and eventually make a purchase decision. For most, the web is less like the checkout aisle at the grocery store (stocked with tempting treats and not-so-tempting magazines, at least IMO) and more like the considered purchase of a grill, television set or automobile. Social media isn't the deal closer - it's the channel that creates potential for a future conversion. Social media can create brand familiarity and drive visitors to content that further draws them in, but it very rarely directly answers an expressly-stated need. Let's take a look at a typical buying cycle for someone who takes a free trial of SEOmoz's software and look where social falls in the process: Twitter and Facebook are early on in the process, likely prior to this customer's realization of need or knowledge of the product. Social channels are likely to be partially responsible for thousands of free trials at SEOmoz, but given the tools currently available, we'd have a very tough time figuring out just how much social participation and presence brought to the company. Another great illustration of this phenomenon comes via Eloqua's Content Grid, which explores the types of content shared on various channels (including social media) and its impact on the buying process: Social media does lots of good things for businesses and brands on the web: Drives traffic Builds brand familiarity Creates positive associations with the brand Delivers social proof via the people sharing the content and discussing the brand Attracts brand followers and evangelists who can help spread the word The Atlantic recently had an article talking about why good advertising works, and many of the same principles apply to social media but are, in my opinion, even more powerful because they're not interruption-based, but inbound and organic. If 10 of the people I follow on Twitter or Google+ start sharing links to a new startup's website, I'm going to be far more engaged, impressed and enticed than if that same startup put banner ads on some of the websites I browse. Both create brand awareness, but social is more personal, more trustworthy and more likely to capture my click. We know that social is a softer, more-difficult-to-measure traffic source, but we're inbound marketers and that means we can't live without data :-) So let's explore some of the ways we can monitor this channel. Which Social Metrics to Track In the social media analytics world, there are several key types of metrics we're interested in tracking: Traffic data - how many visits and visitors did social drive to our sites? Fan/follower data - how many people are in our various networks and how are they growing? Social interaction data - how are people interacting with, sharing and re-sharing our content on social networks? Social content performance - how is the content we're producing on social sites performing? Getting the right metrics to answer these questions requires segmenting by network. Not every question will have direct answers in the data, so we may need to make assumptions or inferences. Facebook Facebook offers a relative wealth of data about nearly all the metrics we care about through their built-in product for brand pages, Facebook Insights: Here you can track key metrics over time, including the size of your fanbase, the reach and effectiveness of your content, the quantity of likes and shares of your content, demographics of your fans and more. Insights also has a very unique and powerful feature - integration on your website. Using a small bit of Javascript code, you can embed the Facebook Insights functionality on your site and receive information about all the users visiting your pages that are logged into Facebook. Since it's been well-covered on SEOmoz (and around the web), I won't dwell too much on Insights other than to say it's the most robust of the built-in, social platform analytics tools by far. More on Insights: Official Insights Page on Facebook 4 Facebook Marketing Tactics You Might Not Know About 6 Areas You Need to Monitor for Effective Messaging Twitter Twitter and Facebook are likely to be the largest two social networks for referring traffic to most sites (StumbleUpon purportedly sends more outbound traffic, but is more of a discovery/browsing engine than a true social network), but while Facebook has relatively sophisticated analytics built into their platform, Twitter does not. This means tracking growth of metrics over time requires third-party tools (or a lot of time collecting data manually), which I'll cover in a section below. The key metrics I care about on Twitter are: Followers (and follower growth over time) - the unique number of Twitter users who've \"followed\" my account Active Followers - the number of followers who've logged into or used a feature of Twitter in the past 30 days (those that have not are likely inactive or non-human accounts). This is challenging to get, and requires software that runs through your followers and determines which are actively using via the API. Some third party tools discussed below will show this information. @ Replies - the number of tweets sent that begin with my account name @ Mentions - a tweet that includes my account name, but uses it inside the tweet, rather than at the beginning, meaning others on Twitter can see the tweet by default, rather than only those who follow both accounts Brand Mentions - tweets that contain the brand/account name but don't use the @ symbol Domain/URL Mentions - tweets that include a link that contains my brand name/domain name. These now include, by default, any shortened URL that contains the brand/domain name as Twitter is automatically parsing the final destination URL for matches to the query. Direct Retweets - the quantity of retweets (using Twitter's native retweet button/functionality) appeared on the service RTs & Vias - the quantity of tweets that contained an RT or via of my account. These are similar to direct retweets, but aren't necessarily counted by Twitter's automatic RT system because they contain a modification of the original message and appear to come from a unique source. Best Performing Content - the content I shared on Twitter that earned the most clicks, retweets and shares. This is currently unavailable directly through Twitter, but some third-party tools will display it. Direct Traffic + Non-Twitter.com Drivers - sources that sent traffic to my site via Twitter's ecosystem, even if they come from desktop clients or other third-party software sources. Thanks to a recent change made by Twitter, these will now show up (mostly) as coming from T.co (Twitter's shortener). In addition to these relatively standard metrics, I'd love to be able to see the impact of my interactions in Twitter on follower count, engagement, etc. For example, if my account sends a tweet that earns me 100 new followers, it would be terrific to see that growth, but currently isn't possible (to my knowledge). All of these metrics are showing the growth, reach and traffic-level impact of my Twitter activity, but none of them help with the full-lifecycle tracking shown above. In an ideal world, I'd want to see the bottom-line impact of my Twitter interactions, but this is very challenging to achieve. Luckily, Google's Analytics evangelist, Avinash Kaushik, wrote a great post on tracking Twitter here, which can serve as further reference. It's often mentioned that in analytics, nothing is worth tracking unless it can be used to take action and improve. For the metrics above, the primary action you're tracking is your own and the key to taking better actions is comparing successful interactions, tweets and content against less successful ones to determine what has the best impact on growing your audience, bringing visits to your site and, eventually, driving conversion actions. LinkedIn LinkedIn functions like a hybrid of Twitter and Facebook. Connections require acceptance from both sides, but public entities (like company pages) and groups can be followed. LinkedIn tends to be a great social network for those who are recruiting talent or involved in B2B sales and marketing. It's often far less effective as a pure consumer/B2B channel. Like Facebook, LinkedIn has some built-in analytics for businesses, one for individual profiles, and lots of data points that are useful to track, including: Company Page Views + Uniques - these track the number of times your company's LinkedIn profile has been viewed over time and the quantity of unique visitors to the page Quantity of Followers - as with Twitter, individuals can \"follow\" a brand account on LinkedIn and receive status updates in their \"updates\" stream. The more followers, the greater your ability to reach more people on LinkedIn with the content you share there Connections - The quantity of unique connections for an individual profile on LinkedIn is a worthwhile metric to track, but unfortunately, I couldn't find built-in functionality to graph that data, just the raw, current count (on the \"Network Statistics\" page) and some data about the geographic and industry reach of those connections. Messages and Invitations - the number of invitations and messages to your account (I clearly need to find a free hour or two and comb through mine - sorry if I haven't added you yet). This, too, lacks any graphing or temporal analysis capability. Profile Views - how many people have looked at your profile over time and some data about who they are (if they're a \"1st\" connection, LinkedIn will show their name; if not, they'll display their company or industry) Top Keywords - a list of the top keywords users on LinkedIn searched for prior to discovering your profile. Content Shares - tragically, I couldn't find a way to measure or record the quantity of status updates/shares you've sent out over LinkedIn nor the number of \"likes\" you've received on the service... Hopefully they'll add those soon. Traffic - LinkedIn isn't a huge traffic driver for most, but for certain B2B sites, it can be relatively substantial and the quality is often higher than other social sources. Here's a screenshot from Moz's Google Analytics Over the past month, LinkedIn's been our 4th largest referrer (since referrals from seomoz.org and pro.seomoz.org are technically internal referrers); not too shabby! Few third-party tools exist to help with measurement of LinkedIn, but over time, I hope to see more tools in the social media analytics field achieve success with Twitter and Facebook and expand to LinkedIn and beyond. Google+ Google's new social network is still relatively young, but given Google's intent to make it part of the signals that influence web search rankings and considering the dramatic growth (to 25 million+ members) in the first two months after launch, it's already worthy of marketers' attention. Unfortunately, the network doesn't yet have any sophistication around metrics tracking, and very few third-party apps have integrated Google+ (an API and oAuth functionality still do not exist in robust ways). Despite this, there's plenty of interesting metrics worth tracking, it's just insanely frustrating because even raw counts are unavailable for many of these. Hopefully, Google will add some soon (heck, if you work on the Google+ team and are doing analytics for users/brands, please consider this list!): Number of Followers - This, at least, is possible. Technically, on Google+, these aren't called \"followers\" but instead use the more awkward nomenclature \"have you in circles.\" You can see this on your profile page. +Name Mentions - It's tough to even reach the list of these (screenshot below), and, unfortunately, there's no raw quantity that I could find in the service, making it nearly impossible (and certainly unpragmatic) to track the number of named mentions you receive on Google+ today. Brand Mentions - Another bummer; I'm unaware of any way to find this through Google+ currently. However, you can use Google's \"site:plus.google.com\" search modifier and query for your brand name with date restrictions, as per this example query (illustrated below): Content Shares, Content +1s, Link Shares, Link +1s - These would all be excellent to add to the list, but tragically have no way of extracting data from the current Google+ system (to my knowledge, anyway). Hopefully in the future they'll arrive. +1s of Your Site's Content - This is currently unavailable in Google+, but is possible to track via Google's Webmaster Tools. The tool gives really excellent analytics data on the impact of +1s, the quantity and where they come from and point to: Traffic - Google+ is already a traffic powerhouse for many tech-forward brands and those that reach early adopters in general, especially considering their relatively small social market share (1/8 the size of Twitter in total users, probably smaller in actives). Here's a screenshot of Moz's traffic (for the record, they're our 9th largest referrer of visits to the site over the past 30 days): Perhaps due to privacy issues, Google+ uses a single referring URL for all traffic, helping to consolidate it in analytics reports but making it frustrating to determine which shares/users/links sent what quantities or value of visits. Reddit, StumbleUpon, Quora, Yelp, Flickr, and YouTube Depending on the quantity and value of the traffic that other social networks send, there may indeed be additional metrics worth tracking. For SEOmoz, StumbleUpon, Slideshare, Reddit and Quora are all in our top 50 referrers, and each sends 500+ visits/month. These are likely worth some investment on the metrics and effort front, and if small quantities of contribution/participation yield large returns, more investment is likely warranted. Blogs + Forums The world of social started out as one where discussion sites (forums, Q+A, bulletin boards and the like) and the blogosphere reigned supreme. Eventually, consolidation and massive adoption of the major networks (those mentioned above) took over the hearts and minds of the press, but the social web is still very much alive in the blogosphere and forum world. Marketers have massive opportunities in these spaces, too. At SEOmoz, we have tens of thousands of visits each week from blogs and discussion sites of all sizes, and participation/interaction with those sources often yields fantastic results in referral traffic, mindshare and links. Many brands do likewise, hiring community managers or evangelists to engage in the sites where industry topics are discussed and building up strong, recognizable profiles that help bring awareness and produce traffic+links. Thus, as responsible inbound marketers, it's our job to measure these channels and quantify their impact. Site/Brand Mentions - mentions of a site or brand name, e.g. \"seomoz\" or \"www.seomoz.org\" in the blog/discussionsphere can help lead you to content and conversations worthy of engagement, as well as tracking the quantities of those mentions (and possibly the sentiment as well) over time. Google Alerts and Blogscape are potentially worth looking at to help monitor these mentions. Links - direct links are nice because they appear either in link-tracking tools like Google Webmaster Tools, Open Site Explorer or Majestic OR directly in your web analytics (if they send any traffic). Noting new referral sources (in quantity and location) and applying metrics (I like Domain Authority personally, but of course, I'm biased) Traffic - a must-have for any inbound channel, visit-tracking is the most simple metric here (though honestly, I wish it could be tracked alongside the quantitative metrics for mentions/links and stats like follow vs nofollow / DA / # of linking root domains / etc. to help give a sense of the SEO value, too). For any inbound marketing channel (social or otherwise) you're considering, I really like this process: Losing a few hours to channels that don't provide value is minimal next to the value of discovering and participating on those that do! If you're curious about this process and want to dive deeper, this presentation may be helpful. Tools for Measuring Social Media Metrics The number of tools available to track social media has grown exponentially over the last 3 years, and while I'll be unable to list all of them, this will hopefully provide a good sample set: PostRank - great for tracking RSS feed content's performance in the social world, though with the purchase by Google, Facebook data is now gone (which is the largest network by far, thus rendering the service a bit less-than-valuable, IMO). Bit.ly - excellent for tracking clickthroughs on content from any source on any device or medium. It's frustrating to have an extra layer of analytics required, but given the non-reporting of many desktop and mobile clients, bit.ly's tracking has become a must for those seeking accurate analytics on the pages they share. Radian6 - probably the best known of the social media monitoring tools, Radian6 is geared toward enterprises and large budgets, but has impressive social tracking, sentiment analysis and reporting capabilities. Backtype - another fantastic tool for tracking social metrics that may be lost to acquisition by Twitter. I've got my fingers crossed that they're planning to build Social Mention - Enables \"Google Alerts\"-like updates from social media sources (Twitter in particular) along with several plugins and search functions. Raven Tools - A toolset that offers both search and social tracking functionality, Raven helps track many of the basic metrics from Twitter, Facebook and YouTube, and is likely expanding into other networks in the future. Converseon - A very impressive social and web monitoring tool out of NYC, Converseon, like Radian6, is geared toward enterprises, but offers human-reviewed sentiment classification and analysis - a very powerful tool for those seeking insight into their brand perception on the social web. Pagelever - specifically focused on tracking Facebook interactions and pages, they provide more depth and data than the native Insights functionality. TwitterCounter - a phenomenal tool for monitoring the growth of Twitter accounts over time (it tracks latently, offering historical data for many accounts even if you haven't used it before). Upgrading to \"premium\" provides analytics on mentions and retweets as well. FollowerWonk - technically more of a social discovery tool, Wonk lets you search and find profiles via a \"bio\" search function, but also offers very cool analytics on follower overlap and opportunity through a paid credits model. Social Bakers - stats monitoring for Twitter and Facebook (and several types of unique Facebook sources like Places and Apps) Crowdbooster - more than a raw analytics tool, Crowdbooster focuses on providing tips such as timing and suggested users for engagement to help improve your social reach. Awe.sm - link and content tracking, along with traditional social metrics analytics; they've also got a very pretty interface. TwentyFeet - aggregation of metrics and a datastream from Facebook, Twitter and YouTube. SimplyMeasured - reporting via Excel exports, including some very cool streams of data. Most Shared Posts - a plugin for Wordpress from Tom Anthony that enables Wordpress users to see the posts that are most shared on Google +1, Twitter and Facebook. If you have tools you love, please feel free to add them in the comments (links are certainly welcome, too). OnReact in the comments noted this great post on tools specifically for Google+, some of which can be useful to gather the data above. Several other tools mentioned in the comments (apologies for my initial overlook):KloutViralheatHootsuiteSharedCountPeerIndex Obviously, there's a ton of metrics and data worthy of attention, and no single platform to combine them (at least, not yet). For now, marketers are stuck with a combination of tools, manual collection, visit tracking via analytics and plenty of questions about the value of social media. However, much like the SEO space, I expect that we'll see an increasing growth of metrics, tools, sophistication from marketers and value derived through participation and network growth. It's exciting to be an early adopter in this space :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tracking the KPIs of Social Media"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tracking the KPIs of Social Media"
    },
    {
      "level": "H2",
      "text": "Why + Where Social Matters"
    },
    {
      "level": "H2",
      "text": "Which Social Metrics to Track"
    },
    {
      "level": "H2",
      "text": "Tools for Measuring Social Media Metrics"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}