{
  "url": "https://moz.com/blog/traffic-estimate-differences-between-google-adwords-and-search-based-kw-tools",
  "slug": "traffic-estimate-differences-between-google-adwords-and-search-based-kw-tools",
  "title": "Traffic Estimate Differences Between Google Adwords and Search-Based KW Tools - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google provides monthly traffic estimates by KW in both its original Adwords Keyword tool (ADKWT) and its newer Search-Based Keyword Tool (SBKWT).  In some cases the numbers reported are similar, but in most cases the monthly traffic numbers appear to very different, with the SBWKT numbers being…",
  "content": "Traffic Estimate Differences Between Google Adwords and Search-Based KW Tools Keyword Research By: BruceBrownlee January 14, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: BruceBrownlee January 14, 2009 Traffic Estimate Differences Between Google Adwords and Search-Based KW Tools Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Google provides monthly traffic estimates by KW in both its original Adwords Keyword tool (ADKWT) and its newer Search-Based Keyword Tool (SBKWT). In some cases the numbers reported are similar, but in most cases the monthly traffic numbers appear to very different, with the SBWKT numbers being only a fraction of the ADKWT. Here are some examples taken from a \"business intelligence\" search with each tool. KW, ADKWT, SBKWT business intelligence bi, 4400, 33 business intelligence books, 720, 350 business intelligence cube, 320, 125 business intelligence kpi, 210, 52 business intelligence metrics, 170, 52 business intelligence performance, 880, 52 business intelligence planning, 320, 66 reporting services analysis services, 590, 100 Changing the Adwords KW tool to exact or phrase match can drastically reduce the estimated average monthly search counts reported, but this does not seem to help align the numbers. It appears to swing the Adwords numbers below the search-based KW tool numbers. I tested this with the search-based KW tool running across several different sites in the BI industry, and the search-based KW monthly searches reported was invariant. There are also great differences in the competition level reported for each KW, but the differences in the search counts are more puzzling. Perhaps there is a better explanation online, but I haven't found it yet. It would be helpful if Google could provide clarification on what the numbers actually mean. The odd thing is that, in practice, we use the Adwords KW Tool numbers, but factor them down to a fraction to account for market segmentation and relevance. For example, \"call blasting\" is a core KW for one of my customers in the voice broadcasting and automated phone message business. However, a large fraction of \"call blasting\" traffic relates to people who take large amplifiers and speakers out to Pacific northwest forests and play \"Sasquatch calls\" to lure Bigfoot. So, -Sasquatch -Bigfoot, and we'll hope to learn more later about why the traffic numbers differ. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Traffic Estimate Differences Between Google Adwords and Search-Based KW Tools"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Traffic Estimate Differences Between Google Adwords and Search-Based KW Tools"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "BruceBrownlee\n          \n            BruceBrownlee"
}