{
  "url": "https://moz.com/blog/traffic-bait-and-ad-clicks-perfect-markets-study-isnt-telling-the-whole-story",
  "slug": "traffic-bait-and-ad-clicks-perfect-markets-study-isnt-telling-the-whole-story",
  "title": "Traffic \"Bait\" and Ad Clicks: Perfect Market's Study Isn't Telling the Whole Story - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yesterday, Perfect Market, a company that \"helps publishers create value from their online content with little effort and no risk1\" released a study that's been getting quite a bit of attention. The study analy...",
  "content": "Traffic \"Bait\" and Ad Clicks: Perfect Market's Study Isn't Telling the Whole Story Content Marketing By: Rand Fishkin October 18, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 18, 2010 Traffic \"Bait\" and Ad Clicks: Perfect Market's Study Isn't Telling the Whole Story Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Yesterday, Perfect Market, a company that \"helps publishers create value from their online content with little effort and no risk1\" released a study that's been getting quite a bit of attention. The study analyzes the relative traffic value per visit of several types of content, coming to the conclusion2 that \"while the Lindsay Lohan sentencing and other celebrity coverage drove significant online traffic for major news publishers, articles about unemployment benefits, the Gulf oil spill, mortgage rates and other serious topics were the top-earning news topics based on advertising revenue per page view.\"Coverage included the New York Times' Traffic Bait Doesn't Bring Ad Clicks, Columbia Journalism Review's Celebs are Loud, but Hard News Pays, Nieman Journalism Lab's Public Interest News Can Be More Valuable to Publishers than Traffic Bait and Search Engine Land's Hard News Pays More than Chasing Search Trends.I'm worried for a few reasons:What's the branding value of those stories? Do they drive up awareness of the publications that authored them? Do they increase return visits?What other actions do those visitors take? Are they more likely to subscribe to an RSS feed? To share those stories on social networks? To get email notifications?Do these stories drive links that then help other, lower link-earning content rank well in search engines? The goal of linkbait, after all, is often to drive branding, links and sharing rather than being directly monetizable. Plenty of consultants on viral content creation even recommend removing ads to drive up sharing and linking activities.Granted, from a personal perspective, I love the idea that writing about celebrity gossip and other \"soft news\" isn't profitable and therefore might be less prevalent in the future. It's purely opinion, but I suspect that many share my sentiment that the United States' major media outlets are far too focused on shallow reporting of topics (like those mentioned in the Perfect Market analysis) that deserve far less attention than, say, understanding what caused the mortgage crisis, who's spending money on elections and why, the success other nations have had in dealing with crime, poverty, drugs, multiculturalism, etc.However, anytime a skin-deep, single-metric analysis like this makes its way into major publications, it has an effect on content publication that's not necessarily positive. If executives, editors and journalists start using singular metrics rather than deep analyses of data to make decisions, their publications will suffer and their content and marketing budgets will be misallocated.If Perfect Market (or another source) could show:The value of the links brought in from those storiesThe branding impact of the visits generatedThe value of sharing activities from those visitsI'd be far more inclined to agree with the conclusions the press is reporting.If you can't fully/accurately analyze the true lifetime value to your publication of so-called \"bait\" (and I don't just mean celebrity-obsessed soft news, but a broader group of creative, traffic-driving pieces), that's OK. Just don't presume a single metric like \"ad click value\" combined with \"page views\" will give you the whole story. The web is all about providing data, and you're cheapening your own value when you cut corners to this extent.BTW - I don't mean to cast all the blame on Perfect Market - they did some reasonable data analysis and shared the findings. I wish it had included a bit more caveats, but their job is promoting their work. I'm more concerned with how the media treated the story - reporting, exaggerating and not bothering to dig deeper. Just look at the opening lines of the NYTimes piece3:Sure, articles about Lindsay Lohan’s repeat trips to rehabilitation and Brett Favre’s purported sexual peccadilloes generate loads of reader traffic, but do they actually make decent money for the Web sites that publish them? According to a new analysis, no.That's not what the analysis showed. It showed one metric and it's impact, but it didn't explore the overall value of the page views, visits and CLTV (Customer Lifetime Value) of the stories it examined. Let's hope the publishers do a more thorough job and that we, as content creators & marketers, think carefully about how to value the content we create and the traffic we attract. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Traffic \"Bait\" and Ad Clicks: Perfect Market's Study Isn't Telling the Whole Story"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Traffic \"Bait\" and Ad Clicks: Perfect Market's Study Isn't Telling the Whole Story"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}