{
  "url": "https://moz.com/blog/transmedia-storytelling-building-worlds-for-and-with-fans",
  "slug": "transmedia-storytelling-building-worlds-for-and-with-fans",
  "title": "Transmedia Storytelling: Building Worlds For and With Fans - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Every brand has a story to tell, and the way users consume stories is changing faster than ever. How will you tell your brand's story across multiple media outlets and platforms, while still giving users an active role in the expansion process? Transmedia Storytelling is here to save the day!",
  "content": "Transmedia Storytelling: Building Worlds For and With Fans Branding By: Gianluca Fiorelli April 23, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Gianluca Fiorelli April 23, 2013 Transmedia Storytelling: Building Worlds For and With Fans Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. John loves Batman. He's collected comics since he was nine years old, is proud of owning the first edition of Gotham by Gaslight, and still remembers the afternoons spent watching the TV series with Adam West at home when he was a kid. Obviously, he has seen all the movies. The Dark Knight was a masterpiece; the I believe in Harvey Dent web campaign and the Joker counter site were pure genius, as were all the other sites created for that movie. The passion John has for Batman is such that he could not resist, and ended up buying some action figures, Batman Arkham City, and the Batman Lego video games, too. But John is especially proud of the two short stories he wrote and published in Fan Fiction. Seriously, John loves the universe of the Batman stories. This universe is the consequence of the most complex and exciting expression of our culture nowadays: Transmedia Storytelling. What is it Transmedia Storytelling? Henry Jenkins presented the idea of Transmedia Storytelling for the first time in 2003 in the MIT Technology Review magazine. The idea can be defined as a story that unfolds across multiple media outlets and platforms, and in which a portion of the end users take an active role in the process of expansion. Transmedia Storytelling tends to be mistaken for Cross Media, which can be defined as one story - rather than different ones pertaining to the same narrative universe - narrated through different media channels. Although, nowadays the two terms are used almost as if they were synonyms. In the same semantic galaxy, we can find concepts like: Multiple platforms (or multi-device) Intertextual commodity Transmedial narrative Transmedial worlds The characteristics of Transmedia Storytelling Spreadability vs. drillability Spreadability refers to the expansion of a narrative through viral practices in social networks and the Web. Drillability is the task of penetration into the audience the producer develops to find the core of the fan base of his work; those ones who will disseminate and expand the transmedia productions. Continuity vs. multiplicity Transmedia worlds must have a continuity across the different languages and platforms that are used. For example, we expect Indiana Jones to behave in the same way as in a movie as in a video game. This continuity is complemented by multiplicity, which is the creation of seemingly incoherent narrative experiences related to the original narrative world. The Gotham by Gaslight comic cited before is a good example of multiplicity. Immersion vs. extractability Transmedia stories almost always offer to their consumer the opportunity to immerse themselves in their worlds (an example are the games inspired by a series or film or novel). On the other hand, the gadgets allow us to extract elements of the story and bring them to our everyday life. A special type of extractability is the reverse product-placement (for instance, the Duff beer of The Simpsons). World building As any other form of storytelling, Transmedia Storytelling presents a narrative world, which requires the suspension of disbelief by the user. This suspension is more effective the more detailed the narrative world is. Details like Sherlock Holmes playing a Stradivarius or snorting a line of cocaine are those giving verisimilitude to the narrative world. Inception, somehow, described well how the Transmedia professionals see themselves as World Building Architects. Seriality Transmedia storytelling is dispersive, and by its nature tends to be serial. The seriality is not linear, but becomes an hypertextual network. Subjectivity In Transmedia, the presence of multiple subjectivities is common. Therefore, Transmedia tends to enhance the polyphony caused by the large number of characters and stories. A classic example was Lost. Performance The actions of the consumers are essential as the fans are evangelists. Some of them - like our John - give the next step and become prosumers (producer + consumer), and do not hesitate in creating new texts and add them to further expand the boundaries of the original narrative world. Just think what would be Star Trek without the Trekkers. Transmedia, which was at first a pop culture new form of storytelling spontaneously originated in the entertainment industry, is now spread and common in fields like journalisms and, for some years now. It's a form of branding. This sophisticated form of marketing, which we'll call \"Inbound Square,\" has a rather complex creation process, such that I decided to present it in a more \"digestible\" Slideshare. Transmedia Storytelling from Gianluca Fiorelli The Transmedia prototype: Star Wars The Transmedia expansion of Star Wars began immediately after its premiere on May 25, 1977. In July of the same year, Marvel published the first Star Wars comic, and even though the first six numbers reflected what was seen in the movies, new situations started being presented from the seventh number onwards. In 1978, the first novel, Splinter of the Mind's Eye - a spin-off based on an early version of the script - was published. But it wasn't until 1987, with the commercialization of the Star Wars roleplaying game, that George Lucas created what is known as the Star Wars Expanded Universe. It covers about 4,000 thousand years of history of that \"galaxy far far away\" and is not public (the Encyclopedia section of the official Star Wars site is not the same). From that moment, the flood of products began: video games (from X-Wing to the Old Republic MMORPG), the Director's Cut of the first trilogy, the new trilogy, cartoons series, new comics, new novels, and even radio versions. Star Wars is also paradigmatic of the relationship between the producer (George Lucas) and the fans, who (from one side) have taken possession of the Star Wars universe from the beginning, while (from the other side) George Lucas tried for a long time to keep under strict control the expansion of the universe of the Star Wars narrative with actions such as The Official Star Wars Fan Film Awards (here you can see some of those fans creations). It is humanly impossible to monitor and classify all the variants that fans have created within the narrative universe of Star Wars, such as the stories published on Fanfiction.com, sites like Death Star PR, Twitter bots like Yoda, photos using the action figures, and all kinds of videos published on YouTube. The fans have created content ranging from the staid tribute to parody itself, like this hilarious Lego video based on the Eddie Izzard gag of the Death Star canteen: Transmedia Storytelling gives gigantic opportunities, which is why it can help explain the acquisition of Lucas Films by Disney and that J.J. Abrams, creator of now classic Transmedia example as Lost and Fringe (and director of the revamped Star Trek movies series) was chosen as the director of the next trilogy. Transmedia and Hollywood The relationship between the producer and the fans is critical to the success of any Transmedia Storytelling strategy, and Hollywood has understood its implications the best so far. A good, recent example is The Hunger Games movie trilogy. I strongly suggest you to recover the post that Bryden McGrath wrote for Portent: 44 Ways 'The Hunger Games' Social Media Campaign Increased the Movie's Odds of Success. What Bryden defines as a \"social media campaign\" really is the \"spreadability\" social side of the transmedia campaign that Ignition created for Lions Gate, the film's producer: The Hunger Games Case Study from Ignition on Vimeo. This campaign has just been relaunched last week, with the presentation of the first trailer of The Hunger Games: Catching Fire. This time, a new site was created in partnership with Microsoft Internet Explorer, The Hunger Games Explorer, which works as a hub for all the sites and social media profiles used in this transmedia experience (check the Capitol.pn official site..., or its Google+ page). Another great - and maybe more complete - example of Transmedia Storytelling is that Ridley Scott and (again) Ignition created for Prometheus last year. This video below explains (better than I can) why it was created, how it was structured, what channels were used, and the results it obtained: Prometheus Transmedia Campaign from Ignition on Vimeo. I'm sure that many of you remember having seen some of the things Campfire created for the transmedia campaign preview of the first season of Games of Thrones on HBO. Game of Thrones Case Study from Campfire on Vimeo. Here's the big question: can only big major movies or tv series do transmedia? Absolutely not. An example is the Veronica Mars Movie Project, which two weeks ago closed its crowdfunding campaign on Kickstarter, all based on fans and social media, after managing to accumulate $5,702,153. Transmedia journalism Journalism - real journalism - is storytelling. There is no discussion about that, as it was well explained in Telling True Stories: A Nonfiction Writer’s Guide published by the Nieman Foundation. Transmedia storytelling is the next logical step that journalism has already done (not always perfectly). Remember that: In transmedia, a story is narrated among different media channels and platforms. Prosumers actively participate in the construction of the narrative world. Here's a more recent example about a world event that shook many people in many countries. Do you remember how the world discovered that Osama Bin Laden was dead? Here's how it went down: \"Helicopter hovering above Abbottabad at 1AM (is a rare event).\" — Sohaib Athar (@ReallyVirtual) 01 maggio 2011 Not long after, when the entire Internet was discussing the news, Keith Urbhan launched this tweet: \"So I'm told by a reputable person they have killed Osama Bin Laden. Hot damn.\" — Keith Urbahn (@keithurbahn) 02 maggio 2011 Check out the post Gilad Lotan wrote on Social Flow to understand the social earthquake that tweet caused. President Obama announced the news of the Osama Bin Laden death an hour later, and after his announcement, it became known that many people in many countries already knew through social media. From that moment, the journalistic storytelling (as well as continuing in social networks) expanded in the news portals, televisions, radios, and, of course, the printed paper. This event relied on transmedia, was \"organic,\" and was unplanned (obviously), but nontheless, it was transmedia. Transmedia journalism, which is well explained by Kevin Moloney in is thesis Porting Transmedia Storytelling to Journalism (2011), substantially means that the news must generate a space, which allows the active participation of the readers/viewers. It is not surprising, nowadays, seeing how much this interaction between the journalists and the readers is central in the news industry. Transmedia journalism can take many different forms, but all must see the reader - meant as a free citizen - as a contributor in the creation and storytelling of news: Great examples of Transmedia journalism can be find in sites like 18 day in Egypt or Storify. Transmedia branding Do you remember the concept of Liquid Content promoted by Coca Cola? Well, that is nothing but the Coca Cola definition of Transmedia Storytelling. Brands have found a naturally ally for their marketing efforts in transmedia (and crossmedia) for years. Think to the Art of Heist ARG created for the launch of Audi 3 in the USA, to the first Old Spice campaign or, more recently, to the Daybreak transmedia campaign created for AT&T, which shows five online movies, two websites (you can discover the second almost in the footer of the fist), and an app. Another example is Dove's extremely recent Real Beauty Sketches campaign created by Ogilvy Brasil, which cannot be defined really as transmedia, but that showcases the transmedia spirit: narrating a story, which represents the brand's world (\"Real Beauty\") to its fans (women just as they are) by using channels likes online video, a microsite, and social networks (Facebook, especially). The purpose was to create a public, yet intimate dialogue with the fans, and the campaign surely obtained that objective. It did so well that it already has originated a parody: You can read here more about the story behind the Dove's campaign. I can imagine the doubts you may have in your mind: a narrative world is easier when you have a movie, a series, a book, or news, but what about my website? What about my bolts and rolled aluminum factory? I understand your hesitations, but the answer is that you are probably searching in the wrong place. All brands have a story, and the basis of their stories are in their mission pages, that you usually forget exists. Let's take two example: REI and our own SEOmoz. REI has created all its business, and marketing, around few very clear values: (Image taken from How to Build SEO into Content Strategy, by Jonathon Colman) Those values, the REI's \" Why,\" define the narrative world of REI, which is shared by more than five million members of the Company (REI is a cooperative). We have a narrative world through of outdoor adventure, environmentalism, and stewardship, along with a gigantic base of brand evangelists who not only share what REI does (and sells), but create their own narratives inside the REI's world. That is the base from where Transmedia Storytelling can be built, and REI seems to be moving towards it with ideas like the REI 1440 Project, the REI Members Stories YouTube videos. They also have a presence in Facebook, Twitter, Pinterest, Instagram, and all their IRL events (i.e.: Learn at REI and Travel with REI). What about SEOmoz? Moz could do transmedia, and actually (without maybe knowing it) it does it, because - as I told before - transmedia is the \"Inbound Square.\" Moz has built its story around the 6 TAGFEE Tenets; has built a community of entusiastic people (yes, you!) around its tools and Internet marketing philosophy; and a narrative world, which evolves thanks to the fans, both internally (YouMoz, QA) and externally (check the Mozscape API's Gallery). The world of fans that SEOmoz nurtures with gamification (one of the experience principle of transmedia) and live events like MozCon, meet-ups, and MozCation is the most transmedia campaign SEOmoz has created so far. And, finally and importantly, Moz has Roger. Conclusion People have always needed stories to communicate and feel connected, and good stories always become part of our history and our culture. The most recognized brands have one thing in common: they all tell a story. But something is changing. Never before have people had so many devices and screens from which to follow a story, and now the consumers seek new experiences and a deeper engagement. The stories are formed and followed differently than before. In order to be relevant for a hyper-connected generation and be present in its life, we need: Liquid and customizable content to distribute by any means available. Different levels of depth in the story made for different levels of depth of user involvement. A consistent message, where each piece feeds the story and the conversation with the audience continuously. What we need is Transmedia Storytelling, a process where the elements of a story are dispensed each other through multiple distribution channels with the purpose of creating a unified entertainment experience, where each medium really makes its own contribution to the development of the story. Transmedia Storytelling is a very powerful and immersive persuasion tool, a fans-generating machine, because it creates a strong emotional connection with the audience. It is profitable because it redefines and increases ROI, increases impact over media, and can cause exceptional sources of income. Transmedia Storytelling, finally, is the best and most effective way to connect (especially) with the new generations of consumers and build a sustainable audience around a brand, as Red Bull demonstrated. So... are you ready to tell your story? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Transmedia Storytelling: Building Worlds For and With Fans"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Transmedia Storytelling: Building Worlds For and With Fans"
    },
    {
      "level": "H2",
      "text": "What is it Transmedia Storytelling?"
    },
    {
      "level": "H3",
      "text": "The characteristics of Transmedia Storytelling"
    },
    {
      "level": "H3",
      "text": "The Transmedia prototype: Star Wars"
    },
    {
      "level": "H3",
      "text": "Transmedia and Hollywood"
    },
    {
      "level": "H3",
      "text": "Transmedia journalism"
    },
    {
      "level": "H3",
      "text": "Transmedia branding"
    },
    {
      "level": "H3",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gianluca Fiorelli\n          \n            Gianluca Fiorelli\n          \n            Gianluca Fiorelli"
}