{
  "url": "https://moz.com/blog/travel-seo-trends",
  "slug": "travel-seo-trends",
  "title": "Travel SEO Trends and Pivots from 2020 (and What to Carry into 2021) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It’s hard to remember a time of greater collective cabin fever. Though with border closings, pre-travel testing, and business closures remaining a moving target, we can still expect that a majority of travel will happen closer to home in early 2021.",
  "content": "Travel SEO Trends and Pivots from 2020 (and What to Carry into 2021) Marketing Industry | SEO Analytics By: Rachel Vandernick January 14, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rachel Vandernick January 14, 2021 Travel SEO Trends and Pivots from 2020 (and What to Carry into 2021) Marketing Industry | SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If 2020 taught us anything, it’s that you can’t predict the future of tourism. Unlike nearly any other industry, tourism is simultaneously dictated by a number of factors including consumer proclivity, weather and climate, global economics, and government. Travel was undoubtedly one of the hardest hit sectors in the 2020 shutdowns, which affected every business domain from the largest destination marketing organizations (DMOs) to local small businesses that thrive on the foot traffic tourism normally brings. US Travel’s year-end assessment determined there was a 48% drop in travel-related spending for December 2020 compared to 2019, and a year-long loss of $500 billion. Success in tourism in 2020 meant simply surviving for many businesses, accompanied by total content strategy revamps, product pivots, local SEO investments, and local marketing activations. What worked in 2020 Locals-only tourism With out-of-state quarantines in effect for most of the US, and especially prevalent in the northeast, once global destinations and metros became intensely local. Succeeding locally meant celebrating local culture and playing to the hometown advantage, and creating and activating hyper-local content and SEO to sell reimagined experiences and drive renewed interest at home. Visit Philadelphia, the DMO for the greater Philadelphia region, revamped its 2020 marketing efforts to rollout “Our Turn To Tourist” through winter 2021, a “regional marketing initiative [that] encourages people to take staycations and close-to-home drive trips.” Visit Philadelphia’s main objective is to attract tourists from all over the country to the city of Philadelphia. With millions of out-of-state visitors each year, and huge growth each year proceeding 2020, Visit Philadelphia had the early foresight to create content geared towards both locals and visitors, and adopted a local-first SEO strategy for things to do, see, and eat nearby. The organization went so far as to create local-centric mini itineraries based off of current restrictions, optimizing for local tourism and attraction-related keywords, and widely distributing new COVID-19 content. This campaign supported not only the hotels and attractions in the city, but also the local restaurants and small businesses. While not totally divergent in its approach, the long-term investment that Visit Philadelphia has made into winning at local search, snagging SERP features, and embracing new features like Discover, helps ensure it will continue to be a successful advocate for Philadelphia as “the greatest city in the USA to spend the weekend”. Reinvented experiences Tourism and experience-based companies hadn’t extensively ventured into the virtual space prior to 2020 — after all, why plan to watch the action from home when you could board a plane and take part live and in-person? Philadelphia-based Beyond the Bell Tours, the only LGBTQ+-owned-and-run tour operator in the city, faced a critical decision in May 2020: Their hallmark Pride-themed “Drag Me Along” drag queen trolly bar crawl was unable to launch with bars closed indefinitely and social gatherings restricted. As searches continued to increase for virtual events, virtual gatherings, and virtual things to do, businesses that rose to meet the demand found success. For Beyond the Bell, that meant turning the “Drag Me Along” concept into “Pride In A Box”: a series of five different themed Pride boxes that included products and experiential components for use at home. Though their website was originally built on a tour-booking engine, to execute a pivoted product strategy, they restructured it to allow an e-commerce integrated function, and optimized to sell products and experiences for Pride. Founder Rebecca Fisher said, “We thought about how a box could embody a community. We highlighted queer people, businesses, and queer products, and held weekly events for Pride, all proceeds of which were donated to racial justice. A single ‘box’ purchased during Pride supported many queer businesses, and we wanted people to feel that impact.” Ultimately, businesses that adapted quickly to changes in consumer search behavior, and that conducted and implemented keyword research for new content targeting previously unranked/low-volume terms, were better positioned to maintain consumer support and visibility even though actual travelers continued to drop. Up-to-date info on expanding and changing regulations Domestic travel is rarely regulated in the US, so when cities across the country responded to shut down orders, hot spots beloved by locals and tourists alike emptied out and revenue began to drastically fall. As an SEO community (especially local!) we’re always advocates of the value of keeping local listings in Google My Business up-to-date, and it never mattered more than in 2020. Coming out on top were those who updated hours, COVID-19 policies and procedures, and published delivery or third-party partnerships. Unsurprisingly, AirBnB’s and VRBO’s new Covid content “enhanced cleaning protocol” and “guidelines for owners” come out top in searches for short term rental cleaning best practices, and cleanliness related to travel accomodations. Updated local listings allowed exasperated consumers to easily see what businesses were open, and allowed search-savvy businesses to leverage their GMB to position themselves as safety-conscious, accessible, and prioritize addressing consumer concerns (not to mention the features released to help businesses access these tools). What to expect from tourism in 2021 It’s hard to remember a time of greater collective cabin fever. Though with border closings, pre-travel testing, and business closures remaining a moving target, we can still expect that a majority of travel will happen closer to home in early 2021. Here’s where we can expect to see growth first. Short term stays: road trips, workspace respites, and snow birds What's ahead for short-term travels? Continued RV sales, for one, which were up 4.5% annually in 2020. These growth indicators, as well as public perceptions of travel safety, continue to slate hometown and close-by exploration as the early 2021 winners. Outdoor and spaced-out activities show continued interest in search volume and sales. Yellowstone National Park alone saw a 21% increase in year-over-year visitation in September 2020. Don’t expect this to slow down any time soon. Another trend we expect to see continue in early 2021? Snow birding. Once reserved for the retired, heading south for the winter is especially popular this year for northerners leaving lockdowns at home. Expect extended stays, fuller flights, and busier beaches than normal. One final place you can expect to see travelers? In a nearby hotel. Formerly reserved for the luxurious staycations, local hotels have become workplace respites for those fully remote workers who lack adequate home office space. Though not “technically” travel, many hotels (Hyatt, Marriott, and Hilton, for starters) are offering single-day, day-time only, “work from hotel” deals to help relieve lost revenue and fried nerves of managing co-occurring zoom calls at the kitchen table. Extended visits: remote relocations With many children and families, not to mention formerly remote employees, feeling the squeeze of their walls at home, many hotels and villa properties are offering cost-effective extended stays (three weeks or more). Mid-term relocations are becoming incredibly common, with particular flight happening from metro centers in New York City, Philadelphia, and Washington D.C. Individual countries are actively trying to scoop up consumer demand for change of scenery and pace, with countries like Dubai, Jamaica, and the Cayman Islands offering temporary extended work visas to US citizens as a way to revive local tourism. Short term rental properties such as beach house bookings, waterfront properties, mountain cabins, and southern getaways — or you know, just a yard if you’re a city-dweller — are booking in greater numbers in 2020 than nearly any time in 2019. AirDNA notes, “Among those leading the rebound are beaches, mountain towns, lakeside getaways, and really anything within driving distance of a major urban hub.” Longer-term remote stays, whether for yourself or your family, are increasingly popular, as are remote work options which, according to Google trend data, have increased by two-times the previous levels pre-pandemic. Searches for extended stay vacations peaked at the end of December 2020, with previous highs in October and April 2020. Moving into 2021, we’ll likely see expanded tourism offerings to match this consumer demand, and also to accommodate pre-quarantine requirements, which vary city to city. In conclusion Travel isn’t what it used to be, and for the time being, we’re seeing increasingly important local search activations and feature adoption. And as remote work and location agnostic work becomes more the norm, the lessons we learned from pandemic travel search will help businesses thrive in this new tourism climate moving forward. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Travel SEO Trends and Pivots from 2020 (and What to Carry into 2021)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Travel SEO Trends and Pivots from 2020 (and What to Carry into 2021)"
    },
    {
      "level": "H2",
      "text": "What worked in 2020"
    },
    {
      "level": "H3",
      "text": "Locals-only tourism"
    },
    {
      "level": "H3",
      "text": "Reinvented experiences"
    },
    {
      "level": "H3",
      "text": "Up-to-date info on expanding and changing regulations"
    },
    {
      "level": "H2",
      "text": "What to expect from tourism in 2021"
    },
    {
      "level": "H3",
      "text": "Short term stays: road trips, workspace respites, and snow birds"
    },
    {
      "level": "H3",
      "text": "Extended visits: remote relocations"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rachel Vandernick\n          \n            Rachel Vandernick\n          \n            Rachel Vandernick"
}