{
  "url": "https://moz.com/blog/treat-your-channels-like-a-soccer-team",
  "slug": "treat-your-channels-like-a-soccer-team",
  "title": "Treat Your Channels like a Soccer Team - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Different marketing channels play different roles, and just as you wouldn't build a soccer team with only goal-scoring strikers, you shouldn't build a suite of marketing channels that focus solely on conversions.",
  "content": "Treat Your Channels like a Soccer Team SEO Analytics C By: Craig Bradford December 2, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! C By: Craig Bradford December 2, 2013 Treat Your Channels like a Soccer Team SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you're like a lot of people (myself included) it's very easy to go into an analytics package and focus only on conversion rate. We look at reports like the one below and make short-sighted decisions: Looking at only the information above, we might decide that \"Organic Search\" is a bad channel. Making decisions on how successful a channel is based only on conversion rate is short-sighted and will cost you money. Instead, I urge you to think of your channels like a soccer team. A sensible soccer formation looks something like the image below: You have one goalkeeper, defenders, midfielders and attackers. You would never think of creating a team of only 11 strikers. But that's exactly what we do with our channels all the time. We create a team that looks like this: We have a team of channels that are all being graded on their ability to \"score goals\"—please don't make this mistake. I'm okay with the fact that some of my channels have a low \"e-commerce\" conversion rate; that may not be what they're designed to do. Channels aren't binary The one thing that I want you to take from this blog post is that channels are not binary. It isn't that they either drive sales or do nothing; there's lot's of value in between if you know what to look for. In a report \"The Customer Journey to Online Purchase\" Google showed this to be the case by looking at the relationship that each channel is likely to play in the customer journey. The idea is to show on a very simple scale whether a channel plays an \"awareness role\" or more of a \"decision making\" role.This is an interactive piece so please have a look and play around in it. You can segment by industry or by country. Let's take the US market as an example: US – All Industries It shows that in general, Display and Social are more of awareness channels, while Organic search and Paid search tend to be last interaction/decision making channels. I'm not surprised by that, but if that's true—if social is best used as a tool for driving awareness of my brand—why would I ever use e-commerce conversion rate as a metric of success? The answer, of course, is that I shouldn't. Better metrics would perhaps be things like: How many new visitors did social bring this month? Brand awareness - how many people have heard of my business? How many people interacted with my brand in some way? These are just a couple of examples, but if you want more specifics I recommend you read this post by Hannah Smith on the Distilled Blog: Calculating ROI from Social Media - Problems, Pitfalls & Breaking all the things… If you dig a little further, it gets more interesting. Let's look at the health industry in particular: US – Health Social is still an awareness channel, but look at display. It's now playing more of a decision-making role. Email has also moved from an awareness role to a decision-making role. So what does this mean? The data above shows that different channels play different roles depending on country and industry, so don't assume anything. Don't assume that social will be an awareness channel, don't assume that email will be a decision making channel, and whatever you do, don't assume that all channels are designed to only drive sales. Next time you're accessing your channels, try two things: 1. Assign attributes to channels As mentioned above, not all channels have the same strengths, but that's okay as long as they are pulling their weight somewhere else. To see if that's the case, try assigning them some attributes other than sales. Avinash Kaushik gave an excellent presentation at MozCon 2013 (if you weren't there, the video can be purchased from Moz), in which he said that channels should solve for performance and relationships. This is shown in the table below (the example is for ModCloth): As you can see, if we were to only solve for the line with red text (\"Orders\") we would ignore all of the other good that some channels are doing. Social, in this example, is terrible at everything except \"Be the Buyer.\" I encourage you to do the same for your channels; add in all the metrics that are important for relationship-building, not just sales, and take a step back to see what else your channels might be contributing to that isn't immediately obvious when you simply look at sales. Create SMART goals Just about anyone who's ever read about goal-setting will have seen the theory of creating SMART goals: I think most people are good at thinking about goals that are specific, attainable, and realistic. We think we're good at measurable, and we seem to often forget about time-bound. Since the rest could easily be a post on their own, I'll just focus on time-bound here. When we look at tables like the one below, If we are going to make bad decisions like declaring channels \"good\" or \"bad\" from just one metric, at least remember to consider time. If we say organic search is a bad channel, what you actually mean is organic is a bad channel at driving sales in the last X days. That's an important difference, because it has an impact on where the channel is placed on the scale of \"awareness\" to \"decision-making.\" In summary Build a team of channels, not just strikers. Don't assume channels work in the same way across all markets. Assign attributes to channels (performance- and relationship-based). Remember to create time-bound goals. Let me know what you think in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Treat Your Channels like a Soccer Team"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Treat Your Channels like a Soccer Team"
    },
    {
      "level": "H2",
      "text": "Channels aren't binary"
    },
    {
      "level": "H3",
      "text": "US – All Industries"
    },
    {
      "level": "H3",
      "text": "US – Health"
    },
    {
      "level": "H2",
      "text": "So what does this mean?"
    },
    {
      "level": "H3",
      "text": "1. Assign attributes to channels"
    },
    {
      "level": "H2",
      "text": "Create SMART goals"
    },
    {
      "level": "H2",
      "text": "In summary"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Craig Bradford\n          \n            Craig Bradford\n          \n            Craig Bradford"
}