{
  "url": "https://moz.com/blog/trendspotting-with-popular-search-sources-a-new-tool-from-seomoz-to-help",
  "slug": "trendspotting-with-popular-search-sources-a-new-tool-from-seomoz-to-help",
  "title": "Trendspotting with Popular Search Sources & a New Tool from SEOmoz to Help - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There are several great sources on the web of \"popular searches\" that help to illustrate the rising trends and consistently buzz-worthy terms and phrases online. These include:\n\n    Technorati - popular tags & popular searches all on one page\n    Flickr - popular tags\n    Del.icio.us - popular…",
  "content": "Trendspotting with Popular Search Sources & a New Tool from SEOmoz to Help Content Marketing By: Rand Fishkin August 5, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 5, 2007 Trendspotting with Popular Search Sources & a New Tool from SEOmoz to Help Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There are several great sources on the web of \"popular searches\" that help to illustrate the rising trends and consistently buzz-worthy terms and phrases online. These include: Technorati - popular tags & popular searches all on one page Flickr - popular tags Del.icio.us - popular tags Yahoo! Buzz - shows top search terms and rising trends (though it's certainly somewhat filtered) Google Hot Trends - shows a smattering of current trends in search (though this data appears more filtered and less representative than Yahoo's) eBay Pulse - top searches and stores at eBay AOL Hot Searches - as with Yahoo!, both rising stars and bright-burning constants appear on the lists Lycos Top 50 - as above Ask.com IQ - as above, but organized by vertical and category (which is very cool) Amazon Popular Tags - the tags with the most usage today Amazon Bestsellers - the bestselling products organized by category Amazon Movers & Shakers - products that are on the rapid upswing By themselves, these pages can be a fantastic resource for a search marketer trying to find trendy content or high popularity search phrases to target. However, if there were a resource that aggregated all of these sources into one location and enabled one to see the popular searches from the past, maybe even make it available in a CSV format, that would be truly handy, right? Ask and ye shall receive: Our latest, completely free tool highlights popular searches from all of these sources, making your brainstorming tasks even easier. There's obviously a lot of uses for this data, so we've also made it available via CSV and given you the ability to go back in time (though right now it only goes back a couple weeks). Please test it, play with it and let us know what you think! BTW - I'm in Ashland, OR with Mystery Guest this week, looking at potential wedding locations for next summer, so email & blogging will both be quiet slow. However, Rebecca Kelley returns from a long trip this week, so look forward to more of her presence (along with the rest of the mozzers) while I'm away. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Trendspotting with Popular Search Sources & a New Tool from SEOmoz to Help"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Trendspotting with Popular Search Sources & a New Tool from SEOmoz to Help"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}