{
  "url": "https://moz.com/blog/tribute-to-eric-ward",
  "slug": "tribute-to-eric-ward",
  "title": "Link Strategies that Stand the Test of Time: A Tribute to Eric Ward (Link Moses) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In honor of the late SEO pioneer and our friend, Eric Ward, this episode of Whiteboard Friday covers the kinds of link strategies he worked so hard to teach.",
  "content": "Link Strategies that Stand the Test of Time: A Tribute to Eric Ward (Link Moses) Whiteboard Friday | Link Building By: Rand Fishkin November 3, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 3, 2017 Link Strategies that Stand the Test of Time: A Tribute to Eric Ward (Link Moses) Whiteboard Friday | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week, we pay a special tribute to the late SEO pioneer Eric Ward. His link strategies formed the foundation of many of today's smartest approaches to links, and in this Whiteboard Friday, Rand covers several that are as relevant today as they were when Eric first started talking about them. Click on the whiteboard image above to open a high resolution version in a new tab! &amp;amp;lt;span id=\"selection-marker-1\" class=\"redactor-selection-marker\"&amp;amp;gt;&amp;amp;lt;/span&amp;amp;gt;Video TranscriptionHowdy, Moz fans, and welcome to a special edition of Whiteboard Friday. This week we are paying an honorary tribute to our friend, lost but not forgotten, Eric Ward. Eric was one of the pioneers of the SEO industry. In fact, he was a link strategist and a creator of links for websites before search engines even valued links on the internet. He was the very first link marketer that Amazon.com hired. He had a testimonial from Jeff Bezos on his website, from Google's Matt Cutts from many years ago, and worked with hundreds, if not thousands, of organizations to improve their link strategies. Beyond that, Eric was a remarkable contributor to the field of SEO through conferences and events, through webinars, through his blog and his Twitter account, and through countless conversations with SEOs like me. In fact, Eric was one of the first people who helped me to understand how link strategy worked, and I have many, many fond memories of him. I'd also like to say that Eric and I had a number of phone calls and emails over the years about mental and emotional health. I know that's something that both of us have struggled with. I know that it's something that many of us in the entrepreneurial and technology worlds struggle with, and it's an issue that deserves more openness and more attention. I hope that we can do that and that I can do that here at Moz. But, of course, this is Whiteboard Friday, and since we're honoring Eric, what I want to help today with is talking about some of his link strategies that stand the test of time. These are high level concepts, which we often dig into the very weeds and the details here on Whiteboard Friday, but I think it pays to pull back a little and think about links from a big-picture perspective. For those of you who are active link builders and link strategists, much of this might be familiar. But I bet for your clients, for your teams, for your bosses, for the people that you work with, this sort of strategic level thinking sometimes goes ignored, and it means that you don't always get the credit that you should. So let's take some of the lessons. These are just a tiny handful of the plethora of value that Eric has provided over the decades that he had been in our field. 1. People and organizations link because:First off, Eric liked to talk about why people and organizations link, and I think there's actually some excellent tactical and strategic thinking in here. A. Content is deserving of their recognition First off, he talked about how the content that they would link to is actually deserving of their recognition, which I think makes intuitive sense, but is something that is often not considered in a link building list. When we create our lists, we sometimes ignore that. B. They have a non-financial incentive to link Which makes sense. If you're trying to get someone to link, they need to have a reason, an emotional reason, a business-driven reason, a partnership-driven reason. If it's financial, of course, the search engines will penalize it or eventually penalize it. C. The right person made them aware that the citation should exist This was the form of work that Eric concentrated on particularly early in his career, when he was a very tactical link strategist, and I think it makes great sense, but is so often ignored, that we don't find the right people in our organizations to make that connection, that we don't actually make the organizations that should link to us aware of why a link should happen and where it should exist, and that this work, while very manual, is also very powerful. It can drive direct traffic, and of course it drive rankings in search engines. D.The content actually matters to their audience That whoever you're reaching out to, this reason, this incentive needs to connect with their audience. Otherwise, Google is unlikely to count that link, and visitors are unlikely to click on that link. I actually think personally that the two might be related, that there's some form of browser level data, user and usage level data that Google is using here. E. That content is new (or recently updated) I found this fascinating that Eric pointed out that it is vastly easier, vastly easier to get content to earn links from its audience, from a target if it is new or recently updated. It's much more challenging to do that with older content, which is one of the reasons why a lot of the strategies or a lot of the tactical elements that he proposed, when working with his clients, centered around: How are we going update, redo, or make something new that is going to cause all of these things to be true?I think if you can check off these five, you have got a great set to be able to go out and pitch people on why those links should exist. A quote from Eric: \"Identify and contact venues that would be inclined to care about the new content enough to write about it and/or to link to it.\" I think that really is PR. That's public relations, just in a digital marketing capacity and really a huge part of what successful outreach looks like. 2. Great execution is a result of strategy and planningNext up, great execution is a result of strategy and planning. I know. Who knew? What's true in every other part of the business world and every other part of the world of things that get accomplished is also true in link building? Yes, it is. A. Strategy flows from understanding your topic and online space Eric liked to say that strategy flows from a deep understanding of the topic and the space, which is why a lot of these services that you might find online, that are very inexpensive or very scalable, don't work very well in links, because they don't have that deep topic and deep space understanding. When you have a deep understanding of the topic and the space, you can better target your link earning abilities. B. A blueprint of how to earn links from various types of targets dramatically increases the odds of success. So two interesting things in here. If you have a blueprint, that means you have a structure for how you're going to target and how you're going to outreach. If you consider various types of targets, and Eric mentions a number of these on his website. I'm planning to link to link to a bunch of resources in this Whiteboard Friday from Eric around this. If you choose those various types of targets, you will over time discover which ones are consistently high performing for you and have the best opportunity to earn you the links that will make a difference in your campaigns. Eric would say what we do, and he's using \"we\" here to refer to link strategists rather than just link builders, \"What we do is to help content find the audience it was intended for and the audience find the content.\" I love that. It has a beautiful simplicity to it, but also a deep strategy that unfortunately a lot of link building campaigns don't pay attention to. 3. Short-term thinking leads to devaluation, penalties, and poor resultsEric was extremely passionate, if you ever spent time with him or listened to one of his webinars or interviews, he was very passionate about this idea that... A. Links that would exist, even if Google and Bing did not, are almost always the ones that provide the most value. That's both in traffic and in rankings. Eric had this wonderful nomenclature. He was known as Link Moses, and Link Moses had these commandments about link building. He said, \"The link schemer may eat today, but the link earner eateth from a bountiful table for a lifetime.\" I think that's a beautiful sentiment. Folks, if Eric has provided you with value, and I can assure you that if you are in the link world, almost all of us, who have anything worthwhile to share, have earned our ideas from people who have learned from Eric or from Eric himself. His family is grieving, and it would be wonderful if we could help show them support. Geraldine and I, my wife and I have done so, and I'd encourage you to do so as well. Danny Sullivan, who's now with Google, but of course who was behind Search Engine Watch and Search Engine Strategies and then Third Door Media, has set up a donation page that will go directly to his family at bit.ly/ericward2017. I think it would be wonderful if the Moz community and all of us who have benefitted so much from Eric's help over the years paid him that respect.Thanks very much. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Strategies that Stand the Test of Time: A Tribute to Eric Ward (Link Moses)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Link Strategies that Stand the Test of Time: A Tribute to Eric Ward (Link Moses)"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1. People and organizations link because:"
    },
    {
      "level": "H2",
      "text": "2. Great execution is a result of strategy and planning"
    },
    {
      "level": "H2",
      "text": "3. Short-term thinking leads to devaluation, penalties, and poor results"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}