{
  "url": "https://moz.com/blog/trouble-at-seomozwar-imminent",
  "slug": "trouble-at-seomozwar-imminent",
  "title": "Trouble at SEOmoz...War Imminent! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There’s a war brewing. The ranks aren’t split, they are shattered. Its every SEOmozer for himself. 1 2 3 4 Let's have a thumbwar!Yep that’s right. Rumour has it (and yes its only a couple of us spreading the rumour) that the thumbs league in SEOmoz is about to see a flurry of...",
  "content": "Trouble at SEOmoz...War Imminent! Public Relations By: Rishi Lakhani December 16, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Rishi Lakhani December 16, 2007 Trouble at SEOmoz...War Imminent! Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There’s a war brewing. The ranks aren’t split, they are shattered. It's every SEOmozer for himself. 1 2 3 4 Let's have a thumbwar! Yep that’s right. Rumour has it (and yes, it's only a couple of us spreading the rumour) that the thumbs league in SEOmoz is about to see a flurry of change. There are challenges abound, with canvassing for thumbs and support. The battle cry sounded in the forum, with intelligence reports pouring in. Yes, this is a comic relief post. But equally it brings to light the fact that we have over time started taking our online profiles and popularity more seriously. The term “Currency of Kudos” isn’t a marketing term any more, but a reality. See, for example, Yahoo Answers – some people sit for hours trawling the questions so that they can answer them and gain points. See Sphinn, Digg, etc (I don’t want to teach you to suck eggs, but hey!) So, what are the rules and regulations of voting off and against in these networks? I don’t know – I follow my own morals and ethics. If what I read is genuinely interesting, I will vote it up – if reading it was a waste of time, down it goes – but I will always try and make sure I comment when I vote something down. It's only fair! I never vote for people because they are popular or are my friends--if the stuff's good, it's good. If it's rubbish, then sorry, no go! But, that’s just me. What’s your behaviour? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Trouble at SEOmoz...War Imminent!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Trouble at SEOmoz...War Imminent!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rishi Lakhani\n          \n            Rishi Lakhani\n          \n            Rishi Lakhani"
}