{
  "url": "https://moz.com/blog/truly-awesome-tactics-to-gain-traffic-from-twitter",
  "slug": "truly-awesome-tactics-to-gain-traffic-from-twitter",
  "title": "Truly Awesome Tactics to Gain Traffic from Twitter - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Here’s a crazy statistic. On average, Twitter sees 500 million tweets per day. Out of all of the interactions people have with these tweets, 92 percent of them involve clicking links. For some of us, getting in on that action feels as easy as chatting with a barista at the local coffee shop. For…",
  "content": "Truly Awesome Tactics to Gain Traffic from Twitter Social Media By: Nichole Elizabeth DeMeré March 29, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Nichole Elizabeth DeMeré March 29, 2016 Truly Awesome Tactics to Gain Traffic from Twitter Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Here’s a crazy statistic. On average, Twitter sees 500 million tweets per day. Out of all of the interactions people have with these tweets, 92% of them involve clicking links. For some of us, getting in on that action feels as easy as chatting with a barista at the local coffee shop. For others, getting website traffic from Twitter may as well be alchemy. That's okay, since it actually is possible to turn Tweets into gold. I promise. CaveatsIf your target audience is on Twitter — this is the primary caveat — Twitter marketing is the best way to increase targeted traffic to your website. The. Best. I don’t use those words lightly. There are two reasons: 1) Twitter attracts almost everybody, which makes finding a large audience for your niche (however small it is) easy; and 2) Twitter, along with helpful tools like Tribeboost, can help you find people in your audience. The secondary caveat is this: Twitter marketing only works if you use Twitter the right way. It’s amazing to me that people are still Tweeting about what they ate for lunch in 2016. Sometimes those posts are fun, too — don’t get me wrong — but you can do better. Reviewing the basicsFirst, let's review the basics of how Twitter works within the context of your overall content marketing strategy. Twitter, like all social media platforms, amplifies the high quality content you create for your site. I confess, the above image is overly simplistic. After all, your content isn’t limited to blog posts. Those are part of a larger strategy where blog posts support high-value offerings like ebooks and webinars. My point is this: It all starts with strong content. Here’s a secret: Not all of the content you post on Twitter has to be your own. In fact, it shouldn’t be. My personal strategy is to share the best of the best of everything I read and see around the web. Sometimes that’s my own content. Often, it’s someone else’s. But before we get into why this practice works, let’s discuss two fundamental tools that are going to make this all so much easier: Tribeboost and Buffer. Twitter marketing made easier I use Tribeboost (paid tool) and Buffer myself and recommend them to everyone, even though they can cost a little money. The benefits far outweigh the costs, even for startups and small businesses. Tribeboost uses keywords chosen by you to find your niche audience on Twitter using keywords, mentions, and hashtags. Then they narrow down that list based on user biography, location, and influence. Tribeboost automatically sets your account to follow the cream of the crop. Because these people are carefully selected, the follow-back rate is relatively high. Of course, you could spend hours using Twitter’s search feature to find these people yourself, but is that really how you want to spend your time? I love Twitter, but I’d rather use that time to find high-value content to share with my followers and chat about it with them. Buffer is a social media scheduling tool that lets you bank your curated content ahead of time, then automatically deploys it at peak times. Just don’t bank time-sensitive posts, though, or you could find yourself celebrating a beautiful, sunny day in the middle of a hurricane. Note: Buffer recently acquired Respondly, a social media customer service tool, sweetening the deal for businesses looking to delight their customers in real time. Having the right tools is surely helpful, but there is no guarantee that they will ultimately boost traffic from Twitter to your site. Implementing the following Twitter marketing tactics, however, will ensure your tweets drive more traffic to your site. Tactic #1: Be visualSo many businesses fail to take full advantage of posting images. When you want to generate traffic, settling for stock photography is a mistake. Everybody does it, which means you won’t be able to catch anyone’s attention. The right image is not only worth a thousand words, it’s well worth a thousand page views — but only if it’s fresh, informative, and intriguing. You’ll gain far more shares if you use your image to illustrate a how-to post or to tell a story. Try using Picmonkey or Piktochart to make an infographic, or Visage to create a thought-provoking graph. Tactic #2: Be authenticDon’t simply share and retweet the same content everyone else is sharing. You’ll never build traffic to your site that way, and you certainly won’t build a reputation for innovative thinking. Share content that is unique and that truly represents your values and interests. That way, you’ll connect with others who share your values and interests. They’ll become your biggest fans. Tactic #3: Be directYou want shares? You want links? You want people to read your latest post because it’s the best thing you’ve written this year? Then it’s okay to ask, just not all the time. You’ll be amazed at how many people are willing to show their appreciation of your work by sharing it (but only if you ask them to nicely). Tactic #4: Pique curiosityUse Twitter to build up to the release of your latest ebook or that amazing cornerstone piece of content. But don’t just Tweet teasers that something is coming. Use this as an exercise in benefits-driven copy. For instance, I love this benefits statement I saw for an upcoming ebook: “How would you like to be collected, amused, and tough, even when jerky people hurt your feelings?” I’d want to buy that ebook, wouldn’t you? Tactic #5: Go minimalisticLess is more, and on Twitter, fewer characters translate to more interactions. Tweets under 100 characters have a 21% higher interaction rate. Tactic #6: Use storytelling You might only have 140 characters and a kick-ass image, but you can do a lot that in terms of storytelling. Spend time making every character count. If you want to motivate people to leave Twitter to visit your blog, then you’ll have to lure them there with a compelling headline. Tactic #7: Tweet oftenI schedule upwards of 30-50 tweets per day using Buffer, and I make sure each post is interesting and innovative. That’s my style; it may not be yours. Maybe your style is to chat with people. Maybe it’s to post jokes and funny memes. Whatever it is, post often, and post only your best. Tactic #8: Share helpful, actionable contentThis is the kind of content that gets shared. Joanna Wiebe is the master of this, with regular Tweets like “We assessed 100s of webinar invitations — use this to write your email invites: bit.ly/1oku5aP .” Her Twitter feed reads like a copywriter’s swipe file. It’s that useful and actionable. Many businesses and entrepreneurs fear that they’ll “give it away for free” if they post their best material online, but this assumption couldn’t be further from the truth. Posting your hardest-won wisdom, your brightest ideas, and your very best tricks is how you win trust and build a reputation for your expertise. Posting fluff, on the other hand, is how you lose trust. Also, If you get enough shares on Twitter, your article will likely be featured in Buzzsumo, Nuzzel, and Pocket — leading to even more shares. Tactic #9: Make friends and share their contentI’ve made real friends on Twitter. I’ve met life-changing mentors on Twitter. I’ve even met quite a few clients on Twitter. That’s not accidental. I purposefully seek out people whose ideas I admire and then naturally share their content. When your admiration is sincere, chances are the people you admire will share your posts in return, introducing you to a whole new audience. Conclusion If there’s one overarching theme to using Twitter to effectively drive (targeted) traffic to your website, it’s this: Quality wins. And quantity, too; but mostly quality. Just like any form of marketing, the object of the game is to connect with the right people and give them what they want. Twitter makes the first half of the equation easy. But that second part? The part that makes it all work? That’s up to you. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Truly Awesome Tactics to Gain Traffic from Twitter"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Truly Awesome Tactics to Gain Traffic from Twitter"
    },
    {
      "level": "H2",
      "text": "Caveats"
    },
    {
      "level": "H2",
      "text": "Reviewing the basics"
    },
    {
      "level": "H2",
      "text": "Twitter marketing made easier"
    },
    {
      "level": "H2",
      "text": "Tactic #1: Be visual"
    },
    {
      "level": "H2",
      "text": "Tactic #2: Be authentic"
    },
    {
      "level": "H2",
      "text": "Tactic #3: Be direct"
    },
    {
      "level": "H2",
      "text": "Tactic #4: Pique curiosity"
    },
    {
      "level": "H2",
      "text": "Tactic #5: Go minimalistic"
    },
    {
      "level": "H2",
      "text": "Tactic #6: Use storytelling"
    },
    {
      "level": "H2",
      "text": "Tactic #7: Tweet often"
    },
    {
      "level": "H2",
      "text": "Tactic #8: Share helpful, actionable content"
    },
    {
      "level": "H2",
      "text": "Tactic #9: Make friends and share their content"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nichole Elizabeth DeMeré\n          \n            Nichole Elizabeth DeMeré\n          \n            Nichole Elizabeth DeMeré"
}