{
  "url": "https://moz.com/blog/turn-your-clients-into-seo-allies",
  "slug": "turn-your-clients-into-seo-allies",
  "title": "Spectator to Partner: Turn Your Clients into SEO Allies - Best of Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Turning your clients into SEO allies is key for effective reporting and retention. But how do you do it? To complement our just-released Mini Guide to SEO Reporting, we're bringing back a fan favorite Whiteboard Friday!",
  "content": "Spectator to Partner: Turn Your Clients into SEO Allies - Best of Whiteboard Friday SEO Consulting | Whiteboard Friday | SEO Reporting By: Kameron Jenkins December 13, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kameron Jenkins December 13, 2019 Spectator to Partner: Turn Your Clients into SEO Allies - Best of Whiteboard Friday SEO Consulting | Whiteboard Friday | SEO Reporting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Are your clients your allies in SEO, or are they passive spectators? Could they even be inadvertently working against you? A better understanding of expectations, goals, and strategy by everyone involved can improve your client relations, provide extra clarity, and reduce the number of times you're asked to \"just SEO a site.\" In today's Whiteboard Friday, Kameron Jenkins outlines tactics you should know for getting clients and bosses excited about the SEO journey, as well as the risks involved in passivity. (We were inspired to revisit this classic Whiteboard Friday by our brand-new Mini Guide to SEO Reporting! These two resources go together like a fine La Croix and a well-aged cheese.) Hop to the Mini Guide Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hey, everyone, and welcome to this week's edition of Whiteboard Friday. I am Kameron Jenkins, and I'm the SEO Wordsmith here at Moz. Today I'm going to be talking with you about how to turn your clients from spectators, passive spectators to someone who is proactively interested and an ally in your SEO journey. So if you've ever heard someone come to you, maybe it's a client or maybe you're in-house and this is your boss saying this, and they say, \"Just SEO my site,\" then this is definitely for you. A lot of times it can be really hard as an SEO to work on a site if you really aren't familiar with the business, what that client is doing, what they're all about, what their goals are. So I'm going to share with you some tactics for getting your clients and your boss excited about SEO and excited about the work that you're doing and some risks that can happen when you don't do that. Tactics So let's dive right in. All right, first we're going to talk about tactics. 1. Share news The first tactic is to share news. In the SEO industry, things are changing all the time, so it's actually a really great tactic to keep yourself informed, but also to share that news with the client. So here's an example. Google My Business is now experimenting with a new video format for their post feature. So one thing that you can do is say, \"Hey, client, I hear that Google is experimenting with this new format. They're using videos now. Would you like to try it?\" So that's really cool because it shows them that you're on top of things. It shows them that you're the expert and you're keeping your finger on the pulse of the industry. It also tells them that they're going to be a part of this new, cutting-edge technology, and that can get them really, really excited about the SEO work you're doing. So make sure to share news. I think that can be really, really valuable. 2. Outline your work The next tip is to outline your work. This one seems really simple, but there is so much to say for telling a client what you're going to do, doing it, and then telling them that you did it. It's amazing what can happen when you just communicate with a client more. There have been plenty of situations where maybe I did less tangible work for a client one week, but because I talk to them more, they were more inclined to be happy with me and excited about the work I was doing. It's also cool because when you tell a client ahead of time what you're going to do, it gives them time to get excited about, \"Ooh, I can't wait to see what he or she is going to do next.\" So that's a really good tip for getting your clients excited about SEO. 3. Report results Another thing is to report on your results. So, as SEOs, it can be really easy to say, hey, I added this page or I fixed these things or I updated this. But if we detach it from the actual results, it doesn't really matter how much a client likes you or how much your boss likes you, there's always a risk that they could pull the plug on SEO because they just don't see the value that's coming from it. So that's an unfortunate reality, but there are tons of ways that you can show the value of SEO. One example is, \"Hey, client, remember that page that we identified that was ranking on page two. We improved it. We made all of those updates we talked about, and now it's ranking on page one. So that's really exciting. We're seeing a lot of new traffic come from it.I'm wondering, are you seeing new calls, new leads, an uptick in any of those things as a result of that?\" So that's really good because it shows them what you did, the results from that, and then it kind of connects it to, \"Hey, are you seeing any revenue, are you seeing new clients, new customers,\" things like that. So they're more inclined to see that what you're doing is making a real, tangible impact on actual revenue and their actual business goals. 4. Acknowledge and guide their ideas This one is really, really important. It can be hard sometimes to marry best practices and customer service. So what I mean by that is there's one end of the pendulum where you are really focused on best practices. This is right. This is wrong. I know my SEO stuff. So when a client comes to you and they say, \"Hey, can we try this?\" and you go, \"No, that's not best practices,\"it can kind of shut them down. It doesn't get them involved in the SEO process. In fact, it just kind of makes them recoil and maybe they don't want to talk to you, and that's the exact opposite of what we want here. On the other end of that spectrum though, you have clients who say, \"Hey, I really want to try this.I saw this article. I'm interested in this thing. Can you do it for my website?\" Maybe it's not the greatest idea SEO-wise. You're the SEO expert, and you see that and you go, \"Mm, that's actually kind of scary. I don't think I want to do that.\" But because you're so focused on pleasing your client, you maybe do it anyway. So that's the opposite of what we want as well. We want to have a \"no, but\" mentality. So an example of that could be your client emails in and says, \"Hey, I want to try this new thing.\" You go, \"Hey, I really like where your head is at. I like that you're thinking about things this way. I'm so glad you shared this with me. I tried this related thing before, and I think that would be actually a really good idea to employ on your website.\" So kind of shifting the conversation, but still bringing them along with you for that journey and guiding them to the correct conclusions. So that's another way to get them invested without shying them away from the SEO process. Risks So now that we've talked about those tactics, we're going to move on to the risks. These are things that could happen if you don't get your clients excited and invested in the SEO journey. 1. SEO becomes a checklist When you don't know your client well enough to know what they're doing in the real world, what they're all about, the risk becomes you have to kind of just do site health stuff, so fiddling with meta tags, maybe you're changing some paragraphs around, maybe you're changing H1s, fixing 404s, things like that, things that are just objectively, \"I can make this change, and I know it's good for site health.\" But it's not proactive. It's not actually doing any SEO strategies. It's just cleanup work. If you just focus on cleanup work, that's really not an SEO strategy. That's just making sure your site isn't broken. As we all know, you need so much more than that to make sure that your client's site is ranking. So that's a risk. If you don't know your clients, if they're not talking to you, or they're not excited about SEO, then really all you're left to do is fiddle with kind of technical stuff. As good as that can be to do, our jobs are way more fun than that. So communicate with your clients. Get them on board so that you can do proactive stuff and not just fiddling with little stuff. 2. SEO conflicts with business goals So another risk is that SEO can conflict with business goals. So say that you're an SEO. Your client is not talking to you. They're not really excited about stuff that you're doing. But you decide to move forward with proactive strategies anyway. So say I'm an SEO, and I identify this keyword. My client has this keyword. This is a related keyword. It can bring in a lot of good traffic. I've identified this good opportunity. All of the pages that are ranking on page one, they're not even that good. I could totally do better. So I'm going to proactively go, I'm going to build this page of content and put it on my client's site. Then what happens when they see that page of content and they go, \"We don't even do that. We don't offer that product. We don't offer that service.\" Oops. So that's really bad. What can happen is that, yes, you're being proactive, and that's great. But if you don't actually know what your client is doing, because they're not communicating with you, they're not really excited, you risk misaligning with their business goals and misrepresenting them. So that's a definite risk. 3. You miss out on PR opportunities Another thing, you miss out on PR opportunities. So again, if your client is not talking to you, they're not excited enough to share what they're doing in the real world with you, you miss out on news like, \"Hey, we're sponsoring this event,\"or, \"Hey, I was the featured expert on last night's news.\" Those are all really, really good things that SEOs look for. We crave that information. We can totally use that to capitalize on it for SEO value. If we're not getting that from our clients, then we miss out on all those really, really cool PR opportunities. So a definite risk. We want those PR opportunities. We want to be able to use them. 4. Client controls the conversation Next up, client controls the conversation. That's a definite risk that can happen. So if a client is not talking to you, a reason could be they don't really trust you yet. When they don't trust you, they tend to start to dictate. So maybe our client emails in. A good example of this is, \"Hey, add these 10 backlinks to my website.\" Or, \"Hey, I need these five pages, and I need them now.\" Maybe they're not even actually bad suggestions. It's just the fact that the client is asking you to do that. So this is kind of tricky, because you want to communicate with your client. It's good that they're emailing in, but they're the ones at that point that are dictating the strategy. Whereas they should be communicating their vision, so hey, as a business owner, as a website owner, \"This is my vision. This is my goal, and this is what I want.\" As the SEO professional, you're receiving that information and taking it and making it into an SEO strategy that can actually be really, really beneficial for the client. So there's a huge difference between just being a task monkey and kind of transforming their vision into an SEO strategy that can really, really work for them. So that's a definite risk that can happen. Excitement + partnership = better SEO campaigns There's a lot of different things that can happen. These are just some examples of tactics that you can use and risks. If you have any examples of things that have worked for you in the past, I would love to hear about them. It's really good to information share. Success stories where maybe you got your client or your boss really bought into SEO, more so than just, \"Hey, I'm spending money on it.\" But, \"Hey, I'm your partner in this. I'm your ally, and I'm going to give you all the information because I know that it's going to be mutually beneficial for us.\" So at the end here, excitement, partner, better SEO campaigns. This is going to be I believe a recipe for success to get your clients and your boss on board. Thanks again so much for watching this edition of Whiteboard Friday, and come back next week for another one. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Spectator to Partner: Turn Your Clients into SEO Allies - Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Spectator to Partner: Turn Your Clients into SEO Allies - Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Tactics"
    },
    {
      "level": "H3",
      "text": "1. Share news"
    },
    {
      "level": "H3",
      "text": "2. Outline your work"
    },
    {
      "level": "H3",
      "text": "3. Report results"
    },
    {
      "level": "H3",
      "text": "4. Acknowledge and guide their ideas"
    },
    {
      "level": "H2",
      "text": "Risks"
    },
    {
      "level": "H3",
      "text": "1. SEO becomes a checklist"
    },
    {
      "level": "H3",
      "text": "2. SEO conflicts with business goals"
    },
    {
      "level": "H3",
      "text": "3. You miss out on PR opportunities"
    },
    {
      "level": "H3",
      "text": "4. Client controls the conversation"
    },
    {
      "level": "H2",
      "text": "Excitement + partnership = better SEO campaigns"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kameron Jenkins\n          \n            Kameron Jenkins\n          \n            Kameron Jenkins"
}