{
  "url": "https://moz.com/blog/twas-the-night-before-christmas-mozstyle",
  "slug": "twas-the-night-before-christmas-mozstyle",
  "title": "'Twas the Night Before Christmas... Moz-Style - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Whatever your joys and celebrations this season, we at Moz wish you all the best! In the spirit of the season, we bring you a festive poem about a little Moz Dog with a big heart.",
  "content": "'Twas the Night Before Christmas... Moz-Style Moz News By: Felicia Crawford December 24, 2015 Table of Contents Copied! By: Felicia Crawford December 24, 2015 'Twas the Night Before Christmas... Moz-Style Moz News ‘Twas the night before Christmas, when all throughout MozNot a laptop was whirring, the office on pause.The colorful Great Wheel spun slow on the pier,Downtown Seattle alive with good cheer. The Moz Dogs were nestled at home in their beds,Dreams of dropped tacos alive in their heads.And I, staying late to write on the blog,Had just closed my MacBook, and downed my eggnog. Whence from down the hall came a soft pitter-patter;I arose from my desk to spy what was the matter.Peering ‘round corners, obscured by the dark,Though I couldn’t see who, something gave a small bark. Then, lit by the glow of some USB lights,To my eyes did appear a confusing sight.With a fuzzy red cap and Muppet-like paws,Lettie Pickles the Moz Dog looked like...Santa Claus? Though smaller in stature, with pointier teeth,Her red hat the colorful glow did enwreathe.With a very stuffed sack and a beard mighty thick,No way to deny, she looked just like Saint Nick! As I watched from the shadows, her night’s work begun,Saint Pickles took off with her bag at a run.From desktop to desktop, from seat to seat,All Mozzers were gifted with savory treats. While the flavor of liver won’t everyone please,To give with abandon, the spirit it frees.As she sprinted around with a comical gait,From her magical gift bag did drop some small freight. Creeping forward to read the scribbled-upon note,(No crying, I swear! In my eye, a dust-mote).The night’s giving detailed, no naughty or nice,Just a list of those needing some holiday spice. All over the world, dogs old and dogs young,Saint Pickles some holiday cheer will have brung.As I stood there agape, the note in my hand,Silent beside me Lettie Claus did stand. With a wag of the tail and a sparkle of tooth,No words were required to feel out the truth.From Moz to the streets, from my home to yours,It’s all about helping folks win their hard wars. With all treats delivered and message made clear,Lettie Pickles leapt off, other homes to appear.So take just a moment, and Google a causeWhether for those with two feet, roots, or four paws. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "'Twas the Night Before Christmas... Moz-Style"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "'Twas the Night Before Christmas... Moz-Style"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Felicia Crawford\n          \n            Felicia Crawford\n          \n            Felicia Crawford"
}