{
  "url": "https://moz.com/blog/tweets-effect-rankings-unexpected-case-study",
  "slug": "tweets-effect-rankings-unexpected-case-study",
  "title": "A Tweet's Effect On Rankings - An Unexpected Case Study - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Let me tell you a tale of an unexpected case study on the value of a tweet on a page's ranking and traffic. This tale will mostly be told using graphics, as the images tell the story better than I can. Let's begin...\nLast Monday while I was checking the morning tweets, I noticed a ton of tweets…",
  "content": "A Tweet's Effect On Rankings - An Unexpected Case Study Social Media By: Jennifer Sable Lopez February 15, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez February 15, 2011 A Tweet's Effect On Rankings - An Unexpected Case Study Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Let me tell you a tale of an unexpected case study on the value of a tweet on a page's ranking and traffic. This tale will mostly be told using graphics, as the images tell the story better than I can. Let's begin... Last Monday while I was checking the morning tweets, I noticed a ton of tweets about our Beginner's Guide to SEO. It didn't take long to realize that Smashing Magazine had tweeted about it and the retweets were seriously rolling in. (And yes, they really did spell Beginers wrong ;). Exhibit A - The Initial Tweet I quickly emailed the marketing team, with a \"Sweet! Smashing Magazine tweeted about the Beginner's Guide, let's watch for the traffic bump.\" Not long after Rand in his infinite wisdom realized that all of a sudden we were actually ranking on the first page for the term \"Beginner's Guide\" (without SEOmoz or SEO) and he tweeted. Exhibit B - Rand's tweet as we realized we were ranking for general keyword Whoa. Now, previously we weren't tracking that keyword as we hadn't really thought about trying to rank for such a general term (by the way, it is now a keyword we watch in our web app campaign). Most of the traffic to the Beginner's Guide usually comes from keywords like seo guide, seomoz beginners guide, what is seo, beginners guide seo, seo keyword research, etc. which are all directly related to SEO and the guide. Rand had searched on \"Beginner's Guide\" about a month or two earlier and it wasn't anywhere in the SERPs, and we definitely weren't getting any traffic for that term. So we were obviously quite interested to see that now, after hundreds of retweets we were showing up on the first page for that term. HOLY WOWSERS. At that point I wasn't sure how long it was going to stick around so I took a screen shot, thinking \"this will make for a great case study.\" Exhibit C - The SERP Sure this was really interesting but the question was \"will it last?\" or is this just an example of QDF? Over the next week I watched the ranking and traffic every day. The ranking seemed to fluctuate between the first and the second page for \"Beginner's Guide\" throughout the week. I even tweeted about it one day last week to see where others around the world were seeing our guide rank for the term. The response was overwhelming that most people in the U.S. saw it on the first page still (at various spots) and most international folks saw it on the second page (in the 11th-13th spots). All pretty interesting but we all know ranking isn't everything right? So let's take a look at happened with our organic traffic for that keyword. Exhibit D - The Traffic Sure, the traffic hasn't been huge, which is totally expected since our guide to SEO probably wasn't the user's intent if they searched for \"Beginner's Guide.\" Plus, the fact is, that's not a highly searched term, so getting a ton of traffic for it wouldn't make sense. What IS interesting though is that before the tweet, we had absolutely zero traffic for that keyword and after the tweet, we have traffic. It has obviously died down since the initial tweet but we're still getting traffic each day for it. Just like our initial test we ran a few months ago, we'll continue to monitor the traffic and ranking for \"Beginner's Guide\" to see if the tweets only helped in the short term or in the long term as well. Until then, if you have any similar case studies or \"random awesome tweets that fall into your lap\" as we did, I'd love to hear about the outcome. Oh, and one last little bit of info. Below is a screenshot of the data about the bit.ly URL that Smashing Magazine used in their tweet. It's pretty dang exciting to see how many clicks it generated! Some takeaways: A high quantity of tweets from \"real\" users on Twitter has a pretty substantial impact on rankings in the short term (take note sources seeking rankings during high search volume periods - holidays, news events, etc.) It appears likely that Google (and Bing) are using the concept they described in the interview on SELand of \"Author Authority\" to help weight the value of tweets (as we've seen that bot-repeated tweeting in similar quantities doesn't have this affect) There seems to be some long-term, nascent value carried by tweets in addition to the short-term effects. If this is consistently observed, expect a lot more SEO activity around engaging and incenting tweeting to key URLs. It's still unknown whether and how much the text of a tweet impacts the SERPs in a way similar to anchor text. That will be an excellent next test for us to observe. Ah... the power of tweets. :-) Would love to hear your experiences and feedback on tweets influencing rankings in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Tweet's Effect On Rankings - An Unexpected Case Study"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Tweet's Effect On Rankings - An Unexpected Case Study"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}