{
  "url": "https://moz.com/blog/twitter-an-effective-marketing-tool-for-business",
  "slug": "twitter-an-effective-marketing-tool-for-business",
  "title": "Twitter - An Effective Marketing Tool for Business? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Twitter debate has been raging for quite some time now and I have seen and heard more than a few folk claim that they generate a lot of business from it; however, there has been very little information on the actual (as in tangible, monetary) value of the application to companies rather than…",
  "content": "Twitter - An Effective Marketing Tool for Business? Social Media A By: Andrew Steel March 25, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! A By: Andrew Steel March 25, 2009 Twitter - An Effective Marketing Tool for Business? Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The Twitter debate has been raging for quite some time now and I have seen and heard more than a few folk claim that they generate a lot of business from it; however, there has been very little information on the actual (as in tangible, monetary) value of the application to companies rather than sole traders. Dell recently claimed that its use of Twitter (furthering awareness of sales, etc) led to revenue in excess of $1 million, which, while small potatoes for a company used to dealing in billions where revenue is concerned, is a significant amount to generate for almost no cost (other than time for planning and producing tweets and creating initial awareness of the delloutlet account) in getting their message to market. Dell plans to build upon this by turning Twitter into a loyalty marketing platform, offering its followers unique deals and discounts otherwise unavailable outside of the Twittersphere. However, will it provide much of an increase in revenue for the additional effort involved? Granted, Dell isn't betting their entire business on it, but can it really produce the kind of figures that would make it worthwhile as an aggressively targeted marketing platform? Obviously a goal of any company or corporation should be to increase engagement with customers and target markets wherever possible, and Twitter would seem to be an ideal way of doing this. After all, by filtering searches on Twitter it is possible to track everything mentioned about the brand or company and quickly address any issues that arise (reputation management made easy!). Yet, as with all forms of social media, it is still difficult to accurately measure the actual value of campaigns (again, monetarily speaking) to the company. With Twitter founder Biz Stone recently discussing charging businesses to use Twitter as a possibility of monetising the application, it is likely to be something companies will begin to analyse on a cost/gain basis in terms of the value added to the brand. Therefore, my question to you all is: Can Twitter be an effective marketing tool for all businesses, or are many companies simply jumping on the social media bandwagon because it is perceived as \"free customer engagement\" and a \"must do\" of the modern age? Feel free to provide examples to back your case. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Twitter - An Effective Marketing Tool for Business?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Twitter - An Effective Marketing Tool for Business?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Andrew Steel\n          \n            Andrew Steel"
}