{
  "url": "https://moz.com/blog/twitter-impacts-relevance-like-i-impact-gravity",
  "slug": "twitter-impacts-relevance-like-i-impact-gravity",
  "title": "Twitter Impacts Relevance Like I Impact Gravity - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I am awestruck by the collective nonsense I'm reading on this page. You people need a serious reality check. Even if Twitter was big enough to significantly influence search engine rankings--which it definitely ISN'T--it would still be nothing more than a noisy stream of garbage data, being…",
  "content": "Twitter Impacts Relevance Like I Impact Gravity Social Media By: Darren Slatten April 10, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Darren Slatten April 10, 2009 Twitter Impacts Relevance Like I Impact Gravity Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I am awestruck by the collective nonsense I'm reading on this page. You people need a serious reality check. Even if Twitter was big enough to significantly influence search engine rankings--which it definitely ISN'T--it would still be nothing more than a noisy stream of garbage data, being produced by a very narrow range of internet users. The suggestion that search engines will eventually be forced to consider Twitter data as a ranking signal is laughable. While we're at it, let's build these signals into the algo: MafiaRank - the more MySpace users you have in your Mafia Wars family, the more important you are. PokeRank - the more Facebook users that have SuperPoked you, the more popular you are. SuperPokes from users with high PokeRank are worth more than low-PokeRank SuperPokes. Really, when you think about it... how could Google NOT use MafiaRank and PokeRank? I mean... Mafia Wars alone has 12 MILLION active monthly users, and it hasn't even been around for a whole year yet. We're looking at a growth rate of more than 1.2 BILLION % per year! With numbers that big, it's only a matter of time before Google ditches their search engine entirely and actually starts a mafia business. Whose family are you gonna join, the Brin-nellis or the Page-arinos? Trust me, folks... 2010 is going to be all about Mafia Wars Marketing and PokeRank sculpting. If your company doesn't already have at least 50% of your advertising budget set aside for dedicated Mafia Wars optimization, then you're basically sending your customers to your competitors' mafia families. And one last thing... Only pursue natural, editorial-grade pokes. Stay away from paid pokes, poke exchanges, and poke farms. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Twitter Impacts Relevance Like I Impact Gravity"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Twitter Impacts Relevance Like I Impact Gravity"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Darren Slatten\n          \n            Darren Slatten"
}