{
  "url": "https://moz.com/blog/twitters-brand-equity",
  "slug": "twitters-brand-equity",
  "title": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords",
  "content": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords Social Media | Search Engines By: Dr. Peter J. Meyers August 1, 2023 Table of Contents Copied! By: Dr. Peter J. Meyers August 1, 2023 Twitter’s Brand Equity: 17 Years & 12 Million Keywords Social Media | Search Engines Edited by Emilie Martin On July 24, Elon Musk made the surprise announcement that Twitter would be rebranding as ‘X’, with a new logo and brand identity arriving quickly after that announcement. Shortly after, X.com started redirecting (302) to Twitter.com. Any experienced SEO knows how perilous a major site migration can be, and Twitter.com has been accumulating authority for 17 years. Here are a couple of stats from Moz’s Domain Overview tool: Domain Overview dashboard available with Moz Pro. Those are numbers most sites could only envy, with nearly 12M ranking keywords on Google.com alone. Over time, X.com could recover many or most of the non-branded rankings, but what about the equity in searches for the Twitter brand? Brand search: It’s complicated According to our data, there are 8.4 Million searches a month in the United States just for the word “twitter” (and that’s probably a conservative estimate), but brand search goes far deeper than that. Consider the Google result for just the letters “tw”: Not only does Twitter rank #1 for just “tw”, but Google is sending strong brand signals, including expanded sitelinks and a Knowledge Graph entry. While many possible sites and searches begin with “tw”, Google has determined that Twitter.com is — in their own lingo — the dominant interpretation. This is impressive even by large-brand standards. Something unique to social networks is that people also pair other search phrases with the network’s name. So, we see many searches for prominent figures and brands, such as: “Taylor Swift Twitter”“Tom Holland Twitter”“Fortnite Twitter”“Netflix Twitter”“NFL Twitter” We also see brand-like signals for topics paired with the word “Twitter”, prominent Twitter personalities (even without the brand name), inquiries like “Twitter search” and “Twitter login”, and official spinoffs, like “Tweetdeck.” Even popular memes can return brand-like signals. In addition, Twitter qualifies for a unique, carousel-style format like the one below: This kind of prime real estate on Google results may carry over to the X brand, but that is entirely at Google’s discretion and may depend on the strength of the new brand. Quantifying Twitter’s brand power Across the approximately 12 Million search queries Twitter ranked for in Moz’s data, we examined just the ones that received 150+ searches per month and where Twitter ranked on page one, which left us with about 600,000 unique queries. We analyzed those 600K queries for brand signals and ended up with 10,149 search queries. While this may not seem like a lot compared to 12 Million, it represents a massive influence of the Twitter brand. All told, these 10K queries drive over 18 Million searches per month. The problem for ‘X’ is that the vast majority of these brand-like searches reference Twitter or associated brand terms (like “tweet” and “Tweetdeck”) directly. To recapture this search volume and traffic long-term, ‘X’ will have to reach a level of brand awareness where searchers are actively looking for terms like “Taylor Swift X” and “Fortnite X’. The confusing history of X.com X.com currently ranks for no keywords in our databases, due to a number of long-term issues. It doesn’t take a lot of math to tell you that this drives zero brand searches. This situation will undoubtedly change, but X.com faces another challenge — it has been used to house a number of sites (with multiple owners) and also has redirected to Musk’s wider brand portfolio. To understand X.com’s more than 25-year history, you really need to see it. The early years (1995–2000) Using the Internet Archive’s Wayback Machine, we can capture a bit of this confusing history. The X.com domain was originally owned by Dave Weinstein, who launched the site in 1995 or 1996, in pretty typical mid-1990s fashion: Sadly, the list of stuff that Rob Walker might want is lost to the sands of time. In 1999, Elon Musk bought the domain for the first time (he would later re-buy it from eBay). Here’s a screenshot from early 2000 of the original X.com online banking site: Until the recent rebranding of Twitter to ‘X’, this 2000-era site was the only one to ever house the X.com brand as originally envisioned. The PayPal years (2000–2011) Due to a rocky period at PayPal after the merger of X.com and Confinity, the X.com brand gave way to various PayPal brands. In the spring of 2000, the site was briefly rebranded as “X-Finance” and then “X-PayPal” (shown below): By the fall of 2000, Musk was ousted as CEO at PayPal, and this site was rebranded as just “PayPal” in early 2001. This persisted for a while, with X.com eventually redirecting to the PayPal site. The ‘X’ brand was nowhere to be seen at this point. In late 2007, X.com was resurrected as PayPal Labs (captured here in 2008): PayPal Labs persisted for a while, followed by a handful of PayPal experiments, including this “X.com blog” that appears to have nothing to do with the ‘X’ brand (screen shot from July 2009): These appear to be the only two posts the X.com blog ever had, until it was replaced in spring of 2010 with the PayPal-X Developer Network (not to be confused with X-PayPal): In summer of 2011, this site was replaced by a new joint venture of eBay (which had acquired PayPal in 2002), PayPal, and Magento called “X-commerce”. X.com[merce] (2011–2014) X.commerce, a play on the X.com domain, housed “a new venture in commerce” that sought to integrate the eBay, PayPal, and Magento developer communities: X.commerce went through a number of iterations, surviving until February of 2014. At that point, eBay seems to have given up on the X.commerce venture and redirected X.com directly to eBay’s corporate site (ebayinc.com). The Boring hat (2017–2023) In July of 2017, Elon Musk repurchased X.com and replaced the home-page with just the letter ‘x’. Soon after, X.com redirected to The Boring Company, but not to the home-page — to a page to buy a hat: Roughly a year later, this was replaced by an under construction page reminiscent of the late 1990s, while living unironically in 2018: This page soon returned to the letter ‘x’ on a white background. Note that the basic ‘x’ page contained no HTML source code at all nor any clues about the nature of the ‘X’ brand or website. It was literally just one character. This persisted until July of 2023, when X.com was 302-redirected to Twitter.com, which is its current status as of this writing. The long, uncertain road ahead The strange history of X.com — regardless of my personal feelings — is an SEO and branding nightmare. X.com has been used and abused by various owners and has spent years just being the letter ‘x’ on a white page, with absolutely no clues as to the brand’s purpose. During this time, X.com has built roughly zero online brand equity and ranks for nothing. Temporarily redirecting to Twitter.com is a short-term solution, and presumably Twitter.com itself will permanently redirect to X.com at some point. I have no knowledge of Musk’s plans — this is the only reasonable way for X.com to become the permanent home of the ‘X’ brand. At that point, X.com risks losing a substantial portion of the 10,149 Twitter-branded search queries and 18 Million searches per month previously discussed. Reclaiming those searches and the resulting traffic is not just an SEO task, but will require building the ‘X’ brand in the minds of consumers to the point that they routinely search for celebrities, brands, and topics combined with ‘X’ or X-related terms. The long-term success of X.com is anyone’s guess, but as the ‘X’ brand is moved to X.com, I predict — based on my experiences with even moderately difficult similar transitions — a substantial loss of search traffic for at least 3-6 months. Given the power of the current Twitter brand and the long, strange history of X.com, losses could easily last over a year. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Brand search: It’s complicated"
    },
    {
      "level": "H2",
      "text": "Quantifying Twitter’s brand power"
    },
    {
      "level": "H3",
      "text": "The confusing history of X.com"
    },
    {
      "level": "H3",
      "text": "The early years (1995–2000)"
    },
    {
      "level": "H3",
      "text": "The PayPal years (2000–2011)"
    },
    {
      "level": "H3",
      "text": "X.com[merce] (2011–2014)"
    },
    {
      "level": "H3",
      "text": "The Boring hat (2017–2023)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "How TikTok Is Reading Your Mind — Whiteboard Friday"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}