{
  "url": "https://moz.com/blog/twitter-begrudgingly-revisted",
  "slug": "twitter-begrudgingly-revisted",
  "title": "Twitter Begrudgingly Revisted - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Caught during a moment of extreme moral ineptitude on Saturday, I did the unthinkable. I signed up to Twitter. I felt like a fourteen seventeen year old who's been thinking about sneaking into the parents' booze cabinet with her friends and finally makes the decision to pick the lock. I felt bad…",
  "content": "Twitter Begrudgingly Revisted Social Media By: Jane Copland March 12, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland March 12, 2008 Twitter Begrudgingly Revisted Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Caught during a moment of extreme moral ineptitude on Saturday, I did the unthinkable. I signed up to Twitter. I felt like a fourteen seventeen year old who's been thinking about sneaking into her parents' booze cabinet with her friends and finally makes the decision to pick the lock. I also felt bad immediately, especially given this and this. I didn't try to convince myself that I'd signed up in order to keep ahead of the world's breaking news, to connect with important people or follow the torrid happenings at SXSW. I did it to add yet another method by which I can communicate with my friends, because we're lacking those. What I noticed, however, was that there is interesting information to be found via news sites' accounts, but they blend in all too well with the idle chatter. Additionally, I don't want to add news services to the list of accounts that \"notify\" me when they're updated by sending me an instant message. (I don't have text messages turned on because I think it would get very irritating and, frankly, my phone is not up to the challenge.) I also don't like the idea of news stories popping up as instant messages along with the latest appalling YouTube link that Tom Critchlow has sent me (warning: once you've seen it, you can't unsee it), or Ciarán Norris' startlingly accurate portrayal of a weekend spent using Twitter. But at the same time, I see the appeal in following the micro-blogging that goes on. Solely subscribing to (following? Creepy) the updates of blogs, newspapers or other sources of information can indeed make for a juicy little RSS feed-type creature. Like a personal ticker of whatever news you're interested in receiving, you'd never be short of easy blog content again. Unlike RSS, there is no need to wade through hundreds of unread posts, which could be more than 140 characters in length. Smart links from trusted sources, dropped via tinyurl of course, provide a quick insight into what's going on right now. It's all very instantaneous. However, as with every form of social media and RSS, you'll see update after update that you don't care about, as well as posts directed at strangers, which add to Twitter's infamous one-sided conversations. Twitter would become infinitely more useful if you could conveniently message a select group of friends. The @username feature is good for getting a specific person's attention, but with only 140 characters to work with, it's hard to get more than two people into one message. One thing that kept me away from Twitter for so long was the idea that all everyone did was post never-ending updates like, \"Going to the store.\" \"Found five bucks on the street.\" \"Thinking about what to have for tea. Pasta, maybe.\" Useless. Luckily, this hasn't really happened. With the impressive total of three days Twitter usage to my name, here are my thoughts on its strengths: Twitter is great for: Sharing links. To me, this is probably one of its biggest strengths. Getting a crowd together, geography allowing. Sending free text messages. Keeping up with / sharing very new news. Keeping up with / sharing viral, overblown, hysteria-driven gossip. Seeing subjects' reactions to overblown, hysteria-driven gossip. Meaningless chat. The web is disturbingly void of places to do this. Annoying the holy hell out of Facebook fangirls who get mad at Twitter posts showing up as Facebook status updates and who berate their friends about it until they turn them off. Spawning stupid words. I assume that many of you have used Twitter for quite some time, so you may enjoy some of the newbie mistakes and lessons I muddled my way through over the past few days: It took me quite_some_time to figure out how to do the @username thing. Just writing out the person's name after the @ symbol seemed too simple. I didn't notice the \"reply\" arrow until Lisa Barone pointed it out. I maintain that it should be labeled. Properly. Like it is at Facebook. I was very excited to learn that I could update Twitter via Gtalk, which is my preferred instant messenger. I was not excited to learn how easy it is to type a reply to Scott into the Twitter window by accident. It turns out that not everything I say to my coworkers needs to be posted on the Internet for everyone to see. I better understand why Rae refers to everyone by their blog name when talking about them offline. After a few days of calling her @sugarrae, I still wouldn't call her that in person, but I'd not find it weird if someone else did. I thought that Twitter was meant to be a giant status-update of itself, but I use it as an instant messenger. If this pisses people off, I don't really mind: it's bad enough that I'm actually using it, so I'll use it any way I like! Twitter will let you post more than 140 characters in a message. It'll just cut off the end and make you look like an idiot. And now for some shameful admissions: Throughout writing this post, I've been engaging in various conversations with my friends, all via Twitter. The @username style is now natural to me. I recognise people's little avatars just as well as I do their Facebook profile pictures. I've forgotten most of their last names. There you go, Internet marketing community. You broke me. I'm standing here with my white flag, burning up the @ key and watching my soul slowly escape into a bubbly blue background. But I won't be truly impressed until you get Rebecca. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Twitter Begrudgingly Revisted"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Twitter Begrudgingly Revisted"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}