{
  "url": "https://moz.com/blog/twitter-links-are-a-source-of-external-links-sometimes",
  "slug": "twitter-links-are-a-source-of-external-links-sometimes",
  "title": "Twitter Links Are a Source of External Links...Sometimes - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I wanted to establish if external links from Twitter hold any weighting. It is a well-known fact that Twitter uses rel = “no follow” on all external links, but do the search engines still cache these and consider them a vote?",
  "content": "Twitter Links Are a Source of External Links...Sometimes Link Building A By: ao.com February 18, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! A By: ao.com February 18, 2009 Twitter Links Are a Source of External Links...Sometimes Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I wanted to establish if external links from Twitter hold any weighting. It is a well-known fact that Twitter uses rel = “no follow” on all external links, but do the search engines still cache these and consider them a vote? I tweeted for a couple of weeks trying, where possible, to diversify the location and type of links I used: My site (About Me / Bio) Normal URL (If I could get it to fit) TinyURL I wasn’t expecting any of the links to be cached due to the nofollow, but I was pleasantly surprised with the results: My Site Results: As you can see, both Google and Yahoo consider the link from Twitter as an external link. Normal URL (If I could get it to fit) Results: Again, Yahoo considers the link from Twitter as an external link (I don’t have webmaster access for Google). TinyURL All my attempts to find where the search engines have attributed an external link through a TinyURL resulted in no direct association with my Twitter page. Summary Even though Twitter uses the nofollow command to stop the search engines from attributing value to the linked site, the search engines seem to still consider it as an external link, but only if it’s the true URL, not a TinyURL. So get twittering! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Twitter Links Are a Source of External Links...Sometimes"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Twitter Links Are a Source of External Links...Sometimes"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "ao.com\n          \n            ao.com"
}