{
  "url": "https://moz.com/blog/twitter-top-6-presidential-candidates",
  "slug": "twitter-top-6-presidential-candidates",
  "title": "What Can Twitter Teach You about the Top 6 US Presidential Candidates? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What juicy details can Twitter reveal about the top 2016 US presidential candidates? Follow along with our \"wonky\" journey as we use in-depth Followerwonk analysis to uncover insights about this wild election year.",
  "content": "What Can Twitter Teach You about the Top 6 US Presidential Candidates? Social Media By: Ann Boyles February 10, 2016 Table of Contents Copied! By: Ann Boyles February 10, 2016 What Can Twitter Teach You about the Top 6 US Presidential Candidates? Social Media As many of you — particularly our friends in Iowa and New Hampshire — are keenly aware, the height of the US presidential election season is upon us. In recent years, social media has had an increasingly profound impact on campaigns and election conversations, with candidates and their supporters (and detractors) taking to Twitter in droves. Here at Moz, we’re seizing the opportunity to examine the Twitter accounts of candidates seeking the highest office in the US to see what insights we can discover by sifting through the data. Over the next nine months, we’ll be putting our Twitter analytics tool, Followerwonk, to work on the presidential candidates: analyzing followers, tracking changes in followership around key moments in time, and sharing any other interesting tidbits we run into along the way. Join us on the Moz Blog between now and the general election in November as we reveal insights on followership trends of the top-performing presidential candidates. You can also follow the data we’re tracking the current six top-performing candidates* in realtime by visiting their individual Followerwonk analysis report pages: Hillary Clinton Ted Cruz Marco Rubio Bernie Sanders Donald Trump John Kasich *Top-performing candidates as measured by their finishing positions in the 2016 Iowa Caucus and New Hampshire primary. This list will evolve with the election cycle. Top states getting their political tweets on Let’s dive in! We wanted to identify the top 10 states where users were tweeting about each candidate during 24-hour periods surrounding the Iowa Caucus and the New Hampshire primary. So, what's the big deal with Iowa and New Hampshire? We’re going to take a quick step back here for those of you who may not be familiar with these events to explain why they matter. The Iowa Caucus and New Hampshire primary are the first two electoral contests during the US presidential election cycle. It’s the first time real voters cast real votes to narrow the field of candidates hoping to become the next president. These events play a significant role in shaping the public conversation about which candidates will ultimately be best positioned to capture their party’s nomination. We won’t dig into the debate on this forum about whether either the Iowa Caucus or New Hampshire primary should be as influential as they are — plenty of other blogs and media outlets have that covered. But, there’s no denying they play an important role in setting the tone for the electoral contests still to come. Which states were a-twitter on Twitter? Back to our original question: Which states tweeted the most about the candidates during the first two electoral contests? To capture this, we examined all tweets mentioning the candidates in the Twitter Sample Stream and used Followerwonk's location resolution algorithm to determine which US states were most represented in users' Twitter bios. We then normalized results based on state population size. It's worth noting that we used the locations from Twitter bios, which cannot always be resolved accurately. That said, we think it paints an interesting picture. Top states tweeting during the Iowa caucus Top states tweeting during the New Hampshire primary Not surprisingly, you’ll see that the US capital, Washington, DC, is a hotbed of political activity on Twitter, ranking as the #1 location for tweets mentioning candidates during both the Iowa Caucus and New Hampshire primary. Other states with highly active political tweeters include Nevada, Iowa (which appeared on every candidate’s top 10 list for the Iowa Caucus), New Hampshire, and New York, which appeared on every candidate’s top 10 list for the New Hampshire primary. Do political party patterns reflect voting patterns? When reviewing the most active states broken down by candidates, we wanted to see if the political party patterns reflected how citizens of those states voted in the most recent 2012 presidential election. In other words: in the early 2016 contests, did GOP candidates generally see the most activity from “red” states (traditionally Republican-voting) and Democratic candidates from “blue” states (traditionally Democratic-voting)? Sometimes yes and sometimes no. For Democratic candidates, the answer is generally yes: only one of Sanders’s top 10 states surrounding the Iowa Caucus (Montana) and the New Hampshire primary (Indiana) was a red state in 2012, and only two of Clinton’s top 10 states for the Iowa Caucus (Alaska and Indiana) and New Hampshire primary (Indiana and Tennessee) were red states in 2012. But for Republicans it was not as clear cut. Only two states (Alaska and South Carolina) on Rubio’s Iowa Caucus top 10 list, and only four states on both Trump’s list (Alaska, Idaho, North Dakota, South Carolina) and Kasich’s list (Nebraska, Louisiana, Arizona, and Oklahoma) were decidedly red states in 2012. In fact, Ted Cruz was the only candidate to net a majority of decidedly 2012 red states in his 2016 Iowa Caucus top 10 list. Results from the New Hampshire primary were fairly similar, although this time around both Trump and Cruz netted 50 percent decidedly red states on their top 10 lists, while Rubio and Kasich had closer to 30 percent decidedly red states on their lists. So why the skew in data? We suspect it’s likely due to the fact that Twitter’s overall user base tends to have more liberal leanings; data suggests more Twitter users identify as Democrats than Republicans. Is a Twitter bio worth a thousand words? If a picture is worth a thousand words, we wanted to create pictures of who follows each candidate. So we generated word clouds based on the most frequently used one-word and two-word phrases in the Twitter bios of each candidate’s followers. For the GOP candidates, some commonalities and divergences exist. For example, everyone has the word “love” as the #1 word used in their followers’ Twitter bios, but only Trump's does not have “conservative” as a close second. In fact, “conservative” does not appear anywhere in Trump’s one-word follower word cloud. And while “business” appears in every GOP candidate's one-word follower word clouds, only for Trump does it rank in the top five. Trump one-word bio word cloud Cruz one-word bio word cloud Rubio one-word bio word cloud Kasich one-word bio word cloud Then there’s the prominence of religious words in the bios of people following GOP candidates. For Cruz and Rubio, the word “God” comes in at #5 and #7, and “Christian” at #7 and #9, respectively. According to Iowa Caucus entrance polls, 64 percent of Republican caucus-goers were evangelical Christians, which may help explain Cruz’s first-place finish and Rubio’s better-than-expected third-place finish in nation’s first presidential electoral contest of 2016. Out of all of the top six presidential candidates, only Kasich’s one-word bio word cloud features the name of a state (Ohio, the state of which he is governor). This suggests that, prior to his New Hampshire primary second-place finish, many of his followers may have been from Ohio. Now that he's made more of a splash on the national stage, this may change as he gains more followers from around the country. When we looked at two-word bio clouds, we found both the expected and unexpected. For instance, the words “real estate” ranked in the top two phrases for (not surprisingly) Trump, but also for Hillary Clinton and John Kasich, which we didn't expect to be featured so prominently. Trump two-word bio word cloud Clinton two-word bio word cloud Kasich two-word bio word cloud Bernie Sanders’ two-word bio cloud boasts a number of phrases one might associate with a more youthful follower base, including “video games,” “pop culture,” “grad student,” “state university,” and “college student.” Voting data suggests Sanders’ Twitter followers reflect those supporting him electorally: according to both Iowa Caucus and New Hampshire primary exit polls, a whopping 84 percent of Democrats under the age of 30 voted for Sanders. It’s also worth noting that Sanders’s two-word bio cloud was the only one to feature the candidate’s name, suggesting that his followers are sufficiently interested in him to place his name in their own Twitter bio. Sanders two-word bio word cloud How candidates tweet: Retweets vs. original content For most candidates (Clinton, Kasich, Rubio, and Sanders), around 30 percent of their total tweets are actually retweets. Ted Cruz, however, is an enthusiastic retweeter: at 65.5 percent, the majority of his tweets are retweets. Donald Trump is on the other end of the spectrum, preferring to generate original content: his retweet percentage is only 5.5 percent. Battle of the sexes What insights can we glean from the gender breakdown of each candidate’s followers? Turns out, nothing too revolutionary. Followerwonk’s gender ratio analysis produced results falling roughly in line with what one would expect from the demographic breakdown of the larger Republican and Democratic electorates. The Pew Research Center has found that, in the American electorate as a whole, women lean Democratic by 52 percent vs. 36 percent Republican, while men are roughly evenly divided at 44 percent Democratic, 43 percent Republican. In Followerwonk’s gender analysis, we uncovered similar findings: the followers of the Republican candidates tended to skew more male (anywhere from 62–68 percent of gender-determined followers), while the followers of the Democratic candidates were more evenly divided between men and women (women made up 48–52 percent of gender-determined followers). As Twitter’s overall user base has a greater percentage of men, this aligns closely with the Pew results. It should be noted that a significant proportion of each candidate’s follower base falls under “undetermined” — that is, Followerwonk is unable to determine their gender — but the results are still illuminating. For instance, Clinton is the only candidate with a larger percentage of female followers. Gender breakdown of Trump followers Gender breakdown of Rubio followers Gender breakdown of Cruz followers Gender breakdown of Kasich followers Gender breakdown of Sanders followers Gender breakdown of Clinton followers It’s all in the timing Most candidates received the bumps in followership you would expect from greater visibility that comes with the debates and the Iowa Caucus: Democratic candidates saw a spike in new followers around January 17 and February 4 (the most recent Democratic debates), whereas Republican candidates saw similar spikes around January 28 and February 6 (the most recent Republican debates). Additionally, all candidates increased their follower base around February 1, 2016: the Iowa Caucus (and, generally to a lesser extent, the New Hampshire primary on February 9). Sometimes candidates saw spikes when the opposite party debated, such as Hillary Clinton, who experienced a modest uptick (14,050 new followers) around the Republican debate on January 28. Clinton follower change chart While Sanders hasn’t, on the whole, been gaining as many new followers as Clinton on a daily basis, his spikes on the dates of the Democratic debates, the Iowa Caucus, and the New Hampshire primary were much higher: 23,647 to Clinton’s 16,979 for the January 17 Democratic debate, 25,544 to Clinton’s 9,341 for the February 4 Democratic debate, 30,592 to Clinton’s 16,613 on the Iowa Caucus, and 17,529 to Clinton’s 11,396 for the New Hampshire primary. This may be because, while most people are already familiar with Clinton, more are finding out about Sanders during these major events. Sanders follower change chart If you thought people on Twitter would be turned off by a candidate eschewing a debate, you'd be mistaken. In fact, Trump saw a significant jump in followers (41,948) immediately following his announcement that he would not participate in the January 28, 2016 GOP presidential debate hosted by FOX News. Indeed, while Cruz and Rubio (the two largest competitors to Trump during the Iowa Caucus) saw their largest increases in new followers after that contest, Trump’s largest increase was around the date of the Republican debate he did not attend. Even his smallest recent bump in followers for the February 6 Republican debate (17,768 new followers), however, was still larger than either Cruz’s or Rubio’s largest spikes for the Iowa Caucus (11,599 and 17,342 respectively). Prior to the New Hampshire primary, Kasich’s largest bump in new followers occurred after the February 6 debate. Kasich’s biggest spike ever, however, came following his second place finish in the New Hampshire primary: in the day leading up to, of, and following the primary, he’s had a nearly 4.5 percent net increase in followers. Compare that to Cruz and Rubio (finishing 3rd and 5th respectively), who both experienced a less than 1 percent increase in followership during the same period. Trump, as the first place finisher, saw his biggest follower increase since the January 28 Republican debate, gaining more than 35,000 new followers. Trump follower change chart Rubio follower change chart Cruz follower change chart Kasich follower change chart What’s next? If you enjoy nerding out on this data as much as we do, check back with the Moz Blog between now and the general election in November, where we’ll regularly report on more of our analysis and findings. You can also follow Followerwonk on Twitter, where we’ll share interesting nuggets and stats we uncover along the way. In the meantime, let us know any interesting trends you’re seeing with political candidates and issues on Twitter. Maybe you’re using Followerwonk or other social media analysis tools to track candidates for local office in your hometown or to keep a pulse on hot political elections and referendums internationally. Feel free to share your insights in the comments — we’d love to hear about them! Special shout out to Marc Mims, whose mad developer skillz brought us all this juicy data, and to Angela Cherry, whose obsession with politics meant she couldn’t resist co-authoring this post. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Can Twitter Teach You about the Top 6 US Presidential Candidates?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Can Twitter Teach You about the Top 6 US Presidential Candidates?"
    },
    {
      "level": "H2",
      "text": "Top states getting their political tweets on"
    },
    {
      "level": "H3",
      "text": "So, what's the big deal with Iowa and New Hampshire?"
    },
    {
      "level": "H3",
      "text": "Which states were a-twitter on Twitter?"
    },
    {
      "level": "H2",
      "text": "Do political party patterns reflect voting patterns?"
    },
    {
      "level": "H2",
      "text": "Is a Twitter bio worth a thousand words?"
    },
    {
      "level": "H2",
      "text": "How candidates tweet: Retweets vs. original content"
    },
    {
      "level": "H2",
      "text": "Battle of the sexes"
    },
    {
      "level": "H2",
      "text": "It’s all in the timing"
    },
    {
      "level": "H2",
      "text": "What’s next?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ann Boyles\n          \n            Ann Boyles\n          \n            Ann Boyles"
}