{
  "url": "https://moz.com/blog/two-cents-on-personalized-search",
  "slug": "two-cents-on-personalized-search",
  "title": "Two Cents on Personalized Search - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Have you paid any attention to personalized search yet?  If you stay logged into one of your Google accounts such as Gmail, your search history will start to accumulate.  As your history grows Google starts to modify the SERPs that they send you in ways that they think will be more pleasing.  \n\nI…",
  "content": "Two Cents on Personalized Search Search Engines E By: EGOL February 5, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL February 5, 2007 Two Cents on Personalized Search Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Have you paid any attention to personalized search yet? If you stay logged into one of your Google accounts such as Gmail, your search history will start to accumulate. As your history grows Google starts to modify the SERPs that they send you in ways that they think will be more pleasing. I first noticed this a few days ago when Google seemed to know which site belonged to me in the SERPs. When I searched for my main keyword I could see [homepage] in the SERPs right below my URL. When I clicked on the homepage it took me to a page that displayed my search history... whoa! It was a little bit if a surprise. Also, if I query for \"personalized search\" and click the number 1 result (with a title tag of \"Google Search History\") it also takes me to a page that displays my search history. This search history page has a long list of my search terms, separated into queries where I have clicked a result and queries that I did not click a result. In addition it has a small calendar that I can click and see what I have searched on any day back to January 22nd. Before I understood what was going on I watched my sites climb higher and higher in the SERPs. I thought that I was getting kickass rankings! But it was simply the personalization and Google figuring out what kind of sites that I like. It was like the woman who authored a book and visited the page where it was sold on Amazon... pretty soon she was telling everyone that her book was featured on the Amazon homepage - but they could not see it... lol This is just a warning that you should not order that new Porche if you see your site climbing the SERPs. It could be personalized search playing a trick on you. Once you have accumulated a search history you can check how much it influences your SERPs by doing a search while logged into your Google account, logging out and then doing the same search. Bam! Immediately different. Now you see what every Joe Schmoe gets who does not log in to a Google account. I've heard lots of people complaining about the personalized search being bad for SEOs. My two cents on this is that it is a good thing. Why? Because it adds some diversity to the SERPs and gives your sites a chance to rank higher when Mrs. A searchs than it otherwise would rank. This should build a little diversity into your rankings portfolio. Diversity in your income stream is not a bad thing. And, if you are doing something really right, then your site might rank number 1 for everybody - no matter if their results are personalized or not. I know that this new feature will bring out a diversity of opinions. I'd really enjoy hearing what you think. If you have not experimented with it, you might want to check it out - it's might have an impact on your bottom line. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Two Cents on Personalized Search"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Two Cents on Personalized Search"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}