{
  "url": "https://moz.com/blog/two-conflicting-judicial-opinions-on-using-a-competitors-trademark-in-metatags",
  "slug": "two-conflicting-judicial-opinions-on-using-a-competitors-trademark-in-metatags",
  "title": "Two Conflicting Judicial Opinions on Using a Competitor's Trademark in Metatags - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Both cases involve using a competitor's trademark for advertising purposes. However, they represent fundamentally different understandings about how metatags work and the effect, if any, they have on the consumer.\n\nBecause the value of using keywords in metatags for ranking purposes is minimal at…",
  "content": "Two Conflicting Judicial Opinions on Using a Competitor's Trademark in Metatags E-Commerce SEO By: Sarah Bird May 12, 2008 Table of Contents Copied! By: Sarah Bird May 12, 2008 Two Conflicting Judicial Opinions on Using a Competitor's Trademark in Metatags E-Commerce SEO May It Please the Mozzers, Today we're going to contrast two recent judicial opinions on the use of a competitor's trademark in meta-tags. Same issues, different outcomes. Let's take a very brief look at each case. North American Medical Corp. v Axiom 2008 WL 918411 (11th Cir. April 7, 2008) The two companies involved in this suit make spinal decompression devices. Allegedly, Axiom used North American Medical's trademark in its metatags and not in the body of the site. We don't know what kind of metatags (title? keyword? description?) were used. The Court found that Axiom used the trademark in metatags to \"influence Internet search engines.\" \"For instance,\" the Court states, evidence in this case indicated that, before Axiom removed these metatags from its website, if a computer user entered the trademarked terms into Google's Internet search engine, Google listed Axiom's website as the second most relevant search result. In addition Google provided the searcher with a brief description of Axiom's website, and the description included these terms and highlighted them. Accordingly, the 11th Circuit Court of Appeals ruled that this was trademark infringement because using a trademark in metatags to influence engines was a \"use in commerce\" and likely to cause consumer confusion. Standard Process, Inc. v. Banks 2008 WL 1805374 (E.D. Wis. April 18, 2008) Standard Process creates dietary supplements. They are suing a doctor for including Standard Process trademarks in metatags. We don't know what kind of metatags are involved in this case either. However, unlike the appeals court ruling in Axiom, this Judge found that \"today 'modern search engines make little if any use of metatags.....' As more and more webmasters 'manipulated their keyword metatags to provide suboptimal keyword associations, search engines progressively realized that keyword metatags were a poor indicator of relevancy.' Accordingly, search engines today primarily use algorithms that rank a website by the number of other sites that link or point to it.\" Since search engines don't use metatags, the 7th Circuit District Court ruled that the use of a competitor's trademark in a metatag is not \"a use in commerce.\" Both cases involve using a competitor's trademark for advertising purposes. However, they represent fundamentally different understandings about how metatags work and the effect, if any, they have on the consumer. Because the value of using keywords metatags for ranking purposes is nonexistant you could respond to both of these cases with a resounding, \"So what?\" Why do we care if you can or can't use a competitor's mark in keyword metatags since that is not a viable SEO strategy? There are three reasons we care about these cases: (1) While some metatags arent' valuable for rankings, others are very useful. Unfortunately, we don't know what metatags are at issue here. SEO/Ms need to be cautious when using competitor's trademarks to lure clicks. Given the conflicting state of the law, there is risk involved in doing so. (2) The cases also demonstrate the varying levels of technological sophistication within the legal field. Lawyers and judges are not differentiating between the kinds of metatags, even though this impacts the visibility of the mark and therefore the likelihood of consumer confusion. (2) These cases may provide insight into how the courts will approach other keyword-triggered advertising issues, such as search engine liability for Adwords, Adsense, and aggressive/abusive SEM (such as trademarked-stuffed \"review sites\"). In short, we can look forward to many conflicting, poorly conceived rulings with the occasional beacon of clarity. Attorneys will make out very well. I'm not sure I can say the same for the engines and internet marketers. Good luck guys! Best Regards, Sarah Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Two Conflicting Judicial Opinions on Using a Competitor's Trademark in Metatags"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Two Conflicting Judicial Opinions on Using a Competitor's Trademark in Metatags"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}