{
  "url": "https://moz.com/blog/two-great-pieces-from-slate-one-on-the-long-tail-the-other-linkbait",
  "slug": "two-great-pieces-from-slate-one-on-the-long-tail-the-other-linkbait",
  "title": "Two Great Pieces from Slate; One on the Long Tail, the Other - Linkbait - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Slate's begging for two blog entries with their content today, but I'm going to put both subject in one to help conserve space. Besides, they really don't need link love from the SEOmoz's of the world .\nThe first piece is a review of ...",
  "content": "Two Great Pieces from Slate; One on the Long Tail, the Other - Linkbait User Experience (UX) By: Rand Fishkin July 25, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 25, 2006 Two Great Pieces from Slate; One on the Long Tail, the Other - Linkbait User Experience (UX) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Slate's begging for two blog entries with their content today, but I'm going to put both subject in one to help conserve space. Besides, they really don't need link love from the SEOmoz's of the world . The first piece is a review of Chris Anderson's new book, The Long Tail, which has, in the tech industry, received generally favorable and several exceptional reviews. Slate's take is unique - they like the book, but panned Anderson's attempts to universalize the concept: This insight goes only so far, but like many business books, The Long Tail commits the sin of overreaching. The tagline on the book's cover reads, \"Why the Future of Business Is Selling Less of More,\" which is certainly wrong or at least exaggerated. Inside we learn about \"the Long Tail of Everything.\" Anderson's book, unlike his original Wired article, threatens to turn a great theory of inventory economics into a bad theory of life and the universe. He writes that \"there are now Long Tail markets practically everywhere you look,\" calling offshoring the \"Long Tail of labor,\" and online universities \"the Long Tail of education.\" He quotes approvingly an analysis that claims, improbably, that there's a \"Long Tail of national security\" in which al-Qaida is a \"supercharged niche supplier.\" At times, the Long Tail becomes the proverbial theory hammer looking for nails to pound. Tim Wu, the author, is a very skilled writer, but I'm not sure I entirely agree with his perspective. Anderson's theory can be overapplied and may well be in the book, but the examples he uses are not so compelling as to rush to judgement. Perhaps when I actually read the book, I'll find myself on Tim's side, but I feel that even without background, it's nice to hear something besides unmitigated praise for the Long Tail theory. Unlike \"Web2.0,\" it rarely is reviewed critically. The second piece worth a look is an interactive feature made in Flash called \"The Middle East Buddy List.\" It's not technically linkbait because it wasn't designed to target a demographic for natural link building and branding attention. However, it's fascinating because the type of content used and the presentation are something I, personally, hadn't considered until seeing this - and thus, haven't shared before. The chart works well graphically and it's much more practical and interesting than an article spelling out the relationships. Kudos to the staff at Slate for making use of this system. With a Google Maps underlay and AJAX instead of Flash, this would be on top of Slashdot, Digg, Wired News and the rest... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Two Great Pieces from Slate; One on the Long Tail, the Other - Linkbait"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Two Great Pieces from Slate; One on the Long Tail, the Other - Linkbait"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Unlock Your B2B SEO Content with Structured Resource Sections"
    },
    {
      "level": "H3",
      "text": "The ROI of Accessibility in SEO"
    },
    {
      "level": "H3",
      "text": "How SEOs and UX Designers Can Work Better Together — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}