{
  "url": "https://moz.com/blog/two-simple-quick-social-media-tips",
  "slug": "two-simple-quick-social-media-tips",
  "title": "Two Quick, Simple Social Media Tips - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today, I want to share two pieces of advice that are particularly useful to certain types of business - and will be exceptionally quick to implement. I've also created a free download that might help some people implement one of these ideas even more quickly.",
  "content": "Two Quick, Simple Social Media Tips Social Media By: Rob Ousbey September 6, 2010 Table of Contents Copied! By: Rob Ousbey September 6, 2010 Two Quick, Simple Social Media Tips Social Media Today, I want to share two pieces of advice that are particularly useful to certain types of business - and will be exceptionally quick to implement. I've also created a free download that might help some people implement one of these ideas even more quickly. About two years ago, I made a recommendation to a client in the UK, and I've just seen it used by a hotel in the USA. If your business offers public computers with internet access - such as those in hotel lobbies, libraries, etc - this is for you: Tip 1: Put up a sign, next to your public computers, with a call to action; typically this could be something like 'Find us on Facebook' or 'Follow us on Twitter'.Here's such a poster in use, at the Ledgestone Hotel in Yakima. (Click the image to embiggen.)Sadly, it doesn't look like the Ledgestone is doing much with their Twitter account; this probably disappoints people who go to their page, and so they don't end up with as many followers as they could do. Remember - getting people to your Twitter page (or Facebook, or whatever else you're asking them to do) is only the first stage - there has to be something there for them when they arrive.The second tip is more for people who offer wi-fi - this could be all manner of hotels, conference venues, airports, aeroplanes, train stations, coffee shops, etc. For places that offer free wi-fi, this can work even better:Tip 2: You control the first page visitors see after logging on to your wi-fi. Don't waste this with a dull message; make the page interesting, and put some calls to action on there.People have probably logged on to do something - but many will welcome a distraction - particularly if you keep the request brief. Create a nicely styled, but simple page, and add a couple of message on there. Some examples could include:Follow us on Twitter / Like us on Facebook: you could incentivize this, for example: if you're a coffee shop, then offer a free latte to new followersSign up to our email newsletter: this will only take them a second if you make sure the form is right there on the page, and again this can be incentivizedDon't forget to check in on foursquare: ideal for almost any location, and this is as good a time as any to remind them to check inIf you're enjoying your stay, please review us: particularly useful for hotels, where online reviews can increase visibility; I'll go into a little more detail about this below.There can be some issues with sites noticing that a lot of people from the same IP are visiting, particularly when it comes to review services. Local search expert David Mihm advised me that he's heard Yelp in particular does try to filter our multiple reviews from the same IP, and that TripAdvisor's fraud rules do include clauses that might get you into trouble (such as offering incentives for people to write reviews is not permitted.)I'd recommend that there are two steps around this type of issue:Try to appeal for reviews only from people who already have accounts on those sites (e.g.: \"If you're a Yelp member, please review us here....\" or \"If you have a Google account, please leave a review here...\"Make this 'post-wifi-login' page available on the public internet; review sites should be able to recognize that lots of people are being referred to your page from the same URL - if it's public then they'll be able to visit that page, and should figure out what is going on.I've built a quick free template for you to to download as a starting point. You can visit the file, or download it, by clicking this link: free wifi login CTA page.(That was created based on a template from LayoutGala; I'm not going to add any licence to it, other than use it however you want. You should change the image that are in it to be local files at the very least.)Honestly, it doesn't take long to print off a couple of small posters (or even to publish a nice wifi login page) so I'll hope to see social-media CTAs cropping up all over the place soon. :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Two Quick, Simple Social Media Tips"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Two Quick, Simple Social Media Tips"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rob Ousbey\n          \n            Rob Ousbey"
}