{
  "url": "https://moz.com/blog/tying-topical-events-into-your-sites-link-building-strategies",
  "slug": "tying-topical-events-into-your-sites-link-building-strategies",
  "title": "Tying Topical Events into Your Site's Link Building Strategies - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "VanessaH, an SEOmoz member who does SEO work for PlumberSurplus.com, recently contacted me about an interesting link bait campaign her company is attempting. Basically, the SEOs over at Plumber Surplus are trying to build more links to the site and hopefully bump the Page Rank up from a 5 to a 6.…",
  "content": "Tying Topical Events into Your Site's Link Building Strategies Link Building By: Rebecca Kelley July 18, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley July 18, 2008 Tying Topical Events into Your Site's Link Building Strategies Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. VanessaH, an SEOmoz member who does SEO work for PlumberSurplus.com, recently contacted me about an interesting link bait campaign her company is attempting. Basically, the SEOs over at Plumber Surplus are trying to build more links to the site and hopefully bump the Page Rank up from a 5 to a 6. They had been trying various methods and campaigns and were brainstorming additional ways to attract more links. By happenstance, the site/property group owner, Tim, who is a staunch Republican, made a t-shirt on a whim that said \"Don't Trust This Man\" and had an arrow pointing to a picture of Barack Obama. He wore the shirt out to lunch one day and got a large response from both Democrats and Republicans alike. Being the diligent marketers that they are, Tim's team immediately started thinking of ways they could channel this buzz into their Plumber Surplus marketing tactics. The result? Don'tTrustThisMan.com, a site aimed at both conservatives and liberals. The gist of the site is that if you write a blog post about either PlumberSurplus.com or OutdoorPros.com, one of their other properties, you'll be entered in a daily contest to win a t-shirt of your choice (either a pro-Obama or a pro-McCain shirt). The site gives suggestions on what you could blog about if you don't have the creative juices flowing, and it posts some rules to adhere to in order to make sure the links are spiderable (e.g., \"must not be behind a login\") and to make sure that Don'tTrustThisMan won't get penalized by Google (\"must adhere to Google's Webmaster Guidelines\"). The site also offers some badges you can display on your site, blog, MySpace page, et al: I think the badges are extremely clever, as both Liberals and Conservatives who are passionate about the upcoming elections are likely to display these images in order to share their political opinion and show everyone who they're supporting. The only snag is that the badge image points to Don'tTrustThisMan, which in turn encourages users to promote two entirely separate websites, so it's a bit of a roundabout way to try and build links. It's unfortunate that the badges are too off-topic to host directly at Plumber Surplus. I think this link bait campaign is both brilliant and problematic. The pros are that it takes advantage of a current hot topic, one that's generating constant buzz and attention: the upcoming presidential elections. I think that \"Don't Trust This Man\" is an extremely clever concept--it's definitely attention grabbing, and it both sparks curiosity in the uninformed user and is controversial to a politically-savvy user. Best of both worlds, I'd say. Now for the cons. As I mentioned before, the topicality of the link bait is weak. Using a political agenda to promote plumbing merchandise may be questionable in the search engines' eyes. Additionally, I wonder about the relevancy and topicality of the links that Plumber Surplus will attract from these various blog posts. They likely won't be from other home improvement stores or wholesalers, but rather from regular folks with personal blogs or websites or from political sources. Thus, will the links hold much weight since they won't be on-topic? Lastly, the rules don't even explicitly state that you have to link to Plumber Surplus or the other site at all. I'd assume that a good chunk of the folks who'll blog in order to win a free t-shirt will mention the site but won't link to it, and the ones who do will probably just use the domain name as the anchor text, meaning Plumber Surplus isn't really building a large number of optimized links. It seems like a missed opportunity. That being said, Vanessa has informed me that the contest is now live and that they're more than happy to share their data and findings with us here at SEOmoz once their experiment has run its course. We'll see if this campaign is a success or a failure. Either way, it's bound to be a fascinating case study and is sure to make for an interesting analysis. What do you think of the link bait campaign? Do you have any suggestions on how they could improve their efforts? Have any of you tried a similar strategy--if so, what was the result? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tying Topical Events into Your Site's Link Building Strategies"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tying Topical Events into Your Site's Link Building Strategies"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}