{
  "url": "https://moz.com/blog/tyler-shears-on-finance-seo-smm-personas-and-smx",
  "slug": "tyler-shears-on-finance-seo-smm-personas-and-smx",
  "title": "Tyler Shears on Finance SEO, SMM, Personas, and SMX - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tyler Shears is a bright search marketer working at Databanq, which specializes in the financial services game. We met at SMX West after my local panel (on which note you should read this fresh, enlightening and generally awesome interview with Brian Gil, of Yaho...",
  "content": "Tyler Shears on Finance SEO, SMM, Personas, and SMX Public Relations By: Gabriel Goldenberg April 4, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Gabriel Goldenberg April 4, 2008 Tyler Shears on Finance SEO, SMM, Personas, and SMX Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Tyler Shears is a bright search marketer working at Databanq, which specializes in the financial services game. We met at SMX West after my local panel (on which note you should read this fresh, enlightening, and generally awesome interview with Brian Gil of Yahoo, who was a co-panelist), which was great because I don't often get to meet people in search who aren't really active in the blogosphere. Tyler and I did an interview by email, and he was kind enough to share insights on the hyper-competitive space that is financial services (which comprises credit cards, loans, mortgages, and any kind of financing/line of credit you can imagine). Enjoy :). (SEOmoz's Rand Fishkin and Databanq's Tyler Shears at SMX West 2008, by Tyler Shears.) 1) Tell us about yourself, how long you've been doing SEO, how you got into it (also feel free to pimp your sites for some links). I’ve been doing SEO for around 3 years now. It all begins with my first computer I suppose… 5 years old and a computer disassembled across the living room… angry mom. Besides the incredible ride I’ve been on in my past computer experience (IT Tech / Web Dev / Coding), I haven’t really found anything else that I’m as passionate about as search. I got into the actual search space when I was running my web development firm 3 years ago, primarily from watching the outsourced labor market and the rise in SEO labor there. It piqued my interest and re-captivated my attention to the web, which eventually was the demise of my web development firm and the start of my dedicated SEO career. I’ll be blogging more about this soon actually at http://www.gimmiethescoop.com 2) How is the financial services search space unique or different from others? It’s one of the most competitive spaces on the web, but its biggest influencing factor is the least computer savvy ones of all: OLD PEOPLE! The bigwigs at the FTC basically control your business model with rate cuts and financial epidemics (at least that’s what they convince us all into thinking.) Otherwise, it’s your typical competition and SEO principals into work. Social media is very difficult in this space though, so link building becomes a very tedious task at times. Widgets, widgets, widgets… 3) Tell us about some of the most abused tactics in finance right now? Paid links? lol. Considering it’s not finance specific, I’d have to say people using micro site generators to load up the vertical with spammy sites that somehow rank well, at least for a few weeks at a time until someone notices. Otherwise, if it’s not the Russian Mafia trying to spam your customers with fake payday loan offers, then it’s probably the content theft that makes this space extra-difficult to compete in. Once you rank, your content is free game and becomes a time-intensive task to maintain credibility in a crawler's eyes for the content you syndicated in the first place. 4) Does the financial blogosphere matter much in the larger rankings scheme for finance? What's the impact like, or where could it be felt in the next year/two? The financial blogosphere consists of [keywordhere].blogspot.com with poorly written or stolen content, usually syndicated from one of the big players. I think as Google cracks down in the next year this will become a more important factor to focus creative efforts and consumer-centric content towards… until then, spam wins. 5) Should an internet marketer be involved in all the social news/bookmarking sites? Why/why not? There’s a funny question that everyone answers differently. All of them? No. You should perform some low level market research and find out where your vertical performs the best and focus your efforts there. You’re better off picking a few of the big sites and saturating the niche-specific social sites instead. Sure, Digg will drive more traffic and hits, but are they actually going to convert or even take the time to write about you? Find your own Linkerati and make them the most important target to your business! 6) Give us your opinion on Wells Fargo's deep interest in social media and investment in Second Life, etc.? Well… the deep interest in social media has been on my radar for awhile, but I still don’t see magnificent results for them at this point. Second Life became a huge mess and probably in hindsight was a mistake to dive so deeply into. I don’t think launching their own version of a social world powered by Second Life is a viable solution, either. It will be an interesting story as it unfolds and may be a deciding factor for us moving more heavily into social media. 7) What's the next big thing for financial services promotion online outside of search? What steps can search marketers take to that end? I don’t feel there’s any real advancements being made outside of search in financial services any more than another category. Having a well rounded marketing team is essential in covering all of your bases, but I’m not sure I can give you any profound insight here. Just because the guy next to you doesn’t understand SEO doesn’t mean he’s not equally as valuable to the company in another respect. The best advice I can give is don’t get too absorbed in one area and always plant your eggs in a few different baskets. 8) We heard about personas at SMX West. Do your analytics bear out anything you can relate to that? Customer surveys, perhaps? How are you/will you use those in the next year? We’re in the midst of utilizing our analytics and gearing our user experience off behavioral analysis… it may not happen this quarter but hopefully by the end of the year we will be sending our surveys, widgets, and other juicy items across our network of sites. Personas are going to be one of the most crucial tools for us, due to being in the financial services niche. We have a very broad range of customers and each prefers a different type of form/application, etc… If you don’t focus on personas you could be really behind in a year or so. 9) There's been good talk about retargeting/remessaging, or the practice of showing ads to previous visitors to your site. Do you feel that the ROI on that is worth the opportunity cost of putting the dollars into, say, PPC, linkbait, community development, or hiring more analytics staff/buying analytics software? How do you measure and decide between the competing priorities in-house? I would group the re-marketing based on user status under the “personas” definition again. It’s not dominant yet, but in about 12 months you’ll be behind the ball if you’re not considering every possible ROI opportunity. The larger the web grows and the more competition that spawns, the further we will be forced to squeeze our customers as tight as possible. Measuring priorities in-house can be very tricky, though, and is largely dependent on the type of company you have. For us, it doesn’t make a lot of sense to focus on building social media profiles or managing overly-complex PPC campaigns when we can afford to outsource to experts in the field. Sometimes just letting an expert do it for you (who usually ends up becoming a long-term friend, anyway) pays off in more ways than the initial opportunity-cost measurement. 10) How did you learn SEO? I’ve spent far too many years / hours a day on the internet. After a few years exploring HTML and VisualBasic, I was hooked on detail-oriented computer tasks. This progressed through the rest of my life and I haven’t gotten up from the computer since. Self-taught SEO with a little help along the way. So far, so good. 11) Share the single most practical thing you learned at SMX, and how you're going to use it. Search marketers sure know how to drink! Hah. Besides that, the level of compassion shared by our community is absolutely amazing to me. I spoke to more people than I can count and everyone seemed to be genuinely enjoying themselves, even the conference regulars. The most practical lesson I learned is to remain relentlessly dedicated to what I’m doing, and never settle. We’ll see how that plays out for the next few years, then I’ll let you know how I used it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Tyler Shears on Finance SEO, SMM, Personas, and SMX"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Tyler Shears on Finance SEO, SMM, Personas, and SMX"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gabriel Goldenberg\n          \n            Gabriel Goldenberg\n          \n            Gabriel Goldenberg"
}