{
  "url": "https://moz.com/blog/uk-indexing-case-study",
  "slug": "uk-indexing-case-study",
  "title": "UK Indexing Case Study - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Optimizing a site for an overseas audience can be a daunting task. There are usually a number of barriers that make it more difficult than one would hope for. The barriers can come in the form of language or stipulations from the client, such as U.S. hosting that can't be changed or a…",
  "content": "UK Indexing Case Study Local SEO W By: westgate July 1, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! W By: westgate July 1, 2009 UK Indexing Case Study Local SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Optimizing a site for an overseas audience can be a daunting task. There are usually a number of barriers that make it more difficult than one would hope for. The barriers can come in the form of language or stipulations from the client, such as U.S. hosting that can't be changed or a non-geographical domain, like a .com or .org. A client that I am currently servicing asked me to optimize their site for a UK audience. The difficulty of this challenge was that it happened to be a dot com domain name that was hosted here in the U.S. Major search engines have a pretty easy time indexing your site to the correct international audience when you have the appropriate ccTLD (country code top level domain), but when location indicators are mixed, indexing can become much more difficult. This is especially true for search engines other than Google - Google allows you to indicate which audience you would like to target in your Webmaster Tools account (if you happen to have one associated with the site). Below I’ve outlined some of the steps I’ve taken to gain indexing in UK search engines with an international domain (.com) and U.S. hosting. When I started, the site was not indexed in any UK search engines – even Google UK. Instead, it was indexed for U.S. search queries. Step 1) Webmaster Tools There is an option in Google’s Webmaster Tool’s that allows you to choose which country's search results you would like to target. Go to Site configuration > Settings and choose the geographic target you’d like to be associated with. Yahoo! and MSN should have similar tools to this, but they don’t. This step alone made it clear to Google which audience I was targeting and within a few days the site could be found in Google UK search results. I needed to take additional steps, however, to make this point clear to other search engines. Step 2) Address My next step was making it clear that there was a physical location of the business in the UK. Of course, some Web sites do not have a physical business address, which would add a degree of difficulty. Luckily for me, there was an address that I could take advantage of. The address was stated in the footer, but to make it even more obvious, I placed it in an HTML address tag. I also visited local UK search engine centers to make sure the company was listed there. Step 3) Home page title tag In this step I added ‘in the UK’ to the homepage title tag and mentioned the term ‘UK’ a few times throughout the copy. In all honesty, I’m not sure if this has had any effect at all. It was an attempt to further influence Yahoo! and MSN that I was targeting the UK. Simply adding this term to the site will not get you indexed in the UK, but I figured that when coupled with other factors it might have some benefit. I plan to remove the term from the title tag once I am indexed in all major UK search engines, however, I have still failed to be indexed in any of the UK versions of MSN, Live or Bing. To expand on this point, I contacted MSN to inquire about getting my site indexed in the UK version of their engine. Their reply was prompt, but did not answer my question. It went as follows: Form submission: I want my site indexed in UK results, however it is only indexed in US results. I know the website does not have a .co.uk extension, but the business is physically located in the UK and the address is on the site. I've managed to get it to work in other engines, but have been unsuccessful in getting it to work in MSN or Bing. How do you suggest I fix this aside from changing the domain name or server location? Thanks. Response: Hello Jeff, Thank you for writing to Bing Technical Support. This is Luis and I understand that you want your website indexed in the United Kingdom. I know how important this is to you and I look forward to assisting you today. Jeff, you might host your site in a different location than your target market. When your site is located in a different market, your site may rank higher in your local market's search results, and rank much lower in your target market's search results. Windows Live use information such as the website's IP address and the country code top-level domain to determine a website's market and country. You can alter this information to reflect the market that you want to target. We appreciate your continued support as we strive to provide you with the highest quality service available. Thank you for using Bing. Sincerely, LuisBing Technical Support Current status of my client’s site As of this post, I am happy to say that the site ranks well for many competitive terms in both Google UK and Yahoo! UK. Unfortunately, I still haven’t found a way to change the geographic target audience in MSN search engines. If MSN would put more effort into their webmaster tools, they could simply have a page where you could control this – like Google does. Unfortunately, their lack of developer tools gives me limited options for indexing my client's site which has the barriers of a dot com domain and hosting outside of the target country. In a perfect world, I would use a .co.uk domain extension, but if you work with clients, you know that there are limits, no matter how important a factor may be. Have you had similar encounters or do you have any suggestions for cracking into Bing’s UK results? Jeff Swanson is a Site and Search Optimization Specialist at Movéo Integrated Branding Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "UK Indexing Case Study"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "UK Indexing Case Study"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "westgate\n          \n            westgate"
}