{
  "url": "https://moz.com/blog/ultimate-moment-of-truth-moving-toward-shared-experiences",
  "slug": "ultimate-moment-of-truth-moving-toward-shared-experiences",
  "title": "Your New Sales Cycle: Optimizing for the Ultimate Moment of Truth - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There are many apparent \"moments of truth\" in a sales cycle—those important moments when customers decide to take action. As SEO blends more and more into experience design, content marketing, and social networks, one moment becomes increasingly important: the ultimate moment of truth.",
  "content": "Your New Sales Cycle: Optimizing for the Ultimate Moment of Truth Community Management By: Brian Solis October 1, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Brian Solis October 1, 2013 Your New Sales Cycle: Optimizing for the Ultimate Moment of Truth Community Management The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Search is a natural step in the discovery process. In a web-based world, search engines offer a lens into a qualified and structured view to help online consumers focus and make informed decisions. With Google dominating search, marketers concentrated on improving search ranking through tried and true techniques to ensure that what they were marketing earned a coveted position in the likely search results a customer might consider clicking. Search is only part of the story now. The experiences that people have, and in turn share, have created a powerful collective repository that is indexed and tapped every minute of every day—mostly outside of Google. The importance of search engine marketing is fundamental to the discovery process. And, this is a world that still thrives today even though popular conversations among businesses and marketers center on social and mobile media as the \"next big thing.\" There's notable truth in the hype surrounding social and mobile of course. With over one billion users, for example, many tout Facebook as its own Internet. And with Graph Search now available, a new era of interest and relationship-based content optimization will become a reality for the majority of its users. This isn't a debate about the merits of SEO versus social media optimization (SMO), nor is this a discussion about social media. This is a discussion about behavior and the importance of discovery among an increasingly connected customer and the need to optimize and unite their journeys, whether it's on the traditional web, in social networks, or via mobile. The zero moment of truth (ZMOT) In 2011, Google released an ebook written by Jim Lecinski, Winning in the Zero Moment of Truth. The premise of the book introduces us to instances when shopping decisions break down into a series of moments of truth, each requiring a special understanding to help nudge customers along their journey. For example, when a customer is considering a purchase, whether driven by a stimulus or need, in the zero moment of truth customers are essentially going to \"Google it.\" Anyone involved in the art and science of search wins in this moment by ensuring that web pages are optimized to outperform competitive pages as people search. Without awareness, there can be no consideration. What happens, though, when your customers naturally start their discovery process in communities other than Google or traditional search? Trust This is an important question, as the pervasiveness of social and mobile media is conditioning a new generation of connected consumers to rely on their networks of relevance, not just search engines, as an alternative and efficient means of guiding decision-making. Think about it for a moment. Study after study shows that everyday consumers trust others like them. They don't trust executives. They don't trust ads. But, they do trust peers. Global marketing agency Edelman also revealed in its annual Trust Barometer, that customers trust employees of companies. Why is that a significant finding? When people are searching for information in a social ecosystem, they wish to find qualified information that informs and guides them quickly and efficiently. Landing pages are just the beginning. Employees-as-experts are also part of the content and discovery equation, allowing customers to find answers that help rather than sell. This is just the beginning. The future of search is tied to the experiences shared by your employees and your customers across the web, social networks, communities, and mobile apps. If you think about traditional search for a moment, what comes back as someone types in a keyword or question into the search bar? That's right, websites. And websites are often the last thing a connected customer is looking for in a moment when trusted impressions and experiences outweigh pages ranked by inbound links and keywords. After all, many of these connected customers are mobile, and as a result are looking for content that's organic to the context of their state of mind and the device they're using in each moment of truth. In the zero moment of truth it is shared experiences—those that are passed on through social networks, communities, and apps—that serve as the ultimate PageRank. In addition to promoting designated landing pages, how do you optimize experiences to be shared and also appear in each moment of truth? What's beyond the zero moment of truth? You've all heard the stat shared by search and social media experts that YouTube is the second largest search engine. Many skeptics will of course argue that YouTube is merely a network for funny cat videos, wannabe celebrities, movie trailers, and music videos. But you and I know that YouTube is indeed a notable alternative to Google for processing more search queries than any other search engine. Connected customers don't just seek information, they're searching for input, validation, and direction in a way that they can appreciate and use. This isn't a surprise. As consumers, we too have searched on YouTube for content to help us accomplish tasks, learn, or conduct research. We're not alone in the hunt for product-related videos to see them in action and also gauge the impressions of others. YouTube becomes a search engine not for web pages but for shared experiences. It's a good thing Google also owns YouTube. According to a research study published by Ask Your Target Market in Q3 2012, 95% of consumers use both YouTube and Google when searching for relevant content. And it's not just YouTube either; connected customers are fragmenting search through every social network, community, forum, and app where shared experiences become a currency in decision-making. Shared experiences become a critical part of marketing, as discussions around them contribute to a more conversational approach to branding and decision-making among digital consumers. Google's new Hummingbird search algorithm further demonstrates the significance of shared experiences by building them into search results. In a conversational web, people are asking questions rather than plugging in keywords. This changes everything from SEO to tracking search behavior and corresponding results, learning how to spark the creation and exchange of experiences in order to guide a connected and informed customer journey. We now need to optimize search results for shared experiences in every network that's significant to our connected customers. The ultimate moment of truth (UMOT) Our work starts with uncovering what comes back about our brand when we use keywords or questions, as our customers do, to search each network. The zero moment of truth is matched in significance by the ultimate moment of truth, a critical bookend to search introduced in my recent book, What's the Future of Business (WTF). The ultimate moment of truth represents the future of discoverability, branding, and influence, and it is directly tied to the zero moment of truth. The UMOT signifies the instant when a customer creates content based on an experience with your product or service and publishes it in their community or network of preference for others to find. The intention of doing so is a combination of self expression and the desire to inform others. This experience then becomes discoverable for anyone who searches each network. And in many cases, these experiences also populate Google's search results. Said another way, the Ultimate Moment of Truth becomes the next person's zero moment of truth. Every day, customers are sharing experiences in the form of videos, blog posts, reviews, Tweets, status updates, etc. This content doesn't self-destruct like SnapChat images. Shared experiences build upon one another, forming a collective repository in the cloud that's indexable, searchable, and influential. SEO, branding, and sales compete with this content and at some point, without address and optimization, shared experiences can eclipse traditional marketing no matter how creative or aggressive. Without defining and promoting desired shared experiences, businesses will become victim to whatever people create and share. Optimizing shared experiences Social and mobile bring to light the importance of shared experiences and why organizations must first design them rather than just react. Certainly great experiences start with vision and purpose enlivened by the product or service design and its intentions. For marketers who may have little or no control over business affairs, the ability to shape and steer experiences is made possible by promoting every nuance tied to your value proposition and also the unique advantage customers discover on their own. I refer to this as the experience gap. In the experience gap, there's the experience we want people to have, which is reinforced by our marketing messages and strategies. Then, there's the experience people have and share, which usually demonstrates that what \"they\" say about us is frequently different than what we say. A key question for you to answer is, \"are you facing an experience gap?\" Driving shared experiences is a form of customer journey optimization that literally closes the gap. This is where search works for us beyond traditional SEO. With a little keyword anthropology, we can better understand the questions, not just key words, that customers are asking and answering. This research also reveals the following key attributes to develop a UMOT optimization strategy: Searching beyond keywords: The questions that people ask over and over again. What comes back in the zero moment of truth: Patterns and context of questions, what customers find that helps them make decisions, and also why customers err to locate or value traditional content. The communities and people of value: Where people are finding and sharing experiences outside of Google or other traditional search engines (this introduces new touch points in the customer journey). Helpful content that actually answers customer questions: Discover valuable content, additional links, reactions, and a rabbit hole of ambient experiences that further guide customers to or away from you. Real world impressions as told through expressions: What product opinions, tips and tricks, cautionary tales and how these shared experiences influence the impressions of others. New marketing opportunities : Hidden gems and new product usage scenarios not originally considered. A clear picture of your connected customer's journey: All touch points and related information that shows exactly how UMOT connects to ZMOT and where your customers click to continue their journey. Once you've identified the state of shared experiences, it's time to develop a strategy to close the experience gap. Start by defining… What is it that you want people to experience? What is it that you want them to feel and share? What are people sharing today, where (networks/apps) and how (content)? The relationship between keyword anthropology and content creation will guide your strategy development so that you can understand how to influence the relationship between what's shared in the ultimate moment of truth as customers begin the discovery process in the zero moment of truth. Truth can often be a painful surprise. And we all know that perception is reality. There's no need to be placed on the defensive in reacting to shared experiences. It's our job to optimize positive experiences and promote beneficial content and stories to enhance the zero moment of truth wherever customers go to learn and explore. The future lies in the mixing of experience design, content marketing, UGC, and SEO. Positive conditioning promotes a collaborative effort to solve the experience gap. By activating and rewarding customers and influencers, marketers can rally content that promotes desired experiences at every touch point that customers uncover in their journey or lifecycle. By coordinating these efforts, what appears in new channels in each zero moment of truth is no longer a surprise; it's strategically optimized to walk people through each moment of truth. It also loops together, to create a value cycle that keeps on giving to the next person who enters the journey. User and employee-generated content must then become part of an integrated SEO program to optimize the right content in the right context for each moment of truth. When balanced with a premier SEO program, optimized shared experiences will complement the customer journey wherever your customers search and share. What we soon realize is that moments of truth aren't just moments in time, they become an experience fueled continuum. The future of shared experiences and your brand isn't just created, it's co-created. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Your New Sales Cycle: Optimizing for the Ultimate Moment of Truth"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Your New Sales Cycle: Optimizing for the Ultimate Moment of Truth"
    },
    {
      "level": "H2",
      "text": "The zero moment of truth (ZMOT)"
    },
    {
      "level": "H3",
      "text": "Trust"
    },
    {
      "level": "H2",
      "text": "What's beyond the zero moment of truth?"
    },
    {
      "level": "H2",
      "text": "The ultimate moment of truth (UMOT)"
    },
    {
      "level": "H2",
      "text": "Optimizing shared experiences"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Leave the Best Possible Negative Review for a Local Business"
    },
    {
      "level": "H3",
      "text": "Claddagh: How Local Businesses Inspire Love, Loyalty, and Friendship"
    },
    {
      "level": "H3",
      "text": "Building Better Customer Experiences - Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brian Solis\n          \n            Brian Solis\n          \n            Brian Solis"
}