{
  "url": "https://moz.com/blog/unconventional-linkbuilding-ideas",
  "slug": "unconventional-linkbuilding-ideas",
  "title": "Unconventional Link-Building Ideas - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Everybody talks about recip link trades, directory submission and buying links. How about let's share a few unconventional link-building ideas here. I'll give you my best three and if every person who reads this adds just one more we will build one of the best collections on the web. Ask for the…",
  "content": "Unconventional Link-Building Ideas Link Building E By: EGOL August 27, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL August 27, 2005 Unconventional Link-Building Ideas Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Everybody talks about recip link trades, directory submission and buying links. How about let's share a few unconventional link-building ideas here. I'll give you my best three and if every person who reads this adds just one more we will build one of the best collections on the web. Ask for the Link: If you have content that people will link to naturally then plant a seed in the mind of your visitors with a \"link to us\" button or banner. I placed one of these in the persistent navigation of one of my sites and my natural link acquisition rate increased nicely. (I plot total yahoo backlinks on the vertical axis vs time on the horizontal to track my natural link rate for total .edu .gov and .us backlinks. All three lines got distinctly steeper a few days after I installed the buttons and this steeper slope has held.) I believe that if you have really strong content that a link to us button should be on every page and in a prime location. When the button is clicked the visitor is taken to a page with a thank you message and a choice of link codes.This Site has Everything! I don't hesitate to put a large number of links on the homepage of my sites. I want the visitor to be impressed when they land on my homepage and get the \"this site has everything\" feeling. Instead of five or six neat categories in the horizontal navigation bar with dropdown menus, I like to have all of those links out in the open and clearly visible. In my opinion this can increase your natural link acquisition rate and I have hard data to confirm that it has increased the average \"time-on-site\" and pageviews per visitor - at least for my sites. Try it and watch your stats.Build Content for Specific Link Requests: Some of my best success at linkbuilding has resulted from visiting authority sites in my theme and deciding what is missing from their content or missing from their collections of links to outside sites. I then build content that fills the gaps in their topic coverage and when its ready I make a specific link request. Works almost every time.OK.... now its your turn. How about just one or two ideas? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Unconventional Link-Building Ideas"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Unconventional Link-Building Ideas"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}