{
  "url": "https://moz.com/blog/underpants-gnomes-business-model",
  "slug": "underpants-gnomes-business-model",
  "title": "Underpants Gnomes Business Model - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Pat at ConversionRater has a hilarious post on the similarities between some Web 2.0 business models and the underpants gnomes of South Park (pictured below).\n...",
  "content": "Underpants Gnomes Business Model Online Advertising By: Rand Fishkin April 11, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 11, 2006 Underpants Gnomes Business Model Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Pat at ConversionRater has a hilarious post on the similarities between some Web 2.0 business models and the underpants gnomes of South Park. Collect underpants. ???????? Profit! Somehow, I don't think these guys are getting a lot of funding. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Underpants Gnomes Business Model"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Underpants Gnomes Business Model"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}