{
  "url": "https://moz.com/blog/understanding-stemming",
  "slug": "understanding-stemming",
  "title": "Understanding Stemming - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Xan Porter has an excellent blog entry on the subject of stemming in search engine indices. The article points to a terrific trove of resources on stemming, how it is performed a...",
  "content": "Understanding Stemming Search Engines By: Rand Fishkin May 16, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 16, 2005 Understanding Stemming Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Xan Porter has an excellent blog entry on the subject of stemming in search engine indices. The article points to a terrific trove of resources on stemming, how it is performed and what it's used for. Basically, stemming is the process of reducing words to their most basic form in order to run more mathematical analysis on the relationships between the words, the subject of the document, etc. For example, here are some words that have been reduced to their stem by the Porter Algorithm: surprising surpris definitely definit fishing fish Using these stemmed versions of the words, a search engine can more easily run calculations based on term vectors, term weight and other technical measurements of a document's content. In other news, I'm now back from my long East Coast trip to Toronto, Boston, New York, New Jersey and even Philadelphia. Thanks to everyone who has e-mailed me for your patience in awaiting a reply. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Understanding Stemming"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Understanding Stemming"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}