{
  "url": "https://moz.com/blog/under-the-mask-of-the-black-knight",
  "slug": "under-the-mask-of-the-black-knight",
  "title": "Under the Mask of the Black_Knight - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I know interviews are the latest \"craze\" in the SEO world, but this one is different - and special. Ammon's knowledge goes deep into the core of what marketing is - appealing to consumers and businesses and driving them to your brand.\n...",
  "content": "Under the Mask of the Black_Knight SEO Events By: Rand Fishkin March 15, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 15, 2006 Under the Mask of the Black_Knight SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I know interviews are the latest \"craze\" in the SEO world, but this one is different - and special. Ammon's knowledge goes deep into the core of what marketing is - appealing to consumers and businesses and driving them to your brand. Ammon Johns: Looking far too respectable... Here's a few notable quotes from the interview: Anyway, the short version is that quite a few people found my advice useful and I developed a good reputation. I’ve a fairly long history in the SEO industry therefore, and more than a few people have been kind enough to name me as one of their early inspirations. Many of those in turn have gone on to inspire others and so it continues. Knowledge really is the one thing where the more of it you share out, the more you have to share. Have you ever seen how few SEO companies really do any serious level of R&D? No wonder they are all having such a hard time finding good staff to hire. It is important for any SEO company that is in for the long-haul to stop relying on getting all its ideas from forums and articles. You need to devise, test and develop new strategies continually. You need to train your own future staff to enrich the overall pool of SEO talent available. There’s a ton of information out there. Some of it is accurate. Some of it is out of date. Some of it was never right in the first place. The ‘secret’ is not only in knowing the accurate and useful information from the dross, but even more in knowing how to make it useful and intelligible. Nobody should be suffering lack of information – information overload is far more common and expected. Take 10 minutes and read it. I promise you'll feel enlightened and smarter at the end. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Under the Mask of the Black_Knight"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Under the Mask of the Black_Knight"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}