{
  "url": "https://moz.com/blog/unique-content-for-text-links",
  "slug": "unique-content-for-text-links",
  "title": "Unique Content for Text Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Background\n\nI’m pretty sure that many of us on here are aware of the recent Go Compare case where Go Compare dropped in the SERP’s for their brand name for a few days. There was talk at the time that they were penalised for violating Google’s Terms and Conditions (TOC’s).",
  "content": "Unique Content for Text Links Link Building By: jamie hands June 5, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: jamie hands June 5, 2009 Unique Content for Text Links Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Background I’m pretty sure that many of us on here are aware of the recent Go Compare case where Go Compare dropped in the SERP’s for their brand name for a few days. There was talk at the time that they were penalised for violating Google’s Terms and Conditions (TOC’s). It was suggested that as Go Compare was offering third party websites unique content related to the host website with a small text link back to their website that it constituted a ‘paid link’. As far as I’m aware, this has not been confirmed as the reason for the drop in the SERP’s or whether it was merely down to a technical blip. The Email Request The reason that I’m putting this post together is that one of our clients forwarded me an email from a very large mobile phone retailer in the U.K. The email is as follows: Hello. I`m [name], Director at [www.domain.co.uk]. A wholly owned subsidiary of the [large mobile phone retailer], we were the UK`s first retail mobile phone website (launched in 1995) and are now the largest web-only mobile phone store in the UK. I was searching the web for decent potential partners and came across [www.clients-website.co.uk]. I have an idea which I hope you will find useful:- We would like to have our editorial team research and hand write some content for you to add to a page on [www.clients-website.co.uk]. We will agree a subject with you that is relevant to both of our sites (it won`t be a sales pitch for us!) and will include a single simple text link back to a relevant content page on our site. The content will be uniquely written for you and will not be re-used elsewhere. It should be helpful to your visitors and of course the search engines, as will the presence of a relevant link back to us. Hopefully we will also benefit from the link in the longer term. We are not currently in the position of being able to exchange or return links so we thought this could be a good alternative. Naturally there are no costs whatsoever for you. If this isn`t appropriate for you, please accept my sincere apologies for having troubled you. The e-mail then went on to explain how the sender of the email is very busy so there is a form which sends an email to the recipient to acknowledge confirmation of the agreement. Does This Violate Google’s Terms? I responded to the sender saying that our client would not be participating in the scheme due to the Go Compare case. I had a reply this morning from an SEO company running the scheme on behalf of the client explaining that the scheme did not violate Google’s TOC’s. The main points of the response was along the lines of: ‘…[The drop in the SERP's] was some significant technical issues with a site upgrade that caused the GoCompare outage - not their campaign - and they returned to the results within a couple of days of correcting those issues. Whilst I am not at liberty to confirm that GoCompare is a [SEO Company] client (I can tell you that other firms have emulated our approach), what I can tell you with certainty is that content in return for a link is most definitely not in violation of Google TOS and that the interpretation of the provision of content as a form of \"payment\" is woefully incorrect. We have had verification of this from sources throughout the industry -- a number of people with a competitive agenda had \"misinterpreted\" events (as so often happens in this industry!). Is Content for a Link ‘Paid’? There is no doubt that link building in these very competitive markets does get very tricky and spreading content links from a varied array of websites on various C-Class IP addresses with mixed anchor text would no doubt help in these verticals. Also, this is a very creative way in obtaining links as it provides both parties with a benefit, albeit moreso on the recipient of the text link. I believe that Google would find these links very hard to detect as it would be hard to determine intent from a well drafted article as oppose to footer links or side bar links in structured html tags. Also, these text links would likely come from fairly trusted, relevant websites (that have been presumably be well sourced by the link builder). It is a very grey area and down to interpretation whether these links are purchased or not. I personally believe that they would not be classed as paid per se, but if a manual review were taken on these hosted article sites and the practise became widespread then they may be penalised. I can see this practise becoming more commonplace in the industry over the next year. However, this post is written to gauge your thoughts on the subject as I’m sure if your clients haven’t already received one of these emails then they will shortly, and you will be faced with the decision whether to advise them to do so or not... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Unique Content for Text Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Unique Content for Text Links"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "jamie hands\n          \n            jamie hands\n          \n            jamie hands"
}