{
  "url": "https://moz.com/blog/universal-seo-strategy-audit-in-5-steps-whiteboard-friday",
  "slug": "universal-seo-strategy-audit-in-5-steps-whiteboard-friday",
  "title": "A Universal SEO Strategy Audit in 5 Steps - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Starting your SEO strategy with questions only works if you're asking the right questions. In today's Whiteboard Friday, Rand covers the five that'll lead you in the wrong direction, and the five steps you should be taking instead.",
  "content": "A Universal SEO Strategy Audit in 5 Steps SEO Basics | Whiteboard Friday By: Rand Fishkin January 30, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 30, 2015 A Universal SEO Strategy Audit in 5 Steps SEO Basics | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When it comes to building an SEO strategy, many marketers (especially those who don't spend a significant amount of time with SEO) start off by asking a few key questions. That's a good start, but only if you're asking the right questions. In today's Whiteboard Friday, Rand puts the usual suspects on the chopping block, showing us the five things we should really be looking into when formulating our SEO strategy. For reference, here's a still of this week's whiteboard! Video transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're chatting about building an SEO strategy and having a universal set of five questions that can get you there. So number one: What keywords do you want to rank for? Number two: How do we get links? Number three: Site speed. Mobile? Doesn't even seem like a question. Number four: What about Penguin and Panda? Number five: When do I get money? This is bologna. That's not a strategy. Some of those go to tactics you might invest in an SEO, but this is not an SEO strategy. Unfortunately, this is how a lot of conversations about SEO start at teams, with CMOs, with managers, with CEOs, with clients or potential clients, and it's very frustrating because you can't truly do a great job with SEO just in the tactical level. If you don't start with a compelling strategy, doing all of these things is only going to produce a small amount of potential return compared to if you ask the right questions and you get your strategy set before you begin an SEO process and nailing your tactics. So that's what I want to go through. I spend a lot of time thinking through these things and analyzing a lot of posts that other people have put up and questions that folks have put in our Q&A system and others, on Quora and other places. I think actually every great SEO strategy that I have ever seen can be the distilled down to answers that come from these five questions. So number one: What does our organization create that helps solve searchers' questions or problems? That could be, \"Or what will we create in the future?\" It might be that you haven't yet created the thing or things that's going to help solve searchers' questions or problems. But that thing that you make, that product or service or content that you are making, that expertise that you hold, something about your organization is creating value that if only searchers could access it, they would be immensely thankful. It is possible, and I have seen plenty of examples of companies that are so new or so much on the cutting edge that they're producing things that aren't solving questions people are asking yet. The problem that you're solving then is not a question. It's not something that's being searched for directly. It usually is very indirect. If you're creating a machine that, let's say, turns children's laughter into energy, as they do in the film \"Monsters, Inc.\", that is something very new. No one is searching for machine to turn kids laughing into energy. However, many people are searching for alternative energy. They're searching for broader types of things and concepts. By the way, if you do invent that machine, I think you'll probably nail a lot of that interest level stuff. If you have a great answer to this, you can then move on to, \"What is the unique value we provide that no one else does?\" We talked about unique value previously on Whiteboard Friday. There's a whole episode you can watch about that. Basically, if everyone else out there is producing X and X+1 and X+2, you've either got to be producing X times 10, or you've got to be producing Y, something that is highly unique or is unique because it is of such better quality, such greater quality. It does the job so much better than anything else out there. It's not, \"Hey, we're better than the top ten search results.\" It's, \"Why are you ten times better than anything on this list?\" The third question is, \"Who's going to help amplify our message, and why will they do it?\" This is essential because SEO has turned from an exercise, where we essentially take content that already exists or create some content that will solve a searcher problem and then try and acquire links to it, or point links to it, or point ranking signals at it, and instead it's ones where we have to go out and earn those ranking signals. Because we've shifted from link building or ranking signal building to ranking signal earning, we better have people who will help amplify our message, the content that we create, the value that we provide, the service or the product, the message about our brand. If we don't have those people who, for some reason, care enough about what we're doing to help share it with others, we're going to be shouting into a void. We're going to get no return on the investment of broadcasting our message or reaching out one to one, or sharing on social media, or distributing. It's not going to work. We need that amplification. There must be some of it, and because we need amplification in order to earn these ranking signals, we need an answer to who. That who is going to depend highly on your target audience, your target customers, and who influences your target customers, which may be a very different group than other customers just like them. There are plenty of businesses in industries where your customers will be your worst amplifiers because they love you and they don't want to share you with anyone else. They love whatever product or service you're providing, and they want to keep you all to themselves. By the way, they're not on social media, and they don't do sharing. So you need another level above them. You need press or bloggers or social media sharers, somebody who influences your target audience. Number four: What is our process for turning visitors from search into customers? If you have no answer to this, you can't expect to earn search visits and have a positive return on your investment. You've got to be building out that funnel that says, \"Aha, people have come to us through channel X, search, social media, e-mail, directly visited, referred from some other website, through business development, through conference or trade show, whatever it is. Then they come back to our website. Then they sign up for an e-mail. Then they make a conversion. How does that work? What does our web-marketing funnel look like? How do we take people that visited our site for the first time from search, from a problem or a question that they had that we answered, and now how do they become a customer?\" If you don't have that process yet, you must build it. That's part of a great SEO strategy. Then optimization of this is often called conversion rate optimization. The last question, number five: How do we expose what we do that provides value here in a way that engines can easily crawl, index, understand, and show off? This is getting to much more classic SEO stuff. For many companies they have something wonderful that they've built, but it's just a mobile app or a web app that has no physical URL structure that anyone can crawl and be exposed to, or it's a service based business. Let's say it's legal services firm. How are we going to turn the expertise of our legal team into something that engines can perceive? Maybe we have the answers to these questions, but we need to find some way to show it off, and that's where content creation comes into play. So we don't just need content that is good quality content that can be crawled and indexed. It also must be understood, and this ties a little bit to things we've talked about in the past around Hummingbird, where it's clear that the content is on the topic and that it really answers the searchers' underlying question, not just uses the keywords the searcher is using. Although, using the keywords is still important from a classic SEO perspective. Then show off that content is, \"How do we do a great job of applying rich snippets, of applying schema, of having a very compelling title and description and URL, of getting that ranked highly, of learning what our competitors are doing that we can uniquely differentiate from them in the search results themselves so that we can improve our click-through rates,\" all of those kinds of things. If you answer these five questions, or if your customer, your client, your team, your boss already has great answers to these five questions, then you can start getting pretty tactical and be very successful. If you don't have answers to these yet, go get them. Make them explicit, not just implicit. Don't just assume you know what they are. Have them list them. Make sure everyone on the team, everyone in the SEO process has bought into, \"Yes, these are the answers to those five questions that we have. Now, let's go do our tactics.\" I think you'll find you're far more successful with any type of SEO project or investment. All right gang, thanks so much for joining us on Whiteboard Friday, and we'll see you again next week. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Universal SEO Strategy Audit in 5 Steps"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Universal SEO Strategy Audit in 5 Steps"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}