{
  "url": "https://moz.com/blog/unnatural-link-warnings-blog-networks-advice",
  "slug": "unnatural-link-warnings-blog-networks-advice",
  "title": "Unnatural Link Warnings and Blog Networks - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Advice and Confessions from a Reformed Link Network Spammer\n\n\tThere was only one time when link building was the easiest, least challenging part of my SEO work. I was a link network spammer, relying upon services with names like \"blog networks\" and \"article networks.\" These services allow paid…",
  "content": "Unnatural Link Warnings and Blog Networks Search Engines By: Carson Ward March 26, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Carson Ward March 26, 2012 Unnatural Link Warnings and Blog Networks Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Advice and Confessions from a Reformed Link Network Spammer There was only one time when link building was the easiest, least challenging part of my SEO work. I was a link network spammer, relying upon services with names like \"blog networks\" and \"article networks.\" These services allow paid subscribers to post their content to a network of sites for the sole purpose of building links. Because the sites aren't meant to be read by people, many networks accept and actively encourage spun content. The resultant content quality is absolutely horrific. I pulled this example from an active blog network site. \"Sodium Body of water Town\" is spun garbagese for \"Salt Lake City.\" Using blog networks, I had multiple sites penalized, re-included, and, once I had learned the ropes, I even had a few that gained rankings and escaped unharmed. I ultimately gave up my spam-content ways because it became clear that it was not an effective long-term strategy. The writing was on the wall - Google was getting smarter, and I was at risk of losing any time I invested. And the writing was, and still is, on the wall. Google rolled out Panda, which dealt a heavy blow to some blog and article networks that had paid almost no attention to users. Starting this year, blog networks, both private and public, starting dropping. In one of the highest-profile incidents, Google crippled BMR's blog network. Webmasters began receiving warnings in Google Webmaster Tools around the same time that now strike fear into the hearts of those using manipulative or questionable tactics to build links: Google Webmaster Tools notice of detected unnatural links to http://example.com/ Dear site owner or webmaster of http://example.com/, We've detected that some of your site's pages may be using techniques that are outside Google's Webmaster Guidelines. Specifically, look for possibly artificial or unnatural links pointing to your site that could be intended to manipulate PageRank. Examples of unnatural linking could include buying links to pass PageRank or participating in link schemes. We encourage you to make changes to your site so that it meets our quality guidelines. Once you've made these changes, please submit your site for reconsideration in Google's search results. If you find unnatural links to your site that you are unable to control or remove, please provide the details in your reconsideration request. If you have any questions about how to resolve this issue, please see our Webmaster Help Forum for support. Sincerely, Google Search Quality Team In short: you're caught - the game is up. Some sites received this warning without penalties, and some sites were penalized immediately. In either case, the links need to be taken down to retain or regain rankings. So what now? Identifying Posts from Blog Networks There are plenty of webmasters, site owners, and SEOs who have no idea what Google is talking about when they receive the warning. For example, I recently spoke with a friend from a reputable SEO agency who had the bad lack of taking over the same week his client was penalized for the previous SEO firm's work. In any case, the first step to fixing the problem is finding the links in question. We can use tools like Open Site Explorer and Google/Bing Webmaster tools to find bad links. Because BMR's sites have already been outed, penalized, and rendered useless for the foreseeable future, we can use an old BMR site as examples of what to look for: That's right - you can get misinformation about water shoes, Dubai shopping, and constipation remedies - all in one place! BMR posts actually had limited quality reviews, making them higher quality than most existing blog networks. The identifying marks of a blog network post are as follows: Terrible content and a boring template; you find yourself asking, \"Why would anyone ever subscribe to this blog?\" Topics are jumped, unrelated to the site's theme, and categorization is poor. There is rarely an about section, author name, or means of contact. Lots and lots of exact-match anchor text seemingly pointing to sites at random. Posts tend to be 400-500 words with 2-3 links per post - generally all to the same site. If you have recently received an unnatural link warning, there's a pretty good chance that you have a lot of links like this in your link portfolio. You will also wish to look for footer/blogroll links, especially from irrelevant sites, and any other links that were clearly not intended to be viewed by visitors. Fixing and Recovering From Unnatural Link Penalties There is a way back to Google's good graces, but it's not going to be fast, and it's unlikely that your traffic will reach the same heights it once did if you relied heavily on link networks or paid links to gain rankings. Once you're caught, you must sacrifice all paid or spammy links, submit a reconsideration request, and develop a legitimate backlink portfolio. Removing Penalization-Inducing Links The removal of links has to be thorough, or the reconsideration request will be denied. If you rent links on a monthly basis, the obvious step is to stop paying for the links and request their removal. If your links were built by an external company, contact them and see what they can do about taking any links from blog networks offline. For BMR users, I recommend clicking the following link, which BMR was professional enough to offer: Take them all down! Now leave the site without exporting those low-quality posts that you won't need, thanks to the fantastic new link-building strategy you're going to develop. Other link networks often provide simple solutions to taking down your links - speak with the person who put these links up if you don't have access. In the case of paid links not submitted through a blog network, you may have to contact the site directly and request removal of links. It's a tedious process, but a reasonable effort has to be made. Submitting a Reconsideration Request If your site hasn't been penalized yet, but you received the warning, you can skip this step. Do not skip the step above, as you will eventually face into a penalty if you don't clean up your act and link portfolio. In a blog post on 6 Ways to Recover from Bad Links, Dr. Pete offers some advice for reconsideration requests: Be honest, specific and detailed. Show that you’ve made an effort. Act like you mean it (better yet: mean it). You have to explain that you have changed your views and your strategic focus. A good way to show effort is by including a link to an accessible Google Doc spreadsheet showing the bad links, which ones were removed, and which ones you made unsuccessful efforts to remove. Be specific, and touch on everything requested on the reinclusion request form: Tell us more about what happened: what actions might have led to any penalties, and what corrective actions have been taken. If you used a search engine optimization (SEO) company, please note that. Describing the SEO firm and their actions is a helpful indication of good faith that may assist in evaluation of reconsideration requests. If you recently acquired this domain and think it may have violated the guidelines before you owned it, let us know that below. In general, sites that directly profit from traffic (e.g. search engine optimizers, affiliate programs, etc.) may need to provide more evidence of good faith before a site will be reconsidered. Be open and specific about what you were doing, what you changed to comply with Google's guidelines, and what you will do going forward. Right now there is doubtless a long line of websites requesting reinclusion, so make sure you've done a good clean-up. The last thing you want is to have to go through the whole process again in a few months. You'll also have to be patient, especially if you're a smaller site or lesser-known brand. In the meantime, though, we will develop a legitimate link-building strategy. Build a Legitimate Link Portfolio Under most conditions, Google appears to assess link penalties algorithmically. Most of the sites that I have seen receiving warnings about unnatural links have serious problems with the over-optimization of anchor text and links from low-quality sites. Low quality sites, in this diagram, refers to sites (and pages) that have little or no relevance, few incoming links, unnatural link portfolios of their own, and few branding signals. Having too much exact-match anchor text from legitimate domains is a hard thing to do, but it has happened through things like widgets with unnatural anchor text. Building links from legitimate sources is hard, and in competitive and boring industries it take a lot of creativity and work. Some have taken this as a license to manipulate rankings and build spammy links. In competitive and boring industries; however, the online world looks very much like the real world. The secret to success in both is a unique selling point (USP): what makes you different or better than your competitors? Your USP can be customer experience, site interactivity, prices, or content resources. Online businesses will profit in much the same way that offline businesses did and continue to. It is time to start thinking of ways to build links and attract users in a way that is scalable, effective, and long-term. Building links manually is boring, difficult, and often unrewarding. There's a reason a lot of industry leaders have been talking about content marketing. New Questions and Concerns There's a lot of change in this industry, and we've become good at adapting and changing our roles. As with all significant changes, there have been a flood of questions about what to do. First, I do not think that this was related to Google's reported semantic search or the upcoming over-optimization penalty. The later was was pre-announced after large numbers of sites had already been pummeled my something else entirely. My Blog Network is Running Strong. Should I Stop? Yes. Those who have not received warnings for using blog networks should recognize that blog networks are not a sustainable long-term strategy. You're spending time building bad links instead of relationships and branding. Additionally, Google has hit several blog networks, and it's likely to continue. Standing and waiting for the hammer to fall is strategy at its absolute worst. Couldn't I Hurt Competitors? The last defense for the link spammer is a fallacious line of reasoning: \"search engines can't penalize me, because I could do it to my competitors.\" Yes, in theory, you could trigger a link spam penalty on a competitor site. You will find; however, that companies with strong branding signals who have built real editorial links - usually the companies that actually rank highly - are nearly impervious to link spam attacks. Yes, you can do horrible things to other people - but why? Ethics aside, it just doesn't make sense in this industry to waste effort tearing others rather than building a site up. Restaurant owners don't go around attacking nearby restaurant owners' stores, because it takes a lot of effort and, even if you do temporarily close a restaurant, it doesn't really bring new customers. There are a lot of restaurants in the city - and even more sites on the internet. Note that there may be legal ramifications if you successfully harm a competitor with link spam. Once the subpoenas start falling, the invincible feeling of anonymity disappears quickly. Strategies for Agencies One line in the reconsideration request stood out to me: \"Describing the SEO firm and their actions is a helpful indication of good faith\" People rarely describe a company without mentioning its name. What actions might we expect from firms mentioned in multiple reconsideration requests? Direct action is unlikely, but companies who relied on networks to build links to clients' and their own sites may be wise to worry, devise a new strategy, and stop publishing crap. I have absolutely no interest in the obnoxious and mostly-imaginary \"war\" between white hat and black hat SEO. Whether you care about adding value to users - and at the world of link penalties and Panda, it's insane not to - it's time to drop tactics and schemes like blog networks. The links have been low value for a long time, but now they carry with them an unacceptable risk. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Unnatural Link Warnings and Blog Networks"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Unnatural Link Warnings and Blog Networks"
    },
    {
      "level": "H2",
      "text": "Identifying Posts from Blog Networks"
    },
    {
      "level": "H2",
      "text": "Fixing and Recovering From Unnatural Link Penalties"
    },
    {
      "level": "H2",
      "text": "Removing Penalization-Inducing Links"
    },
    {
      "level": "H2",
      "text": "Submitting a Reconsideration Request"
    },
    {
      "level": "H2",
      "text": "Build a Legitimate Link Portfolio"
    },
    {
      "level": "H2",
      "text": "New Questions and Concerns"
    },
    {
      "level": "H2",
      "text": "My Blog Network is Running Strong. Should I Stop?"
    },
    {
      "level": "H2",
      "text": "Couldn't I Hurt Competitors?"
    },
    {
      "level": "H2",
      "text": "Strategies for Agencies"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Carson Ward\n          \n            Carson Ward\n          \n            Carson Ward"
}