{
  "url": "https://moz.com/blog/unraveled",
  "slug": "unraveled",
  "title": "Un-Raveled: How Ravelry Successfully Created a Dedicated Community - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Reading the recent post on the nature of online communities got me thinking about my favourite online community, Ravelry. This is one of the largest niche communities I have ever come across, with it fast approaching 200,000 members all talking about....knitting!",
  "content": "Un-Raveled: How Ravelry Successfully Created a Dedicated Community Social Media S By: Sarah Carling October 22, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: Sarah Carling October 22, 2008 Un-Raveled: How Ravelry Successfully Created a Dedicated Community Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Reading the recent post on the nature of online communities got me thinking about my favourite online community, Ravelry. This is one of the largest niche communities I have ever come across, with it fast approaching 200,000 members all talking about....knitting! First, a little history. Ravelry was started just under 2 years ago, by a husband and wife team, Casey was and is the only programmer creating this site, while Jess brought the knitting expertise. They started with a test community of 100 members in January 2007, and gradually they let more people in. By the time I tried to sign up in April of that year the waiting list was almost 3 months long, and at the end of June I eventually got my Ravelry invite (I wouldn't be exaggerating to say I was leaping round the room at this point). Once inside, Ravelry is a treasure trove of knitting goodness, with a database of over 1600 knitting patterns and thousands of yarns for people to browse and add to their queue system. Users can favourite projects that others have created and see the changes others have made. The forums feature allows any user to create their own group within the site, and 3000 groups dealing with interests from \"knitters for Hillary clinton\" to \"knitters with Pugs\" and everything in between have been created, each moderated by their creators with little or no involvement from the site's owners. OK, so what's the point of my waxing lyrical about a site I love and enjoy logging into every day? Well Ravelry, despite having no marketing team and no advertising, has created a huge community which went from being a part time venture to providing full time employment for 3 people in 18 months. People are still queuing for 2-4 days to get entry to the site! Ravelry has done the one thing that most site owners fail to: they ask every day what their users want to see. There is a whole thread dedicated to allowing users to suggest the next feature or enhancement they would like to see on the site, and a list of over 1700 enhancements that users can vote on and leave comments for. This is something that many of us miss when we are looking at ways to generate more traffic and sales for our clients. What do their customers want to see from the site? Widgets, link building, merchandise and community participation are all very well and good if that is what customers want, but we all have a tendency to guess. Perhaps next time we want to encourage visitors to come back, we should invest more time in asking and listening to them. As Ravelry shows, users will guide you in the right direction. If you give them what they want, they will keep coming back for more. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Un-Raveled: How Ravelry Successfully Created a Dedicated Community"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Un-Raveled: How Ravelry Successfully Created a Dedicated Community"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Carling\n          \n            Sarah Carling"
}