{
  "url": "https://moz.com/blog/unreliable-google-adwords-keyword-volume",
  "slug": "unreliable-google-adwords-keyword-volume",
  "title": "Why Google AdWords' Keyword Volume Numbers Are Wildly Unreliable - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "GOOGLE GUARANTEED - Is Google Keyword Planner accurate? Broad and unusable volume ranges, misalignment with other Google tools, and conflating similar yet distinct keywords — these are just a few of the serious issues that make relying on AdWords search volume data alone so dangerous.",
  "content": "Why Google AdWords' Keyword Volume Numbers Are Wildly Unreliable Keyword Research | Whiteboard Friday By: Rand Fishkin January 12, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 12, 2018 Why Google AdWords' Keyword Volume Numbers Are Wildly Unreliable Keyword Research | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Many of us rely on the search volume numbers Google AdWords provides, but those numbers ought to be consumed with a hearty helping of skepticism. Broad and unusable volume ranges, misalignment with other Google tools, and conflating similar yet intrinsically distinct keywords — these are just a few of the serious issues that make relying on AdWords search volume data alone so dangerous. In this edition of Whiteboard Friday, we discuss those issues in depth and offer a few alternatives for more accurate volume data. Click on the whiteboard image above to open a high-resolution version in a new tab! <span id=\"selection-marker-1\" class=\"redactor-selection-marker\"></span> Video Transcription Howdy, Moz fans. Welcome to another edition of Whiteboard Friday. This week we're going to chat about Google AdWords' keyword data and why it is absolutely insane as an SEO or as a content marketer or a content creator to rely on this. Look, as a paid search person, you don't have a whole lot of choice, right? Google and Facebook combine to form the duopoly of advertising on the internet. But as an organic marketer, as a content marketer or as someone doing SEO, you need to do something fundamentally different than what paid search folks are doing. Paid search folks are basically trying to figure out when will Google show my ad for a keyword that might create the right kind of demand that will drive visitors to my site who will then convert? But as an SEO, you're often driving traffic so that you can do all sorts of other things. The same with content marketers. You're driving traffic for multitudes of reasons that aren't directly or necessarily directly connected to a conversion, at least certainly not right in that visit. So there are lots reasons why you might want to target different types of keywords and why AdWords data will steer you wrong. 1. AdWords' \"range\" is so broad, it's nearly useless First up, AdWords shows you this volume range, and they show you this competition score. Many SEOs I know, even really smart folks just I think haven't processed that AdWords could be misleading them in this facet. So let's talk about what happened here. I searched for types of lighting and lighting design, and Google AdWords came back with some suggestions. This is in the keyword planner section of the tool. So \"types of lighting,\" \"lighting design\", and \"lighting consultant,\" we'll stick with those three keywords for a little bit. I can see here that, all right, average monthly searches, well, these volume ranges are really unhelpful. 10k to 100k, that's just way too giant. Even 1k to 10k, way too big of a range. And competition, low, low, low. So this is only true for the quantity of advertisers. That's really the only thing that you're seeing here. If there are many, many people bidding on these keywords in AdWords, these will be high. But as an example, for \"types of light,\" there's virtually no one bidding, but for \"lighting consultant,\" there are quite a few people bidding. So I don't understand why these are both low competition. There's not enough granularity here, or Google is just not showing me accurate data. It's very confusing. By the way, \"types of light,\" though it has no PPC ads right now in Google's results, this is incredibly difficult to rank for in the SEO results. I think I looked at the keyword difficulty score. It's in the 60s, maybe even low 70s, because there's a bunch of powerful sites. There's a featured snippet up top. The domains that are ranking are doing really well. So it's going to be very hard to rank for this, and yet competition low, it's just not telling you the right thing. That's not telling you the right story, and so you're getting misled on both competition and monthly searches. 2. AdWords doesn't line up to reality, or even Google Trends! Worse, number two, AdWords doesn't line up to reality with itself. I'll show you what I mean. So let's go over to Google Trends. Great tool, by the way. I'm going to talk about that in a second. But I plugged in \"lighting design,\" \"lighting consultant,\" and \"types of lighting.\" I get the nice chart that shows me seasonality. But over on the left, it also shows average keyword volume compared to each other — 86 for \"lighting design,\" 2 for \"lighting consultant,\" and 12 for \"types of lighting.\" Now, you tell me how it is that this can be 43 times as big as this one and this can be 6 times as big as that one, and yet these are all correct. The math only works in some very, very tiny amounts of circumstances, like, okay, maybe if this is 1,000 and this is 12,000, which technically puts it in the 10k, and this is 86,000 — well, no wait, that doesn't quite work — 43,000, okay, now we made it work. But you change this to 2,000 or 3,000, the numbers don't add up. Worse, it gets worse, of course it does. When AdWords gets more specific with the performance data, things just get so crazy weird that nothing lines up. So what I did is I created ad groups, because in AdWords in order to get more granular monthly search data, you have to actually create ad groups and then go review those. This is in the review section of my ad group creation. I created ad groups with only a single keyword so that I could get the most accurate volume data I could, and then I maximized out my bid until I wasn't getting any more impressions by bidding any higher. Well, whether that truly accounts for all searches or not, hard to say. But here's the impression count — 2,500 a day, 330 a day, 4 a day. So 4 a day times 30, gosh, that sounds like 120 to me. That doesn't sound like it's in the 1,000 to 10,000 range. I don't think this could possibly be right. It just doesn't make any sense. What's happening? Oh, actually, this is \"types of lighting.\" Google clearly knows that there are way more searches for this. There's a ton more searches for this. Why is the impression so low? The impressions are so low because Google will rarely ever show an ad for that keyword, which is why when we were talking, above here, about competition, I didn't see an ad for that keyword. So again, extremely misleading. If you're taking data from AdWords and you're trying to apply it to your SEO campaigns, your organic campaigns, your content marketing campaigns, you are being misled and led astray. If you see numbers like this that are coming straight from AdWords, \"Oh, we looked at the AdWords impression,\" know that these can be dead f'ing wrong, totally misleading, and throw your campaigns off. You might choose not to invest in content around types of lighting, when in fact that could be an incredibly wonderful lead source. It could be the exact right keyword for you. It is getting way more search volume. We can see it right here. We can see it in Google Trends, which is showing us some real data, and we can back that up with our own clickstream data that we get here at Moz. 3. AdWords conflates and combines keywords that don't share search intent or volume Number three, another problem, Google conflates keywords. So when I do searches and I start adding keywords to a list, unless I'm very careful and I type them in manually and I'm only using the exact ones, Google will take all three of these, \"types of lights,\" \"types of light\" (singular light), and \"types of lighting\" and conflate them all, which is insane. It is maddening. Why is it maddening? Because \"types of light,\" in my opinion, is a physics-related search. You can see many of the results, they'll be from Energy.gov or whatever, and they'll show you the different types of wavelengths and light ranges on the visible spectrum. \"Types of lights\" will show you what? It will show you types of lights that you could put in your home or office. \"Types of lighting\" will show you lighting design stuff, the things that a lighting consultant might be interested in. So three different, very different, types of results with three different search intents all conflated in AdWords, killing me. 4. AdWords will hide relevant keyword suggestions if they don't believe there's a strong commercial intent Number four, not only this, a lot of times when you do searches inside AdWords, they will hide the suggestions that you want the most. So when I performed my searches for \"lighting design,\" Google never showed me — I couldn't find it anywhere in the search results, even with the export of a thousand keywords — \"types of lights\" or \"types of lighting.\" Why? I think it's the same reason down here, because Google doesn't believe that those are commercial intent search queries. Well, AdWords doesn't believe they're commercial intent search queries. So they don't want to show them to AdWords customers because then they might bid on them, and Google will (a) rarely show those, and (b) they'll get a poor return on that spend. What happens to advertisers? They don't blame themselves for choosing faulty keywords. They blame Google for giving them bad traffic, and so Google knocks these out. So if you are doing SEO or you're doing content marketing and you're trying to find these targets, AdWords is a terrible suggestion engine as well. As a result, my advice is going to be rely on different tools. Instead: There are a few that I've got here. I'm obviously a big fan of Moz's Keyword Explorer, having been one of the designers of that product. Ahrefs came out with a near clone product that's actually very, very good. SEMrush is also a quality product. I like their suggestions a little bit more, although they do use AdWords keyword data. So the volume data might be misleading again there. I'd be cautious about using that. Google Trends, I actually really like Google Trends. I'm not sure why Google is choosing to give out such accurate data here, but from what we've seen, it looks really comparatively good. Challenge being if you do these searches in Google Trends, make sure you select the right type, the search term, not the list or the topic. Topics and lists inside Google Trends will aggregate, just like this will, a bunch of different keywords into one thing. Then if you want to get truly, truly accurate, you can go ahead and run a sample AdWords campaign, the challenge with that being if Google chooses not to show your ad, you won't know how many impressions you potentially missed out on, and that can be frustrating too. So AdWords today, using PPC as an SEO tool, a content marketing tool is a little bit of a black box. I would really recommend against it. As long as you know what you're doing and you want to find some inspiration there, fine. But otherwise, I'd rely on some of these other tools. Some of them are free, some of them are paid. All of them are better than AdWords. All right, everyone. Look forward to your comments and we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Google AdWords' Keyword Volume Numbers Are Wildly Unreliable"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Google AdWords' Keyword Volume Numbers Are Wildly Unreliable"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1. AdWords' \"range\" is so broad, it's nearly useless"
    },
    {
      "level": "H2",
      "text": "2. AdWords doesn't line up to reality, or even Google Trends!"
    },
    {
      "level": "H2",
      "text": "3. AdWords conflates and combines keywords that don't share search intent or volume"
    },
    {
      "level": "H2",
      "text": "4. AdWords will hide relevant keyword suggestions if they don't believe there's a strong commercial intent"
    },
    {
      "level": "H2",
      "text": "Instead:"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}