{
  "url": "https://moz.com/blog/urchin-google",
  "slug": "urchin-google",
  "title": "Urchin & Google - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Urchin, a well-known web analytics tool that runs on hundreds of thousands of websites, has been acquired by Google. While many in the search industry are surprised by this move, I see it as more of a calculated strategy of Google's to g...",
  "content": "Urchin & Google SEO Analytics By: Rand Fishkin March 29, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 29, 2005 Urchin & Google SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Urchin, a well-known web analytics tool that runs on hundreds of thousands of websites, has been acquired by Google. While many in the search industry are surprised by this move, I see it as more of a calculated strategy of Google's to gain access to as much of the information available about websites as possible.The monitoring and web tracking technology provided by Urchin is offered in both free and paid versions, and with Google's acquisition, I foresee a push of both of these through the company's offerings to webmasters - probably AdWords & AdSense programs, as well as the Google webmaster pages. The goal, as I see it, would be to use statistically important data culled from Urchin to get a better sense of who is using the websites and how.The information could help Google in their quest for increased search relevancy by giving insight into what succeeds and fails for web visitors as a group and individually. The tracking of conversions, visit length, number of clicks could dramatically increase the amount of data Google has access to regarding the behavior of visitors to search results. Could this impact rankings in the future? My guess is that it could, but it's probably a good ways off. To be safe, however, I think I'll stay away from Urchin, unless I have fantastically performing sites that I want to show to Google... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Urchin & Google"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Urchin & Google"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}