{
  "url": "https://moz.com/blog/urls-domains-made-fun-and-interesting",
  "slug": "urls-domains-made-fun-and-interesting",
  "title": "URLs & Domains Made Fun and Interesting - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm actually serious with the title here. This session was great. Honestly, I've been to more informative sessions here at SMX West than I've been to since Pubcon 2006, where I knew nothing about SEO and everything I heard was new. Unraveling URLs & Demystifying Domains had some good speakers who…",
  "content": "URLs & Domains Made Fun and Interesting Design By: Jane Copland February 27, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland February 27, 2008 URLs & Domains Made Fun and Interesting Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm actually serious with the title here. This session was great. Honestly, I've been to more informative sessions here at SMX West than I've been to since Pubcon 2006, where I knew nothing about SEO and everything I heard was new. Unraveling URLs & Demystifying Domains had some good speakers who each provided unique information about the subject. I realise that conference recaps aren't usually the most exciting genre of blog posts, so I'll try to keep this both scannable and readable: flip through for the bits you like if you're not into reading it word for word. I won't hold it against you, and you know everyone who says they've never done this is lying! This session started with Brian Combs of Apogee Search covering some basics about domains and URLs in relation to SEO: Begin each web development and business projects with SEO in mind from day one. Thinking about SEO for the first time at day thirty or, better yet, five days before the launch, is a recipe for disaster as well as being potentially expensive. While we may have heard this before, I'd bet that a fair number of people in the room hadn't really thought of SEO like that. We see quite a few questions in Q&A from people who have been brought into companies to take over their SEO efforts, months or years after a website launched. It's so much harder to fix these things when a site has staff and methods in place which have been in use for a long period of time. 301 redirects don't necessarily pass all the link strength. We see this question pop up over and over again. While the new site will be credited with most of the old site's history, there still could be a little difference. After all, it's not the same site. A static URL may be easier to maintain. More later on rewrites... Refer to directories, not files, to avoid file extension changes. To me, that was one of those, \"Dude, that's obvious and yet I'd never thought of that\" moments, which is one of the reasons to go to conferences. Avoid frames and Flash-based files because frames are the creation of the devil. I'd love not to have to write any more on that point, but I should also mention Brian's advice that locational Flash is fine. Use a single URL structure. Focus link strength of internal links. Keywords in URLs are helpful but not critical. I really would have thought that they were more important than I've heard lately. For some reason, I'm sad about this. Limit the parameters and don't use Session IDs. At this point, the two Ebay guys sitting in front of me looked at each other and smiled. I smiled, too. Links are more likely to include keywords if your domain includes a keyword. Beware negative branding impacts and spammy-looking domain names. This is an idea that I recently dealt with in Q&A: a person was having difficulty choosing a domain name. He knew that including a keyword in the URL could result in better-targeted links, but he had a good, unique name in mind and wanted to use it. While I don't know which option he chose, that can be a hard choice to make. Do you choose the unique name and embark on a harder marketing / linkbuilding effort, or do you choose the domain with the keyword, knowing that people will be more likely to link to you with better anchor text? Navneet Virk of Roundarch took over from Brian. He went over the properties of an optimised URL (accessible, keyword-targeted, readable by users and search engines, and unique.) He then went into the challenges of URLs and content management systems. Challenge: CMS inserts multiple parameters and dynamic components into the URL. Solution: Set up rules around allowing dynamic special characters. For example, replace all special characters, spaces, space encoding with a hyphen. Challenge: Channel structure of CMS following navigational breadcrumb can create the same content on multiple URLs. Solution: Implement URL redirects to single preferred URL. Some other issues he brought up included the fact that search engines don't have any issues with indexing and presenting secure pages in SERPs, so they should be disallowed if necessary. He also mentioned the challenges you face with redirecting pages en masse, in terms of losing rankings. Stephen Spencer of Netconcepts then got very geeky on us with some in-depth information about URL rewriting. He has already made his presentation available for download, although you'll have to go all the way through to Slide 10 to see the presentation he gave us. This stuff is over my head, so I won't try to repeat it here! Cindy Krum from Blue Moon Works spoke about international site architecture, which is right up my street because I don't like it when people forget about us foreign folk! The provided three options that people can go with when they're marketing to multiple countries and using different languages. One site approach. Everything is on the same domain You use subdomains and subdirectories for each separate language / country. It's also solid advice to label each country correctly: don't create germany.example.com when Deutschland is what your users call their country. The pros of this approach are that it's easy, all links and traffic come to the same place, and yet you can still get country-specific hosting if you're going with subdomains as opposed to subdirectories. The cons are that your homepage is in the \"wrong language\" for a lot of users. You also have to deal with re-writing content for countries that share a language. The Australian and UK sections can't have identical content. Cindy mentioned server side translations, showing how this can work with legacy CMSs, meta data, content, and feeds. The downsides are that it's hard to set up, natural inbound links could be in the wrong language, and the translations have to be manually checked for errors. The Multiple site approach came next, the benefits of which are the ability to add sites one at a time and the possibility of ranking well in multiple country-specific search engines. On the downside, more sites equal more work: more time spent updating content, fixing problems and general upkeep. Of course, the blended approach is often most popular, where people are brought to a main site and are able to choose where they go from there. Cindy's view is that this is the most realistic for a world-wide presence. It makes sense to set up country-specific sites as you need them, although you should buy up everything you think you'll need in advance. Negative aspects of this approach include the whole \"work\" thing, and the fact that this can be technically challenging. Cindy left us with a quotation as advice: \"The Do Not Disturb signs should be written in the language of the hotel maids.\" Strangely appropriate, since Rebecca's and my sign has gone missing from our door. With that said, it's time for me to head back to the SEOmoz booth, where we're giving away SEOmoz tee-shirts and showing off our neat new PRO features. In fact, I'm going to be late for my 5pm start. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "URLs & Domains Made Fun and Interesting"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "URLs & Domains Made Fun and Interesting"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}