{
  "url": "https://moz.com/blog/use-search-as-b2b-growth-channel",
  "slug": "use-search-as-b2b-growth-channel",
  "title": "5 Ways to Use Search as a Growth Channel for B2B in 2021 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "B2C and e-commerce businesses have more search traffic opportunities than B2B, but no matter how few search visits, B2B sites still have options for optimization. Here’s how to capitalize on them in the year ahead.",
  "content": "5 Ways to Use Search as a Growth Channel for B2B in 2021 Advanced SEO By: Victor Ijidola February 4, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Victor Ijidola February 4, 2021 5 Ways to Use Search as a Growth Channel for B2B in 2021 Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Unlike B2C brands, B2B businesses are often characterized by: low search volumes on Google.high competition on scarcely available keywords. And there’s evidence to support this — usually, where a seven-year-old B2C company is getting 500K visitors per month from SEO, a B2B brand the same age could be seeing only 15K visitors per month. (This is assuming all other things are equal.) Check out the example below comparing Zola.com (a B2C brand) and Yiedify.com (B2B): These two sites were founded around the same time (2013) and have been publishing lots of content. Yet, the difference in their traffic numbers makes it look like Yieldify hasn’t been doing much SEO, but that’s not the case. For instance, when I used the MozBar to analyze the on-page optimization they did on their article about trust badges, I could tell they’re at least following basic SEO principles, like having focus keywords in their URL, page titles, headers, and meta descriptions: I’d say they’ve not been terrible at optimizing their content for SEO — if they do optimize all their content like they did this one on trust badges. My point here is: B2C and e-commerce businesses (usually) have way more opportunities in SEO than B2B, especially in terms of search traffic. But while that is true, it’s also true that no matter how few the search visits, there are still a lot of opportunities in SEO for B2B businesses. Most of the time, what B2B brands lose in search traffic, they make up in revenue — since their products/services are usually more expensive than those in B2C. Long story short: there are opportunities for B2B companies in search, and here’s how to capitalize on them in the year ahead. 1. Start from bottom (not top) of funnel Every funnel begins at the top, but if you want to generate results as quickly as possible, you should kick off your B2B SEO strategy targeting customers at the bottom of the funnel. Ready-to-buy customers are already at the bottom of the funnel (BoFu), searching for information that’ll help them make a purchase decision. They’re often searching with keywords like: “[industry] software”“[industry] tools”“[competitor] alternatives”“Is [competitor] a good product/service?” As a smart marketer, your strategy should be to prioritize reaching them with the bottom of funnel content they’re looking for. You probably know what BoFu content looks like, but just so we’re on the same page as to what it really is, see these examples of BoFu content from SocialPilot ranking on page one: I’m not affiliated with SocialPilot, so I don’t know if they kicked off their SEO content marketing with these BoFu topics (search terms). But if they did, chances are they experienced quick success (in terms of relevant product awareness and sign-ups), since the articles are ranking on Google’s front page for searchers looking for “Buffer alternatives”. Bottom line is, as a B2B brand, you’ll be better off prioritizing BoFu topics in your SEO strategy. It’s a much better approach than starting all the way at the top of the funnel, which would be targeting searchers who aren’t ready to make a purchase (or sign-up) decision. But shouldn’t you start with top of funnel content, since that’s where buyers start their journey? If you think your strategy should be to first target visitors at the top of the funnel (ToFu), you’re probably assuming that your prospects will first consume your ToFu content before ever getting to the bottom. That’s hardly ever the case in real life. What often happens is: A prospective customer knows they have a problemThey search Google for a solutionGoogle shows them multiple solutions on page oneThey read reviews and supporting information to help them make a purchase decision They make a decision to either buy or not buy If you think back to the last purchase decision you made, this was probably the route you took. So it’s not all the time that buyers will start reading your top of funnel content, discover your product, and then decide to start consuming your BoFu content. Sometimes they’re already at BoFu and all it’d take to convince them to buy your product is the right BoFu content. 2. Make your content t-shaped (for demand and lead generation) You’re probably thinking, “what’s t-shaped content?”. Allow me to explain. At my agency (Premium Content Shop), we use “t-shaped content” to describe the type of content that performs two functions at the same time: It provides real value to your ideal prospects AND Generates relevant organic traffic, demand, and quality leads for your business. This little illustration below should help you better understand what our “t-shaped content framework” means: In practice, this is an example of t-shaped content from Mailshake: Right after the fifth paragraph of the article, they introduce a CTA: This is a t-shaped content piece because: The guide is focused on helping Mailshake’s potential customers — “cold emailers” The guide is designed to use the CTA to generate demand and leads for Mailshake I often advise clients not to introduce anything about their product/service until readers have scrolled about 40% into the content they’re consuming, just to avoid coming across as overly promotional. And I’m not saying putting your CTA that early in an article could never work — it could — but your readers should feel like you're prioritizing them getting value from the content over trying to sell your own stuff right off the bat. In any case, creating and ranking t-shaped content helps you achieve two objectives: Build a brand that people trust.Create awareness and generate leads for your product. 3. Don’t just rank content — rank “from-field-experience” content One reason SEO gets a bad rap, especially among B2B marketers, is the sheer amount of low-quality B2B content that’s ranking on page one in the SERPs. And that’s because, while Google’s algorithm is able to determine search-friendly content, it’s currently not able to see if a page is relevant for a searcher, at least from a human perspective. So, it ends up ranking content on page one that meets Google’s ranking standards, but not always the searcher’s standards. As a B2B marketer, you don’t just want to meet Google’s requirements and rank on page one. You need your content to rank AND impress your audience well enough to convert them into leads. How do you do that? You need to write like professionals speaking to professionals. Usually, this means you need to see what other industry professionals are saying or have published on any given topic and spell out: What you agree withWhat you disagree withWhat you want to change about how something is currently doneHow you want it to change or change it Derek Gleason of CXL mirrors the same idea in a recent tweet: And as an expert in your field, this is a no-brainer: you’ll almost always have a different opinion to share about popular topics in your industry. For instance, as an SEO expert, you most likely have fact-based opinions about topics like Google ranking factors, B2B marketing, technical SEO, etc. This knowledge you have about all the topics in your industry is “from-field-experience” ideas that’ll help you connect with customers on a deeper level. And when you’re creating content based on your original opinions, experience, thoughts, or convictions, you won’t be sounding like everyone else and your content will stand out. Even if it’s similar to other competitors’ content, it’ll still have your original ideas. But how do your original ideas impact revenue or growth? Your clients aren't all at the bottom of the funnel. While I’ve advised kicking off your SEO marketing strategy by addressing BoFu topics, many of your potential buyers are still at the top and middle of the funnel. This means, at the stage where they’re reading your “from-field-experience” content, they’re not even thinking about your product at all. But with the right type of content — with your original thoughts and ideas, you can move them from the top/middle to the bottom of the funnel. So, if they’ve been consuming your ToFu content for any amount of time, your brand will get their attention better when it’s time for them to consider making a purchase decision. And yes, they’ll ultimately make a decision based on reviews and other BoFu content, but your ToFu and MoFu content will help you develop authority and trust with potential customers. This will often give you a leg up on your competitors when it’s time for ToFu/MoFu prospects to make a decision. For example, Dom Kent of Mio once shared how people in the collaboration industry keep finding Mio whenever they search for anything related to their industry; that’s one example of what ToFu and MoFu content does for your brand. It's like when you Google something about sales management, and Close’s content keeps showing up. When it’s time to buy — or even just recommend — a sales management tool, guess which product you’ll think of? That’s right, Close. It doesn’t always mean you’ll sign up for Close, but that’s at least one of the brands you’d think of first. 4. Avoid covering too many basic topics Often in B2B, your ideal buyers are experienced professionals. This means that most of the time, they don't need content on the basic topics that entry-level employees might. If they're sales leaders, for instance, they seldom search for content on basic topics like \"what is a sales script\" or \"how does CRM work?\". You're better off covering more important and sophisticated topics — regardless of whether those topics have high search volume or not. For instance, CRM provider Copper currently ranks for “cold call script to get appointment”. It’s a long-tail keyword with only about 500 searches per month. The low search volume may look unattractive on the surface, but Copper’s target customers are the ones searching for it, and that’s more important than them ranking for a high search volume keyword like “what’s a sales pipeline?” that doesn’t frequently get searched by those customers. During your keyword research phase, it’s easy to get distracted by high search volume keywords that your target audience barely ever searches for on Google. Move past that distraction and focus on creating content for keywords your target buyers need content on — even if those keywords have low search volumes. 5. Take care of your technical SEO In my first four points, I covered things you need to know about high-quality content creation and the content strategy side of SEO, but I haven’t forgotten about the technical side. You need to pay attention to technical SEO as well, as it can make or break the opportunities any B2B website can get from search. : Here are the most important parts of tech SEO that you should get in the habit of checking: HTML tags: Your HTML tags help search engines understand what’s on your page. See it this way: you understand English (and any other language you speak), search engine algorithms understand HTML tags (plus human language).Meta descriptions: These help search engines understand the content of your web pages even more. It’s basically the summary of your content, showing searchers and search engines a quick overview of what’s on your web pages.SEO-friendly URL: This one is often considered a “minor Google ranking factor” by many (if not most) search marketers. But even if it increases your chances of ranking by .5%, it’s still important. So optimize your URLs to make them SEO-friendly. This means you need to make sure they contain the target keywords you’re trying to rank for on any page.User experience (UX): This includes site speed, navigation, accessibility (for visitors from PC and mobile devices), and everything else that makes your content and web pages easy to use for searchers. Google’s algorithm has been built to be powerful enough to determine which pages have good UX, so you need to make sure your pages are easy to use, navigate, and access.Backlinks: They may be last on the list here, but backlinks are easily one of the most important ranking factors you need to pay careful attention to. As you know, the more backlinks you get, the stronger your chances of ranking. In conclusion There are a lot of opportunities in SEO for B2B companies — even though the search volumes are often low. I’ve covered what you’d need to use search to your advantage as a B2B marketer. To recap, you should kick-off your SEO and content marketing by targeting BoFu prospects. And make your content T-shaped, so that it benefits your audience and business at the same time. Also, don’t just rank content for organic search traffic, rank with “from-field-experience” content/ideas; this will help you generate demand and quality leads as readers will be drawn to your expertise. And then avoid covering too many basic topics, especially when your target buyers are experienced professionals or C-level decision-makers. Finally, pay attention to the technical side of SEO, too; it can make or break your entire search engine optimization efforts. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Ways to Use Search as a Growth Channel for B2B in 2021"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Ways to Use Search as a Growth Channel for B2B in 2021"
    },
    {
      "level": "H2",
      "text": "1. Start from bottom (not top) of funnel"
    },
    {
      "level": "H3",
      "text": "But shouldn’t you start with top of funnel content, since that’s where buyers start their journey?"
    },
    {
      "level": "H2",
      "text": "2. Make your content t-shaped (for demand and lead generation)"
    },
    {
      "level": "H2",
      "text": "3. Don’t just rank content — rank “from-field-experience” content"
    },
    {
      "level": "H3",
      "text": "But how do your original ideas impact revenue or growth?"
    },
    {
      "level": "H2",
      "text": "4. Avoid covering too many basic topics"
    },
    {
      "level": "H2",
      "text": "5. Take care of your technical SEO"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Victor Ijidola\n          \n            Victor Ijidola\n          \n            Victor Ijidola"
}