{
  "url": "https://moz.com/blog/use-stat-for-keyword-data",
  "slug": "use-stat-for-keyword-data",
  "title": "How to Use STAT to Discover Extra Value in Your Keyword Data - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Maximizing the value in your keyword data is essential when you're a brand trying to rank on the forever-changing SERPs. With that in mind, Moz Learning and Development Specialist Zoe Pegler walks you through the key features in STAT that will help you glean extra (and important) insights from that…",
  "content": "How to Use STAT to Discover Extra Value in Your Keyword Data Whiteboard Friday | Moz Tools By: Zoe Pegler February 4, 2022 Table of Contents Copied! By: Zoe Pegler February 4, 2022 How to Use STAT to Discover Extra Value in Your Keyword Data Whiteboard Friday | Moz Tools Maximizing the value in your keyword data is crucial if you're a brand trying to rank on the forever-changing SERPs. With that in mind, Moz Learning and Development Specialist Zoe Pegler walks you through the key features in STAT Search Analytics that will help you glean extra (and important) insights from that data. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hi and welcome to another edition of Whiteboard Friday. I'm Zoe. I work in the Learning team here at Moz, and my focus is on developing educational materials and resources to promote understanding of our STAT tool. Today, we're going to take a look at how you can use STAT to surface additional insights in your keyword data. Looking for value in your keyword data is important if you're a brand trying to stay visible and on top of the forever-changing SERPs. Looking for those additional insights is paramount to making informed SEO decisions. What is STAT? So what is STAT? If you haven't come across STAT before, it's a large-scale rank tracker, but it's also fantastic for many other things, SERP analysis and intent, a competitive landscape tool. Its value is really how you can dig into the data it provides. Quick wins So where are the quick wins here? Well, we know that usually improved ranking position means increased or at least some uplift in traffic for that term. Knowing where you sit on the SERPs and what features you're winning can make or break your content strategy. This is where STAT's dynamic tags can be hugely useful. Dynamic tagging Dynamic tagging allows you to group keywords together based on criteria you set. That group is then automatically populated daily with keywords based on changeable filter criteria. This means you have the ability to create a group of keywords with any criteria that's important to your business. A great grouping criteria to set here is keywords based on ranking position. For example, flagging keywords which are sitting just outside the top 3, top 5, or top 10 positions and adding a traffic benchmark means you can easily discover which keywords with traffic potential need just a little bit of extra work to shift them into that better position. So maybe your strategy includes hunting down a featured snippet. If so, you can use STAT to set up a dynamic tag that monitors keywords that result in featured snippets. If you see keywords that aren't ranking well within that grouping, they're not winning those snippets. So if you're tracking keywords for a client, this is a great way of seeing where your client owns a snippet and where they don't. You can try to take the spot from their competitors by finding new opportunities to create optimized content. Using this feature is powerful for getting quick feedback on the intent and type of content that perform best in a keyword set, which ultimately is what you can use to guide your content strategy. Data views So we know that organizing your data is key. How do you organize your data so it's meaningful to you while allowing you to see potential opportunities to quickly report back to a client? In STAT, you can hold all your keyword groups, your tags in a single data view. So keeping selected tags in a data view means you get a single dashboard of metrics for those chosen keyword groups For example, you could easily put together a data view of tags that reflect the tactical aspirations of your client. If you're a search marketer, you may choose to set up a data view containing keyword segments that cover stages of the conversion funnel. You really want to split keywords into segments that reflect what your clients want to target. So that could be industry sectors, services, or locations. If product categories are important to your client, you can set up a data view containing keywords tagged as shoes, sportswear, swimwear, or whatever specific attributes you need to track across a product line. Tags tab Okay. So maybe you're looking for a quick health check on how that specific set of keyword groupings are doing. Well, there's a smart little feature in STAT that allows you to compare all of your tags and how well each of those are performing in terms of visibility online, and it's called the Tags tab. So this feature is pretty cool because it allows you to see the performance of all those tags in one place. You'll get the overall picture of how your SEO strategy is progressing and where to focus your attention based on your most important metrics. You can set a specific date range. You can see average rank, top 10 change. Visibility Another key piece of information is finding out who you're up against for those keyword sets you just put together. You can use STAT to view share of voice across that specific set of keyword tags or for that entire market. The share of voice metric used in STAT measures the visibility of a given keyword set on Google. This means you can get invaluable insights, such as where competitors are increasing or decreasing in their visibility. Now, you may have clients that need formalized insights into the progression of a campaign. What's the best way of displaying those reports? Well, in STAT, we have built connectors that allow you to pull live data from STAT into Google Data Studio reports. These visualizations make it easier to share insights with clients and for them to see those top level metrics really quickly. So hopefully these tips and tools mean you can really investigate how much extra value and insights you can squeeze out of your keyword data. Have a great day and thank you for watching this edition of Whiteboard Friday. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Use STAT to Discover Extra Value in Your Keyword Data"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Use STAT to Discover Extra Value in Your Keyword Data"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "What is STAT?"
    },
    {
      "level": "H2",
      "text": "Quick wins"
    },
    {
      "level": "H3",
      "text": "Dynamic tagging"
    },
    {
      "level": "H2",
      "text": "Data views"
    },
    {
      "level": "H2",
      "text": "Tags tab"
    },
    {
      "level": "H2",
      "text": "Visibility"
    },
    {
      "level": "H2",
      "text": "Large-scale rank tracking and SERP analytics."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Zoe Pegler\n          \n            Zoe Pegler\n          \n            Zoe Pegler"
}