{
  "url": "https://moz.com/blog/using-adwords-data-for-seo-unlocking-the-ultimate-keyword-research-treasure-trove-arrrgh",
  "slug": "using-adwords-data-for-seo-unlocking-the-ultimate-keyword-research-treasure-trove-arrrgh",
  "title": "Using AdWords Data for SEO: Unlocking the Ultimate Keyword Research Treasure Trove (Arrrgh!!) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ahoy, SEOmoz UGC blog lubbers!\n\n\tGreat SEO always starts with great keyword research – unfortunately, getting high-quality, actionable keyword data can sometimes be challenging for seve...",
  "content": "Using AdWords Data for SEO: Unlocking the Ultimate Keyword Research Treasure Trove (Arrrgh!!) Keyword Research By: Larry Kim September 26, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Larry Kim September 26, 2012 Using AdWords Data for SEO: Unlocking the Ultimate Keyword Research Treasure Trove (Arrrgh!!) Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Ahoy, SEOmoz UGC blog lubbers! In honor of International Talk Like a Pirate Day, today's post will show you how to unlock a secret treasure trove of SEO keyword research data from your own company’s AdWords account! Avast! Great SEO always starts with great keyword research – unfortunately, getting high-quality, actionable keyword data can sometimes be challenging for several reasons: Google’s keyword tool is an undependable source – it doesn’t always provide complete, accurate data. Google analytics is an unreliable source, no longer showing all of the data for organic search referrals. Also, your Google Analytics data, by definition, tells you about what you’re already ranking on, not what you're missing out on! Keyword suggestion data in general is unreliable from a conversion perspective – it can tell you how popular a keyword is relative to other terms, but it can't tell you how it will perform on your specific site. For these and many other reasons, mining your existing Google AdWords campaign data can be incredibly helpful in determining keyword targets for SEO. In my article today, I’ll show you how to unlock a secret treasure trove of SEO keyword research data from your own company’s AdWords account! Keywords vs. Search Queries Before diving in, I’d like to first call attention to an important distinction in PPC regarding the difference between keywords and search queries. In SEO, the term \"keyword\" is usually synonymous with the specific term you're targeting. However in an AdWords campaign, every \"keyword\" is like a pirate-ship packed full of many different user search queries that triggered your ads, including synonyms, related terms, misspellings, word variations, plurals, etc. of the main keyword. The keyword metrics you see in AdWords, like clicks, impressions, cost, conversions, etc. are a blend of the performance metrics for the entire set of search queries associated with your keyword. The key point here is that in order to get our hands on the secret SEO keyword research treasure trove, we'll need to first unpackage the AdWords keywords into their constituent search queries. Arrr Now Surrrrrender the Booty! (Accessing Search Query Data in AdWords) Getting your search query data in AdWords is a bit hidden – a bit like trying to find a buried treasure! Here's how to unpack your keywords into their underlying search queries: Set the date range to as large a date range as possible, to download as much search query treasure as possible. With “All Campaigns” selected, navigate to the keywords tab Find the “Keyword Details” button, and then click the “View All Search Terms” option, as illustrated here. From there you can see the specific search query terms that users searched on, right before clicking on your ads! Every search query comes with all kinds of great data that we can use to help with SEO keyword research, including impressions, clicks, cost, conversions, conversion rates, etc. as shown here: The above search query data is much more valuable than the fool's gold you get from the Google Keyword Tool and other free keyword tools, because it’s real campaign data for your own site! Key advantages include: Geo-Targeted Volume Data: Most companies target specific countries, states, or cities in their SEO efforts. One neat feature in AdWords is that you can target specific regions or cities, so, the keyword impression data that you’re getting is reflective of only the markets that your business caters to. Actual Performance Data: The search query data contains real outcomes on your websites. For example, you can you can see what search queries actually led to happy outcomes, like a lead capture or completed sale. It's Proprietary Data: The search queries are unique to your website. Your competition does not have access to it. Cost-Per-Click Data: This gives you a true sense for the value your company and your competitors place on different types of keywords and can be used to justify the value of SEO in a very concrete way. Now it's very likely that you're looking at a crap-ton of search query data here, having just expanded you keywords into their underlying search queries – if your company is spending a few thousand dollars per month on paid search, there could easily be thousands or hundreds of thousands (or possibly even millions) of search queries here. If you’re finding that there are just too many rows of data here, it’s important that you sort or filter out some of this data so that your pirate ship doesn’t sink from the crushing weight of all this keyword research booty. Search Query Booty Filtering Ideas If you have conversion tracking on, the instant metal-detector way of finding the doubloons in the search query data is to just filter out non-converting search queries. This means that all remaining search query data has all proven itself to be both valuable and relevant to your business. If you don't have conversion tracking on, or if the number of conversions in your account is too low (i.e. too many of your search queries are being filtered out), I recommend filtering out search queries with very low impression volume and/or spend, for example, search queries with fewer than say, 2 impressions, or with less than a few dollars in spend. Both of these tactics will help weed out the 1-off keyword searches which typically make more than half of the rows in your search query report data. The following screenshot shows how to apply search query filters in AdWords, using the built-in filtering options: Once you’ve gotten your search query data down to a more manageable level, download it to Excel. Panning for Gold (Search Query Analysis) Now that you've exported your filtered AdWords search query data, it's time to analyze this data to prioritize a few SEO targets. In SEO keyword research, there are tons of metrics that SEOs use like KEI, or Global Google Monthly Search Volume Estimate, or keyword competition, or keyword difficulty, to help in picking what keywords to target in their content creation efforts. In AdWords, there's many different search query metrics to choose from. There are too many to list out, but here's some of key search query metrics that I pay most attention to for SEO keyword research, and why: Conversions – Any search queries that convert might be good candidates to target via SEO. Even the terms that are converting at high cost per conversions via PPC could be good terms to target via SEO. Conversion Rate – High performing search queries in paid search will likely enjoy similar conversion metrics in relative terms when targeted via SEO. Impressions – Use keyword impression data to get a better sense for actual search query volume in your targeted region. Click Trough Rates – if you’re seeing very high click through rates that means your ad is resonating and should give you some ideas for content creation. Cost Per Click – I have found that this is generally directly proportional to SEO keyword difficulty. Meaning, the higher the cost per click, the harder it will be to rank organically on that same term. Total Cost – By successfully targeting keywords for which your company is already spending money on paid search, you can easily justify the value of SEO to your boss or client in a very concrete way. Using these and other metrics, you can get a really great sense of which terms have the most overall value to your business, as well as a handle on the effort required to be successful, and even content creation angles to pursue. Grouping and Organizing your Keyword List into Themes Once you’ve pulled out or rank-ordered the different terms that seem to look promising based on your analysis, you may want to re-organize that data to make sense of it, especially because you’ll probably still have a ton of keyword data. For example, say you find that you have a bunch of promising keywords, like: best Internet marketing software top Internet marketing software internet marketing seo software ... (etc.) These search query variations are similar ways for searching on internet marketing software – it would be nice to try to roll these and other similar search queries into top-level keyword themes, instead of having to process hundreds of similar search queries. It's kind of the opposite of what we did early on in this process, when we expanded our PPC keywords into their constituent search queries – it would be nice to somehow repackage our final list of promising looking search queries back into categories and sub-categories based on keyword themes. An easy way to organize your keyword data is to drop it into WordStream's Free Keyword Grouper, which will not only group your keywords into relevant clusters but also shows you which clusters of keywords from your list are the most profitable (you can enter in the keyword and corresponding visits, which in this case you likely want to use impression data for): You can use this tool for free 10 times. And heck, because the SEOmoz community is so awesome, if you run out of free credits, just shoot me an email this week (lkim at wordstream dot com), and I’ll generate a free 1-year license for the paid version of my Keyword Research Suite (valued at $329 / year) which includes this keyword grouper tool. The key point here is using a keyword grouping tool such as this one, you can take up to 10,000 search queries and package them back into a more manageable number of higher level topics and sub-topics, and you can use the resulting taxonomy to map out keyword groupings into specific pages on your site in the same way you would with any keyword research process. Summary: The Pirate's SEO’s Guide to Keyword Research using AdWords Data Mateys: In my article today, we covered: How to find and unpack your company’s AdWords keywords into valuable search query data Tips for filtering out some of the noise from your AdWords search query data Tips for analyzing and prioritizing your search query data How to repackage and organize your analyzed search query data back into topics, for use in SEO content creation efforts By following these steps to super-charge your SEO keyword research, I think you’ll be yo-ho-ho’ing all the way to the bank! Arrrr.... About The Author Captain Larry Kim be the Founder/CTO of WordStream, provider of PPC Management Tools, including the 20 Minute PPC Work Week, and the AdWords Grader. You can follow him on Twitter or Google+. In observance of International Talk Like a Pirate Day, all comments must be in the form of Pirate-speak! :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using AdWords Data for SEO: Unlocking the Ultimate Keyword Research Treasure Trove (Arrrgh!!)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using AdWords Data for SEO: Unlocking the Ultimate Keyword Research Treasure Trove (Arrrgh!!)"
    },
    {
      "level": "H2",
      "text": "Keywords vs. Search Queries"
    },
    {
      "level": "H2",
      "text": "Arrr Now Surrrrrender the Booty! (Accessing Search Query Data in AdWords)"
    },
    {
      "level": "H2",
      "text": "Search Query Booty Filtering Ideas"
    },
    {
      "level": "H2",
      "text": "Panning for Gold (Search Query Analysis)"
    },
    {
      "level": "H2",
      "text": "Grouping and Organizing your Keyword List into Themes"
    },
    {
      "level": "H2",
      "text": "Summary: The Pirate's SEO’s Guide to Keyword Research using AdWords Data"
    },
    {
      "level": "H2",
      "text": "Arrrr.... About The Author"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Larry Kim\n          \n            Larry Kim\n          \n            Larry Kim"
}