{
  "url": "https://moz.com/blog/using-twitter-for-link-relationships-whiteboard-friday",
  "slug": "using-twitter-for-link-relationships-whiteboard-friday",
  "title": "Using Twitter for Link Relationships - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Link building outreach can be unpleasant, but through social media, people have the opportunity to form real relationships to help out with the task of getting your website and content out there. In today's Whiteboard Friday, Ruth Burr shares her tips on finding link targets online and building…",
  "content": "Using Twitter for Link Relationships Whiteboard Friday By: Ruth Burr Reedy November 2, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ruth Burr Reedy November 2, 2012 Using Twitter for Link Relationships Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Link building outreach can be really difficult and unpleasant. I've always hated the tactic of emailing site owners and asking for links; it feels awkward, doesn't work very well, and requires a lot of time and effort. One of my favorite things about our modern world is that with social media, it's possible to form real relationships with people you don't already know. By the time you ask for a link or a share, you're not just some creeper just emailing out of the blue asking for a favor; you're viewed a friend whom they trust to provide value and not spam them. I recently spoke at PubCon Las Vegas about my tactics for finding link targets online and building relationships with them using my favorite social media platform, Twitter. This is a strategy that I've been able to use in the past to completely replace sending \"link ask\" emails. For my very first-ever Whiteboard Friday, I want to share these tactics and the tools I use to do them with you! This is a strategy that takes some time and effort to set up and execute, but it can result in a set of social connections you can use to get links and promote your content again and again. Please pardon my occasional coughing - cold season has really hit the Mozplex hard this year. Video Transcription \"Howdy SEOmoz fans. My name is Ruth Burr, and I'm the Lead SEO here at SEOmoz. Today is my first Whiteboard Friday. Today we are going to talk about using Twitter to build relationships for links. This is my favorite link building tactic, and it something that I recently talked about at Pubcon 2012. I wanted to share it with our awesome community as well. So here we go. Some caveats for using this strategy before we get started. This is not a strategy that is going to work unless you are already creating and have a strategy around good content. Content is still king, and this strategy is only going to work if you are creating unique, compelling, sharable content. There's a ton of other resources out there, including on SEOmoz about how to do that. So we're not going to talk about that today. Second of all, it's important to be real and to be realistic. What that means is that you're not going to have a lot of success with this tactic if you're starting out with a brand new Twitter account with no followers, or if you tweeting in a style that's very corporate. You really want to have an established account that you've got an existing voice for that can be conversational, because what you are really looking for here is to make friends almost. You're building real relationships with real people. The other part of being realistic is to be realistic when we are talking about selecting our link target. So, no matter how many times you tweet @ Barack Obama, you're probably not going to get a link from Whitehouse.gov. That's okay, but it's important to be realistic if you want this strategy to work. So caveats in place, let's get started. So the first think that we're going to want to do when we're thinking about a Twitter focused link building strategy is still the fact that what we want is links. Some social strategies are more focused around shares or around finding influencers. If we want to do that, that's great. It's not a bad thing, but really we want to focus on building relationships with people who can publish content somewhere and give you a link. So we start out actually just doing that same sort of link prospecting that you're probably pretty used to right now. You go into OSE. You look at your backlinks. You look at your competitor's backlinks. You look at sites that are similar to yours that you want links from, maybe look at who linked to them. You get a list of websites. That's a great first step. From there, what I really like to do is visit each of those sites and see if they have a blog role or a list of their favorite sites, because those are really great targets if you want to build relationships with people. They're basically saying to you, \"Here are some sites where my attention already is. Here are some people that if you talk to them, I'm going to know.\" You can be like, \"Oh, you know them? I love them.\" It really can build credibility. Plus a lot of those sites are also going to be good link targets in and of themselves. So I like to use a tool called Multi Links. It's free. It's a Firefox plug- in. It's great. What that allows you to do is highlight any section of a page, and it will copy the links within the highlighted section to your clipboard so then you can just easily paste them into Microsoft Excel or Google Docs or whatever spreadsheet program you might want to use. So now you've got this great list of sites that link and sites you want links from. From there, you just have to get their Twitter handles. Most websites now have Twitter information in their Contact Us. You can either take a day and just go through manually, or if you have like an intern, maybe that is something he or she could do. What I've done in the past is just build a simple PHP scraper, which will find the Twitter.com links that contain their handles and just scrape those out. But if you're not the scraper building kind, which not everybody is, you can also just do it manually. It takes some time, but we're investing. We're investing in strategies for the future. So that's step one of finding your targets, is you found websites, and then you found the Twitter handles that go with those websites. Step two we're actually going to do the same thing, but in reverse. We're going to use Followerwonk. Yay Followerwonk, which you should all have subscriptions to with your SEOmoz Pro account. It's the best tool. I used it before SEOmoz bought it. So there. What you're going to do is look for your target. So Followerwonk allows you to search for people's Twitter bios based on keywords. So maybe you're looking for architects. Maybe you're specifically looking for architects who live in New York. You can search on their keywords. You can search locations. But again, because what we're looking for here is publishers, we want to make sure that we're only looking at profiles that have a URL associated with the profile. A really easy way to do that is to just put .com and nothing else in the URL box when you're searching on Followerwonk. That will bring back any account with your keywords that have a .com URL. You can do the same with .org or .net if you want .net links. Whatever you want to do, but that's a really great way to bring back a broad selection of people, most of whom will probably have some kind of publishing power associated with that site, or know somebody who does. You can also take your initial list from step one and plug it into Followerwonk's compare and contrast function, which will allow you to see who are the people who follow Profile A as opposed to Profile B as opposed to Profile C. People who follow those people are probably good people to target as well. An even better set of targets are the people that all of these people also follow. Again, they all follow Barack Obama. Barack Obama is not going to link to you. It's okay. You're still special. But again, be realistic. You can pull up a whole extra list of Twitter handles, and that would be your target. So now you're going to put them into Twitter. You're going to create a private list so nobody else knows that you are like, \"This is my link target list.\" Make sure that's private. Now it's time to actually talk to them and build relationships. Again, this is something that is going to take time. It's not going to happen overnight. So this is something you should be doing in conjunction with your other link building and content building strategies, but over time it can be really successful. So you're going to talk to them. Just start talking to people every day. Some things that you might say to them, you could share their stuff. You want them to share your stuff, start by sharing their stuff, because sharing is caring. You could also say, \"Hey, you're really great.\" Don't just say, \"Hey @RuthBurr, you're really great.\" I'm going to be like, \"Hey.\" Instead, while you're sharing my stuff, maybe say, \"Awesome post from @RuthBurr, very insightful.\" Then I'll see that and I am like, \"Oh, I'm insightful. I like you.\" That's what you want. Compliments are good. People like to feel important. They like to feel special. They like to feel cool. A really great tactic for this, and this is something that can also inform your content strategy is to answer a question. So every day when you're doing your tweets, you can look in your special link target list, and just do a quick search for question words - who, what, where, when, why, is there, why isn't there - and spend some time answering questions if you can. Again, what you really are trying to say is you're trying to provide some value. You're trying to build a good relationship. Make them think that you're cool. So if you have a good answer to a question, provide it. If you know of a resource that they're asking for, provide it. If no such resource exists, \"Hey, I've got a great content idea for you. Why don't you create that resource.\" Now when they're like, \"Why isn't there a guide for pet owners who are also gluten free,\" you can be like, \"There is. I've created it. It's right here. There you go.\" Number four, one of my favorite things to do is to introduce people to other people. You can be like, \"Hey so-and-so, do you know this guy? He's awesome and I think you guys would really like each other.\" A suggestion that seems totally altruistic, all you're trying to do is connect people to other people. People might make a new friend or get a new resource or make a new contact, and they get something out of it. Again, you're reinforcing the idea that you are somebody who's providing value online. You're doing all of this stuff and over time you want to track who are the people who are responding to this. Who are the people saying, \"Hey, thanks for sharing,\" or, \"That was a great tip\"? Over time you are really going start to figure out who are the people who are responding that you're actually building a relationship with? Who are the people that are not picking up what you're putting down? If they are not picking up what you're putting down, take them out of the list, stop targeting them, move on. Now you've spent some time building relationships. You can discreetly and tastefully ask them to share your content. We're not talking about carpet bombing your entire list one day with, \"Hey, check out my new infographic.\" But when you create a piece of content that you think some of your Twitter relationships would like say, \"Hey check this out, I think you would like it.\" Don't say, \"Please link.\" Don't say, \"Hey could you link to me.\" That's creepy. People don't like it unless they're your really good friends. Instead try, \"Hey, check this out. Thought you'd like this. See what you think.\" People if they like it, if you're creating good content, you make them aware of it, and they naturally share it especially because you've already planted the seeds in their minds that what you're providing is valuable. Now this all sounds like it's going to take a lot of time, and this part does take a lot of time. This is the part that you really invest a couple of days in. But this part can be done in just 15 minutes or half an hour a day. All you do is go online, go on Twitter for 15 minutes. Spend five minutes replying to stuff, five minutes retweeting and sharing other people's stuff, and five minutes talking about your own stuff. When you do that, it's really easy, and you get a nice variety. Don't do it at the same time every day, because people tend to use Twitter the same time every day. If you mix up the times that you're doing it, you're going to target more of your overall list. You don't have to talk to everybody every day. Just try to talk to some people. Try to get to everybody once a week. Whatever feels natural. Just talk to some people every day, and over time you'll build these relationships. Then when you create your really great pieces of content, you have people you can ask to share, check it out, link to it, and you get links and shares and friends. Thank you.\" Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using Twitter for Link Relationships"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using Twitter for Link Relationships"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ruth Burr Reedy\n          \n            Ruth Burr Reedy\n          \n            Ruth Burr Reedy"
}