{
  "url": "https://moz.com/blog/using-small-website-to-create-a-bigger-impact",
  "slug": "using-small-website-to-create-a-bigger-impact",
  "title": "Using Small Websites to Create a Bigger Impact - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We all like links from big sites right?\n\nWhether it's in an editorial article, a guest post, etc, it's great for sending some strength and trust to your site. However, the drawback of links from big sites, is that you might find it's on a small page. The newly published page will take some time to…",
  "content": "Using Small Websites to Create a Bigger Impact Link Building By: Rob Ousbey July 1, 2009 Table of Contents Copied! By: Rob Ousbey July 1, 2009 Using Small Websites to Create a Bigger Impact Link Building We all like links from big sites right? Whether it's in an editorial article, a guest post, etc, it's great for sending some strength and trust to your site. However, the drawback of links from big sites, is that you might find it's on a small page. The newly published page will take some time to get indexed, much of it's strength (certainly initially) is likely to come from internal links, and it's unlikely to have a great crawl rate. The front pages of sites, on the other hand, tend to have a much greater diversity of domains pointing to them and a good crawl rate. Furthermore, Google is likely to look with suspicion at an old article that suddenly gains a new link, compared to site front pages which have new links added to them more often, and legitimately. So, this suggests that a link from the front page of a small site may be better than a link from an inner page on a large site. If this diagram makes sense, you probably don't need to read the rest of the post. As an example, I dived into the Lifehacker archives, and found their coverage of a handy looking tool, Programmer's Notepad 2. Let's imagine that the site owner had done the work to contact Lifehacker, foster a relationship and ultimately get them to post coverage of the app. You can now see their link on this page: lifehacker.com/5105267/programmers-notepad-2-helps-you-code-wrangle (mozRank: 0*, mozTrust: 2.5) (* N.B.: this page is fairly old, and has been rated by Linkscape - the mozRank is just very very low and rounds off to zero.) Of course, they've also been mentioned by smaller sites. I imagine that these sites either found out about them through the grapevine, but I like to think that the app's owners also fired off a few mass emails to programming / web dev websites to say \"Check this out, we built it and I think you might like it.\" So check out some of the small sites that have linked to them from the front page: Domain URL MozRank URL MozTrust www.pappons.com 1.28 1.12 www.jasonbadams.net 1.78 2.36 links.tecwiz.de 2.08 1.39 dintiradan.ermarian.net 2.49 2.54 www.deleyna.com 2.33 3.24 freeware.startingiseasy.com 3.30 3.00 (Ordering the Linkscape report for the Programmer's Notepad 2 site, by \"mozRank Passed to URL\" suggests that Lifehacker.com first appears at around the 400th page in the list.) The downside of a link on the strong-front-page-of-a-less-strong-site is that it isn't going to be around forever, and may be removed at somepoint. However, the strength passed in the mean time, combined with the quick indexation of the links will be beneficial. This works particularly well when you can contact smallish sites in a very relevant niche. To find those sites, I currently recommend having a drill down in these directories: www.Blogged.com, dir.Blogflux.com, and also that you look for directories of sites in that niche. For instance, whilst trying to find some UK craft websites this week, I found that Craftyblogs.co.uk was very helpful. There are bound to be similar niche lists for almost anything you need to look for. In summary: when planning your linkbuilding strategy, don't forget that whilst links from strong domains can be useful, weaker domains can often pass more strength if you are linked to from the front (or other strong high level) page. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using Small Websites to Create a Bigger Impact"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using Small Websites to Create a Bigger Impact"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rob Ousbey\n          \n            Rob Ousbey"
}