{
  "url": "https://moz.com/blog/using-your-whole-business-to-build-links",
  "slug": "using-your-whole-business-to-build-links",
  "title": "Using Your Whole Business to Build Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I am a big advocate of looking for ways that clients' businesses can support link acquisition. For those of you at the expert seminar this week, this fits closely with Rand's presentation on enterprise link building strategies. It became clear at the seminar that there are a lot of in-house SEOs…",
  "content": "Using Your Whole Business to Build Links Link Building By: Will Critchlow August 23, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Will Critchlow August 23, 2008 Using Your Whole Business to Build Links Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In my opinion, anyone working in marketing should be reading Seth Godin's blog. Seth is a new marketing expert and his brainstorms and thoughts regularly give me new ideas. I am in the middle of reading one of his books, Meatball Sundae. Its contents won't surprise anyone who reads Seth's blog; its premise is that mass market products are \"meatballs\" and the new marketing (in which he includes SEO) are \"sundae toppings.\" Trying to add sundae toppings to meatballs results in a mess, and organisations need to be built from the ground up with new marketing built in. We'll get on in a second to situations where this isn't exactly true, but the basic premise is certainly tempting: Paypal wasn't done by an established payment provider - it was a start-up Ebay's marketing looks nothing like Sotheby's Amazon apparently gets ~30x the traffic that Walmart's website gets There are a few situations where I would disagree with the conclusion that you always get a mess when you add new marketing to old businesses, particularly in SEO. Understanding the basics of SEO (not even linkbait, etc., but just keyword research and basic technical on-page SEO) can be enough to form a valuable sales channel for old-school businesses. There are \"meatball\" businesses like Tesco (our largest supermarket in the UK), who has broadly understood SEO (although they have a long way to go in some areas, they are miles ahead of the competition) and who is now popping up as competitors across many many verticals. I therefore think it can be possible to translate old-school success into SEO success with some creativity, and it is still possible to start up in traditional ways in many sectors and at least gather local search traffic through basic SEO techniques, even when the website is effectively an afterthought to the core business. However... It is an analogy that has great use for those of us who have to sell SEO and even more so for those of us who have to explain to over-enthusiastic prospects that SEO is not a magic switch we have under our desks marked \"Google rankings.\" Link building What do you mean by link building? How do you do link building? We know from Rand's question and the enthusiasm for various linkbuilding tips that acquiring links is something many SEOs struggle with. There are a variety of ways of 'building' links - some to be recommended and some definitely not: Directory links and those that you get automatically just by asking / submitting Asking for each link and \"selling\" to the individual webmasters Link worthy content (and asking for links off the back of this) Linkbait through social media / viral ideas Spam Buying links (through a network) Buying links individually These are all the ways normally discussed for getting links (OK, OK, I'm sure I've missed some that are technically different, but almost anything will actually fit into one of these categories). But Meatball Sundae teaches us that there is another way: Build your business in such a way that it acquires links For most of us working on the agency / consulting side of SEO, it is hard to make business model changes (certainly fundamental ones) to our clients' businesses, but if I were starting a new business, you can be sure this would be a priority of mine. Even in established businesses, it can pay to think like an entrepreneur when looking for ways of shaping the business for links. Lessons we can apply I am a big advocate of looking for ways that clients' businesses can support link acquisition. For those of you at the expert seminar this week, this fits closely with Rand's presentation on enterprise link building strategies. It became clear at the seminar that there are a lot of in-house SEOs who read SEOmoz, and for you guys (or agencies working with larger clients) I think a critical success factor will be exactly this. In no particular order, here are a few ideas I have had on this subject (I'd love to see more in the comments): Partnerships and content syndication and all other ideas from Rand's presentation Rand's presentation at the expert seminar this week talked about this and a variety of other enterprise link-building tactics. I have tried to avoid re-using his ideas (apart from the unicorn link, below). All of his ideas belong in this list as well. If you weren't there, they'll all be out on video soon... Releasing financial information in link-friendly ways Obviously this is closely regulated, but within the confines of what you are allowed to do, consider carefully how financial information is released as there are many places that are guaranteed to cover it, so some basic linkworthiness and keyphrase research goes a long way. Allies and internal partnerships You will have a PR and marketing team. Making friends with them and getting them on your side means that your budget just effectively grew. Both advertising and publicity can attract links if done in the right way. The best advice I can give here is not to preach but rather to help them look good to their boss. Just like any networking interaction - think what you can do for them. Internal networking is no different. Use your homepage If you create linkworthy content and you have a big brand, then you don't need social media to begin the process of spreading it. If your homepage gets tens of thousands of visitors a day, then hitting your own homepage can be as good as hitting the Digg homepage (remember that your content is going to be a lot more relevant to your average visitor than the average Digg visitor). Integrate your linkbait into your business. Use your email list We've been talking about this one quite a lot at Distilled HQ and maybe it'll be the subject of its own post sometime soon, but the power of building (what Seth calls) a permission-based relationship with people whereby they not only subscribe to your special offer newsletter but also want to hear when you launch new pieces of linkbait is hard to overstate. Think this is crazy and no-one would ever do that? Consider viral ideas like 10 reasons it would rule to date a unicorn. I think a lot of the people that appealed to would love an email when the next one in the series is released. This is not an exhaustive list (and hasn't even really covered the ways your business can be linkworthy in itself), so I'd love to see your ideas and thoughts in the comments... Quick note to say thanks to everyone whose hard work went into the expert seminar this week. I got a lot out of the sessions and the networking and it was especially good to put faces to avatars when meeting so many people I've spoken to online but never met before. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using Your Whole Business to Build Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using Your Whole Business to Build Links"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Critchlow\n          \n            Will Critchlow\n          \n            Will Critchlow"
}