{
  "url": "https://moz.com/blog/using-google-image-search-to-drive-traffic-to-your-site",
  "slug": "using-google-image-search-to-drive-traffic-to-your-site",
  "title": "Using Google Image Search to Drive Traffic to Your Site - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In the search to find the best ways to promote or drive traffic to your site, Google Image Search is often overlooked. While ranking for terms in Google Image Search is unlikely to ever bring you massive amounts of traffic a la Digg or StumbleUpon, the steps to optimize your images for Google Image…",
  "content": "Using Google Image Search to Drive Traffic to Your Site Whiteboard Friday C By: Caydel May 24, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Caydel May 24, 2007 Using Google Image Search to Drive Traffic to Your Site Whiteboard Friday This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In the search to find the best ways to promote or drive traffic to your site, Google Image Search is often overlooked. While ranking for terms in Google Image Search is unlikely to ever bring you massive amounts of traffic a la Digg or StumbleUpon, the steps to optimize your images for Google Image Search are extremely simple, and the traffic gains you do make more than make up for the effort. As an example, we will use the image of Barry Schwartz, Chris Boggs and Daron Babin at SES Chicago 2006 doing the Search Pulse one evening. Photo Credits SmallBusinessSEM.com Note:I borrowed (stole) this image from Barry’s blog. Check it out - it’s always a great read. The first two steps are more SEO 'common sense' than anything else--they should always be performed in order to include extra keywords in your content so that you'll provide more context for your pages. In addition to being common sense for general SEO, they are an absolute necessity for good results in the Google Image Search. Steps to Optimize Your Images for Google Image Search Use Descriptive Filenames - A filename can present you with your first chance to include keywords in your images. Title the image with a word or short phrase which describes what is in the image. For example, rather than using a camera-assigned filename such as DSC05443.jpg, use a filename like barry-schwartz-chris-boggs-daron-babin-SES-chicago.jpg. Notice the way that I have used a dash (-) between the words in the title - this is commonly interpreted by Google as a space in the filename. This is the most search engine friendly way of labeling images. Use the alt tag! - the alt tag in your image link code will allow you to include some more keywords describing your image. Additionally, the alt tag text will be displayed by Google Image Search in place of the filename in each search result. Therefore, use that as well when linking your code. Here is an example for the example image we are using: <img src=\"/images/barry-schwartz-chris-boggs-daron-babin-SES-chicago.jpg\" alt=\"Barry Schwartz, Chris Boggs and Daron Babin at SES Chicago\" /> Get Included in Google Image Labeler - The Google Image Labeler is a game in which you and a partner collaborate to write tags for images presented. You receive points when you both submit matching tags. The matching tags are then assigned to the images, and taken into consideration for the Google Image Search search results. In order to ensure that your images are included, access your Google Webmaster Central account, and go to the management page for your site. In the left hand bar, you will see an link which says ‘Enhanced Image Search’. Clicking this link will present you with the option to opt-in to the Enhanced Image Search features. This option signifies to Google that you are allowing them to use tools such as the Image Labeler to assist in the indexing of the images on your site. These steps will help ensure that you can get your images ranking in the Google Image Search. As I said above, GIS is not likely to drive nearly as much traffic as many other means; at the same time, the steps to optimize for GIS are quite simple. How else could you optimize for Google Image Search? How else could you use your site's images to drive traffic? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using Google Image Search to Drive Traffic to Your Site"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using Google Image Search to Drive Traffic to Your Site"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Caydel\n          \n            Caydel"
}