{
  "url": "https://moz.com/blog/using-clusterbased-engines-to-discover-keywords-themes",
  "slug": "using-clusterbased-engines-to-discover-keywords-themes",
  "title": "Using Cluster-Based Engines to Discover Keywords & Themes - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A list of clustering search engines can be used to help understand how the search engines are currently perceiving the links & topical nature of you...",
  "content": "Using Cluster-Based Engines to Discover Keywords & Themes Mobile SEO By: Rand Fishkin February 5, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 5, 2005 Using Cluster-Based Engines to Discover Keywords & Themes Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A list of clustering search engines can be used to help understand how the search engines are currently perceiving the links & topical nature of your website. Meta-search clustering engines like Kartoo are even more helpful as they use data from Yahoo! & Google to help construct a word clustering theme that surrounds your website and your competitions. This is another tool that can be used to see which terms and phrases your site is 'on-topic' for as compared to the competition. Another useful tactic with visual clustering engines is to examine a link query and check the themes of the sites perceived to link to you. In this manner, you can get a great approximation of the terms that are used on the pages and in the anchor text of your most important backlinks. You can then conduct this analysis on your top competitors and see where the difference is, giving you a good suggestion of what you may need to focus on for link-building in the future. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using Cluster-Based Engines to Discover Keywords & Themes"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using Cluster-Based Engines to Discover Keywords & Themes"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}