{
  "url": "https://moz.com/blog/using-your-blog-for-niche-market-research",
  "slug": "using-your-blog-for-niche-market-research",
  "title": "Using Your Blog for Niche Market Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While I’m convinced that the reason most businesses fail is a self-sabotaging manic depressive CEO, lack of market research is a close second place.There are two main sources of ideas for product development.  One of them is wildly hit or miss, and the other is actually fairly consistent for a…",
  "content": "Using Your Blog for Niche Market Research Content Marketing D By: daniscool September 8, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: daniscool September 8, 2009 Using Your Blog for Niche Market Research Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. While I’m convinced that the reason most businesses fail is a self-sabotaging manic depressive CEO, lack of market research is a close second place. There are two main sources of ideas for product development. One of them is wildly hit or miss, and the other is actually fairly consistent for a win. Let’s see if you can figure out which one. Source #1: (CEO walks in) “Guys, guys! I just had the perfect idea! You ever notice that everyone hates paying tolls on the road?” (Staff stares blankly) “Well I was thinking, why don’t we set up coffee carts at every toll booth? They already have their wallet out, and most are on their way to work. I’m thinking we should invest our last 6 months of profits into “Toll-taly Java”!” Isn’t that awesome? I came up with that name myself by the way.” (Staff is about to speak) “Oh don’t bother worrying about it, I already bought all the coffee, espresso machines, and made a down payment to the Garden State Parkway.” (Painful sigh heard around the world) Source #2 SEOmoz subscriber notices on Google Trends a high amount of searches for “how do i has energy on long toll road trip” and on Yahoo Answers, “I dreamed I had a skinny latte at the toll both.” The SEOmoz subscriber realizes that this just might be a sign that selling coffee at toll booths could be a way of the future. He sets up a PPC campaign along with SurveyMonkey to do an initial test. If you guessed Source #2, you are significantly less mentally challenged than most online marketing “entrepreneurs” I run into. Some would even say you could run a non-profit branding PPC campaign without supervision. The problem is that if you’re looking where everyone else is, you’ll end up way behind on any creative boom in marketing. Plus, Google Trends and other marketing reconnaissance services only give you what is getting massive, massive volume. What you generally want are small niches that have enough volume to bring in the bucks, but zero competition. This is where your blog comes in. If you are a new blogger, especially a generic, less focused blogger you actually have an advantage here. I run a personal development blog at http://www.wordofdan.com If you want to test your marketing skills, open a new tab, go to the site, and take a guess which article gets the most organic search traffic. Ok, ready? . . . . If you guessed “How to Break an Addiction to Tylenol PM,” you were correct. So how does this help you? Well, it just so happens, that as of today, August 27, 2009, Google Keyword Tool reports that there are 2000 monthly searches for variations of “Tylenol PM addiction.” There is also no advertising on that subject whatsoever. Does this give you an idea yet? If not, you are really hurting in the creativity department. All I would have to do is take down my original blog post on the subject (which is front page on Google for the term), and create a fluffy 10 page special report on how to kill the heartbreaking, family destroying dependence on the drug the evil Johnson & Johnson corporation created for this very purpose. “No more tears,” my ass. Do they know how much your family members cry when you reach for that bottle of blue and white pills? So we have a nice search volume with zero competition, a special report written that actually does what it claims to do, and easy access to create an AdWords campaign. Charge $15-40 bucks for it, and use Google Website Optimizer to split-test pricing and copy. While I’m not sure you could pay your rent on this business alone, once you take some hours to set it up, it becomes a nice side income that doubles and triples once you pick up more “hidden niches” like this one. There's also very little account maintenance besides general AdWords checkups, depending how much time you want to invest. If you’re completely morally bankrupt, you will also find a smaller niche of people searching for “how to get high off of tylenol pm.” Build another special report, and do the same thing. However I’ll warn you that anyone reduced to using Tylenol PM as their club rave drug of choice is probably not the type mommy trusts with her credit card. You should have the idea at this point. Using Google Analytics, keep track of any “surprise” keywords that get you a lot of hits on your site. The less related to your blog niche, the better. --Dan Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using Your Blog for Niche Market Research"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using Your Blog for Niche Market Research"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "daniscool\n          \n            daniscool"
}