{
  "url": "https://moz.com/blog/using-whitelabel-sites-for-seo",
  "slug": "using-whitelabel-sites-for-seo",
  "title": "[White Label Website] Using White-Label Sites for SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "First off, just to clarify, this post is a discussion about white-labeling your e-commerce business in a number of ways and the possible SEO ramifications of this, rather than white-labeling SEO services. What's all this white-labeling stuff then?  A white-labeling is a site which sells your…",
  "content": "Using White-Label Sites for SEO Online Advertising By: John McElborough June 17, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: John McElborough June 17, 2010 Using White-Label Sites for SEO Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. First off, just to clarify, this post is a discussion about white-labeling your ecommerce business in a number of ways and the possible SEO ramifications of this, rather than white-labeling 'SEO services'! What's all this white-labeling stuff then? A white-label is a site which sells your products directly but under a different domain, brand or company name. This type of site is different to an affiliate or drop shipping site, although they share some characteristics. They're particularly popular in the retail, travel and gambling sectors. What I'm going to discuss in this post is the specific ways you can use white-label sites and what part they may play in your SEO campaign. Local white-labels A local white label is where a company who sells nationally or internationally produces local satellite sites which sell the same products which focus on a localized audience. Example Flowers direct offer online flower delivery UK wide. They also run over 100 local white-labels like http://www.walkersflorists.co.uk, http://www.wembleyflorist.co.uk, http://www.duston-florist.co.u... which all sell the same flowers as part of a UK distribution network but are optimized for local terms. There's a few advantages to this approach. Firstly it allows far greater keyword coverage than you can achieve with one site. Effectively having 100+ homepages means you can take on semi-competitive local terms much more efficiently while also optimizing each location for thousands of long tail location based keywords which would be impossible to target with a single national site. When you segment your white-labels locally (and you also have a physical presence in each location) you can also drive traffic through Google local with separate local listings for each site. The other big braw of this type of white-label is its link appeal. If you create 100 sites off the same basic platform on independent domains each of those sites can link back to your main site creating a mini link pyramid. The value of these links may depreciate if each site is hosted on the same IP or if the local sites don't have any link equity in their own right, but still these links are worth having, particularly if you're in a competitive market where links are hard to come by. Its worth pointing out at this stage that link pyramids or link 'empires' can have fairly black hat applications. They're probably more often used by spammers than by legitimate businesses in fact so if you're building your own white-label empire make sure there's a tangible reason for you to host your content over hundreds of domains rather than just one! In the case of Flowers Direct they a perfectly legitimate business reason for using this approach, not just an SEO reason. Keyword rich domain white-labels This method is pretty similar to the local white-labels but instead of segmenting your white label sites by location you host your content over a number of keyword rich domains. Usually this will be used to target a particularly competitive term with an exact match domain or to try and dominate the first page for a keyword with more than one ranking. Example 888.com host a number of white-labels across domains like http://www.online-casino.com/ The real advantage of this technique is its lets you diversity your keyword strategy and rank on particularly competitive terms which may be easier to crack with exact match domains than with internal pages on your main site. In particular this strategy can be beneficial to brands who don't have keywords in their main domain name and it offsets the effect of shifts in algorithms towards favoring keywords in domains. For example the online-casino.com example ranks better in Bing than it does in Google. As Bing becomes more important, so might this strategy. For less competitive terms using multiple websites in this way may give you the opportunity to rank twice for your most important keywords. For more competitive terms you can treat your keyword rich white-label domain with less concern than your branded domain, allowing you to use more aggressive SEO techniques to promote it. Like the local example you can also use this type of white-label to 'link up' to your main site. It also has a role in reputation management as you can optimize the white-label for your main brand name. Site sharing or co-hosted content Site sharing happens when you place your content as a subsection of a site in another niche. Example Lastminute.com white-label their hotel booking system on nationalrail.co.uk The main reason for pursuing this type of strategy is usually to tap into a new audience to make sales but there's also SEO considerations. For lastminute.com hosting the National Rail hotel booking engine means they get 14,000 pages on a trusted domain, allowing them to rank twice for long tail keywords. It may also mean getting followed backlinks with controlled anchor text from that domain, like you can see at the bottom of this page. Also because your content is hosted on a site which the user will likely already know and trust, conversion rates may be significantly higher than if you drove the same visitor to your branded site. Because this strategy usually involves white-labeling full or part duplicates of the content on your main site there may be a duplicate content consideration here- especially if you're white-labeling onto domains which are better established than your own. Co-branded affiliate sites Similar to the co-hosted white-labels above, co-branded sites differ in that the main domain name is used but the site is branded in the style of the referring affiliates site. Example Booking.com offer affiliates a co-branded option where the booking.com site displays the branding of the affiliate like you see on Love Ibiza's hotels pages The advantage of this approach from an SEO perspective is the merchant gets direct links from the affiliate to their main domain. In the booking.com example the co-branded sites use a url variable to display the relevant branding for each affiliate. The rel=canonical tag could then be used to remove duplication of pages and retain the link equity passed by the affiliate. This is really the same as running any in-house affiliate program that passes link weight. If the affiliate nofollows the link or passes it through their adserver the merchant won't get any value from it but affiliates may be more likely to link directly to a co-branded site rather than a standard affiliate link. 3rd party white-labels (aka drop shipping) 3rd party white-labels work in a similar way to drop shipping, although typically the product supplier will manage the website and orders directly and the 3rd party's only involvement is in marketing the site (whereas in a drop shipping agreement the affiliate will run the website independently and the drop shipper will only be responsible for fulfillment) Example The Pack Shack is a white-label of McFarlane packaging managed by McFarlane's but marketed by the removal company who owns the brand. The products supplied through the site are in this case also branded with the removals company logos, meaning the customer only see's the established brand name and has no contact with the actual supplier brand. This strategy can work well when you are better known in B2B than B2C as it allows you to capitalize on consumer facing brands without having to build your own. When a site is fully white-labeled the direct SEO benefit to the supplier is often negligible as your brand will be invisible. If you're setting up this type of arrangement it may be worth including footer links back to your main site, as you'll usually control the content of the white-label site. On the whole as an SEO strategy this is effective as it reduces marketing overheads and means rather than promoting your own site you can let your partners compete while you concentrate on fulfilling orders and securing new white label partnerships. Nice work if you can get it! But don't forget your white-label partner brands could lose interest in the product or be tempted into a more lucrative deal with a competitor so I'd only ever use this strategy alongside your own main domain. White-labeling, the future of ecommerce? From what I've seen, particularly in the UK ecommerce sector, white-labeling is going to rise in popularity and in some cases may even become an alternative to traditional affiliate marketing for brand conscious companies who want to work with a select group of trusted partner sites or retain complete control of their network while operating across multiple sites. Technology is a big driver of this. 5 years ago most retailers online operations were an extension of their real world shops and their backend infrastructure was geared up more for a physical store than an online one. Now most e-tailers have invested in sorting out their backend systems and are realizing that the website itself is just like a shop front, which can be skinned in many different ways to sell the same products to a different audience. Furthermore as SERPS and ranking factors become increasingly unstable it makes sense to maintain a multi-domain or even multi-brand strategy. This way you diversify your rankings and traffic sources thereby reducing risk. John McElborough is a freelance SEO consultant specializing in the ecommerce and travel sectors Note from Jen: I screwed up and put the wrong version of the post up! I just updated it to reflect the correct version - 6/18/10 11am PST Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using White-Label Sites for SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using White-Label Sites for SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John McElborough\n          \n            John McElborough\n          \n            John McElborough"
}