{
  "url": "https://moz.com/blog/using-google-plus-a-guide-for-local-businesses",
  "slug": "using-google-plus-a-guide-for-local-businesses",
  "title": "Using Google Plus: A Guide for Local Businesses - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google+ provides a multitude of benefits for individuals and companies looking to promote unique content and help better optimize their website for organic search. But when most small-to-medium sized business owners think of using social media or having a content marketing strategy, Google+ is…",
  "content": "Using Google Plus: A Guide for Local Businesses Link Building By: Brady Callahan November 7, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Brady Callahan November 7, 2013 Using Google Plus: A Guide for Local Businesses Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Google+ provides a multitude of benefits for individuals and companies looking to promote unique content and help better optimize their website for organic search. But when most small-to-medium sized business owners think of using social media or having a content marketing strategy, Google+ is forgotten and almost always left behind. Unfortunately, because Google has failed in their attempt to seamlessly integrate their social network in a relevant manner, many local businesses are left dazed and confused by simply trying to set up a company profile page. If you need help setting up a Google+ account, thorough, helpful walkthroughs already exist, but that’s outside the scope of this post. This post is meant to teach you how to utilize Google+ properly to create more exposure for your local business. Assuming your business has a Google+ profile, feel free to use the information below as a guide for social media strategy, SEO tips, and ways to keep your business fresh in the minds of your customers. Basic Setup and Implementation Once your Google+ profile has been set up, you can begin using it as another valuable social media asset. However, just creating a Google+ page isn’t enough to increase traffic, sales leads, or general interest in your business. Yes, the social network is heavily integrated into Google’s search algorithm, but no, magic does not happen simply by having a profile. Before you can create great content, share it with followers, and engage with customers, you must first make sure the profile is fully optimized. Verify the website and email address - As a brand page on Google+, it’s critical that both your business’ website and email address where customers can contact you are verified. Performing these small actions create a sense of authority and trust among users and help the search engine confirm the legitimacy of your business. On the “About” page of the profile, in the “Links” section, click the “Link website” button in order to complete the verification process. When you click the button, a pop up appears that looks something like this: Follow the instructions – or email them to your webmaster – and apply the small line of code to your website. When finished, click the “Test website” button. In order to verify the email address, simply click the “Verify” link next to the email in the “Content Information” section. Once you receive the email from Google asking for verification, simply follow the prompts and, \"Boom!\" You’re all set. Setting up your circles - Another aspect that differentiates Google+ from Facebook, Twitter, and other popular social networks is the way you connect with other people. Your circles are a way to follow other people’s accounts, notify people or brands of your existence, as well as topically organize your circles however you’d like. As somebody who’s had to teach people about Google+ in the past, the options circles give you has become one of my favorite parts about the search giant’s social network. Whether I’ve been talking with a social media professional or an oblivious local business owner, the discussion about setting up circles has created the most interest and intrigue on the other end of the conversation. For example, when you create a new profile, the circles are automatically generated like so: These circles probably don’t fit the profiles of your customers, nor are they the most search-friendly way to label and organize your following. Luckily, Google+ allows you to customize the names and number of circles you can have, creating unique branding opportunities. For example, a local news station may want to create circles of people to follow that can be categorized into each of the sections of its online newspaper. “(city name) News,” “(city name) Sports,” and others are not only properly labeled and easily identified by followers, but also are more likely to be shared by other people. If your business can develop an all-encompassing circle of influencers and businesses around a certain topic, it’s likely to be identified and shared by local and even national influencers. Additionally, creating a circle of your organization’s team members would give followers of the brand an easy way to connect and even interact with your employees. Enable authorship for all writers and contributors - If you’re familiar with the SEO industry, then you’ve seen the benefits of authorship when searching in Google. But just in case this isn’t an office-wide policy for your local business, it’s time to implement it. Research has shown that listings in Google search results that include authorship are more likely to be clicked, regardless of their location on the page. Ranking #1 for a given term doesn’t garner as many clicks if listings 3 and 5 have authorship integrated. Assuming your website has a blog or some other form of fresh content stream, authorship is a must for your contributors. In order to set up authorship, each writer or editor must have a personal Google+ profile. The easiest way to establish authorship is by following the instructions here. Setting this up will allow for greater exposure of content produced by your business and help build credibility toward your brand both locally and nationally. WARNING: Please make sure you don’t set up authorship for pages that aren’t specifically produced by a particular author. For example, don’t set up authorship for your “About Us” or “Order Here” page hoping to increase organic traffic and sales leads. I’ve seen this attempted and Google considers this a form of spam. Trust me, it won’t end well. Posting and Engagement The content you share on Google+ should follow the same rules and guidelines that apply on Facebook, Twitter, Linkedin, and other social networks. However, ignoring the unique factors that Google+ provides is wasting an opportunity to create search-optimized social posts and expose your brand to customers in more unique ways. Below are some tips and things to keep in mind when posting content about or created by your local business: Optimize title tags of posts – The first sentence of each post becomes the post’s title tag, which is one of the most important ranking factors and has a large impact on click-through-rate. Similar to the rules of headlines for newspaper articles, make sure the title of the post is intriguing and likely to be clicked by searchers and shared by readers. Additionally, the next sentence of the post is usually what displays as the meta description in the search results page. Are the most relevant keywords and enticing statements included in that portion of the content? They should be. When sharing, use the “Link” feature – It seems obvious, but I’ve seen things this ignored frequently. While you can include multiple links inside each and every Google+ post, the one link that passes value - what we SEOs call a \"do follow\" link - that search engines measure is the link inserted via the “Link” button. When specifically advertising a piece of content from your website, make sure that’s how the link is added. It’s better for both users and search engines. Index bonus for new content – The rate in which search engines index websites and their pages has a lot to do with how often the website is updated. In this case, sharing new articles and other forms of new content on Google+ has proven to have a correlation with faster indexation of those pages on your website. Google has shown favor toward and rewarded fresh content in the past via the Caffeine update, and sharing via Google+ is one of the greatest ways to ensure it gets your content is indexed quickly. Don't forget about editing - You have the ability to edit social posts even after they were originally published! This feature gives Google+ a unique advantage for the content publisher. Be creative! Whether it’s adding an image, correcting an error, or making an additional statement or two based on feedback, the possibilities are endless. Formatting tips - When crafting the social post, surrounding a word or phrase in “*” will create a bold feature, surrounding a word or phrase in “_” will create an italicized feature, and surrounding a word or phrase in “–“ will create a strikethrough feature. Once posted: *Words* will appear as Words _Phrases_ will appear as Phrases -Sentences- will appear as Sentences Microblogging is an option - While character limits constrain content length can on other networks, Google+ doesn’t prevent you from turning your posts into microblogs. Sometimes the best engagement and sharing on Google+ comes out of a post that, instead of just linking to a webpage, includes a large chunk of that pages’ content within the post itself, and then guides the reader to read the rest of the story by sharing the link. If you’re really feeling ambitious, posting the entire piece of content as a social share alone – with no link – has also been done and can lead to greater engagement from followers. Don’t be afraid to test these strategies to see which work best for brand’s followers. Sharing strategically – Assuming you’ve set up uniquely identified circles, take advantage of Google+’s ability to share content only with certain people. For example, a sports story may not always be relevant to share to all circles as its level of detail and expertise would only attract the most avid sports fans. Explore the different combinations of circles and see how followers react to different types of content you produce in order to maximize engagement and sharing potential. Encourage +1s - Companies sometimes ignore Google+ because it seems nobody is active on the social platform. While that may seem true on the face, it’s an incorrect statement. Google+ is directly integrated into Google search and everyday people are performing search queries while signed in, creating personalized search results that could at any time include results directly from Google+. However, to help grow the following of your account, it would help if you performed the following actions: Occasionally promote the Google+ page on your social accounts with biggest following. Add a “+1” button to your website in order to allow readers to +1 each article as well as “Like” or “Tweet” it. +1s are (probably) another search ranking factor that help your content get discovered and maybe even ranked higher. Hangout with your customers! - Google’s Hangout feature on Google+ allows you to get face-to-face with your following and have a conversation with them in real-time. There are countless creative ideas using this tool and is probably worth a day or two of brainstorming with your entire team. Are there questions your customers are asking that would best be addressed on live video? Does your “Frequently Asked Questions” page fall short? You can also record video and post it to Google+ later, creating a piece of rich media that could be extremely valuable to your following. Recording a conversation about the latest industry news and how it affects your business may calm the nerves of your customers. Or, recording a video of your latest product and showing it in action may give people the reason they needed to go visit your store. For real-life creative examples of Google+ hangout videos, Conan's team has done this really well in the past. Connecting with Local Influencers When creating your circles, hopefully you’ve targeted and added local – and even national – influencers that may have an interest in the content you’re sharing. Google+ gives you the unique opportunity to notify an influencer of your presence in a more natural, less awkward way than most other social networks. Mentioning them in posts, commenting on their posts, adding them to a circle, and more will all notify that person thus increasing the exposure of your brand and getting your content in front of influential people. Without being spammy, your local business can continue to expand it’s reach in your city and beyond by introducing itself to powerful people and showcasing unique content. The Local Carousel and Reviews When performing location-based queries, have you seen the new carousel feature? I bet you have (see the query for “atlanta restaurants” below). Launched earlier this year, the local carousel is designed to get the most relevant locations nearest you to the top of the SERP in order to help you find the business you’re looking for as quickly as possible. How does one get their business listed in the local carousel? I’m so glad you asked. If you perform multiple queries, it’s clear that a number of positive reviews are the best way to increase your chances of moving into the carousel and closer to the far left of it. If your business has long-time customers that you’ve built strong relationships with, politely asking them to review your business on Google probably isn’t asking too much. Google+ Local integration increases the power your local business can have when properly optimized for search. But not all of the reviews should be done your customers. In fact, it’ll look significantly more reasonable when you request reviews if your business is leaving valuable, positive reviews of businesses in and around the local area. David Mihm wrote a blog post on barnacle reviews earlier this year, and after reading it I immediately thought I’d try his experiment in order to increase the exposure of a local business’ brand. After a couple months, the experiment was proven extremely successful. I highly encourage you go read the post for yourself, but the short of it goes like this: Using your local business’ Google+ profile, leave honest, detailed reviews of local businesses in your city. Restaurants, parks, museums, whatever you'd like. The most detailed reviews are bumped to the top of the Reviews page. If yours is deemed most valuable, that becomes another SERP impression and additional organic search exposure for your brand. Not only does your brand get to interact directly with other businesses, but you also establish yourself as an authority figure in the area. The Barnacle reviews idea was successful and an incredibly easy way to get additional exposure and traffic. I would highly suggest testing it out with your business page. You won’t be disappointed. Other Practical Google+ Tips Google+ looks complicated at first, but when you dig into the social platform the SEO impact of utilizing it properly can be tremendous. Here are some other hands-on tips for using Google+ in an impactful way: Get people to share and promote your content using the +1 button Comment on other people’s posts as the brand Encourage engagement and interact with your followers Add influential people – especially in your local area – to your circles Make it easy for people to know you have an active G+ profile What are some of the best ways you’ve seen Google+ used by smaller brands? While I’m known as a Google+ expert to most of my friends and colleagues, I by no means have an all-encompassing knowledge of the social network. If I’ve left out some key strategies or ideas, please let me know in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using Google Plus: A Guide for Local Businesses"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using Google Plus: A Guide for Local Businesses"
    },
    {
      "level": "H3",
      "text": "Basic Setup and Implementation"
    },
    {
      "level": "H3",
      "text": "Posting and Engagement"
    },
    {
      "level": "H3",
      "text": "Connecting with Local Influencers"
    },
    {
      "level": "H3",
      "text": "The Local Carousel and Reviews"
    },
    {
      "level": "H3",
      "text": "Other Practical Google+ Tips"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brady Callahan\n          \n            Brady Callahan"
}