{
  "url": "https://moz.com/blog/using-modern-seo-to-build-brand-authority",
  "slug": "using-modern-seo-to-build-brand-authority",
  "title": "Using Modern SEO to Build Brand Authority - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEOs have a leg up in the branding game, as SEO and branding are far more intertwined than most people realize. This post shows you how to align those efforts to compound your return.",
  "content": "Using Modern SEO to Build Brand Authority Advanced SEO | Branding By: Jason Acidre July 30, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jason Acidre July 30, 2014 Using Modern SEO to Build Brand Authority Advanced SEO | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's obvious that the technology behind search engines' ability to determine and understand web entities is gradually leaning towards how real people will normally perceive things from a traditional marketing perspective. The emphasis on E-A-T (expertise, authoritativeness, trustworthiness) from Google's recently updated Quality Rating Guide shows that search engines are shifting towards brand-related metrics to identify sites/pages that deserve to be more visible in search results. Online branding, or authority building, is quite similar to the traditional SEO practices that many of us have already been accustomed with. Building a stronger brand presence online and improving a site's search visibility both require two major processes: the things you implement on the site and the things you do outside of the site. This is where several of the more advanced aspects of SEO can blend perfectly with online branding when implemented the right way. In this post, I'll use some examples from my own experience to show you how. Pick a niche and excel Building on your brand's topical expertise is probably the fastest way to go when you're looking to build a name for yourself or your business in a very competitive industry. There are a few reasons why: Proving your field expertise in one or two areas of your industry can be a strong unique selling point (USP) for your brand. It's easier to expand and delve into the deeper and more competitive parts of your industry once you've already established yourself as an expert in your chosen field. Obviously, search engines favour brands known to be experts in their respective fields. Just to give a brief example, when I started blogging back in 2010, I was all over the place. Then, a few months later, I decided to focus on one specific area of SEO—link building—and wrote dozens of guides on how I do it. By aiming to build my blog's brand identity to become a prime destination for link building tutorials, it became a lot easier for me to sell my ideas on the other aspects of inbound marketing to my continuously growing audience (from technical SEO to social media, content marketing, email marketing and more). Strengthening your brand starts with the quality of your brand's content, whether it's your product/service or the plethora of information available on your website. You can start by assessing the categories where you're getting the most traction in terms of natural link acquisitions, social shares, conversions, and/or sales. Prioritize your content development efforts on the niche where your brand can genuinely compete in and will have a better fighting chance to dominate the market. It's the smartest way to stand out and scale, especially when you're still in your campaign's early stages. Optimize for semantic search and knowledge graph In the past, most webmasters and publishers would rely on the usage of generic keywords/terms in optimizing their website's content to make it easier for search engines to understand what they are about. But now, while the continuously evolving technologies behind search may seem to make the optimization process more complicated, the fact is that it may just reward those who pursue high-level trustworthy marketing efforts to stand out in the search results. These technologies and factors for determining relevance—which include entity recognition and disambiguation (ERD), structured data or schema markups, natural language processing (NLP), phrase-based indexing for co-occurrence and co-citations, concept matching, and a lot more—are all driven by branding campaigns and how an average human would normally find, talk, or ask about a certain thing. Easily identifiable brands will surely win in this type of setup. Where to start? See if Google already knows what your brand is about. How to optimize your site for the Knowledge Graph and at the same time build it as an authority online 1. Provide the best and the most precise answers to the \"who, what, why, and how\" queries that people might look for in your space. Razvan Gavrilas did an extensive study on how Google's Answer Boxes work. Getting listed in the answer box will not just drive more traffic and conversions to a business, but can also help position a brand on a higher level in its industry. But of course, getting one of your entries placed for Google's answer boxes for certain queries will also require other authority signals (like natural links, domain authority, etc.). But what search crawlers would typically search for to evaluate whether a page's content is appropriate to be displayed in the answer boxes (according to Razvan's post): If the page selected for the answer contains the question in a very similar (if not exact) form, along with the answer, at a short distance from the question (repeating at least some of the words from the question) and If the page selected for the answer belongs to a trustworthy website. So most of the times, if it's not Wikipedia, it will be a site that it can consider a non-biased third party, such as is the case with a lot of \".edu\" sites, or news organization websites. Although, John Mueller mentioned recently that Knowledge Graph listings should not be branded, in which you might think that the approach and effort will be for nothing. But wait, just think about it—the intent alone of optimizing your content for Google's Knowledge Graph will allow you to serve better content to your users (which is what Google rewards the most these days, so it's still the soundest action to take if you want to really build a solid brand, right?). 2. Clearly define your brand's identity to your audience. Being remarkable and being able to separate your brand from your competitors is crucial in online marketing (be it through your content or the experience people feel when they're using your site/service/product). Optimizing for humans through branding allows you to condition the way people will talk about you. This factor is very important when you're aiming to get more brand mentions that would really impact your site's SEO efforts, branding, and conversions. The more search engines are getting signals (even unlinked mentions) that verify that you're an authority in your field, the more your brand will be trusted and rank your pages well on SERPs. 3. Build a strong authorship portfolio. Author photos/badges may have been taken down from the search results a few weeks ago, but it doesn't mean that authorship markup no longer has value. Both Mark Traphagen and Bill Slawski have shared why authorship markup still matters. And clearly, an author's authority will still be a viable search ranking factor, given that it enables Google to easily identify topical experts and credible documents available around the web. It will continue to help tie entities (publishers and brands) to their respective industries, which may still accumulate scores over time based on the popularity and reception from the author's works (AuthorRank). This approach is a great complement to personal brand building, especially when you're expanding your content marketing efforts' reach through guest blogging on industry-specific blogs where you can really absorb more new readers and followers. There's certainly more to implement under Knowledge Graph Optimization, and here's a short list from what AJ Kohn has already shared on his blog earlier this year, which are all still useful to this day: Use entities (aka Nouns) in your writing Get connected and link out to relevant sites Implement Structured Data to increase entity detection Use the sameAs property Optimize your Google+ presence Get exposure on Wikipedia Edit and update your Freebase entry Online branding through scalable link building The right relationships make link building scalable. In the past, many link builders believed that it's best to have thousands of links from diversified sources, which apparently forced a lot of early practitioners to resort to tactics focused on manually dropping links to thousands of unique domains (and spamming). And, unfortunately, guest blogging as a link building tactic has eventually become a part of this craze. I've mentioned this dozens of times before, and I'm going to say it one more time: It's better to have multiple links from a few link sources that are highly trusted than having hundreds of one-off links from several mediocre sites. Focus on building signals that will strongly indicate relationships, because it's probably the most powerful off-site signal you can build out there. When other influential entities in your space are vouching for your brand (whether it's through links, social shares, or even unlinked brand mentions), it allows you to somehow become a part of the list of sites that will most likely be trusted by search engines. It can most definitely impact how people will see your brand as an authority as well, when they see that you're being trusted by other credible brands in your industry. These relationships can also open a lot of opportunities for natural link acquisitions and lead generation, knowing that some of the most trusted brands in your space trust you. Making all of this actionable 1. Identify and make a list of the top domains and publishers in your industry, particularly those that have high search share. There are so many tools that you can use to get these data, like SEMRush, Compete.com, and/or Alexa.com. You can also use Google Search and SEOQuake to make a list of sites that are performing well on search for your industry's head terms (given that Google is displaying better search results these days, it's probably one of the best prospecting tools you can use). I also use other free tools in doing this type of prospecting, particularly in cleaning up the list (in removing duplicate domains, and extracting unique hostnames; and in filtering out highly authoritative sites that are clearly irrelevant for the task, such as ranking pages from Facebook, Wikipedia, and other popular news sites). 2. Try to penetrate at least 2 high authority sites from the first 50 websites on your list—and become a regular contributor for them. Start engaging them by genuinely participating in their existing communities. The process shouldn't stop with you contributing content for them on a regular basis, as along the way you can initiate collaborative tasks, such as inviting them to publish content on your site as well. This can help draw more traffic (and links) from their end, and can exponentially improve the perceived value of your brand as a publisher (based on your relationships with other influential entities in your industry). These kinds of relationships will make the latter part of your link building campaign less stressful. As soon as you get to build a strong footing with your brand's existing relationships and content portfolio (in and out of your site), it'll be a lot easier for you to pitch and get published on other authoritative industry-specific publications (or even in getting interview opportunities). 3. Write the types of content that your target influencers are usually reading. Stalk your target influencers on social networks, and take note of the topics/ideas that interest them the most (related to your industry). See what type of content they usually share to their followers. Knowing these things will give you ton of ideas on how you can effectively approach your content development efforts and can help you come up with content ideas that are most likely to be read, shared, and linked to. You can also go the extra mile by knowing which sites they mostly link out to or use as reference for their own works (use ScreamingFrog). 4. Take advantage of your own existing community (or others' as well). Collaborate with the people who are already participating in your brand's online community (blog comments, social networks, discussions, etc.). Identify those who truly contribute and really add value to the discussions, and see if they run their own websites or work for a company that's also in your industry. Leverage these interactions, as these can form long-term relationships that can also be beneficial to both parties (for instance, inviting them to write for you or having you write for their blog, and/or cross-promote your works/services). And perhaps, you can also use this approach to other brands' communities as well, like reaching out to people you see who have really smart inputs about your industry (that'll you see on other blog's comment sections) and asking them if they'll be interested to talk/share more about that topic and have it published on your website instead. Building a solid community can easily help automate link building, but more importantly, it can surely help strengthen a brand's online presence. Conclusion SEO can be a tremendous help to your online branding efforts. Likewise, branding can be a tremendous help to your SEO efforts. Alignment and integration of both practices is what keeps winners winning in this game (just look at Moz). If you liked this post or have any questions, let me know in the comments below, and you can find me on Twitter @jasonacidre. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using Modern SEO to Build Brand Authority"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using Modern SEO to Build Brand Authority"
    },
    {
      "level": "H2",
      "text": "Pick a niche and excel"
    },
    {
      "level": "H2",
      "text": "Optimize for semantic search and knowledge graph"
    },
    {
      "level": "H3",
      "text": "How to optimize your site for the Knowledge Graph and at the same time build it as an authority online"
    },
    {
      "level": "H2",
      "text": "Online branding through scalable link building"
    },
    {
      "level": "H3",
      "text": "Making all of this actionable"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jason Acidre\n          \n            Jason Acidre\n          \n            Jason Acidre"
}