{
  "url": "https://moz.com/blog/using-twitter-for-increased-indexation",
  "slug": "using-twitter-for-increased-indexation",
  "title": "Using Twitter For Increased Indexation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Earlier this year, jtkaczuk wrote a YouMoz post about “Using Twitter as a Sitemap”. After reading it I began to think about the power of Twitter, ReTweets, and if more RTs can help indexation.     MORE…….  ...",
  "content": "Using Twitter For Increased Indexation Search Engines By: Casey Henry August 4, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Casey Henry August 4, 2010 Using Twitter For Increased Indexation Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Earlier this year, jtkaczuk wrote a YOUmoz post about “Using Twitter as a Sitemap”. After reading it I began to think about the power of Twitter and if using Twitter more can help indexation. Many Twitter users will tweet about new post or products on their account hoping to draw attention and links from their followers. What if this process can also help with getting more pages indexed and indexed faster? I was surprised with the results of this quick little experiment that I threw together in a few months. Experiment Setup The experiment started with 15 local clients of mine who often tweet about new products or posts on their Twitter accounts. These accounts vary in followers from 75 to about 1500. While I did not have direct control over these accounts, I was able to track when a new product was added, tweeted, crawled by GoogleBot, and indexed by Google via a PHP script I wrote and installed on their CMS. Along with tracking those, I monitored when the number of RTs, when the product was indexed, and if it stayed indexed for at least 48 hours after it was launched. For each product or post that was launched, they were placed in one of three categories for 48 hours: Twitter Links Only – 48 hours with no internal links and 1 tweet only from the orginal account Site Architecture Links Only – No tweets about product or post, only internal links and sitemaps generated Both Twitter & Site Architecture Links – Both tweets, internal links, and sitemaps to post or product After the 48 hour observation period was over, the products or posts were launched like a normal, which included tweets, internal links, and anything else my clients might do to promote it. We also stopped collecting data at that point. Experiment Warning As Rand and Ben always say, correlation does not imply causation. Nor do I encourage that you SPAM Twitter with a whole bunch of links to content that is not useful to your followers. Take the results of this experiment and try to find where you can fit them in your business without upsetting and losing your followers. Experiment Data Summary During the course of the experiment: 120 products or posts where published - 40 in each of the categories above, there over 96 RTs, over 350 GoogleBot visits, and an 87% indexation rate. Here are some quick highlights of the findings: Twitter Only Launch GoogleBot averaged its first visit within 78 seconds of the first tweet. Tweets with more than 3 RTs were indexed 325% faster, along with 125% more of its products and post indexed than tweets with no RTs. Average indexation of the post or product was different depending on number of RTs 3 or more RTs had an average indexation time of 8 hours, with 86% indexed. 1 or no RTs had an average indexation time of 26 hours, with 69% indexed. Internal Links Only Launch GoogleBot averaged its first visit within 2.5 hours of the first internal link on the site. Average indexation of the post or product was 8.5 hours, with 85% indexed. Both Internal Links and Twitter Launch GoogleBot averaged its first visit within 82 seconds of being launched. Average indexation of the post or product was again different depending of the number of RTs the Twitter updated received. 3 or more RTs had an average indexation time of 4.25 hours, with 88% indexed. 1 or no RTs had an average indexation time of 5 hours, with 79% indexed. Experiment Raw Data Twitter Only Internal Links Only Both Internal Links and Twitter Experiment Conclusion The data concludes that creating your new product or post with internal links along with a tweet that gets 3 or more RTs, will help in increasing the time and rate at which they get indexed. While the data may show there is evidence that this technique will help your site increase its indexation and crawl time, I would advise you to do it with caution and care. All of my clients took care not to launch more than 1 product a day and did continue to tweet other things besides the new products launched. My personal warning is to remember that Twitter is designed for your clients and not as a launching pad for Google, it would be horrible to see your account lose its following due to mass product tweeting. What are your feelings or experiences on using Twitter to increase your indexation? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using Twitter For Increased Indexation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using Twitter For Increased Indexation"
    },
    {
      "level": "H2",
      "text": "Experiment Setup"
    },
    {
      "level": "H2",
      "text": "Experiment Warning"
    },
    {
      "level": "H2",
      "text": "Experiment Data Summary"
    },
    {
      "level": "H2",
      "text": "Experiment Raw Data"
    },
    {
      "level": "H2",
      "text": "Experiment Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Henry\n          \n            Casey Henry\n          \n            Casey Henry"
}