{
  "url": "https://moz.com/blog/using-youtube-as-a-keyword-research-tool-for-seo",
  "slug": "using-youtube-as-a-keyword-research-tool-for-seo",
  "title": "Using YouTube as a Keyword Research Tool for SEO - Use Video Content on YouTube with Google Adwords Keyword Tool… - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This isn't a post about keyword research for video content on YouTube, but exploring the ways in which it can be used to find relevant data, information and keywords in topics where you have a low understanding of the services and industry.\nNow for an example...\n...",
  "content": "Using YouTube as a Keyword Research Tool for SEO Keyword Research By: Kieron Hughes October 11, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kieron Hughes October 11, 2010 Using YouTube as a Keyword Research Tool for SEO Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This isn't a post about keyword research for video content on YouTube, but about exploring the ways in which it can be used to find relevant data, information and keywords in topics where you have a low understanding of the services and industry. Now for an example... You've just taken on the SEO contract for a private speech therapist based in the UK, and need to carry out industry and keyword research into the sector to best understand the opportunities available, and to structure their in-development website accordingly. You don't know much about speech therapy, but you've been given some information by your client and now you're on the hunt for keywords. Heading over to the Google Adwords Keyword Tool, you put in \"speech therapy\" to see what suggestions/volumes are thrown up. Now although the results displayed by the Google Keyword Tool might be relevant to what you are looking for, they don't provide the bigger picture, which is what you should be looking for. Are there any common phrases used by experts/consumers in the industry? Are there any related (similar) services that the client could offer, but not have mentioned? What are the conditions that most commonly lead to speech problems? All of this information can no doubt be found by carrying out your own research on Google/your other favourite search engine, but it can still be difficult to sift through the results to find the correct information you are looking for... and this is where YouTube can really help. Using YouTube as a Keyword Tool Unlike creating a web page, uploading a video to YouTube is very accessible to anybody with a video file and an internet connection. The great advantage of the upload process is that Google prompts people to provide descriptive content about the video, such as explanatory text (description), a relevant title, and appropriate tags - so not only is it easier for the videos to be sorted, it means more data is available for us to mine. A search on YouTube for \"speech therapy\" provides 3,870 results, and at random I chose a video recording of a speech therapy class. Scrolling past the video to look at the related information provides a great initial insight: From the above information we can get the following keywords: down syndrome (40,500 searches) oral motor therapy (58 searches - low, but still relevant) speech therapist (we already knew this one - 12,100 searches) apraxia (2,900 searches) Even with a somewhat basic knowledge of speech therapy it would have been difficult to know that \"oral motor therapy\" and \"apraxia\" were related to problems with speech - and it's a great stepping stone in our keyword research. Scrolling further down the page to analyse the comments, we see: Which provides us with further keywords and opportunities: autism (201,000 searches) oral motor exercise (91 searches) chewy tube (the \"t-shaped orange material\" - answered in a further comment - 390 searches) Other comments on the page are equally as helpful, with examples such as \"decreasing hyper sensitivity\" being another useful research avenue. Looking around YouTube, comments can actually be much more helpful than the published video data. Conversations often arise between people, and this is an essential place to look if you want to know more information. Once you have taken the time to browse the videos, note down some of the related information and make a list of possible opportunities, then you can go back to the Google Keyword Tool (or whatever tool you might be using) with a whole load of ammo for your next stage of research. The advantage to this second iteration is that you will have also used YouTube what it is intended for - to watch videos, and to find out more information about the services and conditions related to speech therapy (greater understanding of your client's business means you can ultimately do a better job for them). Also note that you should research any of the phrases you find in more detail before optimising a website for them - more about this point at the end of the article. From just the initial view carried out on YouTube above, we have gone from a sitemap looking similar to this: To something more representative of this: The above sitemap has been generated after looking at only one YouTube video on the subject, so imagine the level of data you could get into if you carried out full research? By following an iterative process of looking at YouTube, understanding the opportunities, and analysing the search volumes, you can begin to form a visual picture of how products and services are related - something that can be then portrayed back to the client for approval and additional ideas. Clients can often be too familiar with their business, and miss out a basic level of information when attempting to explain what it is they offer - and this is usually the most valuable detail from an SEO perspective. Carrying out your own research is vital to covering all of the best angles when working with a new website, and you shouldn't just stop at the list of service offerings that the client provides you with. Take things one step further, and you'll no doubt find the website is in a greater position to dominate search visibility than some of the key comptitors in the industry. Use All of the Data Available With people of all ages, backgrounds, specialties and even personal experiences uploading and contributing to YouTube, it really is a gold mine of information and can help a great deal for search marketing campaigns. If you're researching a particular service/product/industry, why wouldn't you use all of the information that is freely available? - especially when you have a user-updated resource such as YouTube at your finger tips. The one point I'll leave on, is that YouTube shouldn't be used for all of your research on a particular subject, as it is, after all, open to mislabelling, incorrect information and of course the efforts by fellow SEOs to promote video content ;) I'm no way affiliated with anyone in speech therapy, but I'm sure the children's communication charity I CAN would appreciate a donation if you're feeling generous: http://www.ican.org.uk/Support%20Us/Donate/Donate%20Now Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using YouTube as a Keyword Research Tool for SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using YouTube as a Keyword Research Tool for SEO"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kieron Hughes\n          \n            Kieron Hughes"
}