{
  "url": "https://moz.com/blog/using-emails-to-build-links-whiteboard-friday",
  "slug": "using-emails-to-build-links-whiteboard-friday",
  "title": "Using Emails to Build Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's not so common to think about email marketing as a potential link building opportunity, but it's actually a wonderful tactic that you can use. Leveraging those finely crafted email lists with an SEO strategy can be highly advantageous. In this weeks Whiteboard Friday, Rand shows off some useful…",
  "content": "Using Emails to Build Links Whiteboard Friday By: Kenneth Martin November 24, 2011 Table of Contents Copied! By: Kenneth Martin November 24, 2011 Using Emails to Build Links Whiteboard Friday It's not so common to think about email marketing as a potential link building opportunity, but it's actually a wonderful tactic that you can use. Leveraging those finely crafted email lists with an SEO strategy can be highly advantageous. In this weeks Whiteboard Friday, Rand shows off some useful and creative tips on how to utilize an email marketing strategy that will help you build links. Video Transcription Howdy, SEOmoz fans. Welcome to another edition of Whiteboard Friday. This is actually Thanksgiving Friday in the United States, so I hope you had a wonderful turkey day with your families. And for those of you in other countries, turkey is not the most delicious of birds, but we enjoy it. It's good. We make a little cranberry sauce. We've got a little yams and some sweet potatoes. It's great. It's lots of fun. And, of course, there's football, which is my favorite part. All right. So in this edition of Whiteboard Friday, since it is indeed the giving of thanks, we are talking about getting thanks from your users from whom you're getting great email content by getting links from them. Email marketing, email list building is actually a phenomenal way to get links. It's not something that many people in the SEO world think about. We've got a bunch of different strategies. The first thing I want to talk about is building an email list itself. There are tons and tons of tips on this out there on the Web, and I don't want to pretend that I'm an expert. But what I will say is that having a subscription to an email list on a website, particularly if you are a content-based site or an ecommerce-based site, is absolutely huge. Even for those of you doing B2B direct marketing or doing affiliate sales of some kind, email list building is a wonderful way to capture consumers and potential customers, bring them into your ecosystem. Those email addresses are incredibly valuable if you can build up a good relationship over time. A few recommendations. You've often got something on the side of your website that lets people subscribe with email. If you blow it up, it looks something like this. You've got your name, you've got your email, you have a subscribe button, and that's great. What I would really recommend is to ask for very, very little in these boxes. If you have a subscription that pops over, please ask for as little as possible. But do me one favor - ask for the name. The reason the name is so important is because in email marketing and list building, as email marketers know, getting the open rate up is critical. Getting people to click on that email, open it up and click through. Having their name means that you can do much more with personalization of those emails. Not having their name means it's very frustrating. It's hard to write that first intro sentence or paragraph, whatever, if you don't have their name, and it's often hard to get them to click through as well. I'm sure all of you get email spam like this that says, \"Hi, blogger from so- and-so.\" \"Hi, dear Rand@SEOmoz.\" I'm sort of like, \"Yeah, you have no idea who I am and you couldn't care less. You're just trying to get me to take some action.\" But if it says, \"Hey there, Rand\" or, \"Rand, we've got something you might like,\" that is much more likely to get an open. It can be customized, etc. Make sure that you have something of great value that you are delivering over email, and then make sure that you're not just promising it, but you are actually delivering on that promise. Indicate the frequency that you are going to have. So in here, I might say something like \"once per week.\" So you will get a weekly email, or you'll get a daily email, or you'll get a monthly email. Don't be coy about how often you are going to send it. Try not to be too out-of-cycle with those emails. It's really that kind of thing. I get a weekly email and then suddenly I get two in two days, and I think, \"It's time to unsubscribe from this list.\" Try not to do that. Also, watch and manage your inactives very, very carefully. If you see people who consistently have never clicked, never opened, never taken any action, you might actually want to remove them from your email list. I know that sounds crazy, because you're thinking, \"Wait, but I want a bigger email list. I want to grow it over time.\" I know. I want that too. But the problem is that email management services, MailChimp for example, or Bronto, which is what we use here at SEOmoz, they monitor very closely that usage rate. A lot of those people who aren't taking any action but haven't unsubscribed are reporting you for spam. They're clicking that spam button in Gmail. They're clicking the report spam button in Hotmail. They're clicking the spam button in Outlook. That's a huge problem, because the percentage of people who report you for spam is a metric that those providers use to determine deliverability rates. They might actually kick you off their service. You are going to have worse deliverability problems over the long run. So try and weed those people out. Anyone who you think might not be engaged or active or interested anymore, you've changed the focus of your business or of your email list, get them out of that funnel so you are not clouding up and murky-ing the waters. Spam is a big, big problem in email deliverability, and you don't want to end up in that group. And finally, last but not least of the tips here, A/B and multivariate test how this piece performs. You want to be trying different things. A different headline, a different way of capturing it, different form placement, using the overlay, using something where they only see when they scroll to the bottom, whatever it is, so that you can get the maximum percent of people who are visiting your pages taking that email action, particularly if email is a big way that you drive your business. Now, you've done all these things. You've built an extraordinary list. I'm very proud of you. Your marketing team loves you. Now you're thinking, \"I want to leverage this for some SEO. I want some links. Give me some links, baby!\" I'm going to give you some links. There are some link building tactics that you can use that are going to drive value back to your site, maybe some of them direct links, good anchor text pointing to the right pages, some of them brand links that are just pointing to your home page, some of them random distribution, and some of them, of course, are going to be social shares, which might not be counted as links, might have some impact on rankings. We're not really sure. Probably as a second order effect at worst. I'll talk about the first one here. Share embeddable content. You're very aware of the power of things like badges and infographics or tools, what have you, stuff that can sit on someone else's site and point back to you. Share that stuff over your email list. If you have a great badge for people and you want to say, \"Hey, you've contributed a design to our site,\" \"You've been a member here for a year now,\" \"You've filled out your profile completely,\" \"You've bought three things from us,\" \"Here's a way to say that you like our brand. Here's something to encourage you.\" And the people who are passionate about your brand and about your community they're going to embed those things on their sites. Wonderful. Just great for your SEO. And, of course, you get to control the anchor text and where that points. Another great thing. This sounds a little complicated, but it is totally brilliant. You've got this big list, and the list looks something like, here's email@domain.com. This domain.com is an absolutely incredible piece of information that so many people under-appreciate. Domain.com is often Gmail. It's often Hotmail. Scrub those. You don't care about those. What you care about are all the rest of those domains. Those are all websites where people from those sites, particularly if you're in the B2B field or serving B2B type customers, where these people own those sites, are marketers on those sites, are involved with those sites somehow, and you can reach out to them by filtering the domain names you care about, using something like the Linkscape API or the Majestic SEO API if you want to get fancy, and seeing, \"Hey, do these sites already link to me?\" and then ordering by, \"Oh, you know what? I'm going to take these domain names and in Excel I'm going to order by domain authority, and I'm going to grab the ones that are highest domain authority that aren't linking to me, where I think I've got a chance of outreach.\" And by the way, I can do that outreach directly because I know somebody there. Somebody there has subscribed to my email list, so they care about my business. That makes that outreach, those business development possibilities much, much more accessible. For those of you who are looking for where should I do email outreach, where is an easy target, it's this. Come on, you can't get any easier. It's wonderful. Number three. Encourage your users through email, particularly if you have something like a profile that they are creating on the site or a user page, encourage them to fill those out completely. The reason that I love filling them out completely is because when people invest effort in them, they will often link to them. If you provide any value back on those profile pages to the people who are creating stuff on there, whether it's, \"This is your design portfolio,\" \"Here's your Amazon Wish List,\" \"Here are the things that you've customized on the site so far,\" whatever it is that you've done, you want those users to fill out the profiles because they will have a strong potential to link to their profiles, and once they do, you get SEO value from that \"rising tide lifting all ships\" phenomenon. The next one; consider sending some individual emails to the users who get activity and engagement on your site. The simplest form of this is blog comments. Someone subscribed to your email list, they accept email privileges when they register with your site, someone replied to their comment. Someone mentioned them somewhere. They received an action on their page. 100 people visited their profile page. 100 people checked out a product they customized. 100 people looked at their wish list. Imagine if you were ThinkGeek and you get, \"Hey, someone looked at your ThinkGeek wish list today.\" Just a little friendly notification. This is a way to bring people back to their site and for them to think, \"Oh, yeah. I wish more people did this. I wish more people engaged with me on the site. I'm going to re-engage.\" Again, not necessarily leading to direct links, but in some cases it will. Just three more good ideas for you here. When you capture the email address, if possible in this box here, if you don't ask for location necessarily, you might later in a profile setup or completion step, you might get it through a credit card, but you can also get it through their IP address. When you capture an email address, capture that IP and Geotag it so that you know where those users are. The reason is when I go and visit Kansas City, I can say, \"Hey, SEOmozers who are in Kansas City,\" shoot them an email, let's tell them I'm going to do a MozCation there. We're going to do an event there. I'm going to be speaking at an event there. It's a fantastic way to bring people from your community who already care about you back into the fold. Events are just a great way to earn natural links back to yourself, because you build relationships, people see you, and they just naturally link to you. You are engaging with them, you are contributing. Even if they can't make it to the event, sometimes you are going to get a link by them sharing it and saying, \"Hey, by the way, so- and-so is coming to this.\" They'll put it on their blog. They'll link to it on a forum. They'll put it on their About page, whatever it is. They tweet about it. Great. Just a terrific way to interact and engage. The second thing. This might be my favorite one on here. When you do this, when you go and you filter and you grab the domain name of all the people that you care about, and you've got that ordered, then go find those people's Twitter accounts, their blogs, their websites, and go engage with them socially. I promise you, if you are naturally, positively engaging on Twitter, in blog comments, on their Facebook Brand page, on their Google+ page, whatever it is, they are going to figure out who you are and remember you. They've already signed up for your email list, so they have a positive association with you and like what you do. You are going to earn a link sooner or later. It might be a month, might be six months, might be a year, but you are going to get that link through engagement. This is a wonderful way to just build your presence in raw inbound marketing, never mind just pure SEO. Finally, Aaron Wheeler from the Moz team had this great idea to insert in your RSS feed, especially if you're running an RSS feed that's not powered by advertising but is content-driven, insert ads. You know how you've got an RSS feed and it looks something like this. Here's a piece of content, and then sometimes there will be a little block of advertising if it's a paid RSS feed and they want to sponsor it. Instead of advertising for a third party, encourage your own advertising. Encourage sharing of content. If you have a special piece of content in the RSS feed, you might say, \"Hey, we'd really appreciate your help spreading this out over the Web. We're doing a subscription drive with a nonprofit. We're having an event somewhere. We are promoting a new service that we have. We have this new infographic that collects a bunch of data that we think a lot of people will love. Help us share it.\" Don't do it on every post or it will be ignored. Do it on every 7 posts, every 20 posts. Then you'll get attention and intrigue, because people who are subscribing to RSS via their email and getting those posts in email will see that little ad block and go, \"Oh, maybe I should share that. That seems useful and interesting.\" So you can see the wonderful power of collecting email addresses, building a great list, obviously for email marketing, but also getting some value back for SEO through the links that you can drive. I hope you've enjoyed this edition of Whiteboard Friday. I hope you had a great Thanksgiving. We will see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using Emails to Build Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using Emails to Build Links"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kenneth Martin\n          \n            Kenneth Martin"
}