{
  "url": "https://moz.com/blog/using-ecommerce-keyword-research-to-hook-more-customers",
  "slug": "using-ecommerce-keyword-research-to-hook-more-customers",
  "title": "Using E-Commerce Keyword Research to Hook More Customers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "To some, keyword research is keyword research...the type of website doesn't matter!\nTo me however, ecommerce websites require a different approach to keyword research because ecommerce is in my opinion an entirely different beast.\nThe following is a step-by-step process for how I do SEO keyword…",
  "content": "Using E-Commerce Keyword Research to Hook More Customers Keyword Research By: James Agate May 16, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: James Agate May 16, 2011 Using E-Commerce Keyword Research to Hook More Customers Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. To some, keyword research is keyword research...the type of website doesn't matter! To me however, ecommerce websites require a different approach to keyword research because ecommerce is in my opinion an entirely different beast. The following is a step-by-step process for how I do SEO keyword research for my ecommerce clients – I'm not saying categorically that this is the best way but it is certainly a process that has yielded excellent results for me. I've found this to achieve more visibility, more targeted visitors and a much higher conversion rate. Please feel free to add any suggestions for improvements you might have, in the comments section below as I'm always looking to refine this process. Step 1 - Harvest your exclusive data I recently contributed a post here on YOUmoz which talked about the subtlety of really good keyword research and whilst this was well-received, I think one thing I overlooked was utilising the data only we have access to – our exclusive data from sources like Google Analytics and by talking to our customer base. Google Analytics Google Analytics is a great source of data and should form the starting point of any keyword research project (if the site isn't brand new of course). You can pull a report and see at a glance which keywords already bring you visitors and of course it is far easier to enhance rankings of existing keywords in addition to bolstering your keyword portfolio across the board than it is to start your SEO efforts completely from scratch. The way I utilise Google Analytics is to pull a report of all the keywords that bring you traffic, sift through these to weed out the low performance ones (depending on the goals of the site and business) and then put this list to one side ready to be amalgamated with the rest of my keywords research. Research within customer/user base Another way to utilise exclusive data is to research within your customer base to ascertain the types of keywords that they use/used to find your products and services. This step is of course budget dependent because even though they are your customers, contacting them and giving them an incentive to respond costs time and very often money (think incentives!). The data found can be very insightful and ultimately powerful because these are people who actually pay for what you offer however I have found that sometimes customers A) cannot remember how they found your website and B) if they do remember, I have found the keywords they come up with, very often, don't seem to correlate with what we perceive as being a good keyword to target. If you are going to do this kind of primary research then I think it would be smarter to use their suggestions as the basis for your keyword research i.e. areas to investigate further rather than the keyword suggestions forming the actual list. Step 2 – Start the research I would imagine opinion is divided here as to whether the next step is to map out the site and then research each of the areas or categories on the site whether to do the keyword research before mapping the site but I believe this order is the better of the two. Keyword research in its rawest form helps you to spot opportunities, if you research within the constraints of your current website, you may well be improving the targeting of your website but you will certainly be missing opportunities. Doing good keyword research shouldn't be needlessly complicated; it requires common sense, some SEO instincts and a working knowledge of the industry you are researching. You should start by giving yourself a rough outline of the website and the industry as a whole, take a look around competitor sites to see areas or niches they are targeting that you or your client perhaps aren't. Then start putting together a few 'big themes' and some potential keywords. Using this initial research, some input from the client and any other data collected (think Google Analytics and user feedback), you can then build up really quite large keyword lists using a handful of the keyword tools that are out there. I have subscriptions to a number of the leading keyword tools and I also utilise many of the free options also but the software doesn't do my job for me and neither would I want it to. Keyword research is both a creative and analytical endeavour so utilising technology rather than relying on it is the best option. I am the first to admit however that the tools do make my life easier and the process of building out an initial list infinitely easier. I use a variety of tools because it helps to provide more accurate metrics and believe it or not, I have also found that many offer a variety of different suggestions. They also offer food for thought and I've found they prompt me to explore certain avenues in more depth. Let the tools do their thing at this point but keep scanning those lists as you build them to make sure you are getting a variety of keyword types (generic, long tail...immediate targets, possible future targets) to investigate further. Be sure to keep your keywords in some sort of theme organised list to make the next couple of steps much easier. The next step of this is to perform a manual comb of the automatically generated lists, clearing out the irrelevant keywords. Tools might associate keywords with other words but you recognise they are in actual fact completely non-related (hence the need for a human in the keyword research process). At this point, you might also want to look through and work up a few keywords suggestions by hand because a machine will probably miss a few keywords which you think could be good to target – it doesn't matter at this stage if they are good or bad keywords, we just need ones with potential to research in more depth. Perhaps create some new theme areas that the site could target in the future with new product lines or enhanced offerings. You now have a list that is ready to be fully researched. Naturally, how big your list ends up is a matter of individual opinion and things like time, budget, site size, market size, boredom threshold all come into deciding how big the list, you want to research in more depth, actually is. You want to build an accurate picture of each individual keyword so getting some key metrics is important, factors like: Search volume Competition Relevance Conversion rate (based on your data) Current ranking (if applicable) Potential traffic if position 1 is achieved Those are the main metrics you want to be looking at and I tend to add a few more into the mix depending on the type of client I am working with. Many of the keyword tools out there can help you quickly and easily fill in the metrics at the click of a button – for your own sanity, let the machine take the strain. More precisely, let the machines (plural) take the strain because it is essential you utilise data from at least two sources and cross reference just so you know you are painting a more accurate picture. Step 3 – Analyse and build your shortlist You now have all the data you need and a wide variety of keywords that might just make your shortlist, the next step is to sort the winners from the binners. I've yet to find an automated way of doing this that's truly effective, so the way I work is to go through each theme area, analysing the data that is presented, investigating each in more depth and performing some general due diligence for example a Google search to see the types of competition, looking into search volume trends or utilising the keyword difficulty tool in the SEOmoz tool suite. Think about your business situation when you are performing your keyword analysis and making your selections. If you or the client you work with has a healthy sized budget then you can 'afford' to select a different set of keywords to a client with less money to spend that needs to find something a little more within reach. I tend to go through the list a couple of times, the first is a general sweep to clear out the obvious no go keywords and the second and third times are simply to prune my list so we have something more manageable with which to create a shortlist from. Don't forget to add in any keywords you garnered from digging in Google Analytics before preparing the final shortlist. At this stage, if budget permits, it is well worth testing out some of the more important keywords that you've identified using a small but neatly organised PPC campaign. This accelerates the feedback loop giving you powerful insights in a short space of time, data like true search volumes and even likely conversion rates. Utilising PPC in your keyword research really does help you to avoid costly mistakes in terms of targeting and ultimately leads to a leaner keyword list. Timothy Ferris, author of The 4 hour work week, uses PPC when he launches new projects as a way of determining the best name and he raves about the benefits of doing this. You should now have a preliminary shortlist with which to work on. Step 4 – Sort your list Now we need to sort the keyword list: By default, they will probably already be in some sort of theme order because that's how we started off back in stage 2 and this is a perfectly acceptable way of organising your keywords ready for use. It is certainly the easiest option for sorting and if that's what you wish to do then move straight on to step 5. My suggestion is to organise keywords firstly by theme and then by their likely appearance in the consumer buying process. For anyone unfamiliar, the consumer buying process model looks like this: It starts with the consumer recognising they have a problem that needs solving, they head out into the market (well, usually Google) in search of a solution, they find products, services and their alternatives, weigh up their options before finally making a purchase. Since we are doing keyword research for ecommerce websites, this marketing model is really very important because it describes the likely journey our customers are going to go through so it makes sense to organise our keywords and our website around facilitating the movement through this process. Organising our keyword list according to its likely stage in the buying process enables us to identify areas of the buying process where our site is perhaps weak – and spotting gaps in content. That isn't its only purpose though because we all know that keywords form the basis of search marketing campaigns and strategies tend to stem from keyword research therefore it makes sense to understand where each keyword fits in so that A) It is championed on a suitable page B) We create the right kinds of content to target the phrase and C) We appreciate where the consumer's 'head is at' in order to usher them into the next stage of the buying process. The graphic below is a representation of this tactic in action complete with some example keywords and suggested page types. Step 5 – Map out site The purpose of this stage is to map out exactly which pages are going to target which keywords. It is a relatively straightforward task but it can be quite time-consuming so prepare yourself. To start, you need a sitemap of your existing website with the pages you are going to optimise in a list (preferably within an Excel spreadsheet) with room to add keywords besides them. I then assign a main keyword and two or even three supplementary keywords to each of the pages. I think of each page as its own mini ad group in a PPC campaign – you group keywords together into very closely related groups but don't try and target too many per page, it just simply won't be effective. Slight variations are good and will come in handy when it comes to linkbuilding as it enables you to balance your anchor text distribution. Investing time at this stage is worthwhile, move keywords around and don't stop until you are completely satisfied. I can't stress enough the importance of not 'shoehorning' keywords onto pages, if you have a keyword you think is worth targeting but no viable page to target it with then mark a new page to be created. This will increase your search engine visibility because you will be expanding your keyword portfolio. Very often, I will also plan on-page optimisation efforts at this stage – work up some title tags and if you have a developer working on the site, perhaps put together some instructions on page structure or a revised page layout for better keyword targeting. Step 6 – Compile final list + add to rank tracker In the process of mapping out the site in step 5, chances are you will have uncovered a few variations and you may have even chopped and changed a few things but it is important that you have a complete list of keywords you are going to target so that this can filter through to other areas of your campaign. Add your final list to whichever rank tracking programme you use and you are ready for step 7. Step 7 – Plan your next move I'm sorry to say that the work has really only just begun because now you need to implement all this keyword research. The next steps in the process are: Planning your content creation efforts to plug any gaps in your site Implementing on-page optimisation to reflect new keyword targeting Communicating changes to the link-building team, or if that's just you then plan the steps you are going to take to reflect the new targeting Looking into new product ranges and diversifying into new markets as a result of identifying keyword opportunities Ecommerce sites are challenging to work on in my experience but characteristics that can be construed as a challenge (for example huge numbers of pages) are also great opportunities (e.g. greater visibility) not to mention the fact that very few other websites are as easy to calculate the ROI of an SEO campaign for, making you the client's new best friend! Contributed by James Agate, founder of Skyrocket SEO - a high-performance SEO consultancy based in the North West of England Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using E-Commerce Keyword Research to Hook More Customers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using E-Commerce Keyword Research to Hook More Customers"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "James Agate\n          \n            James Agate\n          \n            James Agate"
}