{
  "url": "https://moz.com/blog/using-google-analytics-for-blog-post-timing-insights",
  "slug": "using-google-analytics-for-blog-post-timing-insights",
  "title": "Using Google Analytics for Blog Post Timing Insights - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google Analytics provides a lot of information about your website; but there is always room for more. The traffic for a website vary by day of week, and of course, throughout the day, and it is very useful to know when a website expects the most (or least) visitors. The goal of this post is to show…",
  "content": "Using Google Analytics for Blog Post Timing Insights SEO Analytics By: Alexander Villamizar January 14, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Alexander Villamizar January 14, 2013 Using Google Analytics for Blog Post Timing Insights SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Google Analytics provides a lot of information about your website; but there is always room for more. The traffic for a website vary by day of week, and of course, throughout the day, and it is very useful to know when a website expects the most (or least) visitors. The goal of this post is to show the advantages of using more detailed data to help you make decisions such as when to launch a specific post or take down your website for maintenance. Visits per Hour to Your Website This report’s aim is to show you the number of visits to your website site broken down by hour. What we need to do first is to create a custom report and then add the dimension we want to analyze, in this case it would be “hour” and the metrics we want to visualize. For example visits, pageviews, etc. 1. Custom Reports Custom reports are an awesome way to tell Google Analytics which dimensions and metrics we want to analyze. Once logged into Google Analytics, go to the “custom reporting” tab, then click in the “+New Custom Report” button 2. Configure the dimensions and metrics Next, you’re going to select the dimensions you would like to visualize. In this case, I’m going to select the visits and the organic searches. Also, in the dimension drilldowns section, select “hour” (It is located under “Other” -> ”Hour”, don’t confuse it with the Hour of day dimension). Finally, you can save the report and wait for Google Analytics to apply the report to your data. After saving the report, you will be able to see your visits segmented according to the hour in which they occurred. Exporting to Excel Within Google Analytics we can export this information to Excel to try to visualize it better. The numbers 00-23 in the hour column represent hour of the day in the timezone configured for your account. Also, for this example, I have selected the total number of visits and the organic visits per hour. (The organic visits are defined as the number of organic searches that occurred within a session). In Excel, we can then create a graphic like the following: This graphic is showing the information of the last two months, which we can use to spot a trend that shows us at what time our website is most active. Different tools such as Followewonk can show you at what time it is best to tweet something in order to get maximum exposure. You can apply a similar principle using Google Analytics: Discover at what time it is best to publish something in your blog in order to be seen by most of your visitors. Now, the overall number of visits can be influenced by many different factors, for example, if you tweet something using a link pointing to your site at a specific time, then probably you are influencing directly the number of visits sent to your website. That’s why I like to include and analyze the “organic searches” dimension, as this in theory would represent a more “natural” hourly trend in which users are finding your site. Possible Uses Personally, I have used these hourly-based reports in Google Analytics to publish short-term promotions where I needed to guarantee a specific offer to be seen by as many users as possible. I was able to provide a solution to a client by making these decisions backed by data and usage patterns seen in the website. Maintenance Hours It is natural to perform all sorts of maintenance fixes to your website during night time, where you would expect to have the least visitors. This report can give you a more accurate hour of when to can make changes to your website and have the least impact on your visitors. It never hurts to double check and see exactly at what time your site is used the least to do maintenance to your site. Understanding Your Audience I don't think you can draw any solid conclusion based just on the hour your site is being used, but it can give you some perspective and ideas which you can confirm through other methods afterwards. For instance, in the example shown above, I can identify a peak in usage of my site between 3:00 pm and 4:00 pm. Then the traffic goes down, and then I see another peak at 8:00 pm. This behavior could give me ideas as to which type of content I can put at night for my readers to use, and what type of content I can put at 3:00 pm. It's possible that the intent of my visitors is going to be different according to the time the reach my website, and these reports give me more information to test this. Another usage for your report is to map your conversions and revenue based on the hour they occur. Just select those metrics while creating the report: This is a simple and easy option in Google Analytics to view the activity in your website from a different angle and allow you to extract some relevant information. How about you? Do you use other tools to help you plan better the publishing hour for your posts? About Alexander Villamizar - Online Marketing Director at SEO Colombia, an SEO Agency focused in the Hispanic and Latin American market Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using Google Analytics for Blog Post Timing Insights"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using Google Analytics for Blog Post Timing Insights"
    },
    {
      "level": "H2",
      "text": "Visits per Hour to Your Website"
    },
    {
      "level": "H3",
      "text": "1. Custom Reports"
    },
    {
      "level": "H3",
      "text": "2. Configure the dimensions and metrics"
    },
    {
      "level": "H2",
      "text": "Exporting to Excel"
    },
    {
      "level": "H2",
      "text": "Possible Uses"
    },
    {
      "level": "H3",
      "text": "Maintenance Hours"
    },
    {
      "level": "H3",
      "text": "Understanding Your Audience"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Alexander Villamizar\n          \n            Alexander Villamizar"
}