{
  "url": "https://moz.com/blog/using-cro-to-make-great-content-whiteboard-friday",
  "slug": "using-cro-to-make-great-content-whiteboard-friday",
  "title": "Using CRO to Make Great Content - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week we are joined by Carlos del Rio from Agillian, who is based here in Seattle, WA. Carlos will discusses a method that will help you make great content by following 3 easy steps. After watching the video dive into the comments and discuss what your thoughts are on using CRO to make great…",
  "content": "Using CRO to Make Great Content Whiteboard Friday By: Casey Henry December 1, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Casey Henry December 1, 2011 Using CRO to Make Great Content Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week we are joined by Carlos del Rio from Agillian, who is based here in Seattle, WA. Carlos will discusses a method that will help you make great content by following 3 easy steps. After watching the video dive into the comments and discuss what your thoughts are on using CRO to make great content. P.S. It looks like we might have also been joined by a fly, so please excuse him when he flies across the screen a few times.... Video Transcription Hey Mozzers. I'm Carlos del Rio. I own a consultancy called Agillian, and I am the author of \"User Driven Change: Give Them What They Want\" and a \"Strategic Framework for Emerging Media,\" which is kind of a mouthful. Even I have trouble saying it. I am here today to tell you how to use CRO to make great content, and when I say to make great content, I mean for any portion of your marketing campaign. So, you need to make sure that you meet the most basic portion of conversion optimization. I mean the three things that are the most important for all conversion rates are a clear action, a clear purpose, and a clear value. That's what every landing page is trying to do. That's what every pay-per-click ad is trying to do. Tell a person what you want them to do, tell them what it is about, and communicate what the value they're going to get out of the interaction. So, \"Buy tires cheap,\" or \"Buy tires, free delivery.\" Something where they know what it is that they are coming for and that they get something at the other end. For example, if you are writing a piece of content for your blog, you want to be able to answer, \"Is it clear what the purpose of this blog is? Is it clear what the topic is? Is it clear that there is a value for this person to share it with their friends?\" Essentially if you are doing blog and content marketing, it is really for the links. We know that's what it's about. Same thing with if you're making LOLcats. Same thing if you're sending out an email to solicit a link buy. So, in all of your strategies you want to know what is this particular campaign doing. Is it helping our users understand what they can do with us? Is it helping them understand who we are, or is it helping them understand what the value is? Each one of the individual pieces, like each piece of link bait or each email or each tool that you build is supposed to answer all three of these very clearly. You want to know exactly how to interact with it. You want to know what it is going to do. You want to know why is it of value to you. So, if you take the example of, like, LOLcats, we've all seen these. The difference between the millions of LOLcats that nobody cares about and the LOLcats that end up being in your Facebook stream every 15 minutes are that the ones that get shared answer the clear action, which is share me; what is the purpose, this is a LOLcat; and what is the value, this is the funniest LOLcat that I've seen all day. This is the LOLcat that crosses over with my community. If I was to make a cat playing on a computer that said, \"I'm up in your Internet messing with your title tags,\" you're going to find that funny because you are in SEO, but almost everybody else is going to be like, uh, lame. If you were, say, This or That, Rebecca Kelley did a thing recently that was, \"Does Justin Beiber look like Velma from Scooby Doo?\" This enrages both people who like Justin Beiber and people who like Velma. So, what she is doing is creating a place where you interact with this piece of content, and she has two groups of people that want to interact with this type of content. They get to show what they think, and they get a value out of having you know what they think. When they pass this on to their friends who come in and do those three things to derive value for themselves, you get traffic, which you are monetizing. It is the same thing with the LOLcats. Cheezburger makes money off of people coming to visit. They get people coming to visit by thinking about a clear action, a clear purpose, and a clear value from the perspective of their users. In the same way, you are here in the Moz community, and they have two kinds of users. They have basic users and they have premium users. Well, they keep building new tools, and they have to think about: What is the action of this tool, what is the purpose of this tool, and is it going to be valuable to the community? When they write out to every one of the basic members and say, \"We have this great new tool,\" they have to really go through this process twice. They have the process of does the tool meet these standards? Is it clear what I can do with the tool? Is it clear what the tool is going to deal with? Is it clear that I can get some value out of it? They also have to write an email that it's very clear what they want you to do, which is switch from being a basic to being a premium user. It has to be very clear what this tool is going to do for you, and it has to be very clear that you're going to derive value out of it. Otherwise, they aren't going to get a good conversion rate. So, hopefully, these examples will give you something that's actionable for your business and let you take conversion rate optimization into all of the things that you're doing for your marketing. I'm Carlos del Rio. Thanks. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using CRO to Make Great Content"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using CRO to Make Great Content"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Henry\n          \n            Casey Henry\n          \n            Casey Henry"
}