{
  "url": "https://moz.com/blog/utilizing-twitter-in-a-link-building-campaign",
  "slug": "utilizing-twitter-in-a-link-building-campaign",
  "title": "Utilizing Twitter in a Link Building Campaign - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When I approach a link building campaign, I generally incorporate the following strategies:\n\n    * Choose an affinity – what type of sites do I want to contact for a link?\n    * Compile a list of sites and contact information using Google\n    * Send out emails\n    * Follow up [I am hardcore about…",
  "content": "Utilizing Twitter in a Link Building Campaign Social Media By: Nicole Chenet May 27, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Nicole Chenet May 27, 2009 Utilizing Twitter in a Link Building Campaign Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. When I approach a link building campaign, I generally incorporate the following strategies: Choose an affinity – what type of sites do I want to contact for a link? Compile a list of sites and contact information using Google Send out emails Follow up [I am hardcore about this – after 2 days, if I haven’t gotten a reply, you can be I’m sending a follow up email. It may drive some people crazy, but it works for me. I swear by the follow up!] I have always relied on Google searches as a source of sites to contact, but this week, as I was fooling around with my organization’s Twitter account, I discovered how Twitter can serve as an excellent search tool when starting a link building campaign. An explanation of this may be elementary or redundant for some, but I figured I’d share anyway. Searching for Sites: [By the way, anyone else amazed that Adam Lambert DIDN’T win the title of American Idol?] I choose a keyword/term and type it into the “Search” bar on the right-hand side of the Twitter “Home” screen [see above]. Then you can hit “Enter” or click on the little magnifying glass icon on the far right of the “Search” bar. Your REAL TIME results will look like this: [I did a search for “designer shoes” as an example]. Obviously, you’ll get a few types of results when doing a search via Twitter: results that feature Twitter accounts that Tweet exclusively about your particular search term [like an account linked to an online designer shoe boutique, for example] and results that feature the term you searched for, but may not have anything to do with that particular term at all [kind of like the second result here from SavageHair – this user may not Tweet about designer shoes every day, for example, but they did 2 hours ago, so it’s relevant and pops up in my results]. The next step is to go through the search results and try to find decent sites that I can add to my list and eventually contact as a part of my link building efforts. If I click on one of the Twitter accounts in the search results, I’ll be directed to their “Home” page. In this example, I clicked on “cavalliblog,” which happens to be the Twitter account for Roberto Cavalli, a well-known fashion [and shoe] designer. On the top right, under the “Name” and “Location” listings, is a link to Roberto Cavalli’s website. My first step is to click the link, visit their website, find some contact information and add it to my list of sites to email. The next step, though, is to check out cavalliblog’s Tweets – there could be links to additional contact-worthy websites within those Tweets! This past week, I found about 50 websites worth contacting that I had never come across before. When I sent them an email asking them to consider linking to my website, I mentioned that I had found their site on Twitter and that my organization was following their updates. By letting the contact person know that I followed them on Twitter, it’s sort of like a compliment – they feel like their information is valuable and useful, and if they appreciate that, it can only help me in my attempt at obtaining a link on their website. In my particular niche, it is often frustrating because we’ve emailed THOUSANDS of sites asking for a link, and we often feel that we’ve run out of new ideas, or that there is a lack of new websites available to contact. Using Twitter as not only a means of generating traffic to our site, but also as a source of new websites to get in touch with, was a nice surprise. When utilizing Twitter for your organization/business/website, however, I think that it is important to note the following: Protect your updates: this ensures that spammers and other sketchballs can’t auto-follow your Twitter account. If someone wants to follow our updates, I can verify that they’re legit first. Set up an RSS feed from your news source or blog: if you publish news or other content on your site/blog daily, like I do, it makes sense to set up a feed so that you’re not manually posting with the latest news story or blog post. This makes “Tweeting” super-easy…very little work on your part! Place a widget to your Twitter account on your website: Twitter is becoming SO HUGE that everyone is wondering – do you Tweet? How do I find you on Twitter? Adding a widget to your site or blog makes it easy for people to find you [and follow you] on Twitter. More Twitter followers = more potential traffic to your website. Hey, I know that I am not the first person to think of this – but it worked for me, and it IS “Social Media Month” here at SEOmoz. Next time you’re trying to find new sites to contact, try searching via Twitter. I hope it will be as beneficial for you as it has been for me [so far…perhaps I’ll update in a couple of months!] Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Utilizing Twitter in a Link Building Campaign"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Utilizing Twitter in a Link Building Campaign"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nicole Chenet\n          \n            Nicole Chenet\n          \n            Nicole Chenet"
}