{
  "url": "https://moz.com/blog/ux-vs-seo-whiteboard-friday",
  "slug": "ux-vs-seo-whiteboard-friday",
  "title": "Managing the Tensions & Tradeoffs Between UX & SEO - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We don't live in a world where we have the luxury of thinking about ​just​ user experience or ​just​ SEO. The two share many of the same spaces online, working in tandem and sometimes clashing. In today's Whiteboard Friday, Rand details the considerations and compromises that must be made for UX &…",
  "content": "Managing the Tensions & Tradeoffs Between UX & SEO Advanced SEO | Whiteboard Friday | User Experience (UX) By: Rand Fishkin July 8, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 8, 2016 Managing the Tensions & Tradeoffs Between UX & SEO Advanced SEO | Whiteboard Friday | User Experience (UX) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We don't live in a world where we have the luxury of thinking about just user experience or just SEO. The two share many of the same spaces online, working in tandem and sometimes even clashing. In today's Whiteboard Friday, Rand details the considerations and compromises that must be made for UX & SEO to coexist in harmony. Click on the whiteboard image above to open a high resolution version in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're chatting about managing tension between user experience and SEO. This is a topic we've touched on a little bit in the past, but we've seen it come up quite a bit as many more folks are thinking about user experience and working with user experience designers and product and project managers and SEO. They're trying to reconcile some of these differences. So it is the case that a lot of the things that positively impact user experience also positively impact SEO. In fact, we have a whole Whiteboard Friday about those kinds of things. But UX touches on lots of things that impact rankings in the search engines. Affecting SEO with UX changes Certainly spam, to a certain indirect degree, Google can be looking at pages and sites and may say, \"This fits in our template of what spam looks like.\" It affects links, especially because user experience helps to predict whether someone might link to you. If you have 1,000 people coming to your site, by improving the user experience you may go from 1 link per 1,000 people coming to your site to 2 or 3, which could dramatically increase the links that come to you, affecting your search engine rankings. Obviously, content is being impacted here. User experience affects how search engines judge content just as it affects how users judge that same content. User and usage data. Naturally, of course, technical issues certainly in some respects, especially with things like page load speed, mobile friendliness, these are big UX elements that impact. Probably less so with things like query interpretation and user context. Those are generally less impacted signals that search engines might use. But regardless of this, nearly everything you do that's on a site or a page that's going to positively impact user experience or negatively impact user experience will have a corresponding impact on SEO, with a small handful of exceptions. The small handful of exceptions is where we see a lot of these tensions and challenges coming into play, and that's what we're going to discuss today, specifically four kinds of tension that can exist. So what I'm going to do is ask you to imagine two worlds, one world in which there is no SEO. It's before search engines. We're just worried about the user experience. People only come to your site through the site itself, and they only navigate through the website. They don't navigate from engines directly to your pages. They're not performing searches. We're UX-only world. 1. In UX-only world, one of the big exceptions here is page consolidation versus segmentation. So page consolidation would be, I'm going to put a bunch of different user intents all together on a single page because we can serve users best from that single page, single experience. That is true in UX-only world. But what has happened is that you've forgotten about UX+SEO world. I'll give you an example here. Let's say I'm trying to make a website all about transportation in the Seattle area. I want to provide people with how to get to and from places, and the best times to go, and are you thinking about traffic, and are you thinking about comparing public versus private transport options, and driving versus Lyft versus Uber versus renting a car, all these different kinds of things. I'm covering the whole world of Seattle transit. So I have in my UX-only world a single experience that describes getting to and from any neighborhood or any particular location to any other one. That page is sort of a singular experience. It provides everything all those users might need. But in UX+SEO world, we have to remember that somewhere between a third and half, sometimes even more of our traffic is actually going to be searching on Google for what we provide. They're not going to be going directly to our website and then experiencing the site only through that. They're also going to be searching on Google, and that means they're going to be searching with all different kinds of queries. Those different kinds of queries have different intents behind them, and we need to serve those with separate pages, which is why page segmentation is so important. So I might have a general landing page in UX+SEO world. I might have an individual neighborhood landing page. I might have a location to location landing page. If I'm only thinking about UX and not SEO, I am not serving these folks well. In fact, I'm hurting the user experience of anyone who searches for me or who might come to me through a search engine. Because landing on this page, if I've already expressed to Google that I'm looking to go from Ballard to the Space Needle and I want my options, that's a lousy experience. I have to go enter that information again. I already told Google what I wanted. Your website should be delivering that. So this is one of those areas where we have to make the sacrifice and live in UX+SEO world, recognize this exists, create landing pages that specifically serve the needs of searchers and provide that great experience for them. Those pages have to be linked to. They have to be indexable. They have to be keyword-targeted. They need the right kinds of content on them. It's different than pure UX world. 2. Exception number two, this also happens in internal linking and site navigation. So in UX-only world, I can have a much more limited set of onsite navigation because I don't have to point to nearly as many pages and because, in general, I can rely on the intuition of my users to be able to figure out that oh, this particular page probably lives in this particular section. If I want to go from neighborhood to neighborhood, I can look at the neighborhoods landing area. Or if I'm particularly interested in comparing costs of different kinds of vehicle rentals versus getting around the city with Lyft and Uber versus that kind of thing, I can go to the transportation options section. But in UX+SEO world, again because we have different types of landing pages, we generally speaking have to link to much more, and so that might mean instead of a single section we actually need drop-downs. We need to have more navigation. Maybe we need to even put in a footer or have some more sidebar navigation. We may need to make a little bit of a sacrifice for the purity of user experience for someone who's not coming from search in order to link to more things and in order to provide better internal anchor text. These links are going to need good internal, descriptive anchor text. That is not actually just helpful for search engines. This is actually quite helpful for folks who may not have the same intuition that you're assuming many of your visitors might have and for folks who are looking to quickly navigate directly, potentially on a mobile device or on a screen reader for those folks who have more trouble with accessibility issues. This is positive from all those perspectives. That internal anchor text, as we've discussed previously on Whiteboard Friday, can have quite a positive impact on your search rankings. 3. Exception number three, keyword use on pages in titles and in anchor text So in UX-only world, I might have a page that's \"Ballard to Space Needle.\" Great, that's all I need to say. But in UX+SEO world, I need to show the search engines and, indeed, the searchers themselves that I'm very relevant to their query, that I'm answering exactly what they are looking for before they get to this page, because, remember, all they're going to see in the search results is just the title and the description maybe, whatever is in that little snippet. They're not going to know, \"Oh you know what, they probably provide a great experience, but it's very visual and interactive and so I just can't see it. I'll click them anyway.\" That is not how people search. They look at that snippet. They decide whether they're going to click and engage. So we need to present a better, more optimized version of the page for search engines specifically. In this case, what is also true is that there's probably a bunch of words and phrases — what we've called here at Moz related topics — related keywords, related topics that I should have on this page. If I'm talking about going from Ballard to the Space Needle, I probably want to include words like bus, streetcar, farmers market, the farmers market in Ballard, or Seattle Center (which is at the base of the Space Needle surrounding it), monorail, which there is a monorail. It won't get you from Ballard, but it will get you from downtown to the Space Needle. Uber and Lyft. These are all words and phrases that Google would expect someone who's interested in transportation between these neighborhoods to want to find on this page. Therefore, we need to do a good job of serving those searcher intents and those related topics that Google cares about. 4. Fourth and finally, we need crawler-readable text content on pages. In UX-only world, that's not always the case. In fact, if you think about UX-only world, an app might be the very best type of experience. That could be a web app, or it could be a mobile app, or interchangeably both. It could provide a great experience by letting me just click around the city and know where I'm going and select things from inside the app. The URL would actually never change. But you know what? This sort of visual interactive experience is not going to work in UX+SEO world. We need descriptive content. We need to be able to navigate between pages. We need separate URLs for each of these. Those URLs need to have good anchor text that's pointing between them back and forth. We need to have keyword targeting in all of the facets of that navigation. We need to figure out what all those keyword targets are, which requires keyword research. So there are just a lot of different changes that need to happen. My advice is this. If you're an SEO and you're working with user experience folks, please remind them that the user experience doesn't just apply to the people who are already on the site or navigating internally in the site. Search engines send a huge amount of traffic, and we need to think about the user experience of coming from a search engine to the website. It's not just about rankings and traffic. It's about the user experience that those people have as well. If you're a user experience professional and you're working with SEOs, with the exception of these few things, generally speaking everything that you do to improve user experience — the UI itself and the visuals, the design, the branding, the load speed, the efficiency that people get between pages on a site — all of those experiential elements also improve SEO. So as a user experience professional, your pitch to SEOs should be, generally speaking, very easy because you can help them rank better so long as you keep these things in mind. All right, everyone, look forward to your comments, and we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Managing the Tensions & Tradeoffs Between UX & SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Managing the Tensions & Tradeoffs Between UX & SEO"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Affecting SEO with UX changes"
    },
    {
      "level": "H2",
      "text": "1. In UX-only world, one of the big exceptions here is page consolidation versus segmentation."
    },
    {
      "level": "H2",
      "text": "2. Exception number two, this also happens in internal linking and site navigation."
    },
    {
      "level": "H2",
      "text": "3. Exception number three, keyword use on pages in titles and in anchor text"
    },
    {
      "level": "H2",
      "text": "4. Fourth and finally, we need crawler-readable text content on pages."
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}