{
  "url": "https://moz.com/blog/vanishing-affiliate-links",
  "slug": "vanishing-affiliate-links",
  "title": "Vanishing Affiliate Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I have some affiliate sites and recently received two messages from site visitors who were interested in making a purchase but could not figure out how to click through to the purchase page.  I chalked the first one up to some cranky person who didn't know how to run a br...",
  "content": "Vanishing Affiliate Links Design E By: EGOL February 20, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL February 20, 2006 Vanishing Affiliate Links Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I have some affiliate sites and recently received two messages from site visitors who were interested in making a purchase but could not figure out how to click through to the purchase page. I chalked the first one up to some cranky person who didn't know how to run a browser.... I replied asking him the standard questions... what did you see on the site, what browser are you using, what version, etc. I couldn't figure it out so I blew it off. Then a second complaint comes in for the same page and that got me off of my ass.Here's what I think was happening.... Firefox has an option to block images that are being called from another domain (Tools >> Options >> Load Images for the originating website only). So, if you are using an image server or calling images from the affiliate program's website you might be losing a bunch of dough. I am also wondering if there are some ad blockers that can smell parametered affiliate links and will block images that link through them from displaying in the broswer? If you have any good info related to this or other affiliate link problems, please post them as comments below. Maybe we can get a collection if ideas right here. Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Vanishing Affiliate Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Vanishing Affiliate Links"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}