{
  "url": "https://moz.com/blog/vertical-content-marketing",
  "slug": "vertical-content-marketing",
  "title": "Benchmark for Success: What Your Vertical Can Achieve With Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Domenica D'Ottavio of Fractl shows how businesses across seven niches can set realistic expectations for their link-building content, based on insights from over 600 projects Fractl has produced and promoted in the last five years.",
  "content": "Benchmark for Success: What Your Vertical Can Achieve With Content Marketing Content Marketing By: Domenica D'Ottavio March 4, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Domenica D'Ottavio March 4, 2020 Benchmark for Success: What Your Vertical Can Achieve With Content Marketing Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. You’ve produced a piece of content you thought was going to be a huge success, but the results were underwhelming. You double and triple checked the content for all the crucial elements: it’s newsworthy, data-driven, emotional, and even a bit controversial, but it failed to “go viral”. Your digital PR team set out to pitch it, but writers didn’t bite. So, what's next? Two questions you might ask yourself are: Do I have unrealistic link expectations for my link-building content?Is my definition of success backed by data-driven evidence? Fractl has produced thousands of content marketing campaigns across every topic — sports, entertainment, fashion, home improvement, relationships — you name it. We also have several years’ worth of campaign performance data that we use to learn from our successes and mistakes. In this article, I’m going to explain how businesses and agencies across seven different niches can set realistic expectations for their link-building content based on the performance of 626 content projects Fractl has produced and promoted in the last five years. I’ll also walk through some best practices for ensuring your content reaches its highest potential. Managing expectations across verticals You can’t compare apples to oranges. Each beat has its own unique challenges and advantages. Content for each vertical has to be produced with expert-level knowledge of how publishers within each vertical behave. We selected the following common verticals for analysis: Health and fitnessTravelSex and relationshipsFinanceTechnologySportsFood and drink Across the entire sample of 626 content projects, on average, a project received 23 dofollow links and 88 press mentions in total. Some individual vertical averages didn’t deviate much from these averages, while others niches did. Of course, you can’t necessarily expect these numbers when you just start dipping your toes in content marketing or digital PR. It’s a long-term investment, and it usually takes at least six months to a year before you get the results you’re looking for. A “press mention” refers to any time a publisher wrote about the campaign. A press mention could involve any type of link (dofollow, nofollow, simple text attribution, etc.). We also looked at dofollow links individually, as they provide more value than a nofollow link or text attribution. For campaigns that went “viral” and performed well above the norm, we excluded them in the calculation so as not to skew the averages higher. Based on averages from these 626 campaigns, are your performance expectations too high or too low? Vertical-specific content considerations Of course, there are universal principles that you should apply to all content no matter the vertical. The data needs to be sound. The graphic assets need to be pleasing to the eye and easy to understand. The information needs to be surprising and informative. But when it comes to vertical-specific content considerations, what should you pay attention to? What tactics or guidelines apply to one niche that you can disregard for other niches? I solicited advice from the senior team at Fractl and asked what they look out for when making content for different verticals. All have several years of experience producing and promoting content across every vertical and niche. Here’s what they said: Sex and dating For content relating to sex and relationships, it’s important to err on the side of caution. “Be careful not to cross the line between ‘sexy’ content and raunchy content,” says Angela Skane, Creative Strategy. “The internet can be an exciting place, but if something is too out-there or too descriptive, publishers are going to be turned off from covering your content.” Even magazine websites like Cosmopolitan — a publication known for its sex content — have editorial standards to make sure lines aren’t crossed. For example, when pitching a particularly risqué project exploring bedroom habits of men and women, we learned that just because a project is doing well over at Playboy or Maxim doesn’t mean it would resonate with the primarily female audience over at Cosmopolitan. Especially be aware of anything that could be construed as misogynistic or pin women against each other. It’s likely not the message your client will want to promote, anyway. Finance Given the fact that money is frequently touted as one of the topics you avoid over polite dinner conversation, there's no doubt that talking and thinking about money evokes a lot of emotion in people. “Finance can seem dry at first glance, but mentions of money can evoke strong emotions. Tapping into financial frustrations, regrets, and mistakes makes for highly entertaining and even educational content,” says Corie Colliton, Creative Strategy. “For example, one of my best finance campaigns featured the purchases people felt their partners wasted money on. Another showed the amount people spend on holiday gifts — and the number who were in debt for a full year after the holidays as a result.” Emotion is one of the drivers of social sharing, so use it to your advantage when producing finance-related content. We also heard from Chris Lewis, Account Strategy: “Relate to your audience. Readers will often try to use financial content marketing campaigns as a way to benchmark their own financial well-being, so giving people lots of data about potential new norms helps readers relate to your content.” People want to read content and be able to picture themselves within it. How do they compare to the rest of America, or their state, or their age group? Relatability is key in finance-related content. Sports A little healthy competition never hurt anyone, and that’s why Tyler Burchett, Promotions Strategy, thinks you should always utilize fan bases when creating sports content: “Get samples from different fan bases when possible. Writers like to pit fans against each other, and fans take pride in seeing how they rank.” Food and drink According to Chris Lewis, don’t forgo design when creating marketing campaigns about food: “Make sure to include good visuals. People eat with their eyes!” If the topic for which you’re creating content typically has visual appeal, it’s best to take advantage of that to draw people into your content. Have you ever bought a recipe book that didn’t include photos of the food? Technology Think tech campaigns are just about tech? Think again. Matt Gillespie, Data Science, says: “Technology campaigns are always culture and human behavior campaigns. Comparing devices, social media usage, or more nuanced topics like privacy and security, can only resonate with a general audience if it ties to more common themes like connection, safety, or shared experience — tech savvy without being overly technical.” Travel When creating content for travel, it’s important to make sure there are actionable takeaways in the content. If there aren’t, it can be hard for publishers to justify covering it. “Travel writers love to extract ‘tips’ from the content they're provided. If your project provides helpful information to travelers or little-known statistics on flights and amenities, you're likely to gain a lot of traction in the travel vertical,” says Delaney Kline, Brand Promotions. “Come up with these ideal statistics before creating your project and use them as a template for your work.” Health and fitness In the health and wellness world, it can seem like everyone is giving advice. If you’re not a doctor, however, err on the side of caution when speaking about specific topics. Try not to pit any particular standard against another. Be careful around diet culture and mental health topics, specifically. “Try striking a balance between physical and mental well-being, particularly being careful to not glorify or objectify one standard while demeaning others,” says Matt Gillespie, Data Science. “Emphasize overall wellness as opposed to focus on a single area. In this vertical, you need to be especially careful with whatever is trending. Do the legwork to understand the research, or lack thereof, behind the big topics of the moment.” Improving content in any vertical While you can certainly tailor your content production and promotion to your specific niche, there are also some guidelines you can follow to improve the chances that you’ll get more media coverage for your content overall. Create content with a headline in mind When you begin mapping out your content, identify what you want the outcome to look like. Before you even begin, ask yourself: what do you want people to learn from your content? What are the elements of the content you’re producing that journalists will find compelling for their audiences? For example, we wrote a survey in which we wanted to compare the levels of cooking experience across different generations. We hypothesized that we’d see some discrepancies between boomers and millennials specifically, and given that millennials ruin everything, it was a good time to join the discussion. As it turns out, only 64% of millennials could correctly identify a butter knife. Publishers jumped at the stats revealing millennials have a tough time in the kitchen. Having a thesis and an idea of what we wanted the project to look like in advance had a tremendous positive impact on our results. Appeal to the emotionality of people In past research on the emotions that make content go viral, we learned that negative content may have a better chance of going viral if it is also surprising. Nothing embodies this combination of emotional drivers than a project we did for a travel client in which we used germ swabs to determine the dirtiest surfaces on airplanes. This campaign did so well (and continues to earn links to this day) that it’s actually excluded from our vertical benchmarks analysis as we consider it a viral outlier. Why did this idea work? Most people travel via plane at least once a year, and everyone wants to avoid getting sick while traveling. So, a data-backed report like this one that also yielded some click-worthy headlines is sure to exceed your outreach goals. Evergreen content wins (sometimes) You may have noticed from the analysis above that, of the seven topics we chose to look at, the sports vertical has the lowest average dofollows and total press mentions of any other category. For seasoned content marketers, this is very understandable. Unlike the other verticals, the sports beat is an ever-changing and fast-paced news cycle that’s hard for content marketers to have a presence in. However, for our sports clients we achieve success by understanding this system and working with it — not trying to be louder than it. One technique we’ve found that works for sports campaigns (as well as other sectors with fast-paced news cycles such as entertainment or politics) is to come up with content that is both timely and evergreen. By capitalizing on the current interests around major sporting events (timely) and creating an idea that would work on any given day of the year (evergreen) we can produce content that's the best of both worlds, and that will still have legs once the timeliness wears off. In a series of campaigns for one sports client, we took a look at the evolution of sports jerseys and chose teams with loyal fan bases such as the New York Yankees, Carolina Panthers, Denver Broncos, and Chicago Bears. The sports niche has an ongoing, fast-paced news cycle that changes every day, if not every hour. Reporters are busy covering by-the-minute breaking news, games, statistics, rankings, trades, personal player news, and injuries. This makes it one of the most challenging verticals to compete in. By capitalizing on teams of interest throughout the year, we were able to squeeze projects into tight editorial calendars and earn our client some press. For example, timing couldn’t have been better when we pitched “Evolution of the Football Jersey”. We pitched this campaign to USA Today right before the tenacious playoffs in which the Steelers and the Redskins played. Time was of the essence — the editor wrote and published this article within 24 hours and our client enjoyed a lot of good syndication from the powerful publication. In total, the one placement resulted in 15 dofollow links and over 45 press mentions. Not bad for a few transforming GIFs! Top it off with the best practices in pitching If you have great content and you have a set of realistic expectations for that content, all that’s left is to distribute it and collect those links and press mentions. Moz has previously covered some of the best outreach practices for promoting your content to top-tier publishers, but I want to note that when it comes to PR, what you do is just as important as what you don’t do. In a survey of over 500 journalists in 2019, I asked online editors and writers what their biggest PR pitch pet peeves were. When you conduct content marketing outreach, avoid these top-listed items and you’ll be good to go: While you might get away with sending one too many follow-ups, most of the offenses on this list are just that — totally offensive to the writer you’re trying to pitch. Avoid mass email blasts, personalize your pitch, and triple-check that the person you're contacting is receptive to your content before you hit send. Conclusion While there are certainly some characteristics that all great content should have, there are ways to increase the chances your content will be engaging within a specific vertical. Research what your particular audience is interested in, and be sure to measure your results realistically based on how content generally performs in your space. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Benchmark for Success: What Your Vertical Can Achieve With Content Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Benchmark for Success: What Your Vertical Can Achieve With Content Marketing"
    },
    {
      "level": "H2",
      "text": "Managing expectations across verticals"
    },
    {
      "level": "H2",
      "text": "Vertical-specific content considerations"
    },
    {
      "level": "H3",
      "text": "Sex and dating"
    },
    {
      "level": "H3",
      "text": "Finance"
    },
    {
      "level": "H3",
      "text": "Sports"
    },
    {
      "level": "H3",
      "text": "Food and drink"
    },
    {
      "level": "H3",
      "text": "Technology"
    },
    {
      "level": "H3",
      "text": "Travel"
    },
    {
      "level": "H3",
      "text": "Health and fitness"
    },
    {
      "level": "H2",
      "text": "Improving content in any vertical"
    },
    {
      "level": "H3",
      "text": "Create content with a headline in mind"
    },
    {
      "level": "H3",
      "text": "Appeal to the emotionality of people"
    },
    {
      "level": "H3",
      "text": "Evergreen content wins (sometimes)"
    },
    {
      "level": "H3",
      "text": "Top it off with the best practices in pitching"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Domenica D'Ottavio\n          \n            Domenica D'Ottavio"
}