{
  "url": "https://moz.com/blog/viral-marketing-is-stupid",
  "slug": "viral-marketing-is-stupid",
  "title": "Viral Marketing is Stupid - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yesterday, I was arguing with my friend about the existence of one sight or sound that is universally funny. He argued that since different cultures find humor in different things, there couldn't possibly be one example of something that is funny to everyone. Unconvinced, I started searching for…",
  "content": "Viral Marketing is Stupid Social Media By: Danny Dover March 28, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover March 28, 2008 Viral Marketing is Stupid Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Yesterday, I was arguing with my friend about the existence of one sight or sound that is universally funny. He argued that since different cultures find humor in different things, there couldn't possibly be one example of something that is funny to everyone. Unconvinced, I started searching for the holy grail of funny. Immediately, I went on YouTube and starting browsing my favorite videos. Eventually, I came to the monkey video below. No matter how many times I watch the video, I still find it funny. There is something instinctively funny about seeing how dumb a monkey is compared to the brilliance of humans. This video stayed in my mind as I walked to work today. As I sat down at my desk and started doing my usual rounds of social news sites, I realized how redundant and simplistic the online content is on all of my social \"news\" sources. Each day I click to see a picture of someone doing something either really stupid or really clever. I get a brief second of joy and go on to find the next well marketed image or blog top ten list. The content doesn't teach me anything but it is creative and the affect it has on me is hypnotizing. The sad truth is dumbing down content is fundamental to most successful marketing campaigns. What super bowl commercials do people remember? Not the ones with a serious message. Instead, people remember the one with the baby talking about how he wasted his money buying a creepy clown. As a viewer, I get no value from this other than a brief second of happiness and if the advertiser is lucky, I remember the name of a company. Business people and expert marketers call this practice catering to the lowest common denominator. They argue that by writing to get the dumb instinctual laugh rather than the intellectual laugh, they maximize their audience. This might be true for old media but it surely doesn't apply to the internet, right? This brings me back to the monkey video. Should I be striving to ignore the monkey videos and spend all my time online reading informational texts? Absolutely not. One of the most powerful uses of the internet is to help people relax. There is a very important reason people mindlessly surf the net at work. They need to relax their brain before going back to the stress of solving complex problems for their respective companies. Taking mental breaks keeps people happy and productive. This is especially true for SEOs and SEMs. One of the reasons our industry is so enjoyable and successful is that our actual work is intertwined with the mind numb-ers. Top ten lists of weird looking cats are accessible along with up to the second industry news. We get the benefits of both worlds. We work to solve complex problems while being surrounded by things to dumb us down and keep us happy. In our case, it is not ignorance but rather stupidity that is bliss. Now for your moment of zen. A dovernym is any word that looks like how it is spelled. So far, the only one I have been able to come up with is 'bed'. Pretty cool, huh? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Viral Marketing is Stupid"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Viral Marketing is Stupid"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}