{
  "url": "https://moz.com/blog/visitors-judge-a-site-in-120th-of-a-second",
  "slug": "visitors-judge-a-site-in-120th-of-a-second",
  "title": "Visitors Judge a Site in 1/20th of a Second - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Just saw this article at Nature about how visitors to a website can form an impression about it in just 50 milliseconds.  We all think that content is important but this article argues that ...",
  "content": "Visitors Judge a Site in 1/20th of a Second Design E By: EGOL January 17, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL January 17, 2006 Visitors Judge a Site in 1/20th of a Second Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Just saw this article at Nature about how visitors to a website can form an impression about it in just 50 milliseconds. We all think that content is important but this article argues that the first impression will give your site a \"halo effect\" that lends to credible content - even if there are a few flaws. They also talk about simple design with just one focus image per page.I better get a new design on some of my sites! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Visitors Judge a Site in 1/20th of a Second"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Visitors Judge a Site in 1/20th of a Second"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}