{
  "url": "https://moz.com/blog/visiting-bad-neighborhoods",
  "slug": "visiting-bad-neighborhoods",
  "title": "Visiting Bad Neighborhoods - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Cygnus, over at SEOChat, posted a thread back in July that has quickly become one of the most popular and visited threads of the summer. Delisted Sites? poses questions about many recently dropped sites at Google from a variety of sources. I was lucky enough to have some private ...",
  "content": "Visiting Bad Neighborhoods Blogging By: Rand Fishkin September 1, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 1, 2005 Visiting Bad Neighborhoods Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Cygnus, over at SEOChat, posted a thread back in July that has quickly become one of the most popular and visited threads of the summer. Delisted Sites? poses questions about many recently dropped sites at Google from a variety of sources. I was lucky enough to have some private conversations with Cygnus to take a look at some of the sites, and while I'm not free to share them, I can say with some degree of certainty that there is great evidence to support the idea that if you link to \"bad sites\" and \"bad neighborhoods\", you could very well face your site being de-listed. From my experience looking at the sites, there can be little doubt that the ban has been triggered by a scan of the website linking into and out of the site and the quality of the sites and links on both sides. I would urge SEOs, especially those in particularly commerical or competitive spaces to be very wary of how they build links on their sites and where they generate the sources of their links. Low quality coming in and going out appears to be something that can earn a quick reprimand form Google (despite being relatively safer at Yahoo! & MSN) and my recommendation, therefore, is to first earn links naturally, with content - use press releases, directory listings, blogs (not comment spam, but blog mentions in the posts) and creativity before turning to automated systems or link advertising. This is one of the first major upgrades I've seen in Google's ability to punish low quality links and sites (and high quality sites with low quality links). It could very well be that further crackdowns are around the corner. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Visiting Bad Neighborhoods"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Visiting Bad Neighborhoods"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}