{
  "url": "https://moz.com/blog/visitor-statistics-after-1-year-of-business",
  "slug": "visitor-statistics-after-1-year-of-business",
  "title": "Visitor Statistics After 1 Year of Business - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Approximately a year ago, I decided to start my own website - a semiconductor supplier directory company called Semi-Directory. I admit it’s a bit of a dry topic, but please bear with me as this post isn’t about the site per se. Instead, I thought it might be a good idea to share my progress over…",
  "content": "Visitor Statistics After 1 Year of Business Online Advertising D By: Darren Savery March 14, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! D By: Darren Savery March 14, 2009 Visitor Statistics After 1 Year of Business Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Although I’ve hung around SEOmoz for a few years now, this is my first attempt at writing a YOUmoz post *gulp*. Please be gentle with me………. Approximately a year ago, I decided to start my own website - a semiconductor supplier directory company called Semi-Directory. I admit it’s a bit of a dry topic, but please bear with me as this post isn’t about the site per se. Instead, I thought it might be a good idea to share my progress over the last 12 months, and provide evidence that SEO actually works! (duh - as though you didn’t know that already). Still, it’s nice to see tangible evidence that this is the case now and again. Right? I don’t profess to being an SEO ‘expert’ by any means, by I feel that I have lurked around SEOmoz long enough, along with becoming a PRO member, to feel reasonably confident that I would be able to make inroads with this venture. Furthermore, by operating in such a niche industry such as semiconductors, I thought my chances of ranking pretty high were pretty high. I built the database driven site from scratch using a MS SQL backend, and spent a good deal of time making sure the factors within my control (i.e., site/page optimization) were taken care of. Having implemented all the basics (as detailed in SEOmoz’s The Illustrated Guide to Building a Search-Friendly Website), it was time to move on to the meaty stuff – promoting the site. Woohoo! As I worked tirelessly in an attempt to increase the usage of the site and penetrate the market, I noticed that there were certain SEO activities that resulted in a definite and sustained increase in visitor traffic. I hope that by explaining my activities around the various jumps in numbers in the following graph, you're given some confidence to try new tactics if you haven’t already implemented them. They worked for me and, while I can’t guarantee it, I hope they can work for you too. (Please note that although the visitor numbers aren’t that high, the emphasis should be on the percentage increases) 1: Launch of new section/tool on website The first serious jump in traffic to the site came after the launch of an exciting new tool that was added to the website – a semiconductor conference calendar. It took a little longer than I hoped to complete, but I eventually launched what would become a seriously kick-ass, technology laden widget that the industry had never seen before. Having such a unique tool on the site made a massive difference, but I didn’t stop there. Not one to miss an opportunity to put my SEO skills to use, I ‘widgetized’ the calendar and enabled users the ability to access the calendar API and embed a copy in their own website (obviously with a link pointing back to my site). 2: Email Marketing At first I thought the spike was due to the lambing season getting underway, but I quickly remembered that I emailed all my registered users, advertisers, contacts and internet savvy farmyard animals ( totaling approx 4,000) promoting the launch of the new calendar. Over the course of two separate emails (one promoting the site, the other highlighting the events calendar), visitor stats jumped significantly, but dropped back down to normal levels with a week or so. Looking back, I think it is clear to see the benefit of email marketing but, with the benefit of hindsight, I would have increased the length of the email campaign, contacting users over a longer period of time to increase brand awareness. 3: Migration From Dynamic to Static URLs When the site was initially built, I didn’t know much about URL rewriting. “Big deal!” I thought. I didn’t see a problem with URL’s in the format I was using. They worked, spiders indexed them and I received visitors. What more could I want? After hearing that moving to static URLs can help increase results in the SERPS, I posted a few questions in SEOmoz’s Q&A section asking for advice before deciding to take the plunge and undertake the rather large task of migrating over to static URLs. Unfortunately, due to the site being based on a Windows platform and on a web host server that didn’t allow custom software to be installed to handle re-writing at the domain level, I had to rely on some fancy server redirects in conjunction with my 404 page. Without boring you with the technicalities, it worked……boy, did it work! Rankings increased only slightly, but visitor numbers almost doubled! I feel that the big change that occurred was that my site URLs became meaningful in their own right, instead of being full of variables. What reads better to you: Old: http://www.semi-directory.com/category.asp?level1=5&level2=3&level3=9 New: http://www.semi-directory.com/chemical-mechanical-polishing/c9 I can only take from this that users trust results more where the URL reinforces the search term they are looking for. 4: What the %^$*! So, visitor numbers fell through the floor. However, I’m not even bothered – not in the slightest. Why, you ask? Pretty simple, really – Christmas. Being a niche B2B website, and having well over 75% of traffic coming from the Western hemisphere, it was not surprising that everyone shut down for a well deserved break. With visitor numbers jumping straight back to their previous levels once everyone came back to work in the New Year, everything went back to ‘business as usual’. 5: Badges The latest SEO tactic to be employed were badges. Everyone loves badges (even scientists in white lab coats)! I created a variety of badges based around the message ‘recommended by Semi-Directory’ (so as to appeal to the prospective webmaster’s ego), and contacted semiconductor vendors to ask if they would be willing to display the badge on their site. As an added incentive, I offered a small upgrade to their listing in my directory free of charge. A number of vendors took up the offer and, on top of receiving relevant inbound links, I also get increased the site's visibility in the industry at the same time. Nice! I hope this article has shown that SEO tactics DO work. Of all the things that I have tried so far, the one that returned the most noticeable increase in traffic was to move to static URLs. If anyone has any suggestions as to how I can take things to the next level, I’d love to hear them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Visitor Statistics After 1 Year of Business"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Visitor Statistics After 1 Year of Business"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Darren Savery\n          \n            Darren Savery"
}