{
  "url": "https://moz.com/blog/vote-for-the-smx-west-search-bowl-competitors",
  "slug": "vote-for-the-smx-west-search-bowl-competitors",
  "title": "Vote for the SMX West Search Bowl Competitors - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "First off, a quick apology. I had posted this on Monday night without first checking with our nominees to ensure they could attend. I've now done so and thus, have a list of potential competitors who will be present if called upon!\nFor those who may be confused,  next month at the inaugural SMX…",
  "content": "Vote for the SMX West Search Bowl Competitors SEO Events By: Rand Fishkin January 31, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 31, 2008 Vote for the SMX West Search Bowl Competitors SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. First off, a quick apology. I had posted this on Monday night without first checking with our nominees to ensure they could attend. I've now done so and thus, have a list of potential competitors who will be present if called upon! Sadly, favorites like Dave Naylor, Aaron Wall, and a few others will not be in attendance, but the vast majority of nominees are attending! For those who may be confused, next month at the inaugural SMX West search marketing conference, two intrepid search marketers will take on teams from Google, Yahoo!, MSN/Live, & Ask.com in the first ever Search Bowl! Search Bowl is a trivia game, wherein the teams of two will be asked questions related to search and search marketing and those with the greatest knowledge of all things \"search\" will take home eternal glory! Or, at least, a 1994 Chrysler LeBaron (that's the prize, right Danny?). For this voting, I've asked each of our nominees to prepare a short statement indicating why they would be best qualified to represent search marketers on the trivia field of battle. Here are their responses: Heather Lloyd Martin (of SuccessWorks): Sure, Why Not. Sounds like fun! :) Michael Gray (of Wolf-Howl): The man who bought a text link from Matt Cutts. Hamlet Batista (of HamletBatista.com) Reading search engineers' blogs and listening to their advice is not a competitive advantage. Andy Beal (of Marketing Pilgrim): I've probably read 100,000+ search industry news items over the past five years, if I don't release the pressure by regurgitating them, my head will explode. Ian Lurie (of Portent Interactive): Er, what is a Search Bowl? Should I wear protective clothing? Todd Friesen (Oilman and now part of Visible Technologies - congrats, Todd, and welcome to Seattle): I'll bring my cup.... Greg Boser (of WebGuerrilla): I am coming, but I'm really hoping I don't win. Matt McGee (of SmallBusinessSEM): Every vote for me is an entry in next year's SEMMY Awards! (Not really, sorry.) Loren Baker (of SearchEngineJournal): I [nominate] Bill [Slawski] just as long as we can limit his answers to under 60 seconds and insist that he wear an eye patch :) Andrew Goodman (of Traffick): I feel that I'll fare better if we add an egg race, real Super Bowl trivia, or \"best impression of Bugs Bunny\" to the mix, but anyway, count me as \"game\" to be humiliated in some shape or form. Jill Whalen (of HighRankings): I'm the one who made Altavista rank first for \"search engine\" at Google. Why? Because I can. Congrats to all our nominees. Now please help your industry select its finest for the battle ahead: polls - Take Our Poll Thanks for voting - we'll announce a winner next week (along with some other very cool stuff about SEOmoz's participation in SMX West). p.s. That's not actually Jill's quote. I just made it up because she didn't get back to me with the requested one-liner. I'm sure if she had, it would be something far more clever and vote inducing. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Vote for the SMX West Search Bowl Competitors"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Vote for the SMX West Search Bowl Competitors"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}