{
  "url": "https://moz.com/blog/vseo-how-do-they-do-that",
  "slug": "vseo-how-do-they-do-that",
  "title": "An Intro to VSEO (Video Search Optimization) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A while ago, i was looking into video search engine optimisation (VSEO) and what benefits it could or would bring to my customers, and after contacting a number of so called VSEO specialists, found this to be a very expensive way of marketing online. On two occasions, I was quoted in excess of…",
  "content": "An Intro to VSEO (Video Search Optimization) Online Advertising G By: G-Forces August 22, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! G By: G-Forces August 22, 2008 An Intro to VSEO (Video Search Optimization) Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. A while ago, I was looking into video search engine optimisation (VSEO) and what benefits it could or would bring to my customers. After contacting a number of so called VSEO specialists, I found it to be a very expensive way of marketing online. On two occasions, I was quoted in excess of $6,000 for this service; not only was this a high cost, but this was a \"per month\" cost with a minimum contract of 6 months, as this was claimed to be a process that did not provide immediate results. With this in mind, I decided to see what all the fuss was all about. How can a company charge so much money for what seemed like a easy process? That's when it hit me like a bolt of lightening: I was going to do this myself and get the same, if not better results than they claimed to be able to get. So after some careful searching on the beloved Google, I came across what can only be described as the perfect site for VSEO, Tubemogul.com. What is Tubemogul, I hear you ask? Well, TubeMogul is a free service that provides a single point for deploying uploads to the top video sharing sites and powerful analytics on who, what, and how videos are being viewed (extracted from their web site). I played around, did a few tests, and found that if you were to use the same or a similar method to Tubemogul along with other basic SEO tactics, you can achieve these results and even track how many people view the video(s) (with the exception of how many people visit your site from them, as if they don't accept URLs to link from the video to your site). But with a bit of social media and social networking along with a strong link building strategy, it's possible to achieve page 1 listings. For example, for automotive, using generic terms really didn't seem to work that well, but promoting a specific vehicle received over 60 views per day per video, so rolling this out on other industries shouldn't be that hard, either. One thing I would stress though is don't think that just putting a video up will get you the results you're looking for. You need to do hours' worth of work. Uploading a video on its own might get you found, but it will be very short-lived (if you can even get there in the first place). But with careful link building and using social as a way of increasing the link building, you'll be well on your way to achieving the results you're after. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An Intro to VSEO (Video Search Optimization)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An Intro to VSEO (Video Search Optimization)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "G-Forces\n          \n            G-Forces"
}