{
  "url": "https://moz.com/blog/waiting-for-twitter",
  "slug": "waiting-for-twitter",
  "title": "Waiting for Twitter.com - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Rand send me an email on Monday and asked me to review Twitter for the blog as it's been getting some coverage is the blogosphere lately. I'd heard of the site, but had never really investigated it in depth, so I signed up...",
  "content": "Waiting for Twitter.com Social Media By: Jane Copland March 20, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland March 20, 2007 Waiting for Twitter.com Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Rand sent me an email on Monday and asked me to review Twitter for the blog as it's been getting some coverage in the blogosphere lately. I'd heard of the site, but had never really investigated it in depth, so I signed up. I don't know if it's my fault, but I can't get any page to load within a time-frame of about ninety seconds. Some pages never loaded. Loading... Loading. Still loading... I decided to leave the investigating until Tuesday when, hopefully, the site would be working a little quicker. Back on Twitter's case this morning, the site was loading even slower. When I tried to get to my profile, I was greeted with this: Oh my God, it's the new MySpace. Every second click elicits an error alert. Rather than sit and watch the \"Loading\" message, I went on a search of the blogosphere for information about what Twitter does. I found that, as is the case with most start-ups that garner a lot of quick attention, Twitter has its fanboys and its haters. Because I'm a little behind on what Twitter does, I probably don't need to write a lengthy description of the free service, but here's a quick overview. Everyone on Twitter is answering the question \"What are you doing.\" For you Facebook users out there, it's an entire website dedicated to the sidebar status box. When you sign up with the site, you can add existing users as friends or invite other friends to sign up. Once you've amassed some buddies, their status messages can be viewed on the website, sent to you via text message or instant messaged to one of three IM services: AIM, Jabber and Gtalk. Rand wanted me to review Twitter from a marketing standpoint, but despite the numerous things people have dreamed up to justify Twitter's existence, the only real role I see Twitter having is that of an entertainer. I have friends living all over the world, from New Zealand to South Africa, England to New York City... yeah, it would be entertaining to have them all engaged in a constant conversation that appeared on my computer screen, but I already have AIM, MSN Messenger and a couple of other social networking sites to waste my time on. From a marketing perspective, my initial experience with the service has not been particularly inspiring. Quite honestly, I don't see Twitter doing anything that hasn't been done before; it's just been packaged differently. People have posted defenses of the site, such as Amit Agarwal's list of things that one can do on Twitter aside from finding out that friends are going to get coffee. Most of the arguments seem to be quite easy to shoot down, such as the idea that Twitter makes contacting busy people easier. Say one of your friends gets so many emails that he or she can't possibly get through them all. The idea is that a Twitter message will get through to them faster. But how is this quicker and more simple than sending the person a text message, calling them on their phone or sending an IM? The only decent defense of Twitter's marketing potential I've seen is in fact a list of thing the site could or should do from Search Marketing Gurus, and even this list could be expanded quite substantially. However, notice that this is a list of things that the site doesn't do currently. In addition, some people are already hypothesizing that Twitter is reaching critical mass and is going to lose its appeal due to chronic overcrowding. Add marketers to the mix (which means everyone from the pros to the cheap-mortgage-foreclosure-experts-car-insurance-cialis-xanax spammers) and you really will have another MySpace where the vacuum of garbage sucks in every useful function the service once had. The useful information currently available on Twitter's \"Recent Updates\" Page To me, people who make up professional reasons to be on Twitter are simply looking for a way to justify some fun time-wasting. I don't begrudge them this; Rebecca and I have been known to IM each other at work and even write messages to each other (and to a couple of other SEOs) on Facebook. However, I don't call this networking or marketing or try and make up a good reason why my linkbuilding campaign should be put on hold while I see where Sugarrae is spending her weekend. So, aside from the fact that the site is currently running slower than is acceptable in our current internet culture (or in 1996's internet culture), I don't see Twitter being the next influential social media marketing tool. However, I'm completely open to the (inevitable) suggestions as to why I'm horribly wrong. Does Twitter have anything really substantial to offer? Will it ever finish loading? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Waiting for Twitter.com"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Waiting for Twitter.com"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}