{
  "url": "https://moz.com/blog/wall-street-journal-covers-seo",
  "slug": "wall-street-journal-covers-seo",
  "title": "Wall Street Journal Covers SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sifish pointed me to an article at the Wall Street Journal's Startup Journal by Sarah Needleman - Three Myths on Boosting Search-Engine Rankings. It a fairly primitive stab at explaining how the industry operates, and once again it pushes the pervasive view that most search engine optimization…",
  "content": "Wall Street Journal Covers SEO Public Relations By: Rand Fishkin June 27, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 27, 2005 Wall Street Journal Covers SEO Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Sifish pointed me to an article at the Wall Street Journal's Startup Journal by Sarah Needleman - Three Myths on Boosting Search-Engine Rankings. It a fairly primitive stab at explaining how the industry operates, and once again it pushes the pervasive view that most search engine optimization companies are opportunistic vultures who prey on the ignorance of small and mid-size companies. There were some nice mentions and good advice given by Chris Sherman of SearchEngineWatch, Jamie Low of SearchEngineMarketing.com (whom I don't know personally) and Allan Dick of Vintage Tub & Bath (who spoke at the last two SES conferences here in North America). The good advice includes a mention that search engines don't need to be submitted to and that keyword repetition (stuffing) can hurt, rather than help your site's rankings. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Wall Street Journal Covers SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Wall Street Journal Covers SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}