{
  "url": "https://moz.com/blog/want-a-viral-hit-here-is-an-inside-look-at-our-ideation-process",
  "slug": "want-a-viral-hit-here-is-an-inside-look-at-our-ideation-process",
  "title": "Want a Viral Hit? Here Is an Inside Look at Our Ideation Process - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Viral content can lead to astounding results when the right ideas are shared with the right communities, and coming up with those ideas doesn't have to be a daunting task. By blending the right kinds of research with some out-of-the-box thinking, you can maximize your potential for success.",
  "content": "Want a Viral Hit? Here Is an Inside Look at Our Ideation Process Content Marketing By: Kelsey Libert October 9, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kelsey Libert October 9, 2013 Want a Viral Hit? Here Is an Inside Look at Our Ideation Process Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This post was co-authored by Kristin Tynski, VP Creative at Frac.tl and Kelsey Libert, Director of Promotions. The importance of the idea When it comes to creating viral content, if you don't have an exceptional idea, you are dead in the water. Even if you're able to execute production at a very high level and promote your content with the best of them, if the idea doesn't check all the boxes of viral content, you're toast. So, given you understand what a viral idea might look like, how do you bridge the gap between theory and actually coming up with one of these truly viral ideas? What follows is the process we use here at Fractl to come up with ideas that we feel confident will find viral success. Defining parameters We approach our ideation task as we would a riddle. Think of it this way: You are given a set of known parameters, and you must find an answer that elegantly satisfies all of those parameters. The difference here is that there's more than just one correct answer. In fact, there are usually many answers that'll fit. So what are your primary defining parameters? In nearly all cases the primary parameters I follow include: The idea must play well with the brand/product/service topic area. It must also fit the constraints of the client. Decide beforehand if your ideas can be broadly related to a niche or topic area, or if they must be more constrained. The idea must contain an emotionally compelling hook as described in my last post. More specifically, it must evoke feelings of surprise and interest, which are generally essential to a successful viral idea. The idea must contain something original or new, and it's even better if it's newsworthy. From a content promotion and syndication perspective, having an idea that presents new information will make it much more likely to be picked up by mainstream blogs and news sites. The related concepts should have some proof of past viral engagement. Can you point to some other piece of content and use it as a basis for predicting the success of your own content? Be sure to keep these questions in mind as you begin your brainstorming; you will use them to keep your ideation on track. Step 1: The research dump It just so happens I have some ideation to do for one of Fractl's clients, Rehabs.com, so I'm going to use it as an example to bring you through my research techniques and ideation process. The vertical/topic area we're going after this time is \"eating disorders.\" From talking with this client, I know they are willing to stretch the topic area to a certain extent, so my ideation will keep this in mind, and I might go a bit broader in terms of how closely the content I come up with relates exactly to eating disorders. Generally, the best way to begin ideation for any viral content marketing project is to first spend the time to gather all you can about the topic area and collect what sorts of things are currently buzzworthy or have been in the past. Begin by understanding your topic area in a general way, and then use that topic area as a basis for your ideation. I usually make a list of possible ideas by finding as many popular news stories and blog posts around my general topic area as I can. I copy down this research in the first tab of my ideation document. I go to the places online that allow for both content curation and the ability to organize that content by what has already been popular. The places I usually use are as follows: Reddit: Try doing a simple search for about 3 to 5 keywords related to your topical area. In this case I would try eating disorders, body image, bulimia, and anorexia. For each keyword, I would organize the Reddit results by \"top\" and set the date range to \"all-time,\" giving me a curated list of content that's ranked from most engaging to least. I then look through each list and pull out the stories that seem like they might be at least marginally interesting. Additionally, when I do these searches, I take note of the subreddits that pop up, often you will find niche communities related to your topic, go to each of these subreddits, and organize by top-all-time, to find the stories that have been most popular within these sub-niches as well. For example, searching \"body image\" on reddit showed me a subreddit called r/bodyacceptance, which I never knew existed, but seems quite active. Many of their top stories are a great place to start for viral content ideas. Google: Try searching for (Viral + Keyword) and look for other instances of viral campaigns that have been successful. Add as many of these as you can find to your list. Trendhunter: Trendhunter does a good job of picking up on trending concepts and ideas that can be searched by keywords. Try searching for your keywords and then list the interesting URLs in your brainstorming dump list. BuzzFeed: BuzzFeed does a good job with conceptualizing viral ideas. They also have an effective search tool to find these posts. Put these in your list, too. Latest research: Try searching Google Scholar or Pubmed Search. You can segment your search by date, so try to use content from the past year for fresher stories. Latest news: Google News, organized by date, can yield a good overview of what newspapers and online news sites are covering most around your topic area. Datasets: Listing all possible datasets out there would take a long time, but I usually check out this Quora post to see if there is anything that jumps out to me as being applicable to the topic area I'm looking at. Also, https://explore.data.gov/ is a great place to do a few keyword searches to see if anything pops up as well. Reddit also has an active dataset subreddit that is worth looking at. You can also try a search at ZanRan.com, which can sometimes give some good results as well. Still stuck? Here are a few other places you can go if you are still having trouble filling out your research dump: http://www.portent.com/tools/title-maker/ http://wikipedia.cognition.com http://www.instagrok.com Content Idea Generator V2 (Put your topic area in cell B3) Google Autocomplete Quora Web Search Step 2: extracting themes Once you have done a considerable amount of research and feel you've found the bulk of the most talked about stories related to your topic, you're ready to begin an overview analysis of the specific common sub-topics that seem to have a unique potential for further investigation. Go through each of the examples you have listed in your research dump and try to boil them down and label them under general subtopics. You will likely start to see several subtopics that seem to be the most talked about. These should be the subtopics you ideate around. For our example with Rehabs.com, the common subtopics I found were: Men and eating disorders The role of mass media in body image The role of marketing and advertising in body image Eating disorders as represented in Internet culture Real life stories of the afflicted Body image and happiness Eating disorder and body image memes Step 3: ideating laterally on extracted themes Using the extracted themes, the next step is the actual ideation phase, where we look to explore the different content ideas that will fit within each of these subtopic areas that we have identified as buzzworthy candidates. While doing ideation, I pay particularly close attention to ideas that fit my predefined set of parameters that were clearly defined before starting the ideation process. As I mentioned in my last post, strong emotional reactions of interest and surprise are absolutely essential in creating a viral effect. In order to activate these emotions, your goal should be to come up with an idea that presents something unexpected, counterintuitive, or completely novel. Coming up with ideas of this sort requires what is known as \"lateral thinking.\" This type of creative thinking happens when we are able to connect seemingly disparate ideas in new ways. It also happens when we realize how innovations in one area could also be applied to another area. Fortunately, there are several ways to prime your brain to think in this sort of way. I'm going to switch gears and move on from the Rehabs.com example in order to illustrate these brainstorming methods. I've found it can be effective to \"warm up\" your brain by thinking creatively on other topics first, before moving on to your actual ideation task. 1. Connecting Random Ideas You can begin your warmup with nearly any topic area. I prefer a seemingly mundane topic for warmup, so that when I switch back to my actual ideation task, it feels easier. So, lets start with something seemingly boring, how about lighting equipment. For this exercise in lateral thinking, we'll select either three random objects around the room or three random words from a dictionary. For this example, let's go with a soda bottle, which is currently sitting next to me on my desk. Our goal now is to try to come up with ideas that connect a soda bottle with our general topical area of lighting equipment in a way that makes sense and is unexpected, counterintuitive, or novel. Let's start with the soda bottle. How does it relate to lighting? At first you might not think it does, but keep thinking and start asking questions. Could a bottle be somehow used as a light? Hmm ... the answer is yes! After a quick Google search, we find this gem. It turns out that water bottles are being used effectively in the third world as makeshift skylights, and it works incredibly well! Now we can extrapolate on this idea. Keep asking questions. What are the implications of this innovation? What does this mean for populations that prior to this innovation had no lighting? The article says it might actually save lives by reducing the fire risk associated with these populations being forced to use candles. Could we create a piece of content that attempts to quantify the benefits of this innovation in some way? Keep going by taking another tack; ask more questions. For instance, are there other types of lighting implements that utilize trash like empty soda bottles? Let's find out! Yep, there sure are. But this isn't an original idea, so how can we make it original? Keep asking questions. How were these created? How could we add value here? What if we created content that showed how to do these types of projects yourself? Make sure to write down your ideas, but keep going until you have exhausted all the ideas associated with your original item (the water bottle). The truth is that your mind is inherently extremely creative—all you need to do is give it the fuel, and it will begin working on its own. Give your brain two things to connect, and it will start figuring out how it might be done. 2. Provocation technique This lateral thinking technique relies on opening your mind to new possibilities by abandoning your assumptions and asking, \"What if?\" Your goal here should be to think widely and in an exaggerated way that steps outside of what is logically possible. By doing this, you can create a bridge to unexpected connections and extremely innovative ideas. This can be done in 5 primary ways: Escape: Negate what you have taken for granted about the topic. Reversal: Reverse something you have taken for granted about the topic. Exaggeration: Is there a numerical or quantitative element you can play with to arrive at new ideas? Distortion: Try to distort one piece of something you take for granted about the topic. Wishful thinking: Suggest a fantasy you know isn't possible that relates to your topic. As you go through these exercises, remember to keep asking yourself questions. You can use the following checklist as you go: What would the consequences be? What would the benefits be? What special circumstances would make it a sensible solution? What principles are needed to support it and make it work? How would it work moment-to-moment? What would happen if a sequence of events was changed? Let's try this technique with our example of lighting: Escape: We take for granted the permanence of indoor lighting. What if it wasn't permanent? What if the U.S. was subjected to the rolling blackouts seen in many developing countries? What would the impact be? Could we create a piece of content that would explore this scenario? Can we extrapolate on current research about the importance of consistent electricity to make it more accessible to audiences that expect it as a given? Asking questions from our checklist might send us down paths to even more new areas of possibility. For example, could we create a piece of content that looked at the implications of what would happen if all the lights suddenly went out? What would be the benefits of this happening? The consequences? If all the lights in the world went out simultaneously, what exactly would happen? Reversal: Another assumption we take for granted about lighting is that for most of us, the cost of lighting is pretty static. Let's try reversing that. What if it was free or what if it was 10 times as expensive? This would lead us to questions about how the cost of lighting effects our habits. Perhaps we could create an interesting piece of content that tried to answer these hypothetical questions. Exaggeration: Is there a numerical value associated with the topic that you take for granted that could be adjusted up or down? For example, we take for granted the speed of light. What would happen if we changed this number? Alternatively, we take for granted the brightness of our sun, so what would happen if our sun suddenly got brighter or dimmer? What if the number associated with lighting elements themselves changed. For instance, what if light bulbs lasted forever? What if they only lasted a day? Then go back and ask yourself questions from the checklist again and see if anything compelling floats up. Distortion: Let's try to adjust something we take for granted about lighting. How about the idea that lighting is almost always in the form of lamps or ceiling lighting. What are some other ways we could light a room in an unexpected or innovative way. What if our lighting came in another form; what might that look like? Wishful Thinking: Try to ask yourself questions like, \"Wouldn't it be nice/cool/interesting if…\" and list as many of these statements as you can with regards to your topic area. For example, wouldn't it be awesome if there were lights that did more than just light a room? What if lights could be projectors? What if they could display information around a room? What if they could be used as cameras? What if they could be used to improve our health or beam us knowledge? Don't be afraid to be outlandish—it might lead to an amazing idea. To be sure, these examples are just some of the many techniques that can be used to help you think laterally. I love beginning my ideation sessions by doing a few exercises like the ones I've mentioned above, even if it's on a subject that's different from the one I'll be doing ideation for. It opens my mind and gets me thinking of the possibilities that might exist when I let go of my preconceptions. In my experience, this type of creative thinking is most conducive to coming up with potentially viral ideas. This is because these types of ideas aren't generated in a typical, logical way but are instead created by using unexpected ways of thinking that deviate from the norm. I would recommend the work of Edward de Bono if you are looking for more ways to improve your lateral thinking skills. Another great way to switch your brain into lateral thinking mode is to simply do some riddles. Try these before you begin your brainstorming session. Step 4: vetting ideas against a rubric I usually try to do 2 to 3 ideas for each subtopic/theme area before moving on to ideation vetting. When vetting, I typically like to get feedback from at least 4 people (other than myself) who are familiar with the client, who know the parameters the content needs to meet, and who have a good understanding of the contributing factors of viral content. I ask them to assign a score to each idea based on the following factors: The idea's adherence to set parameters The idea's originality The idea's newsworthiness The idea's emotional impact (more specifically, does it create surprise and interest) Step 5: choosing the idea This is the easiest part—simply take your culled list and let the client choose! If it's left up to you, any of the top 2 to 3 ideas should be perfect candidates. Perhaps decide based on factors unrelated to its potential for success. Consider cost, timelines, ease of execution, and whether or not the content is evergreen. Check out the second and third tabs of my Rehabs.com ideation to see this part in action. Conclusions Great viral content ideas come from a combination of creativity and hard work. By cultivating a mindset that lends itself toward the ability to think laterally, and by following a process of investigation, brainstorming, and careful vetting, you can greatly increase your chances of a viral hit. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Want a Viral Hit? Here Is an Inside Look at Our Ideation Process"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Want a Viral Hit? Here Is an Inside Look at Our Ideation Process"
    },
    {
      "level": "H2",
      "text": "The importance of the idea"
    },
    {
      "level": "H2",
      "text": "Defining parameters"
    },
    {
      "level": "H2",
      "text": "Step 1: The research dump"
    },
    {
      "level": "H2",
      "text": "Step 2: extracting themes"
    },
    {
      "level": "H2",
      "text": "Step 3: ideating laterally on extracted themes"
    },
    {
      "level": "H3",
      "text": "1. Connecting Random Ideas"
    },
    {
      "level": "H3",
      "text": "2. Provocation technique"
    },
    {
      "level": "H2",
      "text": "Step 4: vetting ideas against a rubric"
    },
    {
      "level": "H2",
      "text": "Step 5: choosing the idea"
    },
    {
      "level": "H2",
      "text": "Conclusions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kelsey Libert\n          \n            Kelsey Libert\n          \n            Kelsey Libert"
}