{
  "url": "https://moz.com/blog/wanted-software-engineers-reward-12000",
  "slug": "wanted-software-engineers-reward-12000",
  "title": "WANTED: Software Engineers REWARD: $12,000 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In 2010, SEOmoz's software business grew from 4K - 7K subscribers and $3.1mm - $5.7mm in revenue (more transparency on details coming soon). Our customers have been loving our products (our web app now supports nearly 30K campaigns) and our data (over 250 companies use our API), but we're nowhere…",
  "content": "WANTED: Software Engineers REWARD: $12,000 Moz News By: Rand Fishkin February 22, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 22, 2011 WANTED: Software Engineers REWARD: $12,000 Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In 2010, SEOmoz's software business grew from 4,000 - 7,000 subscribers and $3.1mm - $5.7mm in revenue (more transparency on details coming soon). Our customers have been loving our products (our web app now supports nearly 30K campaigns) and our data (over 250 companies use our API), but we're nowhere near satisfied. (*note: consulting revenue, which ended in 2009, is not included; 2011 revenue is estimated) It's our belief that growth is limited only by how much we can surprise, delight and reward our customers with software that rocks. We want to build more, faster and that's why today, we're announcing a new effort in bringing talented software engineers to the SEOmoz team. Have Engineer Friends? Send 'Em Our Way Why should you send your engineer friends to SEOmoz? Three big reasons: They'll be joining an amazing team at a great company earning top salaries at a place that values their contributions (see below) You'll get $12,000 in cash* (OK, probably a check, but still!) They'll also get $12,000 in cash** We're seeking 4-5 very talented engineers (possibly more) with experience handling large-scale problems like machine learning, web crawling, building and optimizing web services (APIs), coping with large quantities of data and dealing in massively distributed systems. You can learn more about the job requirements here. Engineers: Challenging Problems, Brilliant Co-Workers & Some Cool Bonuses Await You, Too As part of this process, we're making things interesting for talented engineers, too: If you refer/apply yourself, you'll receive a $12,000 cash hiring bonus** If you're not in the Seattle area, we can offer up to $10,000 to help you (and your family) move to the area If you make it to our final interview round (for a chat with our full team), you'll walk out with a free iPad Start your new job right with a $5,000 shopping budget to spend on the hardware/software/accessories of your choice (for either home or office!). Need a new desk and chair set for you spare bedroom to work those odd hours in comfort? Go for it. New laptop? No problem. Salaries for engineers at SEOmoz are substantively above the average/median for Seattle (according to Payscale, Glassdoor, SimplyHired). We'll be on par with the offers you get from Google, Facebook, Microsoft, Amazon, etc. in cash, and we're even better on stock. Benefits at SEOmoz rock - we have a great health and dental plan (for you and your family / S.O.), we'll cover your home Internet and your cellphone bill, 20 days of vacation time annually, transportation options, 401K plans and more. That said, we should all be picky about where we work and where we interview. It's not just about the salary, the bonus, the iPad or the shopping spree - there are other things that matter to us (and likely to you) when considering where to work: Will I be working on fun, interesting problems that will challenge me professionally and grow my skills? Will I learn from my co-workers and influence them positively? Does the company compensate generously and appropriately? Does my work make a recognizable impact on the company and the world? Am I contributing to a mission I believe in and a company whose core values I respect? It's my belief that SEOmoz does a solid job on all of these: The problems we face include \"web scale\" challenges - crawling, indexing and building metrics on billions of pages; collecting, filtering and making sense of millions of pieces of social data from Facebook, Twitter and other platforms; serving massive amounts of data to thousands of paying customers in a performant environment. The engineering team at SEOmoz is a remarkable and talented group. You'll be side-by-side with engineers with impressive backgrounds and serious accomplishments on the product and technology side. We are in the top quartile of compensation for software engineers in Seattle and our benefits, stock options and perks are considerably above the average. What you build will have a direct, measurable impact on our subscribers - and you'll be able to see it in the membership statistics and hear it directly through our many feedback channels (we get more than 300 messages about our products each week!). And, you won't just be helping SEOmoz customers - our mission of making it easier for ideas to be shared on the web is carried out every day, and we have tons of great stories and feedback to show it. We think it's great that Google, Bing, Facebook, Twitter, LinkedIn and the entire web ecosystem have built such remarkable platforms for sharing information. But, it's hard to get noticed in all the noise and hard to know what will help make your ideas scale and spread. That where SEOmoz comes in - our software is meant to help companies and organizations of all sizes and shapes to better spread their messages in organic, white hat ways. It's a mission we've found incredibly rewarding and we think you will, too. Why Do We Need So Much Engineering Talent? Because SEOmoz is taking off. Today, we provide some of the web's best and more popular software to help marketers understand, evaluate and improve their SEO efforts. In the months to come, we're expanding to help marketers conquer all of organic marketing - from SEO to social media to blogging, local campaigns, content marketing, PR/media and more. This means huge challenges like increasing the size, freshness and quality of our web index (currently ~45billion pages, moving up to 100 billion), building a \"mention\" index on our Blogscape platform that lets marketers see where their brand names are being used across the web (even if no direct links exist), scaling analytics, improving our machine learning algorithms, exponentially growing our data storage while simultaneously making things faster. And, unfortunately (or fortunately), our requirements for engineering talent are extremely high. We interview a lot of candidates and need not only the best and brightest in challenging fields (machine learning, large-scale crawling, natural language processing, large-scale distributed systems, etc.), but folks who fit with our core values of TAGFEE. We owe it to our customers and our mission to build amazing software and that means recruiting remarkable engineers. It's great to be a profitable startup, but money sitting in the bank won't do us, or our community any good. We want to put these dollars to work and build something revolutionary - we're aiming to be the future of organic web/inbound marketing software. Top 10 Reasons Why Should You Join SEOmoz Because a post like this wouldn't be complete without a top 10 list! Interesting, Challenging Problems (strategic and technical, and often on a very large scale) Engineering Centric Company (development and software are the core of our company's product and the largest team - you won't be in the \"IT department,\" you'll be a key member at the heart of SEOmoz) Customer Focused Roadmap (we don't just build things that sound interesting, we build things we know our customers want, need and use - and when we do, we get great feedback directly from thousands of paying members) Transparency (you'll always know how the company is doing week-to-week and quarter by quarter. Virtually every metric except salaries are shared throughout the organization) Profitability (we're in the black - no burning runways or panicked cries for venture capital. We've got a proven business model and we've been doubling our revenue for 3 years) Excellent Compensation (We pay in the top range of salaries for software engineers in Seattle based on experience + skills. You won't have to sacrifice pay to work at a great startup vs. a behemoth) Amazing Co-Workers (Ask anyone in the Seattle tech, marketing or startup community and they'll tell you - SEOmoz's people aren't just talented, they're truly good people who care about each other and are a pleasure to spend time with) Flat Organization (If you struggle against the politics and bureaucratic inefficiencies of a big organization, you'll love it here. We have smallish teams, 30 people in total, and only a single layer of management - you'll report directly to the VP of Engineering) We Listen (Our engineers have contributed substantively to the product roadmap, to new ideas we implement, even to how we decorate the office) Great Benefits, Perks + Fun Stuff (we play Xbox Kinect on Friday afternoons, snacks in the office, 401K plans, flexible and generous vacation time, a great health/dental plan and more on the way) We hope you'll send your friends, family members and fellow Venture Brothers addicts our way :-) * NOTE: The referrer will receive this bonus only after the engineer stays employed at SEOmoz for at least 90 days after his or her start date. The referrer must also complete and return a w-9 in order to receive the bonus. The referrer is responsible for paying taxes on the referral bonus. Also, to qualify for the referral bonus, the successful candidate must have accepted our offer of employment within four months of your referral. **NOTE: The $12,000 signing bonus applies to all new engineering candidates, but must be paid back if you leave the company prior to 12 months.One more note: Candidates must be eligible to work in the US (citizenship, green card, visa, etc). While we'd love to recruit more from out of the country, it's not yet something we have the resources/connections to provide. p.s. We also want to acknowledge our friends in Cambridge and the crew at EnergySavvy, who are both offering a $10K referral bonus currently (it's a great time to be, or know, an engineer!) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "WANTED: Software Engineers REWARD: $12,000"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "WANTED: Software Engineers REWARD: $12,000"
    },
    {
      "level": "H2",
      "text": "Have Engineer Friends? Send 'Em Our Way"
    },
    {
      "level": "H2",
      "text": "Engineers: Challenging Problems, Brilliant Co-Workers & Some Cool Bonuses Await You, Too"
    },
    {
      "level": "H2",
      "text": "Why Do We Need So Much Engineering Talent?"
    },
    {
      "level": "H2",
      "text": "Top 10 Reasons Why Should You Join SEOmoz"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}