{
  "url": "https://moz.com/blog/want-better-seo-content-let-go-of-your-analytics",
  "slug": "want-better-seo-content-let-go-of-your-analytics",
  "title": "Want Better SEO Content? Let Go of Your Analytics! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Problem\nYou've hired a copywriter who has been producing some great copy for your website, however you feel that he/she is just not quite understanding what you're looking for, as the analytics show little increase over a few months. Now you could fire your copywriter, and hire a new (better?)…",
  "content": "Want Better SEO Content? Let Go of Your Analytics! Content Marketing D By: Diane Kulseth February 9, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: Diane Kulseth February 9, 2011 Want Better SEO Content? Let Go of Your Analytics! Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The Problem You've hired a copywriter who has been producing some great copy for your website, however you feel that he/she is just not quite understanding what you're looking for, as the analytics show little increase over a few months. Now you could fire your copywriter, and hire a new (better?) one. If you think it's best to stick with the copywriter that you have, there may be a solution for better copy. Let Go (of Your Analytics Control) If all your copywriter receives for their project is a list of keywords that should be included in their copy, they're not going to give you what you want. Allow them to delve into your analytics, and they'll receive a wealth of insights that can guide their copy from just plain writing to click-worthy-content. Beyond simply understanding what pages have found success on the site, a copywriter can learn (likely with your guidance) how people view your content, who these people are, and gain more ideas for enhanced web writing. How Visitors View Your Content Lead your copywriter through your analytics that pertain to your visitors. Where do these visitors come from? Are there any linguistic concerns that you may want to take into account? For example, as a proud Minnesotan, I'd expect a soda pop company to advertise their \"pop\" while a Texan may expect \"coke\". While that example is trivial, if you have a company that gets a lot of traffic from other English-speaking countries, you'll certainly want to take that into consideration with your copy. Definitely be wary of cliche's or other statements that could easily be misunderstood from region to region. Are the visitors loyal to your website? Have visits to the website been repeated, or are most of the visits singular incidents? If the latter is true, evaluate the copy with your writer. What incentives does the content provide for return? If you have a limited number of pages, can you edit your content strategy (and yes, you should have one), to increase the amount of content you publish regularly to encourage loyalty? How Visitors Come to Your Content Now look at the traffic sources of your content. Does most of your traffic come from search engines? If not, why? Do you get a lot of traffic from a social media site, such as your Facebook page? Pull up the Insights from Facebook to find out the demographics of your \"likes\". Are you writing to your targeted demographic? If you find from your demographics that you've been receiving success amongst 18-24 year old women, and you're seeking to target 25-35 year old men, your copy should undergo a refresh. Look at the keywords. Yes, as a SEO, you've already exhausted every keyword option and provided it to your copywriter. However, your copywriter may be able to glean some ideas from keywords that aren't on your comprehensive list. For example, a company I help with receives traffic from the term \"Doritos\", yet they'd never dream of optimizing for it. That doesn't mean that it couldn't somehow be incorporated into a page that discusses the company team and their favorite things. While most of these keywords should not be implemented in your content strategy, they may provide some small nuggets for additional traffic. What's Changed Long-Term? While looking over your analytics, make sure to compare to the past. How has the website performed compared to the previous years? Have their been any strategic changes in the company that may contribute to this? What content efforts have been executed, and what was their success? Helping your copywriter to see the big picture will help them fill in the finer details, and create copy that not only is optimized for your keywords, but also represents your brand. Why Not Just Tell My Copywriter This Information? Sure, you could generate a report that goes through all of this information in an Excel or PDF format to your copywriter. But, are you willing to do that for every website that you have them working on? By letting them look through the data on their own, they'll get an unbiased look, and may discover more ways that their copy can improve. It will take a few hours out of both your work schedules, but it will provide for a better relationship and give a greater understanding of why the content is truly important to your website. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Want Better SEO Content? Let Go of Your Analytics!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Want Better SEO Content? Let Go of Your Analytics!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Diane Kulseth\n          \n            Diane Kulseth\n          \n            Diane Kulseth"
}