{
  "url": "https://moz.com/blog/washington-post-on-the-seo-industry-link-buying",
  "slug": "washington-post-on-the-seo-industry-link-buying",
  "title": "Washington Post on the SEO Industry & Link Buying - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " \n\n \nLeslie Walker, who I spoke to by phone while in Toronto, has a relatively good article on the front page of the Technology section in the Washington Post - How to Juic...",
  "content": "Washington Post on the SEO Industry & Link Buying User Experience (UX) By: Rand Fishkin April 26, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 26, 2006 Washington Post on the SEO Industry & Link Buying User Experience (UX) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Leslie Walker, who I spoke to by phone while in Toronto, has a relatively good article on the front page of the Technology section in the Washington Post - How to Juice Up a Site's Rank. The story is also online, but you need to register (it's free, though). A few excerpts: If your Web site isn't getting the attention it deserves on the Internet, it may be running low on Google juice. Google juice, for the uninitiated, refers to how high a Web site ranks in Google's search results -- the higher the ranking, the more juice. Google juice is all about links. As many people know, the Internet search leader ranks Web sites based largely on the quantity and quality of other sites linking to it. I'd say that for a non-SEO, that's not a terrible description. We've certainly seen much worse in the mainstream press. Leslie's kind enough to link directly to John Scott's V7N.com, though she neglects to do so for the other folks whe talks to, including Jim Westergren (who's currently winning the contest), Bill Leake of Apogee and Jarrod Hunt of TextLinkBrokers, who probably gets the best overall business plug. I almost feel bad for him, knowing that Google will be taking a magnifying glass to their network in the next few days. Leslie also had this to say about SEOmoz: Rand Fishkin, chief executive of a Seattle-based search consultancy called SEOMoz, said he focuses on getting editorial links for his clients, partly by creating feature articles that Web publishers will link to: \"We call it link-baiting. The idea is to attract a lot of natural links.\" It sounds like the Web's version of public relations, with consultants baiting webmasters much like PR firms pitch stories to reporters. Fishkin's latest success came from creating an online awards contest he called \"Web 2.0 Awards,\" touted on Web pages that linked to his firm's Web site. No link, but she's right about those awards. It started as a pet project of Kat's and now has 50K+ links. Next time we do something like that, we need to find a way to monetize it - branding is nice, but eventually, there needs to be a monetary incentive. Overall, I'm a fan of the article - it's not overly focused on fearmongering or manipulation and deals realtively honestly with the subject of link building and link buying. Leslie's creative writing at the end was really the only \"warning\" in the piece: There are shady ways to get Google juice, too, but be careful -- it could get your site booted completely out of the Google index. If you break the search-engine rules, the juice can turn to poison and lead to the Google death penalty. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Washington Post on the SEO Industry & Link Buying"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Washington Post on the SEO Industry & Link Buying"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Unlock Your B2B SEO Content with Structured Resource Sections"
    },
    {
      "level": "H3",
      "text": "The ROI of Accessibility in SEO"
    },
    {
      "level": "H3",
      "text": "How SEOs and UX Designers Can Work Better Together — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}