{
  "url": "https://moz.com/blog/wasting-time-or-clearly-incompetent-the-seo-consulting-debate",
  "slug": "wasting-time-or-clearly-incompetent-the-seo-consulting-debate",
  "title": "Wasting Time or Clearly Incompetent - The SEO Consulting Debate - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On Monday, Brian Provost at ScoreBoard Media Group authored a post called - The First Question You Should Ask Your SEO Consultant. Brian's exceptionally good at expressing himself, so I won't paraphrase:\n\n“If you can rank a site in lucrative markets, why wou...",
  "content": "Wasting Time or Clearly Incompetent - The SEO Consulting Debate Public Relations By: Rand Fishkin March 22, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 22, 2007 Wasting Time or Clearly Incompetent - The SEO Consulting Debate Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. On Monday, Brian Provost at ScoreBoard Media Group authored a post called - The First Question You Should Ask Your SEO Consultant. Brian's exceptionally good at expressing himself, so I won't paraphrase: “If you can rank a site in lucrative markets, why would you do it for clients instead of for yourself?” That’s the first thing you, the prospective client, should ask each of the SEO consultants you are considering... Brian proceeds with what is, in essence, a direct indictment of SEOmoz's business model and the model of most of these folks as well: ...For many of us, we only consulted as long as we had to in order to build up our bankroll. I’m constantly amazed at how many of these “SEO Firms” with the big followings generate little to no income from their own projects. If there is a stronger signal of quality for a lack of confidence in their own ability, I can’t think of it. That said, I charge a lot and I have an addiction to cars, so I may divert some more energy to consulting before a car purchase. It’s really, really hard to ween yourself from the Consulting Crack Pipe, but with that said, if your consultant does nothing but consult/teach, that’d be a huge red flag to me. If anyone with more than 3 years of experience is allocating more than 50% of their time to consulting, I’m going on record as doubting their skills. The funny part is, Brian and I actually agree about this issue. Our opinions differ, however, when it comes to which skills, exactly, are being called into question. While Brian believes that SEOmoz (I know he didn't specifically mention us, but we're a perfect match for the profile) is bad at the practice of search engine marketing, I think the truth is that we're bad at starting up different business models. For me, personally, SEO is what I'm passionate about - I love teaching people about how the search engines operate, speaking at conferences, giving presentations to small and mid-size companies, answering questions over email and generally helping good companies perform better in the rankings. I'm certainly willing to accept my limitations, and I would like to broaden what SEOmoz does - we have 3 unique internal projects that have all been under way for some time (but getting the client work done and keeping the bills paid keeps getting in the way ). However, I recognize that Brian makes an excellent point - despite having a few 5-figure and several, smaller mid-3 figure contracts each month, there can be little doubt that the value of ranking well in the right industries can provide considerably greater returns. First off, before anyone replies, I think it's valuable that you read Brian's entire post - his position isn't absolute and he does allow for some \"excuses\" as to why talented folks might take on consulting or client work. What interests me most about this topic is how other talented SEOs, whether you work for a company in-house or at an SEO company or (particularly) as a private consultant would defend themselves from these charges. Are we good SEOs, but bad businesspeople? Lazy enterpreneurs? Risk-averse and lacking in confidence? BTW - I think I'm adding Scoreboard to my must-read blogs list. Thanks for the tip, Aaron! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Wasting Time or Clearly Incompetent - The SEO Consulting Debate"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Wasting Time or Clearly Incompetent - The SEO Consulting Debate"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}