{
  "url": "https://moz.com/blog/watch-out-google-will-dominate-the-web-for-decades-to-come",
  "slug": "watch-out-google-will-dominate-the-web-for-decades-to-come",
  "title": "Watch Out: Google Will Dominate the Web for Decades to Come - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Think back to the last time you were outside just before a rainstorm. Remember the feeling of the wind bustling around you, kicking up a slight dust; remember seeing the sky darken into an eerie gray. Well, the Internet marketing landscape is beginning to look nearly as ominous.",
  "content": "Watch Out: Google Will Dominate the Web for Decades to Come Marketing Industry By: Johann Beishline May 17, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Johann Beishline May 17, 2013 Watch Out: Google Will Dominate the Web for Decades to Come Marketing Industry This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Think back to the last time you were outside just before a rainstorm. Remember the feeling of the wind bustling around you, kicking up a slight dust; remember seeing the sky darken into an eerie gray. Well, the Internet marketing landscape is beginning to look nearly as ominous. If you sit back and examine the current state of the Internet, you find yourself looking at a dominant force that has hung over people for more than ten years. It’s a force so powerful that it has birthed and destroyed millions of small businesses over the years. That force is the seemingly unstoppable nature of Google. It’s really over the past five years that the Internet has begun to take shape. In this time, seven new Internet mediums have matured; seven mediums that will be worth hundreds of billions of dollars in the next decade; seven new mediums that Internet marketers will need to adapt to if they plan on being successful in the long run. Combined with search, these seven mediums will essentially form the backbone of the consumer Internet for years to come. And guess what? If you plan on being an Internet marketer for long, you had better plan on being nice to your big brother, Google. Because like a true older sibling, he’ll try to overshadow you across each and every one of these mediums. 1. Media The average American spends 34 hours a week in front of a television. It’s no wonder that the entertainment industry is able to rake in tens of billions of dollars a year when Americans are making a second career out of their viewing habits. Despite record-high profits in the industry, recent lawsuits indicate that the entertainment industry is worried though. They are worried about the long-term threats presented by sites like Hulu, Netflix, and especially YouTube. Viacom’s recent attempt to force YouTube to remove much of its content vividly demonstrates the seriousness of these fears. YouTube is massive. Like a cake rapidly expanding in an oven, YouTube has fast commanded a large presence in the average American's life - a presence that is only expected to grow year-after-year for the foreseeable future. YouTube was founded in 2005. By 2007, 134 million Americans watched a YouTube video in a given month. Five short years later, that number grew by over 37.3 percent to about 184 million Americans watching a video in any month of 2012. That’s staggering, almost incomprehensible growth. If you took the total number of views on YouTube in 2011 and divided it by the population of the entire world, you would find that the average person on the planet watched close to 140 YouTube videos that year. The average video length on YouTube has also increased over time. In 2007, the typical video was 2.7 minutes long. By 2012 videos swelled in length to an average of 6.7 minutes long. That’s a change of more than 148 percent. The increase in views and content length on YouTube presents a compelling opportunity for advertising to big brands and local companies alike. Guess what? If you can target viewers with highly-specific video ads by factors such as their location, age, income, sex, and interests, you are in a much better position to see massive returns to your budget. Unlike with traditional TV advertising, 100% of your budget will reach the exact type of person you want. And boy are companies beginning to notice. YouTube brought in more than $3.6 billion dollars last year. You may have heard that newspaper revenues are down, but do you know how quickly they’re dropping? Six panic-inducing percent a year. It’s like compound interest but in reverse. Why has demand shifted from newspaper advertising? Partly because the audience is shrinking, but mostly because of the compelling, well-targeted opportunities that digital advertising affords. Google AdWords (combined with Craigslist) broke the newspaper industry’s dam much the same way that YouTube will break the television industry’s iron curtain. Not only is YouTube making huge chunks of money but its costs are much lower than anyone else’s in the industry. Do you know how much risk YouTube had to take to produce the content for those $3.6 billion dollars in revenue? Very, very, little. Since YouTube pays its content creators based on performance, it only loses server space if things don’t work out. And storage prices cut in half every 18 months. YouTube hasn't stopped innovating either. Right now Google is exploring a subscription model for YouTube. If successful, the model will challenge distribution models like iTunes, Hulu Plus, and Netflix. Every major TV interface, such as Apple TV, Sony PlayStation, Xbox, and Google TV, also incorporate YouTube as a core function -- ensuring that no matter what happens in the television space, Google is sure to be a part of it at a fundamental level. Every person from Bill Gates, to you and I, have the same number of hours in a day. Twenty-four hours that we can distribute any way we choose. From the looks of it, that zero-sum figure is redistributing itself rapidly towards online video. Unless you have been living under a giant rock (possibly like the man in this Geico commercial), you have probably noticed that YouTube is owned by Google. If we create a list of the eight areas that will be define Internet usage in the next five years, we can begin to check off which parts Google is likely to own. So far, Google’s future is stacking up quite well. Google’s Scorecard: Search Media 2. Local People use Yelp for essentially one reason; to find the best local restaurants, places, and events by using crowd-sourced, user generated review content. Yelp has monetized people’s interest in everything local to the tune of $137 million last year. Yelp is far from being that lone tree on the prairie. HomeAdvisor, Angie’s list, and the Better Business Bureau made $205 million, $88 million, and $184 million in annual revenues last year, respectively. If you throw Groupon into the local category, you are looking at an additional $1.61 billion in market value. Smart approaches to local, such as FourSquare (also a social networking application), Ticketmaster, and Uber are creating new possibilities on the local frontier as well. The most innovative company in local recently, however, is Google. While it is true that people use apps on their smartphones more than they use search-–it could be because Google hasn’t historically done a good enough job at understanding what people are looking for at a local level. But that has changed. A lot. Google first introduced its ten pack local maps results in 2008. And here is what they looked like: Ouch. What an eyesore. Looks aside, Google was really innovative in the approach it took. It essentially looked at the success that directories were having and decided to bring their core functionality right into the search results. It makes sense if you think about it. Google has always looked to reduce complexity across its entire product line. In Google’s mind, directories not only reduced the amount of time people spent on the search engine but they also increased the amount of clicks users had to go through to find something. Integrating maps into search queries with local intent also presented Google with the opportunity to cut into the revenue and traffic directories had. Not only did Google’s ease of use eat into the profits of directories but it also reduced the need for the Yellow Pages. Obviously directories have since done okay – but I doubt they’re doing as well as they would have had Google not stomped into their territory. For a while, Google scraped reviews directly from its new competitors like Yelp and Insider Pages because it lacked user-generated content of its own. Google was later forced to quit after a government investigation into this practice several years later. In response, Google purchased Zagat in 2011 to incorporate its reviews into local search results. Google’s aggressive actions in local search indicate just how seriously it’s taking it. And their assertive tactics appear to be working. According to Google’s Ed Parson, about 1 in 3 searches now have local intent. Recently, Google came out with a large weather chart in search results for much the same reason it came out with local maps results: it wanted to remove unnecessary steps. Once again, Google is aggregating data from multiple sources, depriving each of potential ad impressions. Beyond adding weather and maps information into search results, Google began integrating advanced flight data into queries since acquiring ITA for $700 million dollars in 2010. The results are nothing short of amazing. Rather than fighting with various airline search mechanisms, Google provides users with an instantaneous source of fast changing flight information from even the most basic of keywords. But what some people may not know is that much like with Google Shopping and Google Credit Cards–flights has largely become a paid game. 100 percent of the viewable window for most searches looking to book flights are now ads. The big players in the travel game, such as Expedia, TripAdvisor, and Kayak have lost tons of money as a result. And it doesn’t look like Google plans on sharing again anytime soon. Oh, and just so you are aware–-I think Google has every right to increase the efficiency and user experience behind its search results. I just think it is important to point out that Google isn’t the innocent white angel that many people perceive it to be. Companies need to fully consider the business risks associated with traffic from Google. Today, Google might be your best friend. But tomorrow it might decide to further monetize your high-value niche under the guise of user experience--destroying your profitability in the process. I say “guise” because if Google’s goal was to purely increase the user experience of its search results, it would not charge companies to advertise in many of these widgets. They would work much like the rest of Google’s ranking algorithms. While local places, weather, and flight information may be pretty cool-– they’re not part of a cohesive, location-based experience. All of these localized search functions still rely on the user to pull information from Google. But all of that changes with Google’s latest local release, which recently won Popular Science’s Innovation of the Year award. That innovation is Google Now. Google Now will essentially be the public’s first brush with augmented reality. Combined with Google Glasses, Google Now will make sure that Google comes out on top of almost everything local. Everything. What makes it so powerful is that it automatically pushes top-notch information about your surroundings to your phone. If there is a traffic jam on your planned route to work--Google Now will tell you and offer a faster alternative. If you’re waiting for a train in a New York subway terminal, Google Now will let you know the exact time it will arrive. It leverages all of the features Google has been building over the past ten years from Google Maps to Google Plus, from Google Flights to Google Calendar, all into one synchronous end-to-end user experience. Google Now will likely secure Google the vast, vast majority of the local technology base–-on both the hardware (see Google’s acquisition of Motorola) AND software fronts. Google’s Scorecard: Search Media Local 3. Mobile Most people classify the iPhone as the world’s first smartphone. When Steve Jobs introduced it in 2007, the world hadn’t seen anything like it. Smartphones are now so commonplace that nearly 130 million Americans own one. Most people in the technology industry are familiar with Steve Jobs epic quote on going thermonuclear on Google because they were entering the smartphone marketplace and borrowing heavily from Apple’s innovations in iOS. But what few know is that Eric Schmidt had actually been on Apple’s board for several years prior to building Android. When Google sees an opportunity to develop a promising product line, it drops everything (from existing relationships, to mountains of cash) to make sure that it successfully dominates the vertical. The reason Google is the massive multi-billion dollar company it is today is precisely because of its willingness to explore indirectly-related verticals with a take-no-prisoners, aggressive approach Since Google’s entry into the smartphone market in 2008, Apple’s first-mover advantage has dropped from owning nearly 100 percent of the market in 2007 to owning just 43.5 percent of the U.S. smartphone market today. Apple’s problem is that it’s a company that has always insisted on creating a closed-software environment for users. The sole reason Microsoft became the powerhouse of 80’s and 90’s tech is because Bill Gates recognized that hardware cross-compatibility would be the most important piece of the personal computer marketplace. Google has essentially taken Microsoft’s approach with its Android platform and its open-source software environment now controls more than half of the U.S. market. Google is well poised to dominate the mobile environment much like Microsoft began dominating the operating systems market decades ago. This market alone will be worth hundreds of billions of dollars to the company. On the side Google has been clandestinely building Chrome OS. According to Eric Schmidt, the end game is for the Android to merge with Chrome OS-- which will make the company a direct competitor to Windows. Google's superior cloud-networking abilities will make it a formidable opponent in the sector. Oh, and by the way, the mobile market also includes tablets--at least with respect to operating systems. Declining PC sales in favor of tablets, and Google’s early success with its thin client-focused Chromebooks casts a promising future for the company’s mobile success. Google’s Scorecard: Search Online Video Local Mobile 4. E-commerce Google has taken a keen interest in e-commerce recently. In fact, three months ago it bought Consumer Intelligence for $125 million dollars in an effort to overhaul its efforts in the area. Online retail is a booming industry. According to Forrester Research, it will grow by 14% this year alone. Companies like Amazon and eBay survived the dot-com collapse and have grown to massive sizes -- indicating the permanence of the market. Nowadays niche sites are gaining prominence as well. Their focus on creating a social and UX based shopping experience have made them hundred million dollar companies in just two or three years. Two examples that immediately come to mind are Fab.com (the world’s fastest growing e-commerce site) and Brian Lee’s ShoeDazzle.com. Underestimating Google’s role in e-commerce is a mistake. Google’s ability to send targeted traffic for e-commerce related queries is nothing short of spectacular -- something they’re well aware of. Google has begun a massive e-commerce monetization attempt with paid Shopping results. Such monetization attempts include infesting queries for credit cards, flights, smart phones, UK insurance, and more with ads. In response to Google’s assertiveness in the area, Microsoft started a big public relations campaign: Beyond increasing the number of ads in its queries, the company has taken even bolder steps in e-commerce. In 2010 they decided to directly compete with LivingSocial and Groupon after a $6 billion dollar failed buyout attempt. In 2011 they created Google Wallet to compete with PayPal and Square -- in both online and offline purchasing (NFC technology makes it likely that Google will take this market too). In 2012 they launched the Google Trusted Store program to gain data from large web retailers. As a result of its various investments in e-commerce, the company is well positioned to become a major voice in the entire ecosystem. Google’s Scorecard: Search Online Video Local Mobile E-commerce 5. Productivity Microsoft made $21.592 billion dollars in revenue from Office last year, accounting for 65% of its operating income. Office is the company’s most profitable arm -- but one that is facing serious competition in the form of web based apps. While it’s true that Microsoft Office currently dominates word processing with 95% of the market, expect major changes to occur in the area in the next 5 to 10 years. Google has been responsible for the majority of the changes in the area so far. The success the company has seen with Google Docs has forced Microsoft to take web based office solutions seriously. Office 365, SkyDrive, Yammer, and Skype are all reactions to Google’s solutions -- which are gaining broad acceptance. While businesses have been slow to drop Microsoft entirely in favor of Google Drive, the shift is beginning to happen. The main driver right now is cost. Microsoft Office can cost up to 8x more for companies -- even though the software lacks decent collaborative features. Google already has more than 5 million companies using Google Apps for Business, bringing in more than a billion dollars of revenue a year. The company also beat Microsoft hand over fist in federal government contracts last year. Of the 42 contracts available for companies to bid on, Google won 23 of the deals to Microsoft’s 10. Microsoft is so concerned about Google Drive that they've started a large PR campaign to bash it. When it comes to office solutions, Microsoft has the most to lose. For the better part of two decades the company has been unchallenged in the area. While new competitors such as Google may not eat all that much into the company’s market share (maybe 5-10% in the next 10 years), they will still cause devastation to the company’s bottom line. Much like the existence of Pepsi causes Coke prices to remain extremely low -- the availability of Google Drive has forced Microsoft to radically reduce its prices, even as their costs (for more feature intense software) is much higher than their competitors’. About two months ago, Google announced Google Keep. The app makes Google an even larger competitor to Evernote and will help it solidify its place in the productivity arena. When it comes to productivity tools, Google has also created tools such as Google Calendar, Google Voice, Google Translate, and Google Hangout. These tools are extremely popular and give Google a significant portion of the overall productivity market. Google’s Scorecard: Search Online Video Local Mobile E-commerce Productivity 6. Gaming In 2012, U.S. gaming companies made upwards of $14.8 billion dollars -- a figure which is growing by 33% a year. Much of this revenue comes from mobile app sales. In fact, 75% of Google Play’s revenue in the United States comes from games. In South Korea, the figure is closer to 95%. While gaming is one of Google’s weakest areas, it has taken a YouTube style approach of simply distributing other people’s creations across its network. But gaming is increasingly developing core online features. Perhaps the earliest browser based game with mainstream success was RuneScape, which came out in 2001. It amassed more than 200 million users in a short time -- and demonstrated the possibilities that server side games had. Following RuneScape came World of Warcraft, which peaked at 10 million paying subscribers and several billion dollars of revenue overall. Most recently, SimCity 5 came out, which had more than 1.1 million sales in the first two weeks. Google is responding to the increasing online nature of games in two ways. Firstly, It is working on an Android game center (much like Apple’s) for leaderboards, multiplayer functionality, and more. Secondly, it launched the Chrome Web Store to distribute HTML5 games to its users. Currently the Chrome Web Store is just an assortment of links and bookmarks to games -- but if Google puts more energy into developing gaming -- it could become a larger player in the space. Google’s Scorecard: Search Online Video Local Mobile E-commerce Productivity Gaming 7. Social Everything thus far brings us to Google’s latest and greatest battle. This is the battle that no one is quite sure Google can win. But Google sure will give it every last damn drop of sacrificial blood it's got. Facebook has fast developed a user base of more than 1.2 billion people. Humans are inherently social creatures. Massive parts of our brain developed for speech, facial recognition, and body language, which in turn allowed for the creation of sophisticated cultures worldwide. It’s natural for us to want to stay connected with those around us… too natural for Google’s liking. In 2011, Facebook already had more than twice as many page views as Google. Google is tackling social heavily for three primary reasons: Reason #1: Facebook is a non-public database of some of the largest pools of semantic information in the world. It has information that people connect with on a deep emotionally driven level. If Google does not incorporate social into search, its algorithms will lack personalization--a feature the future of search is bound to have. Reason #2: Ranking websites based on the number of links they have is outdated. Doing so only provides an exclusive group of webmasters--“the linkerati”--the ability to decide where websites rank. Social media has the potential to democratize search engine rankings, as anyone with a quality social media page could vote. Social data also plays a big role in Google’s plan to incorporate AuthorRank into its algorithms. Reason #3: Facebook could potentially be used to serve crazy well-targeted ads across the Internet. Banner ads are one of Google’s top income generators. But Google AdSense has a huge weakness. It relies on generic interest categories and website visit history to target ads to people. Imagine a world, however, where Las Vegas casinos could target advertising to males in the United States who have visited Las Vegas at least once in the last year, and are between the ages of 45-67 years old. Or imagine a local plastic surgeon advertising his services across the web to women between the ages of 34-56 living in Seattle, Washington who like fitness and health. Such highly targeted advertising has the potential to wipe out Google’s monopoly on banner ads. Will Google win at social? It is unlikely that Google will gain a majority of the market share any time soon. Facebook has done too good a job of making people aggregate their life stories on the site. Facebook is like a living, flexible, step-by-step scrapbook of a person’s life. Imagine reflecting on the adventures you had in life twenty years from now. If Facebook is successful you will have your whole life documented on the site--from that college trip to Mexico City to the loss of your best friend, Facebook will likely have it all in one, easy place. Google Plus faces an uphill battle in trying to convince people to switch social networks. Possibly the only way users would make such a drastic switch is if people are able to import an exact copy of their Facebook data into the social network. New laws on Internet data ownership could actually make this a reality. Truth be told Google has already met many of its goals with Google Plus. It has a vibrant community producing active social signals across the web. It has the bare bones it needs to incorporate social into its algorithm. Google Plus actually has more than 500 million members of which 235 million are active. Google has a good shot of maintaining its position as second behind Facebook for years to come, which just might be all that the company truly needs for continued success. Google’s Scorecard: Search Media Local Mobile E-commerce Productivity Gaming Social World Domination Looks Inevitable. PANIC! In the eight areas that Internet technology is likely to develop in the next decade, Google appears well-positioned to play a permanent and dominant role. Google’s revenues have been growing by an average of 28% a year over the past three years. Last year they made $50 billion dollars. For comparisons sake, the whole newspaper industry combined made $38.6 billion dollars of revenue in that same time. So what does all of this mean for you? It means that it’s pretty much impossible to be a digital marketer without working with Google for the foreseeable future. If you don’t like Google’s policies in search, video, applications, and pay-per-click advertising you are going to hear one message consistently: ‘It sucks to be you. Go work somewhere else.’ And to be honest-- what online marketing options exist beyond Google? Search is the most powerful marketing medium ever developed. It has opened up a world of analytics oriented business; business where you can trace your ROI with exact precision; business where you can optimize your marketing message to its most optimal form with conversion rate optimization. The words we use to describe search engine marketing alone are indicative of its tantalizing power. What about Yahoo and Bing? They’ll remain small players unless they can come up with a compelling enough reason for people to switch. No matter what Microsoft might think-- adding photos to random queries (as their ridiculous ads show) hardly creates a better user experience. Microsoft’s algorithms are at least three years behind Google. Their social media integration is at the wild mercy of third parties like Quora, Twitter, and Facebook. Their results for local queries are abominable-- a mix of irrelevant social sidebars, news updates, alternative search suggestions, and cluttered maps results. Finally, they lack video content, authorship data, and haven’t even begun touching augmented reality. Instead of focusing on value adding innovation, the company has largely turned to creating imperfect replicas of Google’s core search features. What Steve Jobs said about Microsoft almost twenty years ago may still hold true: Bing’s growth over the years has largely come at the expense of its partner, Yahoo. Google is still growing despite Bing’s best efforts. And it will likely stay that way because Google offers so much value through its cross-channel of products like Chrome, Android, Gmail, and YouTube. So where else can businesses be marketed online? Some might be argue that social is a viable option. There’s a fundamental deficiency with social media though. Social media is essentially a branding platform for the individuals and companies that use it. So while it’s great for crafting an image for people who already know, like, and trust you-- it’s hard to reach well-defined groups of people as they move through different parts of the buying cycle. So what does the future with Google look like? As lawsuit after lawsuit has already shown--you as an individual are powerless against an overly aggressive Google. The company has always been able to argue that their algorithms provide the public with mere opinions on which products, services, and websites to use. Pretty much the only thing that has been able to exert some degree of influence over the company’s policies is the possibility of antitrust litigation. And if Google truly begins dominating the Internet--antitrust cases will resurface much like those against Microsoft in the 1990’s. The irony is that Microsoft will likely be the one pushing for it. But until then, Google will do whatever it can to deflect such action. When the Panda update hit in 2011, the Online Publishing Association (consisting of top online publications such as the New York Times) stood to lose $1 billion in potential earnings. According to Aaron Wall’s research, Google re-ranked OPA websites in a backroom deal likely because the organization was big enough to pose a genuine litigation threat to the company. So what can you do with this information? There are three primary things you can do with the information above: You can analyze the areas that Google is going into and consider creating B2C startups in them. The more categories you intersect, the better off your idea might be. For instance, FourSquare is a combination of the Local, Social, and Mobile categories. You can be more aware of the potential for Google to compete with you or your clients in various verticals. Google has shown an uncanny desire to enter large, profitable industries. You can sign up for a monthly newsletter mapping Google's next moves at TrackGoogle.com. The newsletter will document Google's latest acquisitions and how it's developing various product lines in the categories mentioned. Conclusion I guess the main point I am trying to make here is that Google is not your friend. The company doesn’t give two-hoots about anyone’s business except its own. If your business gets in the way of its two goals, increasing user experience and making more money, then trouble is coming your way. That leaves people working in the industry in a tough spot. The best we can do is work together as an open, information sharing community. No one benefits from the infighting between white hats and black hats. We’re all in this together. It's going to become our responsibility over the coming years to not let Google push us around. It's going to be our job to work together to understand Google's ever smarter algorithms. The days of the lone-wolf SEO are over. The truth is that even if Google controls a large part of the Internet in the next few decades, it will still remain the vibrant and creative community that it is today. In fact, in the next seven years, 2.6 billion people who have never been heard from before will join us online-- bringing new stories, perspectives, and opportunities with them. Although Google has swayed from its idealistic motto of \"Don't be evil\" hundreds of times, they are still an organization guided by their view of a better world. I am optimistic that a bright future still lays ahead for online marketers worldwide-- but it's one we might have to fight for to keep. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Watch Out: Google Will Dominate the Web for Decades to Come"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Watch Out: Google Will Dominate the Web for Decades to Come"
    },
    {
      "level": "H2",
      "text": "1. Media"
    },
    {
      "level": "H2",
      "text": "Google’s Scorecard:"
    },
    {
      "level": "H2",
      "text": "2. Local"
    },
    {
      "level": "H2",
      "text": "Google’s Scorecard:"
    },
    {
      "level": "H2",
      "text": "3. Mobile"
    },
    {
      "level": "H2",
      "text": "Google’s Scorecard:"
    },
    {
      "level": "H2",
      "text": "4. E-commerce"
    },
    {
      "level": "H2",
      "text": "Google’s Scorecard:"
    },
    {
      "level": "H2",
      "text": "5. Productivity"
    },
    {
      "level": "H2",
      "text": "Google’s Scorecard:"
    },
    {
      "level": "H2",
      "text": "6. Gaming"
    },
    {
      "level": "H2",
      "text": "Google’s Scorecard:"
    },
    {
      "level": "H2",
      "text": "7. Social"
    },
    {
      "level": "H2",
      "text": "Google’s Scorecard:"
    },
    {
      "level": "H2",
      "text": "World Domination Looks Inevitable. PANIC!"
    },
    {
      "level": "H3",
      "text": "So where else can businesses be marketed online?"
    },
    {
      "level": "H3",
      "text": "So what does the future with Google look like?"
    },
    {
      "level": "H3",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Johann Beishline\n          \n            Johann Beishline"
}