{
  "url": "https://moz.com/blog/ways-to-proactively-welcome-women-into-online-marketing",
  "slug": "ways-to-proactively-welcome-women-into-online-marketing",
  "title": "Ways to Proactively Welcome Women Into Online Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEO may be a male-dominated industry, but let's step out of our biases and work hard to welcome women, and marketers of all stripes, into our community.",
  "content": "Ways to Proactively Welcome Women Into Online Marketing Social Media By: Erica McGillivray September 17, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray September 17, 2014 Ways to Proactively Welcome Women Into Online Marketing Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A lot of my life's work has been focused on increasing the visibility of women and other minorities in male-dominated professional fields. I'm not here to give you an intersectional Feminism 101 lesson or explain to you that institutional sexism is indeed alive and systemically present in online marketing. Instead, in the spirit of the Moz blog, I want to give you tips and tricks to make our corner of the world more welcoming to women. Several of these tips can also easily be adjusted and applied to other groups of marginalized people. Some can really just be applied broadly to life. According to our 2013 industry survey, 28.3% of online marketers are women, and at MozCon 2014, 31% of the audience self-identified as female (up 11% from 2013). We've been here for a while. If this post gets your bristles up and you're ready to yell at me in the comments, I ask you to check out the many resources at the bottom to help build the basics to better understanding the \"whys\" and realizing \"yes, this is a thing.\" In order to be better marketers and better people, we need to open ourselves up to the experiences of others, particularly to the voices of people whose backgrounds are different than ours. But because of how our cultural biases work, we often must actively and consciously work at creating more welcoming environments. It sucks to think we're any less than awesome, and even when we consider ourselves non-prejudiced, our behavior can still support systems of sexism, racism, ableism, homophobia, transphobia, and more. Let's dive in and shake up the industry! Never assume someone's gender, especially in online communications. If you're in doubt, either ask or use a gender-neutral pronoun. If we had a nickel for every time the all-female-identified community team was emailed or Facebook messaged as \"Dear Sirs\" because we work for a SaaS technology company, we'd be rolling in nickels Scrooge McDuck-style. Nothing can instill imposter syndrome or make someone personally upset like being misgendered. Human culture is so sensitive to displays of gender and identification of gender that a misplaced \"sir\" or \"ma'am\" can be incredibly insulting. If the person being misgendered is genderqueer or transgendered, they may be even more sensitive due to the vulnerability of displaying to the world who they are as opposed to who society thinks they should be. If you're ever communicating with someone whose gender you're unsure of, it's better to ask than to use an errant pronoun. So rip out that \"Dear Sir\" and replace it instead with \"To Whom It May Concern,\" or better yet, something more specifically personal. Dump the he, she, or s/he and just use an epicene \"they.\" If emailing my team, try \"Hi, awesome community team...\" You'll probably see better success with your request by not starting out on the wrong foot. Girls vs. women: Refer to groups of adults with words that imply adulthood, especially in professional settings. Perhaps one of my top offenses as a professional woman: being labeled as a girl or seeing another woman or group of women labeled as such. The worst is when it's the \"men and the girls\" or \"the guys and the girls.\" Stop infantilizing women! Again, this elicits imposter syndrome and also makes women appear inferior, as children have more to learn than adults. So please stop referring to us as girls and conjuring up images of pink, pigtails, and Barbie dolls. We're professionals and grown-ups. The tweet above was sent out by a company I've worked with and expected more from. The webinar was with two women I've also worked with and are some of the sharpest, smartest minds out there in our industry. They were talking about online marketing, and it was completely inappropriate for the company hosting the webinar to refer to them as \"girls.\" (Neither of these women worked or have worked for said company in the past.) And before anyone mentions the phenomena of the term \"geek girls,\" let me take a moment to address it. I know there are many organizations that are working hard to bring the achievements of women in all forms of geekdom, including tech, and inviting more women to join that call themselves \"geek girls\" or have some variation in their name. This is fine. This is their group's choice for self-identification, branding, and rolls-off-the-tongue alliteration. However, you would never say \"All the girls going to Geek Girl dinners...\" They're adult women. It's not appropriate to have value judgments about the way a person looks in a professional setting. Unfortunately, because women are too often seen as objects instead of people, those objects are given value judgements on their appearances. Women shouldn't be treated like you're picking out the best sofa for your living room. It doesn't matter how cute you may think a woman in the industry is, she likely doesn't want to hear it or doesn't care. Constantly judging women based on our appearances damages self-esteem. It entrenches stereotypes about beauty having been a woman's most important asset since she was a little girl. It also puts women who don't fit up to traditional Western beauty standards—maybe they're plus-sized, women of color, genderqueer, etc.—at a disadvantage to gaining the professional attention of anyone. Think twice before commenting to a woman how beautiful she is. Or, conversely, how unattractive. (Same goes for men, by the way.) At the end of the day, what matters most is brainpower, so let's actually act like it. When I think of highly successful women, who are constantly judged on their attractiveness, Hillary Clinton's a powerful example. Do we pay the same attention to current US Secretary of State John Kerry's pantsuits? For more things not to say to women in a professional setting, I highly suggest reading Ruth Burr's Things You Think Aren’t Sexist, But Really Are. Follow more women on social media. Particularly on social media that's public and open like Twitter. With networks like Facebook, many women I know actually don't \"friend\" people they have met face-to-face or actually consider friends for safety reasons. Sadly, on networks such as Twitter and even the female-dominated Pinterest, men are followed at higher rates than women. In a perfect world, content on social networks would be shared based entirely on merit. We'd only share the funniest tweet, the cutest cat photo, the most insightful post on Google Analytics, or the best hack we learned today. The best people and brands would have millions of followers. We'd have no internal biases. But the truth is that as the world gets smaller, in that we're more connected, and as technology serves \"smarter\" content, we're only going to see people more like ourselves. Eli Pariser called this the \"filter bubble.\" And while he particularly noted the consequences of this in politics and being attuned to world events, this also applies to the experiences of people who are not like you demographically. For example, over the Memorial Day weekend this past May, Google released a Penguin update. My Twitter stream was full of Penguin talk by male-identified SEOs. What were the women talking about that weekend? #yesallwomen. I couldn't help but wonder if male SEOs, who followed other SEOs primarily, which is a male-dominated industry, even saw the hashtag actively in their streams? Did they know how big the #yesallwomen hashtag was until they saw news stories? I hope for the best, but realistically think about the bubble. \"The internet is showing us what it thinks we want to see, but not necessarily what we need to see.\" — Eli Pariser So how do we see the world we need to see? How do we work to essentially outsmart these built-in features? On Twitter, it's actually pretty easy to find and follow people who aren't like you. Twitter's own analytics and our own Followerwonk will break down the gender of who follows you and whom you follow. Here are some breakdowns of my own Twitter account and those of my fellow Twitter-loving Mozzers, including the genders of the people we follow: Here's Twitter's own analytics on the gender breakdown of who follows me (which I think speaks volumes about our industry as \"SEO\" is the top interest of people following me): It's worth noting that Twitter has categorized every account as either male or female. This is problematic because some accounts are companies, not people, and it discounts people who do not identify with either gender or are somewhere in the middle. Twitter's using a mix of self-reported demographics (what Followerwonk picked up), name categorization of gender, and natural language processing to look for gender signifiers. My recommendation for Twitter: join Facebook in giving people more gender options and toss those companies out. Recently, our own Rand Fishkin took a close examination of his followers and those he followed back, in a concerted effort to follow more women on Twitter. Rand was pretty shocked to learn how many more male followers he had than female, and he was perhaps more shocked about my followers, given that my Twitter bio identifies me as a feminist and I tweet more about social justice than online marketing. In addition to following more women, look at the gender balance of people you retweet and whose voices you're helping amplify. Twee-Q analyzes your last 100 tweets and shows the gender balance who you've been retweeting. Entrepreneur Anil Dash talked about how he spent a year only retweeting women. Even if you don't follow Dash's footsteps, it's pretty eye opening to see just who you're retweeting. I swear I did not stage this equal RTing result. Usually, I skew toward more women than men. Create inclusive community guidelines or a code of conduct for your site, blog, forums, reviews, social media, events, etc. As a community manager, I'm a little obsessed with keeping the virtual living room free of hatred, especially on sites directly owned by a brand. I love, for example, that the comments on the Moz Blog are actually valuable to read, unlike almost every other site out there. It's hard to backpedal and bring order to your community; we all watched YouTube integrate G+ and Huffington Post hire an army of comment moderators. But most of us aren't managing a community with millions of incoming comments and forum posts. Community guidelines or a code of conduct give you more room to be explicit about expectations for behavior on your properties. For example, Moz works in the SEO space. So while it's not very TAGFEE to put a spammy link in a comment, it saves argument time that it's actually outlined in our community etiquette. While not directly tied to stopping discrimination, you can easily see how parallels in explicitly outlining what kinds of speech your brand won't tolerate. \"Be excellent to each other\" can just bring on too many arguments from the person you're moderating. The allowance of hate-fueled user-generated content sends a signal loud and clear to women, minorities, and allies just what your brand is about, and this feeling is only amplified when we all meet face-to-face. This year at MozCon, we implemented a Code of Conduct. For those that don't know, in the events space, there's been an increasing awareness of harassment at conferences. One way organizers are combating it and making attendees safer is by explicitly laying out a policy against this behavior and how event organizers will respond to said bad behavior. Again, this should be solvable simply by saying \"be TAGFEE\"—or whatever other motto your brand chooses—but unfortunately, this is not the case. Some of you have speculated about what happened to make the MozCon committee decide we needed a code of conduct. We created the code to be proactive. This is just one more way to improve our conference and be welcoming to marketers of all stripes. MozCon 2014 attendees having breakfast before the show. Make your brand voice and design guides inclusive instead of exclusive. Many people make employment choices, not to mention purchase decisions, based on \"culture.\" Culture is a nebulous idea, and while it's formed by the combination of how people in your company act and brand perception, you can start out on the right foot. Culture's not a top-down dictate, but the signals come from both directions, and a strong brand voice and design guide can help company communication on what's implicitly acceptable and what's not. Most of us work for brands that are gender-neutral. We don't cater to an exclusively female-identified or male-identified audience. However, we tend to adopt cultural tones that identify our band as a specific gender, and furthermore our industry as exclusive, instead of inclusive. You're probably thinking about how Moz's own Roger Mozbot uses the male pronoun. While Roger's name and his use of the male pronoun will likely never change, those of us who work on Roger as a mascot strive to make him as gender neutral as possible. He doesn't use specific masculine language, and despite many requests from our community, he doesn't have a love interest. Roger's first love is SEO, after all. He's beloved by all our community members, not just the male-identified ones. Not all companies think about these nuances. For example, why is banking portrayed as a masculine industry? Why does it need to support stereotypes that women are bad with money, math, and the financial market? Doesn't every adult need a bank account, retirement savings, and access to their money? Does the marketing-bias only reflect the hiring bias? Who's getting interviewed here? Who looks most like a banker? Who should apply here? Brands who do live in a sphere where they can say 80%+ of their audience comes from a particular gender should also pay attention. If none of your competitors are going after that other ~20% of audience share, you have a market opportunity. At the very least, small tweaks to your voice—like using that epicene \"they\"—or adding a pop color not commonly associated with your industry's dominant gender can make you the friendly, go-to brand for those who feel like outsiders in your niche. ExOfficio shows actual customers fishing, not just models in the clothing. Outdoor and travel clothing brand ExOfficio is known for their fishing clothing. Fishing is considered a male market, but they do a great job making the same fishing clothing for women too. Sure, they might add in different styling and colors and offer some variations geared toward women's fashion, but their imagery and their core offering of fishing clothing doesn't shout out that these are women fishing. Let's also look at a cautionary tale of what can happen when brands try to be more inclusive toward women: the pinkification of the market. While yes, this is marketed toward girls, not women, this fishing set nicely illustrates pinkification. Turning it pink and labeling it with Barbie somehow makes it \"for girls.\" But what really makes me upset is the language. Behold the \"Purse\" of fishing, which contains the exact same actual equipment as the Spider-Man one marketed toward boys. While this may seem a bit consumer-focused, the products you put out the world and the marketing behind them reflect directly if someone can see themselves working at your brand. When I first heard Apple announce the iPad, my gut reaction was to ask if there was a single woman working on the Apple marketing/product team. Because to me, this MAD TV sketch about the then-newly released iPad (possibly NSFW) said all the things I was thinking. Conversely, if your employees know this matters, when something bothers them, they'll likely bring it up. Recently at Moz, our team worked hard on new customer personas. At the end of the day, four were chosen as Moz's current target market and the rest put on hold as future markets. While the personas were gender-balanced overall, it so happened that three of the four current customer personas were male. Because of Moz's culture, multiple people approached the persona team questioning this. The team then pivoted to change the names to be gender neutral selections and edit the accompanying art and descriptive text to reflect this. Publishing an image of your company, what's the gender balance? While we're thinking about how your brand looks to potential employees, what images are out there of your company? Are they only men? Is there only one type of woman? Unfortunately, this main image on our recruiting page presents Moz as looking for a certain type of employee: a young, fit, white professional, preferably with light-colored hair. This doesn't reflect the actual makeup of Moz, especially at 140+ people. But what if this was the only image? What would a potential employee or recruit who didn't fit that image think? This can be particularly challenging for small businesses. You also don't want your employees to feel tokenized for their gender identity or minority status. Perhaps it's time to think more about what a photo means to applicants. BarkBox had 30 employees in early 2014, and here's their simple, yet more welcoming recruiting image: It only takes a little extra effort to go a long way. Include women in interviews, quotes, and other articles and events touting industry experts. There's simply no excuse for an article or an event full of industry experts and to not have the final lineup include a single woman. While there's no \"magical number\" to achieve diversity, it's simply bad practice when a lineup features only men. If you seriously can't think of a single woman expert in your field, you're doing something wrong. There's a strong correlation between seeing yourself demographically and dreaming that you could do that job too. We all need inspiration and heroes to look up to and aspire to be like. And great marketers, we come from all kinds of backgrounds and make this industry a better place because of that. If you're a white man asked to speak as an industry expert, it's time to ask who else is being featured or speaking. Turn down engagements that only have male voices. Ask more of authors and conference runners. If you're the author or event curator, reach out to someone in the industry who's opinion you respect for ideas of experts you're not thinking of. I'll gladly send you my binders full of women marketing experts. A sample of the speakers at SMX East 2014 When you witness sexist behavior, say something. I saved this tip for last because it is one of the most powerful. Simply not keeping quiet and speaking up can change the world. We all have to work together. “People will not listen unless you are an old, white man, so I’m an old white man, and I will use that to help people who need it.” — Sir Patrick Stewart Unfortunately when women call people out on sexist behavior, it's not as powerful as men saying the same thing. Same goes for a black person calling a white person out on racist behavior, etc. And when a woman calls a man out, she's making a \"political\" statement and suffers real consequences in her life. Despite laws in many countries against these things, complaints of any kind can lead to economic consequences of losing jobs or clients and to safety concerns about harassment both online and offline. A recent study actually showed that whistle-blowing or any kind of confrontation wasn't even necessary for economic consequences. Women and people of color who promoted other women and people of color and/or valued diversity in the workplace received lower performance reviews than white men who did the same. Male-identified friends, if you see someone or a company doing these things, please help and speak up. Please stand up for those who are doing this hard work and please be aware of your own biases. More resources... Basic resources: White Privilege: Unpacking the Invisible Knapsack by Peggy McIntosh The Male Privilege Checklist by Barry Deutsch 30+ Examples of Heterosexual Privilege in the US by Sam Killermann Straight White Male: The Lowest Difficulty Setting There Is by John Scalzi The Problem When Sexism Just Sounds So Darn Friendly… by Melanie Tannenbaum Derailing For Dummies Aamer Rahman from Fear of a Brown Planet on \"Reverse Racism\" 8 Things White People Really Need to Understand About Race by James Utt An open letter to privileged people who play devil’s advocate by Juliana Britto Yes, All Men: Every Man Needs to Understand Internalized Misogyny and Male Violence by Tom Hawking Roll up, roll up, to see a man talking about feminism. What could possibly go wrong? by Robert Webb SEO, tech, and startup specific resources: Not all men. Not all industries. But nearly always men in my industry by Martin Belam Why Women Aren’t Welcome on the Internet by Amanda Hess Women as Entertainment in the SEO Industry by Jane Copland The Problem with ‘Brogrammers’: Why is Silicon Valley so stubbornly white and male? by Rebecca Burns Meritocracy [in Tech] is Almost as Real as this Unicorn by Tara Hunt Death by a thousand cuts: the reality of being a woman in tech by Meg Kierstead In Tech Marketing Jobs, Women's Successes Are Rarely Recognized by Laura Sydell Eve wasn't invited: Integrating women into the Apple community by Brianna WuGender Bias in Online Marketing: Data Shows Women Are Undervalued by 21% by Larry Kim Further resources: On being an ally and being called out on your privilege by Andrew David Thaler TEDxWomen Talk from Anita Sarkeesian about Online Harassment & Cyber Mobs Dissent Unheard Of, real and economic impact of speaking out by Ashe Dryden Dos and Don’ts To Combat Online Sexism by Leigh Alexander In Which We Teach You How To Be A Woman In Any Boys' Club by Molly Lambert The Confidence Gap by Katty Kay and Claire Shipman \"Raving Amazons\": Antiblackness and Misogynoir in Social Media by I'Nasah Crockett Visibility Conundrums of Being Queer by Erica McGillivray Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Ways to Proactively Welcome Women Into Online Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Ways to Proactively Welcome Women Into Online Marketing"
    },
    {
      "level": "H2",
      "text": "Never assume someone's gender, especially in online communications. If you're in doubt, either ask or use a gender-neutral pronoun."
    },
    {
      "level": "H2",
      "text": "Girls vs. women: Refer to groups of adults with words that imply adulthood, especially in professional settings."
    },
    {
      "level": "H2",
      "text": "It's not appropriate to have value judgments about the way a person looks in a professional setting."
    },
    {
      "level": "H2",
      "text": "Follow more women on social media."
    },
    {
      "level": "H2",
      "text": "Create inclusive community guidelines or a code of conduct for your site, blog, forums, reviews, social media, events, etc."
    },
    {
      "level": "H2",
      "text": "Make your brand voice and design guides inclusive instead of exclusive."
    },
    {
      "level": "H2",
      "text": "Publishing an image of your company, what's the gender balance?"
    },
    {
      "level": "H2",
      "text": "Include women in interviews, quotes, and other articles and events touting industry experts."
    },
    {
      "level": "H2",
      "text": "When you witness sexist behavior, say something."
    },
    {
      "level": "H2",
      "text": "More resources..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}