{
  "url": "https://moz.com/blog/we-want-you-to-speak-at-mozcon-2013",
  "slug": "we-want-you-to-speak-at-mozcon-2013",
  "title": "We Want You to Speak at #MozCon 2013 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last year's MozCon Community Speakers were a hit, and we're doing it again. Now's the time to toss your hat in the ring!",
  "content": "We Want You to Speak at #MozCon 2013 Moz News By: Erica McGillivray May 6, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray May 6, 2013 We Want You to Speak at #MozCon 2013 Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last year at MozCon, we tried something new: community speakers. The feedback we receieved from those of you who attended was phenomal, and our four speakers were spectacular. So this year, we're opening up four community speaking slots again, and we can't wait to hear from you. I know some of you have been preparing your ideas since last MozCon. Which means this year, I expect even more amazing submissions, harder choices, and to get over 150 submissions (which is what we got in 2012). We're looking for four people to deliver incredibly actionable tips in SEO, social media, content, marketing analytics, conversion rate optimization, and any other great inbound subject. You'll join an already killer line-up of speakers and lots of fun. Fabio was one of our amazing community speakers last year. MozCon 2013 takes place July 8th-10th at the Washington State Convention Center in Seattle. If this past weekend was any indication of how our summer's going to be, bring your sunglasses and flip-flops for the sunshine. We're expecting around ~1200 people, and tickets are already 50% sold out. We'll have all the usual goodies like Roger photos and incredible speakers and a few surprises up our sleeves. The details about the community speaker submission process: Your pitch must be submitted by Tuesday, May 14th at 5pm PDT. Please submit only one pitch. We're looking for the best of the best. Topics can range the inbound marketing spectrum, so submit something you're passionate about. If you've never spoke before or have spoken hundreds of times, we want to hear from you. Presentations will be 15 minutes long with an added ~5 minutes for questions. These sessions will be from 2:00-3:20pm on Wednesday, July 10th. Widescreen-format slide decks will be due one week before MozCon. If you already have a MozCon ticket, we will refund your ticket; and if you don't have one, we'll comp you one! Unfortunately, you will have to book your own hotel, flight, and transportation. You will be invited to attend our speakers' dinner on Sunday, July 7th. And pre-dinner, there will be time to walk on our stage. You must be at MozCon in person. Sorry, no Skype, Google Hangout, or other video conferencing. Our community speaker selections are final. Everyone who tossed their hat in the ring will be notified via email if they were selected or not. Thank you to everyone who submitted their community speaker ideas for MozCon 2013. We'll be in touch very soon! I can't wait to see all the awesome submissions for all potential community speakers. If you haven't snagged your MozCon ticket yet, do it! Also check out the full line-up, minus community speakers, of MozCon speakers. It's going to be out-of-this-world. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "We Want You to Speak at #MozCon 2013"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "We Want You to Speak at #MozCon 2013"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}