{
  "url": "https://moz.com/blog/web-analytics-and-segmentation-for-better-conversion-optimization",
  "slug": "web-analytics-and-segmentation-for-better-conversion-optimization",
  "title": "Web Analytics and Segmentation for Better Conversion Optimization - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I noticed some months ago that SEOMOZ was having more and more web analytics/conversion rate related post, so I decided to give it a shot and talk about segmenting your traffic data in order to have a better understanding of your traffic. For this post I only use the Advanced Segments Tool from…",
  "content": "Web Analytics and Segmentation for Better Conversion Optimization SEO Analytics P By: Philippe Oger November 2, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! P By: Philippe Oger November 2, 2009 Web Analytics and Segmentation for Better Conversion Optimization SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I noticed some months ago that SEOmoz was having more and more web analytics/conversion rate related post, so I decided to give it a shot and talk about segmenting your traffic data in order to have a better understanding of your traffic. For this post I only use the Advanced Segments Tool from Google Analytics. Segmenting by location: I used to work for a website who was selling services to UK people exclusively. When I started there they were driving exclusively organic traffic, and the overall landing page conversion rate was as good as expected. So I started to segment the data by location and checked UK conversion rate against overall conversion rate. In fact the conversion rate of our target country was more than decent, and the reason our overall conversion rate seemed low was due to the mass traffic coming from other location (in this case coming from US). Unfortunately, we had nothing to offer them L. The solution was to drive more UK traffic and sort some SEO problem in fact. (For the story, Google did not understand we were a UK site: .com TLD, server in California, and Google Webmaster tools not yet implemented). Without looking at the UK segment exclusively, we would have taken the wrong business decision. Segmenting by keywords: This one is quite obvious for most of the SEOmoz community I guess. Adwords is probably the most transparent ad network, and you can easily see which keyword converts, which one does not. The ROI is quite straight forward to measure. Internal Search is quite interesting to segment as well: It is very important to understand which visitors use internal Search, and if those people convert more than average! Very easy to set up on Google Analytics. Quite insightful, isn’t it? The conversion rate is 5-6 times higher for visits with Site Search than visits without Site Search! Content Segmentation (very useful for Linbait analysis) Let’s say you made very good linkbait content which went viral and gave you a lot of inbound links. As everyone knows, the SEO benefit is amazing, but did the post on its own lead to conversions? Did visitors signed up to your blog or Newsletter after finding out about your site? How could we measure this! Well, nothing easier. You can easily segment your data to show only visits and visitors which had your linkbait page as an entry page. That way you can quickly appreciate the value of your linkbait (excluding the SEO benefit). I have a small online marketing blog where I wrote a post on how to track spiders with Google Analytics some times ago, and I can see very easily with that kind of segment what the visitors did after reading that, and where they were coming from. Segmenting by Visitor behaviour: I love this one as it gives you very good insights and reveal a lot on how your site perform. For example I have an e-commerce website which has a conversion funnel of 5 pages. In that case, we can consider that a visit with 5 page views is an “engaged visit”. It is very important to see how those visits behave on your site, against the overall traffic. The number of Page Views depends on what you want to measure, and which industry you’re on.That sort of segments are very good indicators to measure the engagement of your site. In the example above, we can clearly see that there is a lot of room for improvement. I only described 4 ways here to segment your data (which I hope you enjoyed). There are so many other ways to get insights with segmentation. You can for example have more than 1 dimension in your segment: Example: I want to see only visits coming from UK, with more than 15 pages views, which stayed on site less than 6 minutes (tricky isn't it?) Segmentation is a wonderful topic which leads to another huge subject in web analytics: Key Performance Indicators. That will be my next post if that one is published (I’m thinking of a KPI Cheat Sheet). In the mean time, I would love to have your feedback and here about your experiences with segmentation. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Web Analytics and Segmentation for Better Conversion Optimization"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Web Analytics and Segmentation for Better Conversion Optimization"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Philippe Oger\n          \n            Philippe Oger"
}