{
  "url": "https://moz.com/blog/web-20-marketing-analytics-and-getting-psyched-for-ses-ny",
  "slug": "web-20-marketing-analytics-and-getting-psyched-for-ses-ny",
  "title": "Web 2.0 Marketing, Analytics, and Getting Psyched for SES NY! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With the wind chill factor at –2 degrees in New York on Tuesday, 3/6/07, I attended an awesome seminar at the New York Hilton, “The New Age of Web 2.0 Marketing,” presented by ClickZ and sponsored by Unica.  It was free, and it was great!    I used to think that there were two main parts to a…",
  "content": "Web 2.0 Marketing, Analytics, and Getting Psyched for SES NY! SEO Analytics R By: risabb March 10, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! R By: risabb March 10, 2007 Web 2.0 Marketing, Analytics, and Getting Psyched for SES NY! SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With the wind chill factor at –2 degrees in New York on Tuesday, 3/6/07, I attended an awesome seminar at the New York Hilton, “The New Age of Web 2.0 Marketing,” presented by ClickZ and sponsored by Unica. It was free, and it was great! I used to think that there were two main parts to a successful website: web design/development/usability and SEO/M. Now I know that there is a third part: analytics. Unlike web design and SEO/M, which are creative and multi-faceted, analytics is about trends and numbers. Analytics is a dedicated function. Successful websites use analytics to drive their web design and SEO/M tactics. Rebecca Lieb was the moderator and the speakers were David Schatsky, President of JupiterKagan, Steven O’Brien, Vice President of Unica Corporation, and Judah Phillips, Director of Web Analytics for Reed Business. What is Web 2.0? Judah Phillips defined Web 2.0 as: blogs, wikis, social networking, consumer generated content, podcasts, RSS, rich internet applications (RIAs), social tagging and bookmarking, publishing, social networks, product reviews, creating mash-up content. Steve O’Brien defined it as: A marketing buzzword used by vendors trying to justify incremental investments in Internet software and services. A collection of technologies for creating interactive Web applications; e.g., AJAX, SOAP, RIAs. A term coined by O’Reilly Media in 2004 to promote a conference about the post-bubble Internet. A catch-all phrase for Internet services that encourage user-generated participation, like Flickr and MySpace. Web 2.0 is About Engagement The goal of a Web 2.0 website is engagement. Engagement can be measured by sessions/visits, repeat visits, session length, RIA usage (ex. rotate, zoom), downloads, uploads, reviews, comments, votes, subscriptions, leads. The return can be measured by recommendations, registrations, and purchases. The Analytics Challenge of a Web 2.0 Website Web 2.0 presents a new model to measure website statistics. Page views are no longer the best measurement of activity. The proliferation of rich internet applications (RIA’s), pose a measurement challenge and requires a new approach to measuring the effectiveness of Web 2.0 elements, because most actions are on-page. The most commonly used RIA applications are Adobe Flash, Java applets/applications, Active X Controls, and AJAX. Tagging relevant events with event tagging functionality is necessary to understand which features are driving which conversions. The right event tagging language needs to be used for the job: Flash/Flex Apps/Movies: ActionScript tag AJAX, DHTML, your blog: JavaScript tag Your blog postings on other blogs: Pixel tag Maturity of Analytics Use A majority of websites have deployed or are investing in web analytics, with 47% using web analytics; 12% planning to upgrade or replace in the next 12 months; 22% planning to deploy; and 19% with no plans to deploy. The maturity of a company’s involvement in web analytics can be broken down into 5 phases: Stage 0 – No analytics have been employed. Stage 1 – Companies have made a minimum technical investment, < $10,000, and generate standard reports about web traffic. These are small companies with revenue <$50 million. Stage 2 – The technical investment is $10K - $25K /year. A moderate amount is spent on reports, path analysis, commerce analysis, and a junior staff member is allocated to preparing the canned reports. Company revenue is between $50 and $500 million. Stage 3 – There is a moderate to high technical investment of $25K - $125K/year. The analytics program enables custom data, integration with other systems, and there is one dedicated staffer for data analysis. Revenues are up to $3 billion. Stage 4 – This is the stage of enlightenment. Tech investment spending is $150K +/year. The company is spending a lot of money on analytics, a lot on staff of 5+, and these people are vital to the business. The analytics are vital to decisions. Critically important decisions regarding the company are not made without the input of the data analyst. What are the Responsibilities of the Analyst in Each of These Stages? Stage 1 – The company makes the investment in the analytics program, they spend a few hours a week on the program, manage it, and generate reports. They figure out what activities visitors to the site perform and how it relates to business objectives. The analyst connects the dots between what users do and what it means. They focus on report generation and distribution. They try to educate other staff members about the data’s value. Stage 2 – One full-time staff member is allocated to evangelize and manage the data. Stage 3 – The mindset is adopted for continuous improvement based on the data, the data is used to drive actions, and the actions affect site design, email marketing, and search marketing. Stage 4 – Lots of money is being spent on analytics and the company can show ROI for this investment. Utilization of Analytics Tools A problem with collecting the data and analyzing it, is that there is too much data, a lack of expertise, and you can measure an infinite number of things. A company may have the technology in place, but can’t interpret the data. Once a company understands the importance of analytics to the bottom line, the challenge must be overcome on how to use the data. To avoid data overload, collect only the information that will be of immediate value to your organization and adopt an incremental approach to data collection and exploration. Even focusing on one aspect can help. Most analytics tools are used only at their most basic level with most people just using general traffic reports. One interesting stat to track is click-stream data. There is a huge ROI in making email campaigns relevant to users. The insight of click stream data gives you the efficiency to create messages that are targeted based on user behavior. My Analytics Epiphany Web analytics is an insight machine. Prior to this seminar, I didn't realize or fully understand the importance of analytics and how it should be used. Using analytics to continually test and improve a website will make the website a formidable force on the internet. I use website statistics at the most basic level. I’m overwhelmed at all the things I need to be good at. Maybe I’ll just get started slowly and focus on click paths and landing pages and making those better. Getting Psyched for SES NY! Sitting in on a session that gives insight into website success is always so interesting. In the spirit of SES NY, it was great being in a room for 3 hours learning – no phones, no deadlines, no emails. There’s an excitement in the air, because the industry is so new, complex, and exciting. See you next month! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Web 2.0 Marketing, Analytics, and Getting Psyched for SES NY!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Web 2.0 Marketing, Analytics, and Getting Psyched for SES NY!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "risabb\n          \n            risabb"
}