{
  "url": "https://moz.com/blog/web-design-for-roi-chapter-3-managing-for-roi",
  "slug": "web-design-for-roi-chapter-3-managing-for-roi",
  "title": "Web Design for ROI: Chapter 3, Managing for ROI - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In an earlier post I had mentioned that I started reading Web Design for ROI by Lance Loveday and Sandra Niehaus (check out their website for more information on the book). Today I thought I'd share some tidbits from chapter 3, Managing for ROI.\n...",
  "content": "Web Design for ROI: Chapter 3, Managing for ROI Design By: Rebecca Kelley April 1, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley April 1, 2008 Web Design for ROI: Chapter 3, Managing for ROI Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In an earlier post I had mentioned that I started reading Web Design for ROI by Lance Loveday and Sandra Niehaus (check out their website for more information on the book). Today I thought I'd share some tidbits from chapter 3, Managing for ROI. Chapter 3, Managing for ROI, provides a list of considerations and suggestions on how to manage your website for optimal ROI. 1. Know What You Want What do you want your website to accomplish? To you, how satisfying is your website's design/usability? Ask yourself the following questions: \"How can we use our site to achieve organizational objectives?\" \"What opportunities are we missing because we have a poor/mediocre website compared to our competitors?\" These tips are concise, yet powerful. So many companies think \"We need a website\" without truly considering why they need a website. What's the benefit? What are your goals? What do you need your website to do? Also, competitive intelligence is an invaluable resource. Who is beating you in your sphere or industry, and what are they doing that you're not? Are they providing free tools? Offering discounts? Better customer support? Attractive images? It's imperative to analyze your competitors' websites to see what content they provide, which keywords they focus on, who's linking to them, etc. 2. Know Your Audience You're not designing the site for yourself, you're designing it for your audience. Ask yourself the following questions: Why are people coming to your site? What do they expect to find? How can you make your site easier for visitors to use? It's important to think of your site from your user's perspective. Consider doing some user testing on your website--a fresh set of eyes are always good to have. Think about how you ask someone to proofread your work, or how people hire you to do site reviews for their website. The same goes for your website--you look at it and work with it every day, so someone new may very well catch something that you've been overlooking. 3. Treat Your Website Like a Business Think about how your site contributes to your business's goals as a whole. Your site should complement your business plan. 4. Create a Website Strategy Have a site strategy--establish clear goals, communicate with your team, and work to implement those goals. The following is a suggested strategy: List your site's objectives. Don't confuse objectives with strategies--objectives are goals, whereas strategies are how you achieve your objectives. Objectives are the \"what,\" while strategies are the \"how.\" List your primary and secondary audiences. Your primary audience should be who you hope will receive the greatest ROI, while your secondary audience is everyone else. Consider crafting personas or audience profiles to better understand your audience's point of view. Draft a list of questions your audience may have when they're browsing your site, such as \"How does your service/product work?\", \"How much does it cost?\", \"How does using this product benefit me?\", \"Is there any printed material I can obtain?\", Do you have any partnership opportunities?\", etc. Some questions will be specific to your site's niche. Analyze your competitors. I already mentioned this earlier, but be sure to study your competitors' site, their calls to action, their landing pages, etc. Break down your site's traffic sources. What percentage of your traffic derives from organic search, paid search, email marketing, banner ads, direct navigation, partner sites, etc? Think about tweaking your design and offering separate landing pages based on where your traffic is coming from (chapter 4 goes more in-depth with landing pages). Strategize. Revisit your objectives and flesh out specific strategies you'll execute in order to complete them. Understand which metrics you'll need to track in order to measure your strategy's success. Which leads us to the next section... 5. Measure the Right Metrics This section cautions against relying too heavily on some metrics while ignoring others. Loveday and Niehaus list some problems with web reporting (analytics) tools: There's too much data. Too many site owners obsess about the figures without really thinking about what they mean or why they're like that. They aren't perfect. Lots of you know that different analytics programs report different stats. Don't worry or freak out that different programs are providing conflicting figures. Think about the data in a relative sense, much like keyword research tools. What you don't want to do is not trust analytics simply because you think the numbers aren't 100% accurate. They lack context. Don't just look at your analytics and say \"We had 5,000 visitors today.\" Is that good? Bad? Look at the bigger picture and consider your stats as a whole. Know how to take the analytics information and read into it. Key principles of measuring the success of your website include: Focus on what people do vs. what they say. Don't ask someone how they would find a specific product on your site--watch them try to do it. Think of success metrics in dollar figures. Which is easier to wrap your head around, \"Our conversion rate improved to 2.7%\" or \"By increasing our conversion rate, sales improved $200,000\"? Focus on trends. See if your metrics increase long-term vs. just a one day fluke spike. Don't obsess about something that could be nothing more than a short-term, fleeting gain. Emphasize consistency over accuracy. As mentioned earlier, analytics aren't 100% accurate, so instead focus on how consistent the metrics are. Integrate your site with various metrics. Hopefully, you should be able to track your customer's behavior from start to finish. Metrics that matter include business metrics (what your organization uses to measure success at a high level), site metrics (analytics, etc), and user metrics (user feedback). Metrics that don't matter include traffic (if you have a bunch of visitors but no conversions, the traffic doesn't mean much), the time on site and average page views (good directional indicators, but they can easily be misinterpreted), hits (it's not 1997 any more!), and survey (the questions can be subjective, they're often poorly worded, skew responses to people more willing to take the survey). 6. Prioritize Design Efforts Intelligently Most people design their website in the following order: Home page / Category pages / Detail pages / Forms and checkout / Landing pages From an ROI perspective, however, design attention should focus on: Forms and checkout / Landing pages / Detail pages / Category pages / Home page Speaking from SEOmoz's point of view, I can definitely attest that we have spent too much time on the rest of our site and not enough time optimizing our landing pages and sign up process. We're in the process of tweaking them (and are also planning an overhaul of our entire site's design, layout, and functionality, scheduled to launch sometime this fall). I have to say that I'm really starting to enjoy this book (and no, this isn't a sponsored review). The first couple of chapters were pretty introductory, but this chapter has been useful. I already read chapter 4, which dealt with landing pages, and it provided some really great tips that I'm looking forward to implementing on our own landing pages. I'll blog about chapter 4 next week--until then, keep on ROI-in! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Web Design for ROI: Chapter 3, Managing for ROI"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Web Design for ROI: Chapter 3, Managing for ROI"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}