{
  "url": "https://moz.com/blog/web-design-survey-from-alistapart-should-seos-do-likewise",
  "slug": "web-design-survey-from-alistapart-should-seos-do-likewise",
  "title": "Web Design Survey from AListApart... Should SEOmoz Do Likewise? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yesterday, one of the most popular web design portals, AListApart, unveiled their latest project - a survey for web designers and developers. Here's their pitch:\n\nPeople who make websites have been at it for more than a dozen years, yet almost nothing is known, statistically, about our profession.…",
  "content": "Web Design Survey from AListApart... Should SEOmoz Do Likewise? Design By: Rand Fishkin April 25, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 25, 2007 Web Design Survey from AListApart... Should SEOmoz Do Likewise? Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Yesterday, one of the most popular web design portals, AListApart, unveiled their latest project - a survey for web designers and developers. Here's their pitch: People who make websites have been at it for more than a dozen years, yet almost nothing is known, statistically, about our profession. Who are we? Where do we live? What are our titles, our skills, our educational backgrounds? Where and with whom do we work? What do we earn? What do we value? The survey itself itself is here (and I'll probably take it myself). More relevant to this blog, however, would be learning more about our own industry - the search marketing field. Granted, SEOmoz doesn't reach everyone in search the same way that ALA reaches almost everyone in webdev, but we've got about 12,000 feed readers (on a good day) and 10,000+ unique visitors (on weekdays), so there's at least a sizable audience. My question for you is - would you be willing to contribute in and see value in results from a \"state of the search marketing profession\" style survey? Surveys - Take Our Poll If you are interested, please also leave comments below about the questions you'd like to see asked and the kinds of things you'd hope to learn from the study. My feeling is that if we could get 2-5,000 participants, the work would be both valuable and demographically representative. p.s. Yes, yes, I know about the SEMPO studies and I've participated a couple times. Let's just say I'm not a fan, and the invite-only model has its advantages and drawbacks and is basically a different animal. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Web Design Survey from AListApart... Should SEOmoz Do Likewise?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Web Design Survey from AListApart... Should SEOmoz Do Likewise?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}