{
  "url": "https://moz.com/blog/web-metrics-are-you-missing-the-engagement-mark",
  "slug": "web-metrics-are-you-missing-the-engagement-mark",
  "title": "Web Metrics, Are You Missing the Engagement Mark? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One-half of my formal education is marketing, not advertising, marketing -- number crunching, customer segmentation marketing. I've lost c...",
  "content": "Web Metrics, Are You Missing the Engagement Mark? SEO Analytics B By: Bud-Caddell April 24, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: Bud-Caddell April 24, 2007 Web Metrics, Are You Missing the Engagement Mark? SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. One-half of my formal education is marketing, not advertising, marketing -- number crunching, customer segmentation marketing. I've lost count of the hours spent toiling away in front of pivot tables in Excel or tallying customer surveys. There's no better medium than online for my analytical mind. This post is a quick summation of the many many things you can track online -- along with an introduction to measuring social platforms as well as that buzz term 'engagement.' What to Measure Let's start with everything we could possibly (almost) track. Some of these may be right for your project, some may not: Page views Feed subscriptions Comments Quality of comments Number and types of user submissions Resyndication of our content Time spent on your site Media files consumed Unique visitors Email subscribers Traffic generated for other sites Numbers of bookmarks for our content Tags associated with out content Search engine effectiveness Offline public relations impact Downloads of a piece of content/software Satisfaction levels Inquiries Improved relations with developers, analysts, media, customers Sales Cross sales Reduced support costs You'll note that the list starts off with more or less measuring the effects of the user on the site, and as the list progresses, it moves towards measuring business objectives and the impacts on the bottom line. Some cautionary advice: don't try to do everything. Consider your business objectives and select a few key indicators to monitor. I'd also suggest dropping page views from your list of indicators -- it just isn't an accurate unit of measurement and it's led too many companies to a dead-end. Measuring Engagement Watch out when anything is called 'the holy grail' -- but engagement is a valuable way of looking at metrics for sites with social platforms. Engagement also attempts to take quantitative data (which the web is rich with) and make qualitative conclusions -- which is growing more and more valuable as users are more involved with 'communities' and community activities rather than single transactions. But how do we attempt to measure 'engagement'? Well, let's whittle down that lengthy list from above.. Here are, in my opinion, the key metrics to watch for engagement: Time spent on each page, per user Depth of visit (as a % of the whole site), per user Frequency of visits, per user Total time spent per user Community participation metrics (comments, reviews, etc), per user It's time for internet marketing to mature and consider customer segmentation -- for the longest time, we've been reporting metrics for our entire audience, when any marketer knows that you can't possibly expect to draw meaningful conclusions from lumping your entire audience into one category. Engagement is a perfect tool for segmenting your customers. Just a couple days ago, Forrester research finished a study on social technographics and created the following segments to represent the entire population of US adult online consumers: In many ways, you can replicate this type of segmentation by closely watching the behavior of individual users on your site. Based on your site, you can begin measuring engagement and creating segments for your users just like these. You should also tie in your general business metrics into this practice -- thereby creating dollar values for users in specific segments. You may find large chasms of value between specific segments in your business, and you may find that your current site doesn't offer enough mechanisms for you to interact with your users/customers. This surely isn't the definitive post on engagement and customer segmentation; for further reading, see these great sites: Measuring Engagement by Scoble Social Media Measurement by Jeremiah Owyang The Problem with Social Media Measurement by Brian Oberkirch Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Web Metrics, Are You Missing the Engagement Mark?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Web Metrics, Are You Missing the Engagement Mark?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bud-Caddell\n          \n            Bud-Caddell"
}