{
  "url": "https://moz.com/blog/web-20-and-new-economy-topics-for-ceo-presentations",
  "slug": "web-20-and-new-economy-topics-for-ceo-presentations",
  "title": "Web 2.0 and New Economy Topics for CEO Presentations - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I have been invited to present to the top CEOs around Australia as part of a countrywide road show. The presentation will be a 3 hour format in front of around 12-15 CEOs at a time. Each CEO is from a non-competitive industry.I regularly present SEO tactics as part of sales pitches to PR and…",
  "content": "Web 2.0 and New Economy Topics for CEO Presentations Social Media K By: Klikhir March 6, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! K By: Klikhir March 6, 2007 Web 2.0 and New Economy Topics for CEO Presentations Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I have been invited to present to the top CEOs around Australia as part of a countrywide road show. The presentation will be a 3 hour format in front of around 12-15 CEOs at a time. Each CEO is from a non-competitive industry. I regularly present SEO tactics as part of sales pitches to PR and Marketing Departments and Web Development Groups. These sales presentations are usually more technical and hands on and would rarely be interesting to CEOs. Top CEOs, in non technical industries, are usually in their late 40s to late 50s and, in my experience, wouldn’t know much about concepts like Web 2.0, mashups, social bookmarking, or Long Tail theory. They grew up in a world of scarcity and protection of information. If you asked a CEO whether their company has a social component to their web site, they would probably tell you they are not in the dating business. If you ask them how they are using social opinion to drive traffic to individual product pages you would you lose them in translation. What is important to CEOs about the new economy? How can they engage their marketing and information departments to embrace social trends and make their businesses more popular and their sites viral and sticky? How does Long Tail Theory impact their business and what can they do to engage the wisdom of the crowd? I have prepared the following topics with 25 minute timings forming the basis of my presentation. :: start Maximizing Dotcom 2 and Embracing The New Economy What is the New Economy? (25 minutes) Talk about: The Information Age and the Recommendation Age Abundance VS Scarcity Internet’s Effect on Globalization Fundamental Shifts in B2B and B2C and Web2C Success Stories: Dell; Nokia; Apple; LG Long Tail Theory (25 minutes) Talk about: Long Tail Theory Explanation Democratization of Production Democratization of Distribution Democratization of Opinion Hits VS Niches Fundamental changes to Marketing principles The Wisdom of the Crowd | Recommendations, Reviews, Commenting Success Stories: eBay; Google; Wikipedia; Digg; Yahoo! Filtering (25 minutes) Talk about: What is filtering and aggregation The value of filtering to business and customers Practical uses of filtering for non digital businesses Automated filtering and aggregation Industry Trends and Best Practice Success Stories: Amazon; Rhapsody; IMDB; Craiglist; Netflix; del.icio.us Q/A 15 minutes½ HOUR BREAK New Economy Change Management (25 minutes) Talk About: PR is WebR New job descriptions for traditional roles Fire your Sales People, hire Customer Service personnel Sharing is more powerful than ownership The power of Extranet communications frameworks Success Stories: Youtube; Rapidshare; Adsense; SEOmoz Web 2.0 and Mashups (25 minutes) Talk About: Web 2.0 vs Web 1.0 Why some industry leaders have no revenue model Implication of Web 2.0 APIs Practical applications for non-digital businesses Industry Trends and Best Practice Success Stories: Google Maps; Amazon; Commission Junction; eBay; Blogger; Live Journal; Flickr; eBooks Internet Marketing (25 minutes) Talk about: 2006 vs 2007 Marketing Strategies The value of Keyword IP and SEO Traditional vs New Economy Content Types Niche and Viral Marketing Practical Applications of Long Tail Theory Success Stories: The Interview with God; Google Video; Hitwise; Adwords Q/A 15 minutes :: end What other topics and references to success stories do you think appropriate for presentations to CEOs in general? Do you think CEOs will be armed with sufficient information (if explained well) to return to their respective companies inspired with brand new ideas? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Web 2.0 and New Economy Topics for CEO Presentations"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Web 2.0 and New Economy Topics for CEO Presentations"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Klikhir\n          \n            Klikhir"
}