{
  "url": "https://moz.com/blog/web-architecture-tips-and-more-for-seo-pros",
  "slug": "web-architecture-tips-and-more-for-seo-pros",
  "title": "Web Architecture Tips and More for SEO Pros - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you have ever run a web design company or built a website for someone that knows very little (or nothing) about best practices in web design or SEO, then you undoubtedly have come across the client who wants something glitzy, with lots of flash (with or without actually using Flash), and *gasp*…",
  "content": "Web Architecture Tips and More for SEO Pros Design By: Joe Rozsa August 28, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Joe Rozsa August 28, 2007 Web Architecture Tips and More for SEO Pros Design This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. If you have ever run a web design company or built a website for someone that knows very little (or nothing) about best practices in web design or SEO, then you undoubtedly have come across the client who wants something glitzy, with lots of flash (with or without actually using Flash), and *gasp* lots of animations. When I hear something like \"I like those sites that have a flashy intro page\", then I know I'm in for trouble. That is when you have to take a chance on losing the client (if you are like me, I'd rather lose the client than put up something that isn't going to work for the client) or spend an inordinate amount of time teaching Web Architecture 101 to the potential client, along with trying to explain why this is such a bad idea. Since I teach Web Architecture and SEO classes, I thought it might be a good idea to put this into one place so that others can relay the same message to the type of client I am referring to with a few rules for web site architecture and design. Rule #1 - Glitzy Sites Are Great If You Don't Care If Anyone Ever Sees It I guess this one should be amended to add \"Without Paying A Boatload of Money for PPC\" to the end of it. Sure, I could build a flashy intro page and a very intricate design that people would be impressed with. But I follow up by asking them how many of those \"Flash Intro\" sites have they ever seen come up in a Search Engine Results Page (SERP)? After explaining that my job is to make a functional, productive site that receives a lot of free traffic, they are on board. I also mention that if they would prefer to spend at least $10,000 / month to market the site using Pay Per Click, we could do that - but even then the site wouldn't be as user friendly, and ultimately, the Return On Investment for all of that traffic would be terrible. I usually don't have to go into much deeper explanation after that. Rule #2 - Graphic Designers are Not Good Web Developers This is certainly not a dig at professional graphic designers, as they are very talented individuals that can work magic at their trade. However, when they wireframe a site in Photoshop and slice it up for display in a browser, there is no real consideration for true SEO principles. There are exceptions to the rule, but most graphics designers are not experts in search engine optimization. Nowadays, only true full time search marketing professionals have the time needed to truly stay on top of this crucial skill. Nothing against graphics designers, but considering keyword density and properly using an H1 tag is typically not at the top of their design strategies. Rule #3 - Cheap Web Labor Leads to Negative ROI There certainly are plenty of college or high school kids that will toss up a website for your business for some spare gas money these days, and we all know the availability of an offshore developer building a full and functional website for peanuts. But ask your client why they are even interested in having a web site. Is it because they think they are supposed to? Or do they realize that the web site is an entirely new marketing and advertising niche for their business, which, when done properly, will lead to new business they never would have found otherwise? Basically, the old \"you get what you pay for\" cliche is a cliche because it is true. Inexperienced developers may be able to put up a site that has your company name and phone number, maybe a cute little picture of your business or the owner, and a few pages of \"brochure-ware\". Many clients think that a web site is something you have so that you can put a web address on a business card or on their store front. They SHOULD be educated to know that a professional can make that site BE the business card to clients you have never met. Would you rather pay $200 for a web site that generates $500 a year, or would you rather spend $5,000 - $10,000 for a site that generates $100,000 a year? A professional web presence, built with proper SEO best practices, should be viewed with the same type of investment candor that a television, newspaper, or radio commercial demands - except the web site can actually have clear metrics to measure its ROI and performance. Rule #4 - Lot of SEO Firms Know Nothing About SEO I actually consulted my services to provide on-page optimization for a company that offered SEO services to other clients, which was ironic in and of itself. Upon first visiting their web site, I noticed that every page on their web site had the exact same title. Interesting. Since page titles are probably the single most important (but amazingly, most botched) first step of search engine optimization, I knew I was in for a very complicated project. It was more of the same when I came across missing alt tags, javascript navigation, etc. One page on the site that I did find useful was the listing of their current clients, which leads me to the next rule... Rule #5 - Do Not List Your Existing Clients on Your Site You may know that search marketing is a very competitive business. And yes, that is an understatement. So why not put your list of clients, with full working links, on your website so that your competitors can search for your site and immediately get a quick list of potential new clients, knowing that this company is already paying for search marketing services? And no, I won't accept that this is part of a link building strategy for your client either, as your site is probably not the most important part of that strategy (otherwise Google may come looking for you as an SE despised link farm). If you really want to show off your work, link to SERP's using competitive keywords as part of a \"Case Study', but limit these to only your best performers, where the client likely would not leave you anyway, or name the company name in a text mention (and not a text link mention). Anyway, that does it for my five rules, and I apologize for rambling somewhat on different topics. I wanted my first blog post here to be comprehensive, and hopefully I've done that. I look forward to reading any comments or questions that anyone may have about what I have written, and I look forward to sharing more in time. Joe Rozsa - Founder - SEOColumbus.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Web Architecture Tips and More for SEO Pros"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Web Architecture Tips and More for SEO Pros"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joe Rozsa\n          \n            Joe Rozsa"
}