{
  "url": "https://moz.com/blog/web-20-fostering-community-creates-value",
  "slug": "web-20-fostering-community-creates-value",
  "title": "In Web 2.0, Fostering Community Creates Value - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "More and more, quality content is becoming less scarce and the ownership of that content is becoming less valuable.     With media 2.0, web 2.0, community 2.0, open source development, and the rest, content creation has become easier and the barriers to distribute that content are eroding away.…",
  "content": "In Web 2.0, Fostering Community Creates Value Social Media B By: Bud-Caddell February 20, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! B By: Bud-Caddell February 20, 2007 In Web 2.0, Fostering Community Creates Value Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. More and more, quality content is becoming less scarce and the ownership of that content is becoming less valuable. With media 2.0, web 2.0, community 2.0, open source development, and the rest, content creation has become easier and the barriers to distribute that content are eroding away. Content is moving toward commoditization. Moreover, sites that still stranglehold the content creation process have higher costs than their competitors that tap into the overwhelming network effects of a user community. In a community, users take on community responsibilities, creating, moderating, networking and refining the system as a whole. Users create the culture and preserve the history of the community. It’s not only about costs – the value itself is in trust. In an open community, trust is the cohesive factor between members and moderators; trust fosters growth, trust converts users into an audience, and trust broadens the distribution of the message. Community sites (along with multimedia) represented the top growth categories during 2006. Community success stories: (from futureofcommunities.com) Ducati was able to fire their marketing department and replace it with a central customer community group responsible for all aspects of marketing - from product design and marketing communications, to creating the overall brand experience. In Germany, eBay was able to increase its revenue by 56% by getting existing eBay users to join customer communities. And through their “Connect and Develop” strategy - which involves employees, customers, prospects and even competitors, P&G is now able to derive 35% of their innovations and billions of dollars in revenue from the community it’s developed. How is community formed? Communities rally around a strong purpose – this can range from social issues, education, commerce and project development. A clear purpose provides a common goal for all stakeholders to pursue. Communities, when done correctly, are self-propelling and over time require less and less strict oversight and external administration. Online communities are much more likely to succeed when the users have real-world connections, such as membership in an organization and careers in similar fields. Me-first! Successful communities build around the individual rather than the work group, allowing single users to create profiles, customize components of the environment, and express their individuality. Moreover, individuals must gain some benefit by becoming a member of the community and contributing. In the new web, the individual creator is at the center and everything flows outward. In a work-group focused community, individuals are not as easily able to make connections with each other; therefore the strength of the network itself is weakened. Communities need an administrator and a set of ethical principles to adhere to. Communities must have rules of interaction and a system in place to effectively enforce those rules in order to maintain the quality of the communication within the community. Off-topic conversations, advertising, or abuse can lower the value and rate of active participation. However, brand and product based communities should balance the need for civilized interaction with the requirement to have an open and unbiased forum.Community management can be broken into the four following principles: Purpose of the Community It’s the goal of the administrator to clearly define and communicate the purpose of the community and to moderate the interaction of individual members around the purpose. Participants of the Community Within the community, the administrator must continue to provide opportunities for members to express identity and to segment themselves. The administrator must also work to always increase the trust between the provider and community. Platform to Create Community Administrators must oversee the health and fitness of the platform for the community – including providing vehicles for interaction (blogs, forums, etc). Policing of the Community As the community evolves, users will take a greater role in moderating the various vehicles of community – however, clearly defined oversight by the administrator is needed at all times. How can a website foster Community? On the page elements of a site are critical in establishing or hindering community development. The top features include: Interface Ease of Use How easy is it for users to access the features of your site, including all community vehicles (blogs, forums, etc). Do you allow anonymous posting or must users register first? How easily does the system adapt over time or accept new features? Is the system error-prone? Maybe the most important question is how easy is it for one user to find another? Keep the interface as simple and as consistent as possible. Profiles Within every successful community must exist, at its core, the ability for individual users to differentiate themselves and form distinct identities. This can include uploading photos, adding bios, professional experiences, creating a screen name and more. Membership Features & Benefits What is gained by signing up or paying a fee to your site? How is membership defined in regard to the overall features of the site? Who benefits more – your site, or your users? Member Growth Are members encouraged to continue participating? Many sites create points and participation levels to continually activate their users. Mischief How is bad behavior handled throughout the site? How easy is it to find your general policies and codes of conduct? What level of authority do users possess to moderate other user’s actions? Discussion about the Site Successful community sites allow a section of the site to solely hold discussion of the site where users can give feedback in an open dialogue with site administrators – new features can be recommended, existing features can be improved and overall the administrators can share a sense of ownership of the site with the users. Community sites can offer a multitude of vehicles to drive greater user interaction and contribution; these vehicles can come in the following forms: Blogs Wikis, user contributed encyclopedias User Ratings, of products, feature content, other members, etc User Reviews P2P File Sharing Content Sharing, allowing users to send and display favorite content User Comments Trackbacks, ie: when one blog references someone else’s blog Blogrolls, a list of a users personal favorite blogs User Profiles Most Popular Lists Tagging, greatly increases search and browse capabilities Open Source Development, of software or knowledge material Podcasting / Video Blogging, allowing users multiple formats to contribute Chatting/IM Forums Sources and Further Reading http://www.futureofcommunities.com/ -- The Blog of The Community Management and Marketing Council http://www.futureofcommunities.com/wp-content/uploads/Community%20Design.pdf Community Design: The Four Principles of Community Management By Patrick Duparcq, Kellogg School of Management – Northwestern University http://infotangle.blogsome.com/2006/04/07/community-20/ - Community 2.0 Overview http://elearning.typepad.com/thelearnedman/social_networking/ - The Learned Man!http://www.uxmag.com/strategy/93/this-is-media-20 - Media 2.0 Overview http://www.digital-web.com/articles/building_an_online_community/ - Tips for Building an Online Community http://customerevangelists.typepad.com/blog/2006/05/charting_wiki_p.html - Charting Citizen Participation Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "In Web 2.0, Fostering Community Creates Value"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "In Web 2.0, Fostering Community Creates Value"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bud-Caddell\n          \n            Bud-Caddell"
}