{
  "url": "https://moz.com/blog/websites-personal-reputation",
  "slug": "websites-personal-reputation",
  "title": "Websites & Personal Reputation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The cult of personality on the Internet is somewhat lackluster. With the exception of the communities of obsessed fans of web-external celebrities, and a few odd bloggers, the Internet has yet to embrace the American cultural passion of identifying heroes and villains in all that exists.\nThe wheels…",
  "content": "Websites & Personal Reputation By: Rand Fishkin June 7, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 7, 2005 Websites & Personal Reputation The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The cult of personality on the Internet is somewhat lackluster. With the exception of the communities of obsessed fans of web-external celebrities, and a few odd bloggers, the Internet has yet to embrace the American cultural passion of identifying heroes and villains in all that exists. The wheels of commerce continue to turn, however, and it is becoming a increasing trend and even neccessity to mingle your persona with your website. Issues of trust, reliability and accountability have made personal contact and personal relationships a part of the business conducted online more so than they have been in the past. This could be due either to the shift in demographics, as less tech-savvy individuals use the web or it could be a process of experimentation by website operators, interested is seeing if personal exposure can help to build their businesses. There is undoubtedly a greater satisfaction that comes from doing business with people and companies you know. Personal relationships create a level of trust and service that wouldn't be provided if the human contact did not exist. My hypothesis is that this trend will continue to rise in popularity, and we will find that niche businesses, bloggers, consultants and others will increasingly show their faces (or at least their keystrokes) publicly. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Websites & Personal Reputation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Websites & Personal Reputation"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}