{
  "url": "https://moz.com/blog/website-prototyping-software",
  "slug": "website-prototyping-software",
  "title": "Website Prototyping Software - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When building out the page-by-page wireframing of a new website, I've been prone to use Macromedia Flash to layout the elements and create the idea that customers and developers can see. A friend recently suggested Axure, software that's specifically designed for wireframing websites and has a lot…",
  "content": "Website Prototyping Software Design By: Rand Fishkin April 18, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 18, 2006 Website Prototyping Software Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When building out the page-by-page wireframing of a new website, I've been prone to use Macromedia Flash to layout the elements and create the idea that customers and developers can see. A friend recently suggested Axure, software that's specifically designed for wireframing websites and has a lot of built-in functionality to support the task of prototyping. Axure appears to do a lot of things right, but at $589 for the first year and $189 for a 12 month renewal, it's hard to justify when compared with full featured design-and-develop programs like Dreamweaver and Flash (both under $400 with no licensing fees). They do have a 30-day free trial and a fairly good demo. Does anyone use Axure? Do you have any other wireframe/prototyping suggestions (yes, I already know about the $1.99 pen-and-paper solution)? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Website Prototyping Software"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Website Prototyping Software"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}