{
  "url": "https://moz.com/blog/weekend-roundup-for-the-week-of-51009",
  "slug": "weekend-roundup-for-the-week-of-51009",
  "title": "Weekend Roundup for the Week of 5/10/09 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Stories, news, and other notable items from the past week:\n\n\n\nGoogle crashed between 8:40 and 9:55 ET yesterday, preventing people from Googling to find out why Google wasn't working. Oh noes! \nSpeaking of Google, they recently overhauled Google News as well as updated their blog search algorithm,…",
  "content": "Weekend Roundup for the Week of 5/10/09 SEO Events By: Rebecca Kelley May 15, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley May 15, 2009 Weekend Roundup for the Week of 5/10/09 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Stories, news, and other notable items from the past week: Google crashed between 8:40 and 9:55 ET yesterday, preventing people from Googling to find out why Google wasn't working. Oh noes! Speaking of Google, they recently overhauled Google News as well as updated their blog search algorithm, and they're allowing trademarks to be used in US Adwords copy. Geez, no wonder there was downtime. Methinks Google needs a little R&R. Congratulations to Barry Schwartz--he and his wife just had a baby girl. Mazel tov! Now I know what I should work on the next time Rand's out of town at a conference (wait, that's next week...*evil laugh*). R.I.P. 3D Realms. Your perpetual release date for Duke Nukem Forever made for a lot of Internet lulz. Ladies and gentlemen, Frankenfrog! It's alive! It's ALIIIIIIIIIVE!!! Brian Carter shares the 4 steps of social media marketing. I think step 1 is that you do not talk about social media marketing. Todd Malicoat talks about how link building for SEO is like picking up a girl. I'm sure his girlfriend is thrilled with the analogy. :P Jennifer Horowitz dissects the seven deadly sins of social media. It's a well written and clever look at how one needs to succed with social media marketing. YOUmoz entries: What The Celebrity Apprentice Can Teach Us about SEO. Nicchenet shares some parallels between one of her favorite reality TV shows and search engine optimization. The Right Way to Leverage Social Media. Hornedogey talks about some popular social media campaigns that were memorable and successful. Can a Site Gain International Traffic with Links to Babel Fish Translations? Sexteta wonders if linking to Babel Fish versions of one's website can help increase international traffic to the site. How Much Format Counts in the Rankings. John CMS talks about the difference a user-friendly format can make when it comes to ranking a page in the SERPs. Lost in the Ocean of Ghost Writers. SEMWarrior shares the negative experience he had in trying to hire a quality ghost writer. Gaining Organic Trafic via Indexed Internal Search Results Pages. Navin has done some experimenting with creating and indexing internal search results pages, and he shares his process with the YOUmoz community. Competitive Data Acquisition and Analysis. Saurav Kneoteric talks about competitive analysis and how to incorporate competitive intelligence into a business's marketing plans. Best of YOUmoz: Domain Names, Cybersquatting, Politics and the Law. Wredlich shares some information about cybersquatting laws and the difference between cybersquatting and identity theft. The Real Power of Twitter. Dr. Pete prescribes us all a dose of how Twitter is valuable to him, and we happily gulp it down and ask for more. New additions to the SEOmoz Marketplace: Featured job postings: Contracted organic SEO and online marketer SEO specialist for Invodo, Inc. in Austin, TX Director, Search and Performance for First Rate in Sydney, Australia Featured companies: United States: BenjaminMarc.com in Long Island, NY Easy Street Interactive in Manchester, NH Kudzu Online Marketing in the US GILL Media in Tampa, FL, as well as Canada and Honduras Back40 Design Group in Edmond, OK Apples 2 Apples in Montrose, CO The Kali Network in Santa Clara, CA, as well as India and Russia A Greater Town in Montclair, NJ Zoetic Interactive in Fort Lee, NJ Engagence in the US tdburns in Graham, NC Canada: KKT Interactive in Hamilton, ON UK / Europe: WebWise Search in Morecambe, UK Igentics in Cambridge, UK 10Best Solutions in France and the UK Asia: Diolt Web Marketing in Karachi, Pakistan Analyza Technologies in Pune, India Featured resumes: Currently looking: Punit isn't much for words, but he apparently knows how to do web design and how to attract traffic to websites and blogs. Digital marketer is available on demand in London, UK. Rodion Matveev is looking for an SEO/SEM position at an authority Internet marketing company. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Weekend Roundup for the Week of 5/10/09"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Weekend Roundup for the Week of 5/10/09"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}