{
  "url": "https://moz.com/blog/weigh-in-on-directory-submission-do-they-have-any-juice",
  "slug": "weigh-in-on-directory-submission-do-they-have-any-juice",
  "title": "Weigh in on Directory Submission - Do They Have Any Juice? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you go to webmaster forums one of the most common forms of advice given newbies with a brand new site is... \"Submit to the Directories\" - that will get you some quick backlinks (AKA some easy link juice).   These directories will include your site for free or for a small inclusio...",
  "content": "Weigh in on Directory Submission - Do They Have Any Juice? Link Building E By: EGOL May 6, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL May 6, 2006 Weigh in on Directory Submission - Do They Have Any Juice? Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you go to webmaster forums one of the most common forms of advice given newbies with a brand new site is... \"Submit to the Directories\" - that will get you some quick backlinks (AKA some easy link juice). These directories will include your site for free or for a small inclusion fee. I think that this is a ton of bull. I think that you can blow a load of dough and a lot of time chasing these links - which are mostly going to be low quality - and bring you very little real traffic. Weigh in and tell me if I am wrong! *whispering* ...or better yet... share some ideas on how to find the good ones :D Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Weigh in on Directory Submission - Do They Have Any Juice?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Weigh in on Directory Submission - Do They Have Any Juice?"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}