{
  "url": "https://moz.com/blog/weird-crazy-myths-about-link-building-in-seo-you-should-probably-ignore-whiteboard-friday",
  "slug": "weird-crazy-myths-about-link-building-in-seo-you-should-probably-ignore-whiteboard-friday",
  "title": "Weird, Crazy Myths About Link Building in SEO You Should Probably Ignore - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "From where to how to when, there are a number of erroneous claims about link building floating around the SEO world. In today's Whiteboard Friday, Rand sets the record straight on 8 of the more common claims he's noticed lately.",
  "content": "Weird, Crazy Myths About Link Building in SEO You Should Probably Ignore Link Building | Whiteboard Friday By: Rand Fishkin September 9, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 9, 2016 Weird, Crazy Myths About Link Building in SEO You Should Probably Ignore Link Building | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The rules of link building aren't always black and white, and getting it wrong can sometimes result in frustrating consequences. But where's the benefit in following rules that don't actually exist? In today's Whiteboard Friday, Rand addresses eight of the big link building myths making their rounds across the web. Click on the whiteboard image above to open a high-resolution version in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about some of the weird and crazy myths that have popped up around link building. We've actually been seeing them in the comments of some of our blog posts and Whiteboard Fridays and Q&A. So I figured, hey, let's try and set the record straight here. 1. Never get links from sites with a lower domain authority than your own What? No, that is a terrible idea. Domain authority, just to be totally clear, it's a machine learning system that we built here at Moz. It takes and looks at all the metrics. It builds the best correlation it can against Google's rankings across a broad set of keywords, similar to the MozCast 10K. Then it's trying to represent, all other things being equal and just based on raw link authority, how well would this site perform against other sites in Google's rankings for a random keyword? That does not in any way suggest whether it is a quality website that gives good editorial links, that Google is likely to count, that are going to give you great ranking ability, that are going to send good traffic to you. None of those things are taken into account with domain authority. So when you're doing link building, I think DA can be a decent sorting function, just like Spam Score can. But those two metrics don't mean that something is necessarily a terrible place or a great place to get a link from. Yes, it tends to be the case that links from 80- or 90-plus DA sites tend to be very good, because those sites tend to give a lot of authority. It tends to be the case that links from sub-10 or 20 tend to not add that much value and maybe fail to have a high Spam Score. You might want to look more closely at them before deciding whether you should get a link.But new websites that have just popped up or sites that have very few links or local links, that is just fine. If they are high-quality sites that give out links editorially and they link to other good places, you shouldn't fret or worry that just because their DA is low, they're going to provide no value or low value or hurt you. None of those things are the case. 2. Never get links from any directories I know where this one comes from. We have talked a bunch about how low-quality directories, SEO-focused directories, paid link directories tend to be very bad places to get links from. Google has penalized not just a lot of those directories, but many of the sites whose link profiles come heavily from those types of domains.However, lots and lots of resource lists, link lists, and directories are also of great quality. For example, I searched for a list of Portland bars — Portland, Oregon, of course known for their amazing watering holes. I found PDX Monthly's list of Portland's best bars and taverns. What do you know? It's a directory. It's a total directory of bars and taverns in Portland. Would you not want to be on there if you were a bar in Portland? Of course, you would want to be on there. You definitely want those. There's no question. Give me that link, man. That is a great freaking link. I totally want it.This is really about using your good judgment and about saying there's a difference between SEO and paid link directories and a directory that lists good, authentic sites because it's a resource. You should definitely get links from the latter, not so much from the former. 3. Don't get links too fast or you'll get penalized Let's try and think about this. Like Google has some sort of penalty line where they look at, \"Oh, well, look at that. We see in August, Rand got 17 links. He was under at 15 in July, but then he got 17 links in August. That is too fast. We're going to penalize him.\"No, this is definitely not the case. I think what is the case, and Google has filed some patent applications around this in the past with spam, is that a pattern of low-quality links or spammy-looking links that are coming at a certain pace may trigger Google to take a more close look at a site's link profile or at their link practices and could trigger a penalty. Yes. If you are doing sketchy, grey hat/black hat link building with your private networks, your link buys, and your swapping schemes, and all these kinds of things, yeah, it's probably the case that if you get them too fast, you'll trip over some sort of filter that Google has got. But if you're doing the kind of link building that we generally recommend here on Whiteboard Friday and at Moz more broadly, you don't have risk here. I would not stress about this at all. So long as your links are coming from good places, don't worry about the pace of them. There's no such thing as too fast. 4. Don't link out to other sites, or you'll leak link equity, or link juice, or PageRank ...or whatever it is. I really like this illustration of the guys who are like, \"My link juice. No!\" This is just crap.All right, again, it's a myth rooted in some fact. Historically, a long time ago, PageRank used to flow in a certain way, and it was the case that if a page had lots of links pointing out from it, that if I had four links, that a quarter each of the PageRank that this page could pass would go to each of them. So if I added one more, oh, now that's one-fifth, then that becomes one-fifth, and that becomes one-fifth. This is old, old, old-school SEO. This is not the way things are anymore. PageRank is not the only piece of ranking algorithmic goodness that Google is using in their systems. You should not be afraid of linking out. You should not be afraid of linking out without a \"nofollow\" link. You, in fact, should link out. Linking out is not only correlated with higher rankings. There have also been a bunch of studies and research suggesting that there's something causal going on, because when followed links were added to pages, those pages actually outranked their non-link-carrying brethren in a bunch of tests. I'll try and link to that test in the Whiteboard Friday. But regardless to say, don't stress about this. 5. Variations in anchor text should be kept to precise proportionsSo this idea that essentially there's some magic formula for how many of your keyword anchor text, anchor phrases should be branded, partially branded, keyword match links that are carrying anchor text that's specifically for the keywords you're trying to rank for, and random assorted anchor texts and that you need some numbers like these, also a crazy idea. Again, rooted in some fact, the fact being if you are doing sketchy forms of link building of any kind, it's probably the case that Google will take a look at the anchor text. If they see that lots of things are kind of keyword-matchy and very few things contain your brand, that might be a trigger for them to look more closely. Or it might be a trigger for them to say, \"Hey, there's some kind of problem. We need to do a manual review on this site.\" So yes, if you are in the grey/black hat world of link acquisition, sure, maybe you should pay some attention to how the anchor text looks. But again, if you're following the advice that you get here on Whiteboard Friday and at Moz, this is not a concern. 6. Never ask for a link directly or you risk penalties This one I understand, because there have been a bunch of cases where folks or organizations have sent out emails, for example, to their customers saying, \"Hey, if you link to us from your website, we'll give you a discount,\" or, \"Hey, we'd like you to link to this resource, and in exchange this thing will happen,\" something or other. I get that those penalties and that press around those types of activities has made certain people sketched out. I also get that a lot of folks use it as kind of blackmail against someone. That sucks. Google may take action against people who engage in manipulative link practices. But for example, let's say the press writes about you, but they don't link to you. Is asking for a link from that piece a bad practice? Absolutely not. Let's say there's a directory like the PDX Monthly, and they have a list of bars and you've just opened a new one. Is asking them for a link directly against the rules? No, certainly not. So there are a lot of good ways that you can directly ask for links and it is just fine. When it's appropriate and when you think there's a match, and when there's no sort of bribery or paid involvement, you're good. You're fine. Don't stress about it. 7. More than one link from the same website is useless This one is rooted in the idea that, essentially, diversity of linking domains is an important metric. It tends to be the case that sites that have more unique domains linking to them tend to outrank their peers who have only a few sites linking to them, even if lots of pages on those individual sites are providing those links. But again, I'm delighted with my animation here of the guys like, \"No, don't link to me a second time. Oh, my god, Smashing Magazine.\" If Smashing Magazine is going to link to you from 10 pages or 50 pages or 100 pages, you should be thrilled about that. Moz has several links from Smashing Magazine, because folks have written nice articles there and pointed to our tools and resources. That is great. I love it, and I also want more of those.You should definitely not be saying \"no.\" You shouldn't be stopping your link efforts around a site, especially if it's providing great traffic and high-quality visits from those links pointing to you. It's not just the case that links are there for SEO. They're also there for the direct traffic that they pass, and so you should definitely be investing in those. 8. Links from non-relevant sites or sites or pages or content that's outside your niche won't help you rank better This one, I think, is rooted in that idea that Google is essentially looking and saying like, \"Hey, we want to see that there's relevance and a real reason for Site A to link to Site B.\" But if a link is editorial, if it's coming from a high-quality place, if there's a reason for it to exist beyond just, \"Hey, this looks like some sort of sketchy SEO ploy to boost rankings,\" Googlebot is probably going to count that link and count it well. I would not be worried about the fact that if I'm coffeekin.com and I'm selling coffee online or have a bunch of coffee resources and corvettecollectors.com wants to link to me or they happen to link to me, I'm not going to be scared about that. In fact, I would say that, the vast majority of the time, off-topic links from places that have nothing to do with your website are actually very, very helpful. They tend to be hard for your competitors to get. They're almost always editorially given, especially when they're earned links rather than sort of cajoled or bought links or manipulative links. So I like them a lot, and I would not urge you to avoid those. So with that in mind, if you have other link ideas, link myths, or link facts that you think you've heard and you want to verify them, please, I invite you to leave them in the comments below. I'll jump in there, a bunch of our associates will jump in there, folks from the community will jump in, and we'll try and sort out what's myth versus reality in the link building world. Take care. We'll see you again next week for another edition of Whiteboard Friday. Video transcription by Speechpad.com Feeling inspired by reality? Start building quality links with OSE. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Weird, Crazy Myths About Link Building in SEO You Should Probably Ignore"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Weird, Crazy Myths About Link Building in SEO You Should Probably Ignore"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1. Never get links from sites with a lower domain authority than your own"
    },
    {
      "level": "H2",
      "text": "2. Never get links from any directories"
    },
    {
      "level": "H2",
      "text": "3. Don't get links too fast or you'll get penalized"
    },
    {
      "level": "H2",
      "text": "4. Don't link out to other sites, or you'll leak link equity, or link juice, or PageRank"
    },
    {
      "level": "H2",
      "text": "5. Variations in anchor text should be kept to precise proportions"
    },
    {
      "level": "H2",
      "text": "6. Never ask for a link directly or you risk penalties"
    },
    {
      "level": "H2",
      "text": "7. More than one link from the same website is useless"
    },
    {
      "level": "H2",
      "text": "8. Links from non-relevant sites or sites or pages or content that's outside your niche won't help you rank better"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}