{
  "url": "https://moz.com/blog/welcome-to-seomozs-newest-blogger-guillaume-bouchard",
  "slug": "welcome-to-seomozs-newest-blogger-guillaume-bouchard",
  "title": "Welcome to SEOmoz's Newest Blogger - Guillaume Bouchard - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm proud to welcome Guillaume Bouchard to our blogging team at SEOmoz. Guillaume and I have communicated a few times over email, but after meeting him at the conference, I knew he was a guy who \"gets it\". In the search marketing field, Guillaume may be relatively unknown, but he's one of…",
  "content": "Welcome to SEOmoz's Newest Blogger - Guillaume Bouchard Moz News By: Rand Fishkin April 26, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 26, 2006 Welcome to SEOmoz's Newest Blogger - Guillaume Bouchard Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm proud to welcome Guillaume Bouchard to our blogging team at SEOmoz. Guillaume and I have communicated a few times over email, but after meeting him at the conference, I knew he was a guy who \"gets it\". In the search marketing field, Guillaume may be relatively unknown, but he's one of French-speaking Canada's foremost SEOs. Guillaume deals with tough issues in North America that many of us don't see on a regular basis. I'm looking forward to hearing from him on issues like Internet adoption in Quebec, multi-language issues, marketing to a local and highly uniqe audience and dealing with clients and searchers who don't have the sophistication of many in the US and Europe. Welcome to the team, Guillaume - and thanks for your post on day 1 of the conference. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Welcome to SEOmoz's Newest Blogger - Guillaume Bouchard"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Welcome to SEOmoz's Newest Blogger - Guillaume Bouchard"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}