{
  "url": "https://moz.com/blog/were-you-hit-by-negative-seo",
  "slug": "were-you-hit-by-negative-seo",
  "title": "Were You Hit by Negative SEO? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google's Penguin update has caused near-hysteria over negative SEO. While negative SEO is very real, it's also very rare. Learn how to spot the warning signs and when to worry.",
  "content": "Were You Hit by Negative SEO? Advanced SEO By: Dr. Peter J. Meyers July 12, 2012 Table of Contents Copied! By: Dr. Peter J. Meyers July 12, 2012 Were You Hit by Negative SEO? Advanced SEO Since Google’s “Penguin” update, hysteria over negative SEO has exploded, with people blaming it for every problem from falling rankings to their hands turning orange (Pro Tip: Check to see if you just ate a bag of Cheetos). I feel roughly the same way about post-Penguin negative SEO as I do about aliens. I’ve created the following graphic to illustrate my beliefs: Ok, maybe that sounded a little harsh, but here’s the point – while I believe negative SEO is possible – and I’ve seen a handful of cases where I’m pretty sure it was effective – it’s usually not the root cause of a ranking drop. In other words: most people who think they’ve been hit by negative SEO haven’t been. This post is an attempt to ease your fears and help you find out if you’re one of the 0.1% who really saw that UFO. What Is Negative SEO? Broadly defined, “negative SEO” can mean anything malicious someone does to harm your site’s rankings. Rand’s recent video on negative SEO covers many examples and is a great recap. Within the context of the Penguin update, though, negative SEO really only means one thing – that someone has launched an organized effort to make your link profile look bad. This usually means that they’ve hit you with a ton of low-quality or clearly black-hat links across a large number of domains. I don’t want to downplay attacks on your site. If you’ve had a security breach, such as a DDoS that is taking down your site or an SQL-injection attack that has modified your content or added outbound links, take it seriously and handle it quickly. With link-based “attacks,” though, the situation can get a lot trickier, and the cures can sometimes be worse than the disease. If you just start hacking at links or throw all of your time and money into fighting a perceived threat that’s not the root cause of your problem, you could set back your SEO efforts months. What Are The Signs? Let’s say you wake up one morning to find that your cat’s gone missing and your rankings have dropped. Does that mean that your competitors are up to no good? It’s possible, but I think it’s critical in 2012 SEO to step back and assess the problem. Solving the wrong problem can be catastrophic – at best, it’s just a waste of time and energy. Even if your competitors are trying to cause trouble, that doesn’t mean that what they’ve done has caused your problems. I’ve seen people do ridiculously ineffective “negative SEO” – one client’s competitor hired a low-rent firm to create a copy of the client’s site. That copy sat on a staging server in India with no links and all but the home-page blocked in Robots.txt. Was it malicious? Sure, but malicious idiots are still idiots. It wasn’t worth an international incident to take that one rogue site down. Real negative SEO takes a concerted effort and a fair amount of know-how. When someone is really attacking your link profile, and if that attack is going to be effective, you’ll typically see unexplained, low-quality links from a variety of root domains. Just slapping your link in the footer of one bad site isn’t going to bring you down – low-quality links happen in the wild all the time. You need to see a large-scale pattern. Typically, you’ll also see a sudden spike in these links. An aggressive attempt at negative SEO isn’t going to happen over years – it’s going to be done in weeks. When you see massive, unexplained growth in low-quality links, then you may have a problem. I’m not going to dive deep into the tools, but there are multiple good ones for getting different views of your link profile (and using more than one is generally a good idea): Google Webmaster Tools Open Site Explorer Majestic SEO Bing Webmaster Tools The new Bing Link Explorer replaces Yahoo! Link Explorer and seems promising, but you’ll need to sign up for their webmaster tools. Both our paid campaign management tools here on SEOmoz and Majestic's tools will track historical data about your links. Keep in mind, though, that link counts can spike for a lot of reasons. You’re not just looking for a jump in the numbers – you’re looking for a clear pattern of malicious links. Even if you do see a spike in malicious links, the impact of an attack is often temporary. Many times, people use methods that get quickly removed or discounted (such as injecting links on other sites). When the links go away, the problem often goes away. It’s not of much comfort in the short-term, I realize, but it’s easy to be so aggressive that Google spots the attack and devalues the links. Getting the balance just right isn’t easy – many attempts at negative SEO fail. Are Aliens Among Us? About 70-80% of the time someone comes to me having just spotted a bunch of unexplained low-quality links to their site, a little digging turns up that it was the result of bad SEO by either their own team or someone they hired. If it’s your own team, that’s good news (even if it doesn’t feel that way) – you might be able to undo those links more easily or even have a record of them. If you hire an outside link-building firm, make sure you get a record of what they’ve done. Once you realize they’ve trashed your link profile, it may be too late. Monitor new link builders closely and insist that they track links. If they refuse, fire them. It’s that simple. Can You Prevent It? If someone really is out to get you and wants to spend the time and money, there’s no doubt they can do a lot of damage. In most cases, though, it’s just not cost effective, and building up a wall of defenses and monitoring your links every hour isn’t cost effective for you, either. So, what can you do to prevent the most common forms of attack? Probably your best defense is to have a clean, authoritative link profile. Google is looking at your entire pattern and history of links, and if your site is strong with generally high-quality links, it’s a lot harder to do you damage with a short-term attack. The most vulnerable sites are new sites or sites that already have engaged in too much low-quality link-building. If 80% of your links are junk, it’s not going to take that much for a competitor to push you over the edge. At the risk of oversimplifying: do good SEO. I’m not trying to downplay the possibility of negative SEO – it does exist and it can do real damage. I’m trying to drive home the point that it’s still very rare, and most people are spending far too much time and money on tinfoil hats. In 99% of cases, the SEO problems of websites in 2012, even after Penguin, are self-inflicted. Start with what you control, and build a better mousetrap – it’s still your best protection from anything the competition can throw at you. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Were You Hit by Negative SEO?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Were You Hit by Negative SEO?"
    },
    {
      "level": "H1",
      "text": "What Is Negative SEO?"
    },
    {
      "level": "H1",
      "text": "What Are The Signs?"
    },
    {
      "level": "H1",
      "text": "Are Aliens Among Us?"
    },
    {
      "level": "H1",
      "text": "Can You Prevent It?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}