{
  "url": "https://moz.com/blog/whaddya-say-san-jose",
  "slug": "whaddya-say-san-jose",
  "title": "Whaddya Say, San Jose? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ah, San Jose. Your city may be boring and somewhat bland, but your conference is always a fun time. Below are the best things I overheard at SES San Jose 2007: \n\n\n    \"I hate movies where water kills the bad guy.\" -- Eric Dyck from Neverblue Media\n    \"I feel like such a...cool person!\" -- ...",
  "content": "Whaddya Say, San Jose? SEO Events By: Rebecca Kelley August 24, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley August 24, 2007 Whaddya Say, San Jose? SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Ah, San Jose. Your city may be boring and somewhat bland, but your conference is always a fun time. Below are the best things I overheard at SES San Jose 2007: \"I hate movies where water kills the bad guy.\" -- Eric Dyck from Neverblue Media \"I feel like such a...cool person!\" -- Tamar Weinberg talking about how she's a Power Digger. Tamar, you're such a dork. \"I'm going to the Google!\" -- Matt McGee talking about the Google Dance \"How about you guys give out SEOmoz water bottles that say 'SEOmoz: We quench your thirst for search!' That would be so cool!\" -- Adam Lasnik \"We came down here for a drink, and then all of these people started pouring into the bar. What the hell is going on here?!\" -- three British dudes who work for Cisco and were in town for an unrelated conference. The poor guys were so confused by all of the drunken, belligerent SEOs blathering on about links and rankings. They think we tinker with meta tags all day. Poor, naive Cisco brits. :) \"I like a good party, and any time I come home with sand in my underwear it's a good party.\" -- Naoise Osborne talking about the Google Dance (there were beach volleyball courts). \"This oil stain won't come out! Bruce is gonna kill me...\" -- Lisa Barone complaining about her stained Bruce Clay shirt \"What, does it come out of your paycheck or something?\" -- me \"If Rae Hoffman were here I'd be totally trashed by now.\" -- Tamar Weinberg \"Ooh, it comes with a table!\" -- Jill Sampey, after Pat Sexton and Frank Watson ordered a bucket of booze at dinner that did indeed come with a separate table on which to place said bucket. \"Dude, if that were me I would totally win that truck for my son!\" -- Chris Hooley discussing the movie Over the Top (which I'm assuming David Brown had just finished watching right before Search Bash...he took it higher, all right). \"When are you guys going to have a booth at a conference?\" -- Matt McGee \"Um, it's a bit expensive. Our booth would be set up on card tables. Near the bathrooms. And people would come up to it and ask us where they can get a BOTW t-shirt.\" -- me \"It would be cool if you could walk into your session to personalized music...like 'Eye of the Tiger'!\" -- Matt Cutts \"I'm going to talk to your son about not going to college.\" -- Neil Patel \"If he doesn't go to college then you better hire him.\" -- Barb Boser \"I can't afford him! He's a Boser!\" -- Neil \"So I was reading Sphinn, and I was drunk...\" -- Patrick Sexton \"Oh my God, your name is R. Kelley! Hey R. Kelley! Don't pee on me!\" -- Dax Herrera As always, share your memorable quotes below. Expect three more conference posts from me, some informative (session recaps), some somewhat informative (the pros and cons of speaking), and some are not at all informative (my triumphant return to search comics) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whaddya Say, San Jose?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whaddya Say, San Jose?"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}