{
  "url": "https://moz.com/blog/what-you-need-to-know-about-the-newtwitter",
  "slug": "what-you-need-to-know-about-the-newtwitter",
  "title": "What You Need to Know About the #NewTwitter - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " Well yesterday was a big day on Twitter, wasn't it? I don't know about you but I was glued to the live stream of the not-so top secret Twitter press conference at exactly 3:30 pm and watched closely for an hour and a half while @Ev and @Biz told us all about the new \"bigger and better\"…",
  "content": "What You Need to Know About the #NewTwitter SEO Events By: Joanna Lord September 15, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord September 15, 2010 What You Need to Know About the #NewTwitter SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Well yesterday was a big day on Twitter, wasn't it? I don't know about you but I was glued to the live stream of the not-so top secret Twitter press conference at exactly 3:30 pm and watched closely for an hour and a half while @Ev and @Biz told us all about the new \"bigger and better\" Twitter.com. The founders outlined many of the recent achievements they have seen with the growth of their community and announced the release of a brand new interface for Twitter.com, which will be rolling out to all users over the new few weeks (it's important to note that currently only 1% of users have access to the redesign, that decision was not so well received.) The new interface has a renewed focus on the user experience with in stream multi-media expansions, more search capabilities, and an all around sexier more fluid feeling. I went crazy yesterday playing with the new interface and wanted to share way too many screenshots and my thoughts on the new layout. I am excited to hear what you guys think all of these changes mean, so let's do this, shall we? What are the big changes to our beloved Twitter.com? 1. Redirect users back to THEIR WEBSITE – Whoa! I have to admit I got a little fiesty yesterday when I saw my stream fill up with tweets that said things like \"that is it?!\" and \"its just a new interface, what's the big deal?!\" Twitter has over 160 million users, but as we all know many of those users use second party Twitter clients rather than the web interface itself. Ev noted yesterday at the conference that Twitter mobile users are up 250% year over year, which was the motivation for them to release their own mobile apps earlier this year. While this mobile surge has meant huge growth for the community it hasn't done as much for their on-site value. The announcement yesterday was important because it was their first real attempt to redirect those millions of users to a more compelling on-site experience. Whatever the long term goal is for Twitter.com the website, yesterday's announcement was a huge step toward a more united community of users. This.is.a.big.deal.folks. (The new Twitter.com... ohhh pretty!) 2. A whole lot more space for .... uhmmmm advertisements? So now that we have refocused our attention and time back to Twitter.com what will they do with it? Well sell us things obviously. As you can see below there sure is a lot more space for Twitter to fill. You will notice the \"Sponsored Tweets\" and the \"Who to Follow\" elements are more prominent. In addition to that you will see some open areas (that look a lot like traditional ad space units) laced throughout the platform. In general I think its pretty clear that they used this UI redesign to give themselves more options for the up and coming advertising platform we keep hearing about. (Notice all that space they get to play with!) 3. Focus on other tweets, searches…you know uhmmm NOT your tweet During the press conference Ev mentioned specifically that Twitter is a unique community of users in that not everyone actually tweets. He noted plenty of people use it just to listen or research...very \"search enginey\" if you ask me (yes I just made that word up). The new design certainly focuses less on my actual tweet and more on the experience I am having as a Twitter user. You will see the \"search box\" was moved to top right, and has much more functionality than previously. I can see tweets with my searched word(s), \"tweets with links\" & that word, \"tweets near me\" with that word, and see profiles or people that include that searched word. This is a far better experience all around if you ask me, again compelling users to stay on Twitter.com rather than leave and search elsewhere. Smart move people, smart move.(New search experience...man I love Pumpkin Spice lattes from Starbucks) 4. Media, media, media oh my! This is probably the change you are hearing most about. The new platform has the ability to view pictures and video in stream, by expanding from the left column (your tweet stream) to the right column (now used more as an expanded view). In addition to seeing whatever multi media you clicked on you will also see people mentioned in the tweet you expanded, a brief history of that user's tweets, and the latest tweet that tweet may have been in response too. Uhmmm sound confusing? Basically the expanded view of any tweet is now much more of a comprehensive story of that tweet. No longer on the web client will you be clicking from profile to profile to read a full conversation and get context. This new layout has put the story of a tweet together for you in one place. It's smooth, trust me...you will like it! (The new platform when you expand an image... Hi Matt!) (The new platform with expanded video...ohhh puppy!) 5. All sorts of other little things You are not losing your backgrounds (phew!). Atleast right now we still have them. Also you might want to revisit your right column profile color--it's bigger now. Direct messages are up in your navigation (quite seperate from the other functionality actually) and are much more streamlined in my opinion. You now click in and see the number of DM exchanges, and can expand to see them all clearly. I was happy to see this. However you no longer see a \"number\" which was the only way us web client users knew if we had a new DM (unless we got an email notification) so be careful not to miss those new DMs! The new platform still does not support multiple users, sorry folks! Retweets. I still don't really like them, so don't hate me when I say that I am stoked they made the ability to shut off retweets from someone so much easier! It's in there next to the option to get a user's tweets on your cell. Both options are right there and a simple click to change. Easy smeasy for sure. The new platform makes replying to multiple people challenging. No longer can you hit reply and aggregate user handles in one tweet, each \"reply\" click pulls up an individual tweet box. Ugh, yuck. I hope they change this soon. (When you hit reply a box pops-up...still a bit buggy right now) \"Trends\" have some serious face time. I think we will find a lot more focus as marketers on getting our topics on the \"trend\" list (organically or not maybe eventually purchased) as I can imagine this will be much like scoring first page Digg time...similar atleast. You can see they are now top right, whoa in your face! They are calling this a \"preview\" on the interface, and when you get it you will have a notification box where you must manually click into it. You can also (atleast right now, I guess its going away in a few weeks) chose to \"leave the preview\" and return to your old interface. I don't think you will want to, but to each their own ;) That about sums up the big changes I am seeing. As for what it all means? I think this is a renewed focus on Twitter.com - the site not Twitter - the company. Both Evan and Biz alluded to lots of changes coming down the pipeline, and there is a clear energy of excitement in the stream. I don't know about you but I am certainly going to playing around more on the web interface both as a user and a marketer. I think we will have some interesting opportunities coming our way...uhmmm both as users and as marketers ;) Looking for other insights? Checked out @ev's stream from yesterday, he gave a play for play Read the official blog post about it Watch a video and learn more about it from Twitter Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What You Need to Know About the #NewTwitter"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What You Need to Know About the #NewTwitter"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}