{
  "url": "https://moz.com/blog/what-diners-write-about",
  "slug": "what-diners-write-about",
  "title": "What Diners Write About Most: A Study of Restaurant Review Place Topics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Find out what diners write about most in their reviews in Miriam’s new study. Understand the sentiment behind customer reviews and use 'Place Topics' to improve areas that customers talk about the most, to ultimately enhance your restaurant's reputation and attract new customers.",
  "content": "What Diners Write About Most: A Study of Restaurant Review Place Topics Local SEO | Reputation Management By: Miriam Ellis August 21, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis August 21, 2023 What Diners Write About Most: A Study of Restaurant Review Place Topics Local SEO | Reputation Management The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Marketing a restaurant? You already know what a huge role online reviews play in your reputation, rankings, and revenue, with 98% of US adults reading this content and 86% writing it. You may have read that there’s a demonstrable Google local ranking boost when a brand-new restaurant gets its first ten reviews. You may also have seen that many experts consider your overall Google review rating to be the sixth most important of all local search ranking factors. But have you advanced yet to full use of Google reviews as a source of business intelligence for the brands you’re marketing? Formal surveys can be costly to run, so don’t overlook the free, ongoing sentiment analysis shorthand offered right on your listings in the form of Google Place Topics, telling you at-a-glance what real-world attributes inspire reviewers to get typing. These most compelling offline components, aggregated by Google online, can give insights into the areas a business should focus on most. Back in 2020, I examined Place Topic trends for US grocery stores. Today, I’ll do the same for restaurants, and I want to emphasize that this is a case study you can do for any industry to get a sense of what drives customers to take the time to leave reviews. Given the impact of reviews on business viability, this type of study is a very smart thing to engage in! Methodology I wanted to find out which factors inspire the most mentions in restaurant reviews. This small survey looks at 250 data points. I found the top-ranked business for the phrase restaurant+city (like “restaurant sacramento”) in all 50 US state capitals. I then recorded the top 5 place topics for each restaurant, put them in a spreadsheet, and after reviewing the data, realized I could bucket the findings into three main categories: food & drink, amenities, and other. But first, what is a Google Place Topic? If you navigate from a Google Business Profile to the full review overlay, you’ll see a section right below the star rating labeled “People often mention.” Place Topics consist of this row of clickable tabs displaying the words that come up most in the review set, including the number of times each phrase was mentioned. Restaurant review results Here’s what I’ve learned: 64% of reviews for the top-ranked restaurants in state capitols across the US mention food & drink most prominently.24% mention amenities prominently.12% mention something else prominently. Under the ‘food & drink’ category, I included any reference to specific foods (tacos, risotto, coffee, etc.), any mention of meals (brunch, dinner, etc.), as well as food qualifiers like “vegan” or “gluten-free.” Fun fact: people seem very excited about paella at the moment in the United States. Under the ‘amenity’ category, I included any reference to physical amenities (patio, lake, antiques, etc.), any reference to intangible amenities (atmosphere, happy hour, entertainment, fine dining, etc.), and any reference to staff and services (bartender, valet parking, waitress). The ‘other’ category proved interesting. One thing that stood out to me was the number of references to personal celebrations, most prominently “birthday” and “anniversary.” So much is riding on a restaurant when it’s chosen to mark an occasion. There were also several compliments like “gem” and some concerning trends like “cold.” I also filed a few things in this category that weren’t immediately intelligible to me, like “6:00,” “night,” and “silver.” Fun fact: I had to figure out why reviewers kept mentioning “wall,” only to discover they were describing an eatery as a “hole-in-the-wall.” Interpreting the results Place Topics simply indicate which subjects are being mentioned most by your reviewers. For example, lots of reviews might mention your alfredo. That’s good to know as a first step. But the essential second step is to understand what people are actually saying about your alfredo. Place Topics don’t automatically tell you whether the sentiment is positive or negative. As seen above, these two reviews characterize alfredo quite differently, as being worthy of love and as being just okay, but both count as Place Topic mentions. The simplest way to drill down is to choose one of the Place Topics Google is surfacing on your listing and then combine it with a ‘Sort By’ filter. Here, you can see that I’ve combined “alfredo” with “most recent”: This filtered view will allow you to see if the most recent customers talking about your alfredo are satisfied or not. By scrolling through the reviews surfaced by this filter combo and noting down what you see, you can get a sense of present performance for a most-talked-about topic. You can then go through the same process with both the ‘Highest’ and ‘Lowest’ filters to note the best and worst sentiment you’ve ever received on the topic. You could create a spreadsheet to compare how you’re currently doing with a particular topic to your overall highs and lows. The ability to use Place Topics in combination with sorting makes the information a bit more intelligible! This workflow is reasonably manageable for the 10 Place Topics shown by Google for a single-location business. It becomes less so for each additional location of a multi-location business. And, of course, Place Topics only relate to your Google reviews - not to your customers’ sentiments across multiple review platforms. While this feature is useful, it’s limited and feels very manual. If you’re starting to realize this, you may be at a point of learning that an investment in more sophisticated sentiment analysis would make sense if it could highlight multiple most-discussed review elements across all your listings and across various platforms. In that case, you might want to sign up for software like Moz Local, with its more sophisticated sentiment analysis data and clues to whether your locations are trending upward or downward in terms of customer satisfaction: But back to the more limited Place Topics, what should you actually be doing with this information? What to do with Place Topic information I was interested to see that only one truly large restaurant chain appeared to be given a top spot for my search through the 50 state capitals: an Olive Garden in Topeka, Kansas. All the rest were small businesses. I spent a little time looking at a variety of Olive Garden listings. According to Popsugar, chicken alfredo is this well-known brand’s most popular dish, and this is borne out by it showing up as a Place Topic for the Kansas City location in my screenshots above, as well as for many other locations. The most practical use of Place Topics for restaurants (or any other businesses) is to understand that they represent the factors you must get right, because they are the things your customers will talk about most in your reviews. 86% of consumers say local business reviews are either the most important or a somewhat important factor in whether they can trust a nearby company. We can readily imagine prospective diners looking at all the sentiment about whether they can get a good alfredo at Olive Garden. If the sentiment is positive, this would be a yes. If negative, maybe not. Whatever the majority of your customers are writing about in your reviews, you need to examine those areas of your operations with a magnifying glass to ensure that you are giving customers every reason to speak well of your most prominent features. Additionally, if worrisome Place Topics are trending on your Google Business Profile, it’s an actionable piece of business intelligence. For example, if enough people are writing about food temperature to make “cold” a top Place Topic on your listing, a structural fix will be needed so that guests are no longer experiencing this problem, and other things they’re mentioning can replace this word as a Place Topic. Even during the brief period of my study, I saw Place Topics change for specific locations, so take courage from that. If the restaurant you’re marketing is experiencing a downtrend, you might also want to check out your top competitors’ Place Topics for amazing, fast insight into what their customers think they are getting right (and wrong). How does your establishment stack up, and what changes might you make to catch up? Big takeaways for today’s restaurants Overall, what we’ve learned about restaurants from this examination of Place Topics is that for top-ranked dining establishments: Your food matters most. It is the subject that the overwhelming majority of your guests will mention most in their reviews.Your amenities come second but still get lots of mentions in your reviews. This may come as no surprise, but I grew up in a funny era where the emphasis on food in restaurants threatened to disappear. As food writer M.F.K. Fisher described the 1980s, “Many of those young chefs pay more attention to the way food is arranged than the way it tastes.” And as food historian Sylvia Lovegren explains the habits of eighties two-income fueled, credit card-wielding diners in that era, “When they went out to dinner, it wasn’t to a quiet corner bistro where they could relax over a favorite and familiar dish. It was to an expensive, flashy, trendy place, where the fame of the chef or the hipness of the food might help guarantee their place in the demanding, unending struggle for status.” If Google Business Profiles had existed back then, amenities might well have topped the Place Topics, but the 2020s are a very different period, with Americans feeling poor for good reason and restaurateurs really struggling to source affordable ingredients to keep menu pricing reasonable for patrons. Given these factors, it makes sense that the actual food on the table is what drives customers to write about their experiences rather than the atmosphere or social cachet of the spot. When I look around my own town, I see how many pretty restaurants have closed over the past few years, while every night, a very ugly parking lot near me is filled to bursting with people seeking the affordable and fabulous Mexican entrees of a humble food truck: In fact, they’ve been so successful in their tiny mobile kitchen that they’ve got a second truck now, and its location, which is totally lacking in prestige or ambiance, is full now, too. Reviews tell the story of success while also helping to build it. This is a great week to form a new habit of analyzing Place Topics on a regular basis to see what matters to your best salespeople over time, perfecting your fulfillment of those components which could help your reputation most and give a meaningful boost to new customer acquisition. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Diners Write About Most: A Study of Restaurant Review Place Topics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Diners Write About Most: A Study of Restaurant Review Place Topics"
    },
    {
      "level": "H2",
      "text": "Methodology"
    },
    {
      "level": "H2",
      "text": "But first, what is a Google Place Topic?"
    },
    {
      "level": "H2",
      "text": "Restaurant review results"
    },
    {
      "level": "H2",
      "text": "Interpreting the results"
    },
    {
      "level": "H2",
      "text": "What to do with Place Topic information"
    },
    {
      "level": "H2",
      "text": "Big takeaways for today’s restaurants"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}