{
  "url": "https://moz.com/blog/what-does-a-slashdotting-look-like",
  "slug": "what-does-a-slashdotting-look-like",
  "title": "What Does a Slashdotting Look Like? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's been 24 hours (almost exactly) since SEOmoz was linked to from Slashdot, and our current traffic is still exceptionally high. The \"effect\" itself was fairly mild, affecting us negatively for only 30 minutes or so while we removed database connections from the guide and upped the MySQL…",
  "content": "What Does a Slashdotting Look Like? SEO Analytics By: Rand Fishkin December 8, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 8, 2005 What Does a Slashdotting Look Like? SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's been 24 hours (almost exactly) since SEOmoz was linked to from Slashdot, and our current traffic is still exceptionally high. The \"effect\" itself was fairly mild, affecting us negatively for only 30 minutes or so while we removed database connections from the guide and upped the MySQL simultaneous connections limit (warning to others: the default is 100, so raising that in expectation of traffic is a good idea). Below are some traffic figures for the last day: Our traffic normally sits around 1200 visitors and 8-9,000 page views per day, but, yesterday and today have combined for almost 100,000 page views and 35,000 unique visitors. There are some additional benefits to the \"effect\", including links from several other nice spots, including a re-surgence on del.icio.us/popular (which we were on for a couple days early this week) and a mention on many small blogs and re-posters of Slashdot threads. Of course, there were a few negatives - including the many uninformed and hypercritical comments on the Slashdot thread and a few angry emails about the sins of SEO. Overall, however, I couldn't be more pleased about the process. It's taught us a valuable lesson in handling traffic and hopefully can serve as a good example of link-bait, if nothing else. The guide itself was about 4 weeks of work, primarily at home, at night, in my \"free\" time. It was reviewed by several folks, including Bill Slawski and our own Kat. As to be expected, many readers have pointed out fallacies and flaws, which I appreciate. I'll be addressing as many concerns as possible (as time allows) and updating the guide to make it more valuable and accurate. I've also added an OpenOffice formatted version at the suggestion of a reader and will, possibly, be completing an intermediate-advanced level guide in the future (probably many months out). The one thing I am surprised about is that this guide, rather than the ranking factors article from a few months back, was the item to get covered. While I see the advantages to both, my impression was that the ranking factors article would be more \"up the alley\" of /. readership. But, then again, I was also surprised to see how few people tagged the guide at Digg (24) as compared to del.icio.us (928). It shows an interesting contrast between the social bookmarking communities that is worth noting for those hoping to get publicity via these outlets with their own works. For those interested, there's a long thread at cre8 on the subject and an interview that Aaron Pratt from SEOBuzzbox had with me about the beginner's guide. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Does a Slashdotting Look Like?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Does a Slashdotting Look Like?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}