{
  "url": "https://moz.com/blog/what-seos-can-learn-from-adwords",
  "slug": "what-seos-can-learn-from-adwords",
  "title": "What SEOs Can Learn from AdWords - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Taking the time to know AdWords can improve your rankings and on-site experience. Learn how SEOs can improve their game by taking cues from paid search in this Whiteboard Friday.",
  "content": "What SEOs Can Learn from AdWords Advanced SEO | Whiteboard Friday | Paid Search Marketing (PPC) By: Dana DiTomaso November 23, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dana DiTomaso November 23, 2018 What SEOs Can Learn from AdWords Advanced SEO | Whiteboard Friday | Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Organic and paid search aren't always at odds; there are times when there's benefit in knowing how they work together. Taking the time to know the ins and outs of AdWords can improve your rankings and on-site experience. In today's edition of Whiteboard Friday, our fabulous guest host Dana DiTomaso explains how SEOs can improve their game by taking cues from paid search in this Whiteboard Friday. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hi, my name is Dana DiTomaso. I'm President and Partner at Kick Point, and one of the things that we do at Kick Point is we do both SEO and paid. One of the things that's really useful is when SEO and paid work together. But what's even better is when SEOs can learn from paid to make their stuff better. One of the things that is great about AdWords or Google Ads — whenever you're watching this, it may be called one thing or the other — is that you can learn a lot from what has a high click-through rate, what performs well in paid, and paid is way faster than waiting for Google to catch up to the awesome title tags you've written or the new link building that you've done to see how it's going to perform. So I'm going to talk about four things today that you can learn from AdWords, and really these are easy things to get into in AdWords. Don't be intimidated by the interface. You can probably just get in there and look at it yourself, or talk to your AdWords person. I bet they'd be really excited that you know what a callout extension is. So we're going to start up here. 1. Negative keywords The first thing is negative keywords. Negative keywords, obviously really important. You don't want to show up for things that you shouldn't be showing up for. Often when we need to take over an AdWords account, there aren't a lot of negative keywords. But if it's a well-managed account, there are probably lots of negatives that have been added there over time. What you want to look at is if there's poor word association. So in your industry, cheap, free, jobs, and then things like reviews and coupons, if these are really popular search phrases, then maybe this is something you need to create content for or you need to think about how your service is presented in your industry. Then what you can do to change that is to see if there's something different that you can do to present this kind of information. What are the kinds of things your business doesn't want? Are you definitely not saying these things in the content of your website? Or is there a way that you can present the opposite opinion to what people might be searching for, for example? So think about that from a content perspective. 2. Title tags and meta descriptions Then the next thing are title tags and meta descriptions. Title tags and meta descriptions should never be a write it once and forget it kind of thing. If you're an on-it sort of SEO, you probably go in every once in a while and try to tweak those title tags and meta descriptions. But the problem is that sometimes there are just some that aren't performing. So go into Google Search Console, find the title tags that have low click-through rate and high rankings, and then think about what you can do to test out new ones. Then run an AdWords campaign and test out those title tags in the title of the ad. Test out new ad copy — that would be your meta descriptions — and see what actually brings a higher click-through rate. Then whichever one does, ta-da, that's your new title tags and your meta descriptions. Then add those in and then watch your click-through rate increase or decrease. Make sure to watch those rankings, because obviously title tag changes can have an impact on your rankings. But if it's something that's keyword rich, that's great. I personally like playing with meta descriptions, because I feel like meta descriptions have a bigger impact on that click-through rate than title tags do, and it's something really important to think about how are we making this unique so people want to click on us. The very best meta description I've ever seen in my life was for an SEO company, and they were ranking number one. They were obviously very confident in this ranking, because it said, \"The people above me paid. The people below me aren't as good as me. Hire me for your SEO.\" I'm like, \"That's a good meta description.\" So what can you do to bring in especially that brand voice and your personality into those titles, into those meta descriptions and test it out with ads first and see what's going to resonate with your audience. Don't just think about click-through rate for these ads. Make sure that you're thinking about conversion rate. If you have a really long sales cycle, make sure those leads that you're getting are good, because what you don't want to have happen is have an ad that people click on like crazy, they convert like crazy, and then the customers are just a total trash fire. You really want to make sure you're driving valuable business through this kind of testing. So this might be a bit more of a longer-term piece for you. 3. Word combinations The third thing you can look at are word combinations. So if you're not super familiar with AdWords, you may not be familiar with the idea of broad match modifier. So in AdWords we have broad phrases that you can search for, recipes, for example, and then anything related to the word \"recipe\" will show up. But you could put in a phrase in quotes. You could say \"chili recipes.\" Then if they say, \"I would like a chili recipe,\" it would come up. If it says \"chili crockpot recipes,\" it would not come up. Now if you had + chili + recipes, then anything with the phrase \"chili recipes\" would come up, which can be really useful. If you have a lot of different keyword combinations and you don't have time for that, you can use broad match modifier to capture a lot of them. But then you have to have a good negative keyword list, speaking as an AdWords person for a second. Now one of the things that can really come out of broad match modifier are a lot of great, new content ideas. If you look at the keywords that people had impressions from or clicks from as a result of these broad match modifier keywords, you can find the strangest phrasing that people come up with. There are lots of crazy things that people type into Google. We all know this, especially if it's voice search and it's obviously voice search. One of the fun things to do is look and see if anybody has \"okay Google\" and then the search phrase, because they said \"okay Google\" twice and then Google searched \"okay Google\" plus the phrase. That's always fun to pick up. But you can also pick up lots of different content ideas, and this can help you modify poorly performing content for example. Maybe you're just not saying the thing in the way in which your audience is saying it. AdWords gives you totally accurate data on what your customers are thinking and feeling and saying and searching. So why not use that kind of data? So definitely check out broad match modifier stuff and see what you can do to make that better. 4. Extensions Then the fourth thing is extensions. So extensions are those little snippets that can show up under an ad. You should always have all of the extensions loaded in, and then maybe Google picks some, maybe they won't, but at least they're there as an option. Now one thing that's great are callout extensions. Those are the little site links that are like free trial, and people click on those, or find out more information or menu or whatever it might be. Now testing language in those callout extensions can help you with your call-to-action buttons. Especially if you're thinking about things like people want to download a white paper, well, what's the best way to phrase that? What do you want to say for things like a submit button for your newsletter or for a contact form? Those little, tiny pieces, that are called micro-copy, what can you do by taking your highest performing callout extensions and then using those as your call-to-action copy on your website? This is really going to improve your lead click-through rate. You're going to improve the way people feel about you, and you're going to have that really nice consistency between the language that you see in your advertising and the language that you have on your website, because one thing you really want to avoid as an SEO is to get into that silo where this is SEO and this is AdWords and the two of you aren't talking to each other at all and the copy just feels completely disjointed between the paid side and the organic side. It should all be working together. So by taking the time to understand AdWords a little bit, getting to know it, getting to know what you can do with it, and then using some of that information in your SEO work, you can improve your on-site experience as well as rankings, and your paid person is probably going to appreciate that you talked to them for a little bit. Thanks. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What SEOs Can Learn from AdWords"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What SEOs Can Learn from AdWords"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1. Negative keywords"
    },
    {
      "level": "H2",
      "text": "2. Title tags and meta descriptions"
    },
    {
      "level": "H2",
      "text": "3. Word combinations"
    },
    {
      "level": "H2",
      "text": "4. Extensions"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dana DiTomaso\n          \n            Dana DiTomaso\n          \n            Dana DiTomaso"
}