{
  "url": "https://moz.com/blog/what-does-it-take-to-go-viral",
  "slug": "what-does-it-take-to-go-viral",
  "title": "What's it Take to \"Go Viral?\" 11 Traits to Give Your Idea Wings - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Online word-of-mouth can drive exponential traffic growth, attract broad media coverage, and result in tons of backlinks and social shares. Matt Round describes the 11 key traits you should include when devising interactive content that taps into the impulse to share things on Facebook and Twitter.",
  "content": "What's it Take to \"Go Viral?\" 11 Traits to Give Your Idea Wings Marketing Psychology | Content Marketing | Social Media By: Matt Round February 1, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Matt Round February 1, 2016 What's it Take to \"Go Viral?\" 11 Traits to Give Your Idea Wings Marketing Psychology | Content Marketing | Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Before joining Distilled I worked for UsVsTh3m, an experimental Trinity Mirror project, where we created hundreds of games, quizzes and daft \"toys.\" We had unprecedented freedom to try out new interactive formats, learning a great deal about what works… and what doesn’t. The key to success was \"viral\" traffic. You’ve probably heard the term bandied about in reference to something popular, and might even have rolled your eyes; it’s a much-abused buzzword. The idea is that online word-of-mouth can drive exponential traffic growth and broad media coverage with little or no traditional promotional support, but achieving this requires a certain way of thinking. This article focuses on interactive content, but many of the same principles will apply to other formats. The viral life cycleIt’s useful to aim for interactive content to be… Clickable — When someone sees a link and description (on social media or a site), it seems compelling enough to take a look. Playable — The visitor sticks with it and finds it enjoyable or interesting. Shareable — There’s a strong urge to tell others, often involving the visitor sharing their individual result/score. You usually need all three aspects to be strong to get a viral hit. It’s easy to focus on one, an experienced team can usually achieve two, but it’s difficult to consistently get the full set. Crudely, you can think of it in terms of losing potential sharers, ultimately needing to end up with more than one to start the next cycle(s). This image explains it nicely:Congratulations, it’s going viral! That’s a massive simplification, but a helpful one. 11 ways to make it shareable1. AttributesDevelop a concept that ties in with the player’s personal attributes: age, location, abilities, personality, etc. For example, measuring reaction time in milliseconds is fine… but if you can correlate it with age, then you’ve immediately got something far more compelling. 2. TribesReinforce a sense of belonging; tribes can be regional, generational, interest-based, political, etc. Perhaps play different tribes off against each other so that your interactive content can address niche groups while having broad appeal overall. 3. InsightsIt tells you something about yourself or, more likely, confirms a flattering/intriguing attribute, leading into... 4. HumblebragsSharing to make yourself look good… but without it seeming too blatant. 5. “One more go…”Ensure the player is hooked and will want others to share in that. Although bear in mind that the best games often aren’t the most viral — adding multiple levels and features to a game tends to put off non-gamers and can actually reduce sharing (enthusiasm has a chance to ebb away, and the game will tend to end on a low note when the player finally fails or quits). 6. TopicalPeople are impressed by fast-turnaround topical content, and sharing it can show you’re up-to-date (perhaps even the first in your social circle to discover something). We regularly developed and launched games in half a day at UsVsTh3m, and more than once within an hour. This obviously isn’t feasible for most commercial projects, but with more agile development and approval processes you can reduce lead times. 7. DelightOverwhelm the senses: strong use of music, dance, animation, spectacular explosions, anything that’s a straightforward pleasure. 8. Competition“Can you beat this score?” 9. Comparison“I got this result, how about you?” This is much \"softer\" than direct competition and typically more welcoming for a broad audience. 10. CollaboratingThings like global counters, polls, or territorial maps can create the sense of playing your part in a bigger cause. Even just clicking something to increment a number can be made hard to resist with the right \"cause.\"11. QualityIt’s still possible for something to succeed simply by being good, but in the absence of any other aspects it’d better be really good. Knock-your-socks-off good. Of course, all of the above overlap and interrelate, and it’s by no means an exhaustive list. Telling the worldSomething that’s strongly viral can actually just be exposed to a few hundred people via Twitter or Facebook. It won’t need a big push; the viral mechanism will ensure it spreads and attracts media attention. It’s often useful to accompany a launch with relevant press material, perhaps teasing out key angles or supplementary content/data to suit each type of media outlet. Don’t force a story if there isn’t one, though; you don’t want to jeopardize later coverage based around “this cool thing is going viral.”If the stats are showing it’s strongly going viral (this should be obvious within minutes), you’re then in the fortunate position of planning for success. Keep an eye out for initial coverage that may benefit from additional material, and look to do a follow-up press campaign at a suitable milestone (e.g. at X million visitors, or when you have interesting data to share), broadening the coverage. If it’s not going viral, stop and consider whether minor changes to wording might make it more clickable. Look at whether it needs to break into a niche audience or broaden its appeal, and retarget accordingly. Although Twitter drives far less traffic than Facebook, it offers more freedom to experiment, target influential individuals, and re-promote over time. If a topical angle may arise, perhaps wait and be ready to repackage and relaunch at a moment’s notice. Case studies: Two simple games that went viralThe North-o-MeterUsVsTh3m’s North-o-Meter (sadly, this is currently broken due to hosting issues) used multiple-choice questions to guesstimate how Northern/Southern you are. Despite being entirely UK-focused, within just 4 days of launch it had 3.6 million visitors, 1 million Likes, 1.1 million comments on Facebook, and 41,000 tweets. It went on to get millions more visits, virtually saturating the potential audience. Countless similar quizzes had used this topic before, so why did this one make such a big impact? It was clickable because the wording of tweets and Facebook posts worked well, teasing the Northern/Southern cultural identity element in a way that seemed intriguing and non-threatening. It was playable thanks to working well on mobile (people were playing and comparing scores late into Friday nights down the pub), being easy to play and giving constant visual feedback, unlike many similar things that simply ape static magazine personality quizzes. It was shareable by tapping into attributes (location/origin), tribes (north vs. south), insights (using mundane questions to infer something greater), competition, comparison, and quality (the visual feedback and often surprisingly accurate conclusions). Northern/Southern cultural identity is immensely strong in the UK. It’s a key part of how many people define themselves. The whole quiz was grounded in honest personal experience. One of our young journalists had written about moving to London, and the way it resonated with people led us to think about how to apply that to an interactive format. Naming a specific place to go with the percentage meant it sometimes got the player’s location/origin spot-on, so they were then likely to share it in a very enthusiastic way.How Old Are Your Reactions?How Old Are Your Reactions?, produced by Distilled for JustPark, is a simple web game where you stop a car with a tap/click. Your reaction time is then used to look up the corresponding age for that score, based on a survey of 2,000 players. Our thinking beforehand was that it would work well due to the following aspects: It would be clickable by setting an intriguing personal challenge. It would be playable thanks to clear, quick gameplay and good presentation, including full mobile compatibility. It would be shareable due to attributes (age and reactions), insights (inferring age from reactions), humblebrags (impressively young age result), \"one more go…\" (few will play it just once), competition, comparison, and quality. Age is a key personal attribute, and age estimation prompts a great deal of conversation and comparison, whether the result is accurate or lower/higher than the player’s actual age. Lively conversations on Facebook help ensure visibility. Driving is a relevant, relatable way to dress the game up, particularly for this brand. A straightforward, bare-bones reactions test would have been \"colder\" and less engaging. The combination of elements would allow for multiple storytelling angles in coverage, to do with good-natured rivalry between generations, road safety, etc. This all seems to have been borne out by the stats since launch: Over 3 million unique page views, nearly 300,000 social shares, and links from over 400 domains. In summary…Always ask yourself: How can we make it clickable, playable, and shareable? Judge your ideas harshly — you need all three. Which sharing impulses can it tap into? It should be possible to readily pick out a few motivations, or refine the concept to strengthen this aspect. What will be the best way to capitalize on success? Be ready to build a story around it, using popularity as the foundation for broad and varied coverage. The way people share and interact is constantly changing, and reaching large audiences is always challenging, but the approaches I’ve outlined can help you to devise interactive content that’ll have a great shot at going viral. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What's it Take to \"Go Viral?\" 11 Traits to Give Your Idea Wings"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What's it Take to \"Go Viral?\" 11 Traits to Give Your Idea Wings"
    },
    {
      "level": "H2",
      "text": "The viral life cycle"
    },
    {
      "level": "H2",
      "text": "11 ways to make it shareable"
    },
    {
      "level": "H3",
      "text": "1. Attributes"
    },
    {
      "level": "H3",
      "text": "2. Tribes"
    },
    {
      "level": "H3",
      "text": "3. Insights"
    },
    {
      "level": "H3",
      "text": "4. Humblebrags"
    },
    {
      "level": "H3",
      "text": "5. “One more go…”"
    },
    {
      "level": "H3",
      "text": "6. Topical"
    },
    {
      "level": "H3",
      "text": "7. Delight"
    },
    {
      "level": "H3",
      "text": "8. Competition"
    },
    {
      "level": "H3",
      "text": "9. Comparison"
    },
    {
      "level": "H3",
      "text": "10. Collaborating"
    },
    {
      "level": "H3",
      "text": "11. Quality"
    },
    {
      "level": "H2",
      "text": "Telling the world"
    },
    {
      "level": "H2",
      "text": "Case studies: Two simple games that went viral"
    },
    {
      "level": "H3",
      "text": "The North-o-Meter"
    },
    {
      "level": "H3",
      "text": "How Old Are Your Reactions?"
    },
    {
      "level": "H2",
      "text": "In summary…"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matt Round\n          \n            Matt Round"
}