{
  "url": "https://moz.com/blog/what-we-believe-why-seomozs-tagfee-tenets",
  "slug": "what-we-believe-why-seomozs-tagfee-tenets",
  "title": "What We Believe and Why: SEOmoz's TAGFEE Tenets - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At SEOmoz, like many companies, we have a collection of internal documents related to our goals with the business and the ideals we strive towards. A couple years ago, I wrote a post about some of our efforts in that direction, but last year, we authored a document called \"The TAGFEE Tenets\" that…",
  "content": "What We Believe and Why: SEOmoz's TAGFEE Tenets Moz News By: Rand Fishkin February 15, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 15, 2010 What We Believe and Why: SEOmoz's TAGFEE Tenets Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Warning: This post isn't about SEO or online marketing. The focus is on our growth as a startup and our adoption of company values and how we represent those internally and externally. Since transparency remains one of our guiding principles, we felt it only appropriate to share our work in this area - hopefully you can take something away that will provide value in your startup, entrepreneurial endeavors or career path. At SEOmoz, like many companies, we have a collection of internal documents related to our goals with the business and the ideals we strive towards. A couple years ago, I wrote a post about some of our efforts in that direction, but last year, we authored a document called \"The TAGFEE Tenets\" that represents more about what we want to be. Today, I want to share that document with you. SEOmoz's Guiding Principles This document represents the rules we have created and ideals we strive towards for all the work we produce as a company. We embrace these as the embodiment of who we are, why we exist and what we endeavor to achieve in every arena - from software to website content to actions in the workplace and on the road as representatives of SEOmoz. The TAGFEE Code Despite the immense challenges that we have faced and continue to face, we refuse to indulge in negativity or pessimism. We are an organization that believes in empowering people to be their best.\" - Talal Abu-Ghazaleh The TAGFEE code reflects the core values of SEOmoz. It defines not only SEOmoz's strategic differentiation in the highly competitive field of SEO, but also helps to set the standard of quality for all work and content produced. We acknowledge that we are entirely responsible for SEOmoz's reputation, and that the level of success we achieve, the reputation we cultivate, and the contributions we make to the SEO industry are a direct reflection not only of the company, but of ourselves. In short, we are SEOmoz, and by adhering to these standards, we guarantee both we and our work will be Transparent and Authentic, Generous, Fun, Empathetic, and Exceptional. Transparent and Authentic Criteria Am I being as open and honest as possible (without causing any harm)? Am I accurately representing my opinions and my values? Tenets We share the inner-workings of our company - both the good and bad - openly with our community. We take responsibility for our mistakes and will do what we can to rectify them. We will represent ourselves and our intentions honestly to our co-workers and our clients. We will be ourselves, even if that means being occasionally silly, a little less than perfect, and (at times) more than a little dorky. Why we believe in it We at SEOmoz have differentiated ourselves from others in our sphere through our transparency, and open, honest dialogue - sharing behind-the-scenes information about the company and our products (even when that information is not entirely positive), and providing our opinions on trends and happenings in the industry, even if they differ from everyone else's views. We don't need to share this information - we do so because we want to, as we believe it improves our company in several ways: It strengthens our community, giving our readers and subscribers a voice and sense of ownership in the company (equating with brand loyalty). It holds us accountable to our customers, as they are able to weigh in on many of the company's decisions. It keeps us honest and true to ourselves - you can't hide when your company is an open book. It is consistent with our goal of sharing knowledge not only about the field of SEO, but about the experience of running and owning a start-up. To quote Rand, \"We want our community to participate in the adventure that is SEOmoz.\" It keeps us honest and realistic about our limitations, our intentions, and our products. We openly recognize our strengths and areas that need improvement, and share this knowledge with our community. An overly-congratulatory, jargon-laden, car-salesman approach would neither be true to our brand or ourselves. Examples Rand's blog posts about the SEOmoz story. Divulging the entirety of SEOmoz's finances in 2006 (a proclamation that we have repeated yearly, despite some limitations after having taken VC). Maintaining an open dialogue on the SEOmoz blog, even when comments are negative or critical. Disclosing our opinions and directions around contentious subjects (e.g. paid links). Exceptions Our openness has earned us a loyal following. Withholding information sometimes creates negative backlash. Nevertheless, there are circumstances under which we will not reveal information: When it would be materially harmful to the company. Rand refrained from sharing specifics about which partners he met with at VC firms, and does not reveal certain aspects of financial metrics. When it would be damaging to our competitiveness. We withheld information about Linkscape until launch because we felt that revealing this might be detrimental to the project's goals. When revealing such information would be irrelevant or would risk violating our value of Empathy. We refrain from revealing any private or potentially sensitive information about employees, investors, colleagues, or other members of the SEO community. When the board specifically requests that we not release any information about certain internal goings-on at the company. Generous Criteria Am I being as helpful as I can? Am I giving back to the community? Tenets We will over-deliver whenever we can, providing our clients and subscribers with more than their money's worth. We will provide compliments, referrals, and testimonials (that we truly believe in), and will not take compensation for them. We believe that generosity is its own reward, but also helps to make us profitable, as we receive referrals, sign-ups, positive testimonials, and accolades from the community. Why we believe in it. SEOmoz was created as (and remains to this day) a .org domain. The initial goal was to create a blog in which Rand could share with others what he learned about SEO - with no intention of monetizing it. Interestingly enough, this proved surprisingly successful. By focusing on providing a great deal of content and tools to our readers at no cost, we create brand-loyalty and awareness, and trust in our products. This, in turn, leads to profitability, as more and more readers, drawn in by what we offer for free, are compelled to sign up for premium membership. This model has also worked incredibly well for the SEOmoz PRO training seminars, which are priced lower than others of its kind. Though it provides the company with comparatively low profit margins, it opens attendees up to the SEOmoz brand and has repeatedly led to positive press and coverage. Our commitment to being generous extends beyond simply sharing information. We also strive to be generous with our time and finances in order to build stronger relationships with colleagues and staff. We take visiting SEOs out to lunch or dinner, invite them to tour the office, provide referrals (for which we refuse compensation), and host meet-ups and tweet-ups. SEOmoz employees are offered competitive salaries, stock options, and substantial vacation time. Examples Providing an SEOmoz member with accommodations to a conference, when he could not otherwise afford them. Giving away free consulting work to organizations like the UN & Seattle Children's Hospital. Danny Sullivan offering Rand his first conference pass to SES New York for free. Helping other startups with SEO, introductions to VCs, positive press coverage on the blog and sharing our experiences & lessons. Providing free PRO memberships to SEOs doing charity work and for projects to raise money like IM Charity parties. Fun Criteria Are we celebrating our strengths? Are we having fun yet? Tenets We will pursue projects that we find exciting and interesting. When faced with a task that we don't find particularly enjoyable, we will strive to make it a positive experience or steer clear. We are dedicated to creating and maintaining a relaxed and friendly work environment. We will celebrate one another and our achievements. We will bring fun to our clients and subscribers in unique ways. Why we believe in it Because work is only work if you make it so. We want to bring fun and enjoyment to the workplace. If we're enjoying ourselves, we figure we'll be more productive, more resistant to stress, and better all-around at doing our jobs. Consequently, we celebrate creative, independent thinking, and our own unique strengths. Some of our best products and our biggest successes arose from mozzers pursuing their own whims and doing what they do best: Linkscape Visualization and Comparison Tool, the Competitive Link Finder (Nick & Ben building cool tools on top of Linkscape data). Whiteboard Friday (Scott Willoughby's impromptu idea). Danny Dover's popular checklist blog posts. In addition to bringing fun to the workplace, we also are dedicated to bringing it to our subscribers and clients. Our blog posts, tools, and seminars are not only useful, but enjoyable. We hope our incorporation of whimsical graphics, fun anecdotes, t-shirts, stickers, and Roger mozbot will bring smiles and a bit of levity to the average work day. Examples SEOmoz's casual dress code, flexible hours, and open office layout. Company events and celebrations such as the 2,000 subscribers party and Danny's Champagne Wednesdays. Team lunches, birthdays, and snacks (thanks, Christine and Arden). Conference comics, Werewolf Card decks, ridiculous Rand-as-Santa videos, our Facebook photos & videos, etc. Empathetic Criteria Am I being respectful of the thoughts and feelings of others? Can I proudly stand behind my work and my statements? Tenets We treat others the way we wish to be treated - with respect for their thoughts, feelings, and opinions. We will strive to maintain the highest level of professionalism, never resorting to personal attacks or name-calling. We will not participate in or be distracted by gossip, negativity or insults. Why we believe in it We respect the desires and feelings of everyone with whom we work. This includes not only employees, but colleagues, community members, clients, investors, and even direct competitors and detractors. We respect their personal lives and consider them separate from their professional lives (and therefore not a topic of discussion). Before producing any product, blog post, or even an email, we must ask ourselves if it is as considerate of the feelings of others as we personally hope to be. By doing so, we feel we will help bring an air of professionalism and focus to our industry, and not be distracted by petty conflicts, disagreements, or gossip. While many sites in our industry fall into that trap, we hope to establish SEOmoz as a drama-free oasis. While we personally like reading \"snarky' writing, we reject it as a voice or tone for our professional environment. We want to be humorous and fun, but always in a positive, uplifting way. We believe that this approach to community is one we can all feel good about contributing to every day. Issues of Contention Even during disputes or disagreements, we will strive to make our point without dismissing or debasing anyone else's ideas. We will give and accept constructive criticism with the understanding that it will help make us, and our company, even better. In the case of a disagreement or debate regarding an SEO issue, we will focus on using \"I\" statements to make our claims: \"I believe x.\" \"I think the best approach is y.\" We will not address personal attacks made against the character of SEOmoz employees or members on other sites (and will remove them from our site if/when they appear), as we feel this is the strongest and best way to stifle such discourse. Obviously, we will refrain from making personal attacks, direct or implied, against anyone, be they critic or competitor. Topics Acceptable topics: In addition to anything directly related to the search and advertising industry, we can comment on positive changes in the personal lives of SEOs (congratulating SEOs on wedding days, engagements, births, etc.), new hirings at major companies, tips and tricks for improving rankings, white-hat tactics. We will report on unsubstantiated or rumored news or reports relevant to the industry, but we will be sure to frame them appropriately (\"We heard that Yahoo might be considering x.\") Off-limit topics: divorce, firings, affairs, sexual relations, accusations, slander, insults (even if it pertains to a job or project that was poorly executed, it can be expressed in a better way), personal attacks, gossip, outing spam, critiques of general social groups or demographics, unethical or illegal SEO tactics. Note: SEOmoz has created a more in-depth, often updated document for internal reference. It includes a list of topics that should either not be mentioned on the blog at all, or mentioned with high-sensitivity (that is, pending review from Sarah/Rand). Examples include the deal terms of our venture financing, members & topics from the search marketing community that have a high proclivity for negative content, patent pending technology related to our products, legal issues, etc. Examples Behavior that meets the Empathetic criterion: Supporting others in their time of need. Remembering that we are all people first, and professionals second. Refraining from posting about firings of specific individuals, even when they pertain to the industry. Layoffs could be mentioned, as long as it is relevant to the industry, newsworthy, and done with empathy and tact (though specific individuals should not be targeted or pointed out). Offering refunds when a customer is dissatisfied. Responding to all customer services inquiries and tweets in a timely manner, with courtesy and competency. Behavior that would not meet the Empathetic criterion: During a panel on link-bait, an SEO mentioned (in jest) that writing about the personal sex life of a woman in the industry would gain a you a lot of traffic. While the individuals in question were friends and it was done in an attempt at humor, we would consider this off-limits. Using any sort of shock-tactics or inflammatory language (including misleading content), to gain more traffic or links. Using insulting or degrading language (either towards readers or fellow SEOs) under the guise of being instructive. Writing a \"snarky\" blog post that degrades, humiliates, insults or demeans others in any way. We should no longer write blog posts like this attack on Robert Scoble (we might critique his content, but would not do it in such a personal way). We should also try to re-cast future posts like this rant against startup marketing advice to be more focused on the positive and less harshly critical. Exceptional Criteria Is it the best it can be? Is it uniquely better than anything else out there? Tenets We will utilize all of our skills to create high-quality, well-designed software, code, tools, and products. We will consistently strive to do so on-time and on-budget. We will endeavor to be leaders in our industry, providing unique, unparalleled information, products, and customer service to our clients and customers. We will never sacrifice quality for profitability. We will make SEOmoz synonymous with SEO. We will make ourselves known through speaking engagements, webinars, videos, and interviews, all the while delivering the same level of quality and excellence we strive towards. Why We Believe It SEO is a new and growing industry - an excellent platform on which we can prove ourselves to be best in the field. Apple made MP3 players accessible and usable for everyone - not just geeks and gadget-lovers. Julia Child translated French cooking for the average home cook. We believe we can do the same for SEO. Through high-quality, unique content, tools, and products, we can make SEO tangible, understandable, and accessible to all. We won't provide our subscribers and readers with tools or information that is inaccurate or \"needs work.\" Nor will we create sub-par products simply for the sake of doing so, or for making a profit. Whatever we create, we aim for it to be better than any other resource or tool of its kind. Our work will be worthy of us. Examples Linkscape & Open Site Explorer Whiteboard Fridays PRO Training Seminars The SEOmoz blog Our Amazing Staff! How Do We Use this Document? It's one of the first items we send to potential employees we're considering hiring, to help them get a feel for who we are and what we want to be. We give it to everyone who blogs or answers Q+A as an associate for SEOmoz (e.g. Dr. Pete, Michael Cottam, the Distilled crew, etc.) to help guide them in comment moderation and provide best practices for the content we produce (both publicly on the blog or privately in answer to Q+A). We shared it with potential investors after initial meetings turned into interest to help provide a sense of the character SEOmoz strives towards. We use it every day in meetings and decisions about product, content, strategy, hiring and more. We apply it to every new hire, asking ourselves whether they can be stalwart supporters of these tenets. If you've ever met with me to talk about startups and entrepreneurship, you've doubtlessly heard me ramble on about the importance of \"culture.\" SEOmoz has had a lot of success in the past 3 years, and it's my belief that our biggest risk isn't competition or macro-economic factors or even technological challenges (though all of these certainly require effort). I worry about most culture going \"sideways.\" If our best and brightest start leaving SEOmoz because they no longer believe we stand behind our principles or if the executive team, and most importantly, I, don't embody TAGFEE, we have risk. Conversely, if we can summon the will and the drive to work hard, both at execution of our tasks and adherence to these criteria, we have a great shot at building something amazing. As always, we warmly welcome your thoughts and contributions on both TAGFEE and the concept of startups embracing values overall. p.s. We also invite everyone in the SEOmoz community to judge us against the TAGFEE tenets and let us know if you see us stray or feel that some action we take isn't \"TAGFEE\" (it's an adjective we use a lot internally). You've helped so much to make us who we are today, and we are humbled and honored by the contributions everyone in the SEO field has made to helping us build the culture and community here. We hope you'll continue to help, both in cheering us on and in steering us back to the right path when we stray. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What We Believe and Why: SEOmoz's TAGFEE Tenets"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What We Believe and Why: SEOmoz's TAGFEE Tenets"
    },
    {
      "level": "H2",
      "text": "SEOmoz's Guiding Principles"
    },
    {
      "level": "H2",
      "text": "Transparent and Authentic"
    },
    {
      "level": "H2",
      "text": "Generous"
    },
    {
      "level": "H2",
      "text": "Fun"
    },
    {
      "level": "H2",
      "text": "Empathetic"
    },
    {
      "level": "H2",
      "text": "Exceptional"
    },
    {
      "level": "H2",
      "text": "How Do We Use this Document?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}