{
  "url": "https://moz.com/blog/what-a-decade-of-working-in-digital-marketing-has-taught-me",
  "slug": "what-a-decade-of-working-in-digital-marketing-has-taught-me",
  "title": "What a Decade of Working in Digital Marketing Has Taught Me - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'd like to share 10 lessons I wish someone had taught me when I started out in SEO and conversion rate optimization. I recently celebrated 10 years in digital marketing and this is my way of giving back to the community. Thanks also to my fellow marketing consultants who shared illustrative…",
  "content": "What a Decade of Working in Digital Marketing Has Taught Me Conversion Rate Optimization (CRO) | SEO Consulting By: Gabriel Goldenberg October 13, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Gabriel Goldenberg October 13, 2016 What a Decade of Working in Digital Marketing Has Taught Me Conversion Rate Optimization (CRO) | SEO Consulting This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I'd like to share 10 lessons I wish someone had taught me when I started out in SEO and conversion rate optimization. I recently celebrated 10 years in digital marketing and this is my way of giving back to the community. Thanks also to my fellow marketing consultants who shared illustrative anecdotes for this article.#10: The details and technology change, but the principles remain the sameWhen I started doing SEO, you had people debating if content or links were more important. Guess what? They're both still key elements of a sound SEO strategy. One of the people who exemplifies this is Barry Schwartz (above, right; photo courtesy of Real Jerusalem Streets) of Search Engine Roundtable and Rustybrick web development fame. Before anyone else clued in that the app stores were basically new search engines, he was already performing app store optimization, one of many experiences he's shared with others. OK, so there's been a shift in social media usage from forums to Facebook groups. MySpace lost its lead. Instagram and Pinterest didn't exist 10 years ago. But guess what you need to do on Facebook groups, Instagram, and Pinterest? Provide uniquely valuable content and get other users to talk it up and link to it. So don't hesitate to learn from older books that tell you about Myspace or direct mail. Just think about how you can apply those principles with the technology of today. #9: Relationships are key and require constant maintenanceDuncan Morris and Will Critchlow of Distilled were some of the friendliest Moz community members I built relationships with in my early days in the industry. They warmly greeted me at my first conference ever, SMX West. Worried that I wouldn't know anyone during the networking, they quickly allayed that concern. Friends count for so much in this industry. They have referred excellent quality leads to me, and with a warm intro to boot. They've shared my content, unique tactical ideas that aren't blogged about anywhere, and simply been immensely good to me in so many ways. I’m not the only one who feels this way. “I have made some of my closest industry friends at conferences, and we are lucky that people in our industry are so willing to help others. Whenever I have a question about marketing, there is always someone I can find to ask on Skype, email, WhatsApp, Facebook or LinkedIn that can share insight based on their experiences,” says veteran SEO Eli Schwartz. My friends at Shout hold this is to be a key part of their social media efforts: “Sharing the content of those in your network can be of vast help in developing and maintaining relationships with influencers and prospects.” Conversely, many relationships I formed withered over time. When I reached out to restart the relationship, a fair number of people declined to reconnect. Other relationships were lost because I had so neglected the relationship that I’d outright forgotten who many contacts were.This is the biggest mistake I’ve made. #8: Do one thing at a time and persevere past initial failuresWhenever I've tried to run multiple businesses, the results have always been mediocre. My repeated attempts at affiliate marketing have yielded lackluster revenue numbers. My main business has always been consulting, so affiliate marketing was just not something I had time to focus on.\"Focusing on one thing at a time will significantly increase your chance at achieving breakthroughs,\" says Arik Liberman, CEO at Pagewiz. \"The decision to grow Pagewiz as a self-funded start-up limited us to certain things, but it also taught us about our competitive advantages. Instead of spreading our marketing budget thin across multiple initiatives, we simply focused on landing page optimization. That focus allowed us to rapidly achieve a low cost-per-acquisition in a very competitive market.\"Here's what I noticed as leading me to embarking on half-hearted projects, and how I finally overcame the bad habit:I'd read an affiliate marketer's blog where they described their success in juicy, tactical detail. I went off to see what I could do similarly. Then I'd do some research, figure out a traffic source (usually organic search), and start. The same holds true outside of affiliate marketing. I read about someone's success at drop shipping and thought, \"Where can I source products, too?\"Nowadays, I do two things: Avoid the blogs touting ways to make money online. If I get the impulse to go start a new site, campaign, etc., I first ask myself, \"Will I commit to improving and testing this over at least six months?\" If the answer is that I'll give up easily, then it's not worth pursuing.This is true of clients as well — if they can't commit to at least six months, what's the point of starting?SEO Jordan Kasteler has an interesting approach that helps him stay focused: \"Do one thing at a time, and persevere past initial failures really hits home. One of the biggest contributors to the downfall of my former agency was being fractured, not focused. With so many opportunities available to us, we tried to do them all, but all were done sub-par. Had we focused, we'd have succeeded in our area of focus.” #7: There’s no right marketing channel for everyoneEach channel has unique traits that make it right for different purposes. The point is to simply look at your goals and work backwards to see which channel(s) are better for achieving them.Besides unique pros and cons, each channel also has its own loopholes and quirks. For example, Gmail's introduction of the separate tabs for social and promotions did a lot to hurt the value of email lists. That’s a pretty big quirk. Another type of quirk is a channel loophole. Loopholes in marketing channels exist today, existed yesterday, and will continue to exist indefinitely. Moz community member Hamlet Batista is very successful in the extremely competitive affiliate marketing niche.There's no use fretting over these quirks. Provided that you're not harming others, it's typically legal to benefit from them — and it can be perfectly moral in the right conditions.#6: There are diminishing returns on reading blog posts and articles If your main source of learning is blog posts, podcasts and the like, you're reviewing more than you need to and missing out on learning new things.You need structured and comprehensive content to help you in the areas that marketing-related content cannot.This is where reading books, attending conferences, and networking are really valuable. Another approach if you prefer to stay with blogs is to curate the good stuff for yourself, as Bonnie Stefanick of Internet Marketing Ninjas shares:“You can use a curated social media feed as a gateway for finding topics, authors, and good in-depth reads. I've used Twitter in the past and now Facebook for creating a great curated feed. I built up a followers list of authoritative people and continuously curate the feed — culling anyone from it that does not share anything useful or interesting. After some jiggering overt time, my feeds are now great live streams that only show me the most relevant interesting blogs and articles found by subject matter experts that I know, trust, and who are not sharing content just for the promotion. You'd be surprised how many smart people have written self-published books and other really great in-depth content that is under the radar!” #5: Systems are the key to order and repeatabilityHere are some questions that have come up in real life situations for myself and others in the absence of systems. They show you the value in creating systems, which are step-by-step recipes for achieving specific results, with clear metrics and hierarchy for accountability, within a clear timeframe. Are you indispensable to the business' successful function?Why are you writing a new proposal from scratch? Again?Why did that new employee not perform the service the way you intended it? Didn't his CV list five years of experience doing exactly this?How come you feel like dropping your clients and withdrawing into a shell?The above are some of the sad, unfortunate symptoms of a business in a systems-vacuum crisis. Without systems, there are no benchmark results to define success or failure. Therefore, document how you do any given thing as if you were writing a how-to blog post. Include baseline metrics, who is accountable for running this process, who will hold them accountable, and how long it takes to complete the task. #4: An incredible channel specialist or manager will not necessarily make an incredible agency founderThere's a myth that if a channel specialist can drive lots of traffic to a site, then they can just as easily start their own sites or agency. While the myth boosts specialists' salaries, it doesn't correlate to reality. In reality, an agency founder does much more than the specialist’s job. A CRO agency founder may do that for himself and clients, but likely also handles networking, HR, compensation, accounting, legal, marketing and sales, building and equipment maintenance, etc. Realize that business skills are more important than technical skills and have a larger impact on a company’s success, says SEO expert Matt Antonino of Stack Digital. “When I was a photographer I would often debate what makes the better business: someone who is amazing at photography but average at business, or someone who is phenomenal in business but an average photographer. Over the years I watched people come and go. Without fail, great photographers who didn't understand business would go away, being greatly outmatched by fantastic businesspeople who got their processes right. There's a lot more to a great business than doing a good [technical] job.”#3: Learn the ropes on someone else's dime and continue learning after you strike out on your ownWhen I started consulting on SEO, I naively thought that by learning the techniques really well, I'd be able to make a lot of money as a consultant. I made lots of mistakes. This wouldn't be such a big deal if someone else was paying me a regular wage the whole time. As a consultant, however, I reaped not just 100% of the profits; I bore 100% of the costs for my errors. And there are far more than I care to recall. Jason Englert (left to right), Gab Goldenberg and Carlos del Rio, founder of Agillian Search Marketing, who helped me score a free copy of the phenomenal book Web Design For ROI.Be humble.This is especially important if you've got less than five years of experience in the field, or if you've only worked as a channel specialist. Before striking out on your own, learn more of the business by asking for responsibility for key processes like lead generation, sales, project management, and managing staff. You've got a lot more mistakes ahead of you, and it's a lot safer and less stressful to make them while you’re getting a regular salary.(Tip for newbie consultants: No one taught me how to close sales; I was terrible at it for ages. I’m very grateful to Jason Swenk for teaching me his system for doing so.) #2: The Lean Startup movement cracked the code on market researchWhen I was studying in college, our textbooks on starting a small business had advice like \"use Dun and Bradstreet databases to evaluate market size.\"Or do representative surveys, etc. Sure, because young cash-strapped entrepreneurs have got thousands of dollars to plunk down on a national phone survey.Fortunately, you don't need a lot of cash to do market research if you use Lean methodologies.Spot a pattern in common pain points and demographics — and you've identified a market. Repeat the interviewing process with mock attempts at selling your product — and you've really got insight into what you need to say and to whom. So many small businesses fail because they skipped their market research. Accordingly, they think everyone is their market or don't understand the benefit they provide their customers. By creating a system which entrepreneurs can use to research their market with minimal capital investments, Lean methodology has made market research accessible to the masses. The increase in survival and success rates of small businesses will take a generation or more to measure in its full impact, yet anecdotal evidence already shows there is a revolution taking place. If you're starting a digital marketing agency, consider spending some time doing problem-solution interviews to better understand your market.#1: There's no substitute for passion (not even money)One of the most passionate men who ever lived, Theodore Herzl. Photo via Hebrew University film archives.If you don't like what you're doing, then no salary or client fees will ever be enough for you. Your boredom and self-loathing will catch up with you and you won't see things through. I talked about that above with affiliate marketing, but it also affected my core business, SEO and conversion consulting. I got fed up with the psychological toll of building links for small clients. The best links often come from manual requests, yet the payoff is delayed. (\"When was the last time Google crawled this professor's crusty research links page? What anchor text did he use?\")So those with small budgets can't afford quality work because it's time-intensive and the results take a while to be seen. I worked with a number of smaller clients who wanted results quickly, and the depressing cycle of them being here today, gone tomorrow takes a psychological toll. You feel like you suck or your clients suck or the field just sucks and think, \"Why do I bother anyway?\" (Tip for small clients: Look for an SEO consultant specializing in your niche so that they can afford to maintain relationships that can be tapped for your benefit.) Similarly, my blogging on my own site suffered largely as a result of my gradual loss of passion for the field. On the one hand, being that much of my reading was focused on the blogosphere, I got bored when I discovered the diminishing marginal returns on reading blogs. I stopped learning, yet learning was the fuel for my passion. This, plus burnout, plus the above psychological fatigue with SEO did a lot to killing my passion. As content marketer Paul Jacobson writes: “If you’re not proud of it, don’t serve it. If you can’t do a good job, don’t take it on. If it’s going to distract you from the work that truly matters, pass.\"What most easily inspires great work that matters and that inspires pride? Stuff you’re passionate about. What are you doing to ensure you stay passionate about your work? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What a Decade of Working in Digital Marketing Has Taught Me"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What a Decade of Working in Digital Marketing Has Taught Me"
    },
    {
      "level": "H2",
      "text": "#10: The details and technology change, but the principles remain the same"
    },
    {
      "level": "H2",
      "text": "#9: Relationships are key and require constant maintenance"
    },
    {
      "level": "H2",
      "text": "#8: Do one thing at a time and persevere past initial failures"
    },
    {
      "level": "H2",
      "text": "#7: There’s no right marketing channel for everyone"
    },
    {
      "level": "H2",
      "text": "#6: There are diminishing returns on reading blog posts and articles"
    },
    {
      "level": "H2",
      "text": "#5: Systems are the key to order and repeatability"
    },
    {
      "level": "H2",
      "text": "#4: An incredible channel specialist or manager will not necessarily make an incredible agency founder"
    },
    {
      "level": "H2",
      "text": "#3: Learn the ropes on someone else's dime and continue learning after you strike out on your own"
    },
    {
      "level": "H2",
      "text": "#2: The Lean Startup movement cracked the code on market research"
    },
    {
      "level": "H2",
      "text": "#1: There's no substitute for passion (not even money)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How Our Website Conversion Strategy Increased Business Inquiries by 37%"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gabriel Goldenberg\n          \n            Gabriel Goldenberg\n          \n            Gabriel Goldenberg"
}