{
  "url": "https://moz.com/blog/whats-wrong-with-facebook-groups",
  "slug": "whats-wrong-with-facebook-groups",
  "title": "Whats wrong with Facebook Groups? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Now now… don’t get me wrong. I do love facebook – and all its brilliant applications and gossip value (word of mouth for the posh ones…). But…How many of us join various groups? I know I do – quite a few. I flit in and out of quite a few and stick to the interesting ones, more often than not events…",
  "content": "Whats wrong with Facebook Groups? Social Media By: Rishi Lakhani September 17, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Rishi Lakhani September 17, 2007 Whats wrong with Facebook Groups? Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Now now… don’t get me wrong. I do love Facebook – and all its brilliant applications and gossip value (word of mouth for the posh ones…). But… How many of us join various groups? I know I do – quite a few. I flit in and out of quite a few and stick to the interesting ones, which more often than not turn out to be events groups. But I believe that Facebook would be an excellent platform to develop these groups into fully fledged commercial and useful resources for any business. The only problems are the limitations. More in a bit. First about some sponsored groups: The Wal-Mart Roommate Style Match: Membership: 1219. Features: (taken from web strategies): “Your Personal Checklist”, eCommerce links to Walmart.com, “The Roommate Style Match Quiz”, Personal persona wizard, eCommerce hooks, “Mix and match roommate styles“, SoundCheck” Media samples of popular bands, “College Store” Green products Freshman tips. Apple Students: Membership: 423,641.Features: “Itunes” Itunes related news and releases. “Made on Mac” a look at student artists using Mac and reviews of new talent “Student store” discounted deals for students on Mac products Both of these belong to the “sponsored groups” categories. That is, companies pay for the ability to personalise these, and as you can see in both examples, there are some really cool features. A sponsored group runs from $150K for 3 months to $300K for 3 months. A hefty chunky of money on any account. But I am not interested in paying. To me, Social Media is all about the FREE publicity I can generate. So what’s my bugbear? I am not even pissed off about the fact that once your group reaches 1000 members you cant email them all. In a nutshell, the free Facebook Groups are glorified notice boards or at best bulletin / forum boards. I mean compare the personal profiles that you can create and all the lovely stuff you can add: RSS posts, HTML links, HTML boxes (your content ported over?), Split categories for discussion, Various video plugins (not limited to YouTube or Google video HTML links), mini-feeds for everything and a whole host of others that I wont mention - because I am lazy. But the groups is a different story – when you post a video to the groups, it doesn’t show up as a mini-feed, but as a posted item. You can’t categorise your posts into different topics. The links you post become part of the posted items – which means you can't run a series of useful links unless you create a special “forum –type” post. The related groups seems to be aggregates of what I and the member base subscribe to, rather than actual related groups – administrators should be allowed to pick and choose these. And worst of all, you can’t import your feeds into groups. I would love to subscribe to various feeds for my group – which means that the members can be alerted to the various goings on in related external websites. Now that sounds like a rant, and maybe it is. But what the hell – I want to be heard! Come on Facebook – give the groups some more features, or at least let us add those beautiful applications that spring up overnight. And I am sure that a whole new community will start building applications for groups to use… Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whats wrong with Facebook Groups?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whats wrong with Facebook Groups?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rishi Lakhani\n          \n            Rishi Lakhani\n          \n            Rishi Lakhani"
}