{
  "url": "https://moz.com/blog/what-are-your-thoughts-about-optimizing-for-product-variations",
  "slug": "what-are-your-thoughts-about-optimizing-for-product-variations",
  "title": "What Are Your Thoughts About Optimizing for Product Variations? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently I have been looking into rankings for long tail key phrases which are related to product variations. Here is what I mean by product variation: Say your website is selling scarves and you have a page which is for wool scarf. Now that particular type of wool scarf is available in 10…",
  "content": "What Are Your Thoughts About Optimizing for Product Variations? On-page SEO S By: sahota April 30, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: sahota April 30, 2009 What Are Your Thoughts About Optimizing for Product Variations? On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. First, this is my first post, so forgive for any mistakes I make while writing this. I hope you will share your experiences politely :) Recently I have been looking into rankings for long tail key phrases which are related to product variations. Here is what I mean by product variation: Say your website is selling scarves and you have a page which is for wool scarf. Now that particular type of wool scarf is available in 10 different colours, so black wool scarf is a product variation of wool scarf. From a usability point of view, it makes sense to make one product page and then list all colours available on that page. But I was thinking about how you can optimize the website for product colour variations. As these key phrases will convert more, it becomes more important to optimize your website for long key phrases related to product variations. I think there are two ways to go about it: Optimize the main product page for all long tail key phrases also. (Point some links with proper long tail key phrases in anchor text, and try using colour names in copy of page) Create separate pages for variations of the product while still keeping the main product page as it is. Point 2 is straightforward, you just create as many pages as you have colour variations and maybe link to them from a sort of product selector page, which gives users options to select a scarf by colour, size, etc. Regarding the first option, I am not really sure how you can do this without compromising usability of the page. I have been able to rank well just using method 1 for some long tail key phrases, but some are really difficult to break into as there is a lot of competition. I also have tried using method 2, which I have found to be the quickest way to get ranked for these long tail key phrases. I was wondering how you all have gone about solving this problem. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Are Your Thoughts About Optimizing for Product Variations?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Are Your Thoughts About Optimizing for Product Variations?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "sahota\n          \n            sahota"
}