{
  "url": "https://moz.com/blog/what-really-makes-a-top-seo-the-ultimate-abbreviated-top-10-wishlist",
  "slug": "what-really-makes-a-top-seo-the-ultimate-abbreviated-top-10-wishlist",
  "title": "What REALLY Makes a Top SEO: The Ultimate Abbreviated Top 10 Wishlist - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "1.   Tech… You understand everything, absolutely everything that is posted on Google Webmaster Central Blog and Digital Point Design & Development Forums and more, you know that flash is not entirely a bad, and that AJAX and JavaScript can be effectively coded in. You also realize that maintenance…",
  "content": "What REALLY Makes a Top SEO: The Ultimate Abbreviated Top 10 Wishlist Public Relations L By: lauramaccallow@yahoo.co.uk August 20, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! L By: lauramaccallow@yahoo.co.uk August 20, 2007 What REALLY Makes a Top SEO: The Ultimate Abbreviated Top 10 Wishlist Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. 1. Tech You understand everything, absolutely everything that is posted on Google Webmaster Central Blog and Digital Point Design & Development Forums and more, you know that flash is not entirely bad, and that AJAX and JavaScript can be effectively coded in. You also realize that maintenance and SEO objectives for a client are entirely different beasts, and you can identify the issues quickly and easily that explain them in a way non-techies understand. 2. Design You understand the value of CSS, that users are going to drive your sales, and that you can have an aesthetic site that works. PCM is one of your favorite acronyms, even if it is not your primary concern – SEO is one part of a bigger picture. 3. Content You can write meaningful copy that is relevant, on topic, and focuses on your prime volume-driving keywords. If you want to make money, let the long tail take care of itself…it's overrated. You know the character limitations for Google for the header html elements, and what they deliver in terms of relevance and bang for your buck/effort. You realize the value of ellipsis use and placement.. 4. Personality Meeting new people is your second favorite thing, and you speak to clients and other SEO folk with ease, authority, humor, and diplomacy. Even if the other guy is an ass, you make him feel knowledgeable. You love a challenge, you are cautious but confident, aware but not arrogant, authoritative but not obtuse, prepared to work for what you want to achieve, capable of working in a team or alone, good on the phone, easygoing and have a super cool sense of humor, and you’re ambitious. 5. Self-control You can attend conference events and not get pissed as a fart when meeting new people, and an inner sense of style ensures that you don’t say the wrong thing, ever. 6. Manners You are always discrete about who you have met, it’s a small industry, and the people are super friendly – it is a bad idea to alienate, embarrass or be full of unnecessary bonhomie. The celebs in SEO are a small version of the celebs in any industry, but with far more grace and panache. Remember, you aren’t the first fan for them, though it’s your first time meeting them. They are approached constantly… don’t go home and ask for a digg, a link or IM or Aim them etc for no reason, and asking for Linkedin connections when you have just met someone for the first time is usually not a great plan. Also, lewd jokes about someones anatomy, true or untrue, are unlikely to endear them to you. 7. General Knowledge You have an organized, relevant set of high profile, interesting and knowledgeable blogs and forums (no names mentioned here) that you regularly read for the latest info. You maintain a highly relevant and up to date research base covering all aspects of SEO and remember the data like you do your birthday. And you monitor more general research sites and make sure you get regular Jupiter Media, HitWise, Comscore etc reports relevant to SEO and your client industry. 8. Web analytics You have intimate knowledge of Omniture and other top grade web analytics tools which you make use of to track visitors, page views, revenue, engine exposure, top referrers and more, and you understand what everything means both to the extent where you can begin to feasibly forecast behavioral trends for your clients. 9. Who’s Who You know who the top SEO players are, both by name and by knowledge, and you check their blogs regularly as well (those which are not in your regular feed as per point 7). 10. The Engines You understand as much as is possible to of the working of the various algorithms based on patents, experience and research, and you have at least 1 rep at each major engine, who is not only a contact, but a friend you have carefully cultivated – and you read the official and unofficial blogs for all the major engines.. and then some. *BONUS Wishlist Factor* 11. You love SEOmoz... and are a premium member. Case in point - be diplomatic – I probably should have added ‘don’t ass-kiss’, but then again – this IS a wish-list, and I’m failing… so ass-kissing in this case is probably necessary :) (sidenote...I call it being a crawley-bum-lick, but most people this side of the pond understand ass-kising better...) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What REALLY Makes a Top SEO: The Ultimate Abbreviated Top 10 Wishlist"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What REALLY Makes a Top SEO: The Ultimate Abbreviated Top 10 Wishlist"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "lauramaccallow@yahoo.co.uk\n          \n            lauramaccallow@yahoo.co.uk"
}