{
  "url": "https://moz.com/blog/what-bookworm-needs-to-do-landing-page-redesign",
  "slug": "what-bookworm-needs-to-do-landing-page-redesign",
  "title": "What BookWorm Needs to Do - Landing Page Redesign - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "After reading Gab’s problems with Google I have decided that the community might enjoy talking about some of the decisions that you can make in designing your landing pages with a concrete example....",
  "content": "What BookWorm Needs to Do - Landing Page Redesign Design C By: Carlos del Rio April 14, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Carlos del Rio April 14, 2008 What BookWorm Needs to Do - Landing Page Redesign Design This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. After reading Gab’s problems with Google, I have decided that the community might enjoy talking about some of the decisions that you can make in designing your landing pages with a concrete example. Gab’s Pro Member Page Revised SEOmoz Pro Landing Page Telling a story Gab took the tact of telling his story with SEOmoz. Story is most valuable to Humanistic users. Excerpt from: Internet Transactions - Customer Types Humanistic – people who connect through human story, driven by emotions Methodical – people who connect through logic, driven by information Competitive – people who connect through comparison, driven by a mix of emotion and timing Spontaneous – people who connect through immediate interactions, driven by a mix of emotion and information Focusing on Humanistics is probably a good choice because SEOmoz is very community focused, something that Humanistic users really dig. So, I followed the same pattern, telling my story. Design Gab built a simple page that relies on the user's browser set-up to control how people see the content. I decided to go very simple also so this doesn’t become a coding post. The major points that I changed are adding: A better looking portrait ;) A doctype; I use this <!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\"> it is the easiest to adhere to. One DIV to control the width of my content so it always looks the same, regardless of the user. What I did can be done inline like this: style=”width:550px; margin:auto;” Content Gab makes an attempt at setting the premise of his page: The SEOmoz Pro Online SEO training program teaches you everything from linkbuilding to permanent redirects. I've written a review here to help inform your decision whether or not to sign up. That is his H1 header. It is too long, and not actually the content that he provides. He should use something punchier, like “Why I Would Pay More For SEOmoz Pro” or “Why I Am An SEOmoz Pro Member.” These lead into his story. Using a picture in your story is good; I kept that element. Gab also uses bold to select out a point in the first paragraph. That is good in theory, but be careful with long emphasis as it doesn’t highlight the right information. You want people to be drawn to the sentence, so only bold the first clause. I reiterate my headline before moving on to why I recommend and support SEOmoz. Because we are making a long copy page, we need to revisit the central point: the value to the reader. Through the copy I use \"Why I Use SEOmoz Pro\" to highlight benefits and continue the story. I include references to solving common problems, like ranking in Google. Also I try to focus more on the reader with 2nd person language, a list of features toward the end, and a personal testimonial, a high profile testimonial, NYT, and finally my e-mail address. This is an important note. Many people have an aversion to affiliate pages, so it is important for them to have an indication that you stand behind your content. Other Things to Consider Neither of us included price. That is a decision that you need to strongly consider. Also be mindful of where you put someone on the site. SEOmoz allows deep linking--linking to something other than the sign-up. Consider what expectations you are fulfilling when you send visitors to a page. Finally, Gab bought a domain for this project, but he is making a stand-alone page. He could easily make a mini-site that would be more informative and allow all 4 customer types a different way to engage the material. Hopefully this has helped some. I really enjoyed this project and will start doing a weekly SEO or landing page review on my blog. If you have a page that you would like feedback on, visit this post or send me a message. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What BookWorm Needs to Do - Landing Page Redesign"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What BookWorm Needs to Do - Landing Page Redesign"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Carlos del Rio\n          \n            Carlos del Rio\n          \n            Carlos del Rio"
}