{
  "url": "https://moz.com/blog/what-i-want-for-christmas-from-adsense",
  "slug": "what-i-want-for-christmas-from-adsense",
  "title": "What I Want for Christmas from Adsense - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google Adsense is one of the best programs ever to hit the web.  It  allows webmasters to easily monitize their sites and has been a treasure  trove for many. As good as it is, I think that it can be better.  Here's  my wish list of what I would like to see added.  Some of these wishes  are…",
  "content": "What I Want for Christmas from Adsense Paid Search Marketing (PPC) E By: EGOL May 26, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL May 26, 2006 What I Want for Christmas from Adsense Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google Adsense is one of the best programs ever to hit the web. It allows webmasters to easily monitize their sites and has been a treasure trove for many. As good as it is, I think that it can be better. Here's my wish list of what I would like to see added. Some of these wishes are available to publishers with enormous traffic - but I would like to see them offered to anyone... 1) More Ad Formats! Right now there are only 11 ad formats - but there are an infiite number of website formats. I would put adsense in a lot more places if I had additional format choices. As an example the 160x600 skyscraper is great. But it takes up an enormous block of valuable space. I would use 160x300 or 160x200 a lot - in prominent places - if they were available. Right now most of the ad units are BIG blocks, but a webmaster who values her content might want more flexibililty. Better yet... let me provide a height and width and let google automatically format the ads.2) Related Topic Ads: Contextual is fine if you have an info site. However, if I have a retail site I really don't want my direct competitors ads enticing my customers. I would use Adsense on lots more pages if I could run *related* topic ads instead of competing topic ads. Let's say I have a site that sells hiking gear, I would not want ads for boots and backpacks on my site. However, if I could select ads about \"vacation destinations\" or \"physical fitness\" I think that I would be happy running the ads right beside my merchandise. There could also be a \"general interest\" category that would contain G rated ads that could be used on any website.3) Optimize My Palette For Me: I really like having the ability to select four different ad colors to show on my site. Google shows them randomly now, but maybe they could pick the color scheme that does best and display that one more often.4) Fix the 120 Wide Ads: Long URLs in the 120 wide ad formats are chopped off and look really bad. I would never publish that on my site if I had control over the content - and if I was the person paying for the adwords I would not want my URLs truncated. The solution is simple - delete the URL if it is too long to show nicely. : )5) Dump Deceiving Ads: I see lots of ads for FREE LAPTOP COMPUTER (or whatever I am selling on my retail pages). Those get lots of clicks but here is what happens on lots of those sites.... they are rip offs who are simply gunning for your email addres, your snail mail address and any other information that they can weasel out of you. I am willing to bet one month's pay that nobody gets a free laptop from those guys. You click through the ad, fill out fifteen pages of forms asking for lots of personal information, then at the end they want your credit card info or the link to your prize is broken. They want to have 100 page forms or credit card demands so that you quit the survey after they got their goodies from the first two pages. Some of my website visitors might think that I am endorsing those stinky advertisers! I think that Google should look under the hood of some of these advertisters.6) Adsense University? Zillions of dollars are changing hands through contextual advertising but Google has only a small amount of teaching/learning information on the web to help webmasters cash in. Sure, there are a lot of commercial products out there that preach.... \"slap two large rectangles at Page Top and watch the bucks roll in\"... (my personal opinion is that paints a target in your site and makes your SERPs disappear). That's great for spam sites but how about someone who takes a lot of pride in their content. These sites are the building the web. They are reinvesting their adsense earnings into bigger and better content. Everybody on the planet wins if these sites make more money. Adsense team... this could be one of the highest ROI projects on this planet!7) How and Why Case Studies: I enjoy looking at the adsense case studies and snooping their sites. I'd like to hear more about why this placement, format, ad type was used so that I can better understand what's happening. Those are the keys to \"understanding adsense\" vs \"slapping up ads\". That's what allows you to apply intelligently on your own site. These could be part of field courses at Adsense University.8) Adsense and Analytics: Placing adsense on your website is like making any other change. It can improve user engagement with your site and it can kill user engagement. The only way to really understand this is through analytics. I have yet to see any publication that addresses the interrelationships between contextual advertising and changes in the click paths taken through a website. On some sites the adsense can actually be content but on other sites the adsense will be in competition with the content. The winning adsense implementations might well be those that generate income without distracting interested visitors from the content - my suspicion is that adsense sitesearch and bottom of page adsense are in the good implimentations category here. I think that this could be one of the PhD level courses at Adsense Univeristy.9) New Site Search Formats: How about site search that integrates adsense on the right side of the SERPs, at the bottom of SERP pages or at other locations that I have not thought of. Better yet how about templates like we get at Blogger so that we can make the SERPs look exactly like the rest of our site?10) Adsense News: No, not \"What's new with adsense?\"... I am talking about a hybrid that merges Google News, Adsense, and Webmaster produced content. How about building something like Blogger but that has keyword triggered news instead of blog posts? Webmasters could then have pages on their site that are on-topic \"industry related news\" but with adsense integrated tastefully. Maybe I would have the option of inserting a few news items of my own too. I use Blogger in this example because it has a template that I can use to dress it up to look exactly like the rest of my site. Syndicated news content earns money in lots of other markets.11) All Revenue Producing Ads: When there are not enough adsense ads to supply multiple ad units, how about simply repeating the existing ads instead of sending blank ad units or units that do not produce revenue? 12) More Guidance on Alternative Ads: When I display alternative ads, let me know if these will be spidered and counted when assessing my page content or outgoing links. Should I use no-follow on those ads? I think that I see alternative ad links in my link: querries at Yahoo! OK... That's my greedy little list for Santa. What's on your list? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What I Want for Christmas from Adsense"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What I Want for Christmas from Adsense"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}