{
  "url": "https://moz.com/blog/what-a-links-page-should-look-like",
  "slug": "what-a-links-page-should-look-like",
  "title": "What a Links Page Should Look Like - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The question was asked at HighRankings, but I think it's a great, universal question for site builders. What do visitors want from a links page and what should we, therefore, provide.\nMy personal feeling is that your outbound links should be structured in one of 3 ways:\n\nWhen appropriate, link…",
  "content": "What a Links Page Should Look Like Link Building By: Rand Fishkin October 14, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 14, 2005 What a Links Page Should Look Like Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The question was asked at HighRankings, but I think it's a great, universal question for site builders. What do visitors want from a links page and what should we, therefore, provide. My personal feeling is that your outbound links should be structured in one of 3 ways: When appropriate, link directly from content. This is particularly applicable if you're citing a study, a journal or another web page. Links can be in articles, news, blog entries, even biographies and be valuable and helpful to your readers. If you're providing lists of resources on subject matter, split them into the most usable segments possible. In some instances, this may mean a full fledged directory with a categorical structure and multiple levels but in most cases, it simply means seperating links into 3-10 lists, ordered by the type of service or knowledge they provide. Citation or additional references lists at the bottom or sidebar of long article pages are also helpful. This fits the format model for academic and research papers and can serve to help readers who need more information or additional substance to help back up your findings/suppositions. Beyond these formats, there are others that can be used properly, but the worst kind of link pages are the ones I see most often - lengthy, useless lists of links with \"optimized\" anchor text and virtually no compelling description or logical reason that ties them to the site they're on. It may not be today or tomorrow, but one day, search engines are going to start discounting or even penalizing these smaller versions of the \"link farm\". Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What a Links Page Should Look Like"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What a Links Page Should Look Like"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}