{
  "url": "https://moz.com/blog/what-are-your-best-tips-for-link-builders",
  "slug": "what-are-your-best-tips-for-link-builders",
  "title": "SEO Tips for Link Builders - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you want to boost rankings, few things are as effective as link building. It's also the one of the hardest and most time consuming parts of SEO. I'd love to hear from others, so in the comments below share your best or most unique tips for link builders.",
  "content": "What Are Your Best Tips for Link Builders? Link Building By: Justin Briggs December 5, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Justin Briggs December 5, 2010 What Are Your Best Tips for Link Builders? Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you want to boost rankings, few things are as effective as link building. It's also one of the hardest and most time consuming parts of SEO. I'd love to hear from others, so in the comments below share your best or most unique tips for link builders. Following are nine of my best SEO tips to help you as a link builder. You may already be using some of these, but hopefully you'll find a helpful nugget of information in here. #1 Hide Behind Content Strategies If you want to want to engage in less than pearly white link building tactics, do it behind cover of content based tactics. Consider some of the tools available today, which can publicly show link velocity graphs (links acquired over time). Graph from MajesticSEO.com If a spike in links acquired happens without any other change to your site, it may appear a bit suspicious. I recommend starting your link building push at the same time as launching content. This way, there is a corresponding purpose behind a spike in your link profile. #2 Be Approachable When sending out link request emails, try to be approachable. I recommend including an offer to speak with them over the phone. It's just one more trust element, and can set you apart from mass link request emails. Another way to be approachable is building links as a girl. Girls seem to build links more effectively than boys. Geoff, who’s been working with me on link building recently, wrote a pretty clever post about using OKCupid data to improve link requests. Being non-traditional can help put people at ease. Recently, I got a link by using this in a link request email. \"I think it'd be epic to bust out in Spanish like Stewie on Family Guy while blowing the head off a zombie with a shotgun\" A non-conventional link request is more effective than a standard \"Dear Webmaster\" email. And always test your emails, because some small changes can go a long way. I was able to increase my response rate on a campaign from 20% to 87% by reframing the link request. I find that less formal emails work better. #3 Know the Basic of Sales A few of my more valuable experiences as a link builder were the ones that taught me how to be better at sales. Knowing how to be persuasive can improve your link building. I recommend approaching a link building request as a sales pitch to be closed. Build a relationship first. Help them out. Be a bit manipulative. Frame the request. Create a sense of urgency. Overcome objections. Make them a hero. Some books I’ve enjoyed reading are Never Eat Alone, Predictably Irrational and the Little Red Book of Selling. #4 Mining for Information Dig in deep to find a prospective linker's contact information. It's a bit like stalking, but spending the extra time to find a way to get in touch can pay off. I've found it useful to search email address on major social media sites, then cross reference any usernames or screen names I found with KnowEm. This can help find alternative ways to connect with a webmaster other than email. I recommend using CTRL + F to search for rewritten email addresses. For example, check for [at], (at), a/t, [dot], d0t, etc. A lot of webmasters hide their contact information from spam bots by rewriting it. This destroys any obvious pattern, which can make finding the email tricky, but searching for some common rewrites usually does the trick. #5 Get Smarter About Guest Blogging “Matt made a point to mention that users are more likely to click on the first link in an article as opposed to a link at the bottom of the article. He said put your most important links at the top of the article. I believe it was Matt hinting to SEOs about this.” - Search Engine Land As guest blogging becomes mainstream, it’s getting spammed more. I think guest blogging is great, but if this becomes a spammed link building tactic, expect it to become less effective, especially as SEOs start to automate guest blogging. #6 Paid Links Work Although I don’t support paid links, let’s just say that paid links work. There is a lot of risk associated with buying links, but if you’re going to. Don’t buy obvious paid links. Don’t buy from networks. Don’t buy from anyone who discloses selling links. Don’t use perfect anchor text, especially high value terms. Buy links to link magnets and linkbait. Mix it up and have no pattern. Buy for juice / trust and not just anchors. Donate and sponsor. Just because you can, doesn’t mean I’m saying you should. SEOmoz doesn’t endorse buying links and there are ways to buy links without buying links. #7 A Robust Profile, Not Just A Robust Link. We all have a concept of the “perfect” link, but obtaining a link that’s relevant, high authority, and has the right anchor text is challenging. I recommend building out a robust *profile*. Get what you can, where you can. I can get my juice in one place and my anchors somewhere else. A lot of tactics that shouldn’t work still do, especially on sites that have an authoritative link profile otherwise. If you have a site with a strong link profile, but lacks anchor text optimization, think of some easy ways to get the anchor text you want. #8 Understand Diminishing Returns Shoot for domain diversity when building links. At a certain point, the marginal value of a link from a particular domain starts to reduce. If you look at a factor like anchor text, the marginal value of a link may become negative. Get a link from a domain and move on. (20 links on 20 domains > 20 links on 2 domains) Vary your anchor text often. (Over optimization can suppress rankings) #9 Keep Up With New SEO Tips and Tricks Some of my favorites over the last few months are link profile visualization, Multi-links for Firefox, and that Excel and Google Docs have hyperlink functions. (Thanks to Tom & Ben for the hyperlink protip.) I’ve even shared one of my own tricks, which is using GCSE to replace Yahoo! linkdomain. Keeping your finger on the pulse of the link building community can help you find these little nuggets. Other than SEOmoz and Distilled, I really like stuff put out by Wiep, Ontolo, SEER, Blogstorm, and SEO Gadget. I'd love to hear everyone else's tips and ideas. Feel free to connect with me on Twitter if you ever want to chat about link building. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Are Your Best Tips for Link Builders?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Are Your Best Tips for Link Builders?"
    },
    {
      "level": "H2",
      "text": "#1 Hide Behind Content Strategies"
    },
    {
      "level": "H2",
      "text": "#2 Be Approachable"
    },
    {
      "level": "H2",
      "text": "#3 Know the Basic of Sales"
    },
    {
      "level": "H2",
      "text": "#4 Mining for Information"
    },
    {
      "level": "H2",
      "text": "#5 Get Smarter About Guest Blogging"
    },
    {
      "level": "H2",
      "text": "#6 Paid Links Work"
    },
    {
      "level": "H2",
      "text": "#7 A Robust Profile, Not Just A Robust Link."
    },
    {
      "level": "H2",
      "text": "#8 Understand Diminishing Returns"
    },
    {
      "level": "H2",
      "text": "#9 Keep Up With New SEO Tips and Tricks"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Justin Briggs\n          \n            Justin Briggs\n          \n            Justin Briggs"
}