{
  "url": "https://moz.com/blog/what-does-the-moz-in-seomoz-mean",
  "slug": "what-does-the-moz-in-seomoz-mean",
  "title": "What does the moz in SEOmoz mean? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I think I get asked this question on average 4X per week, more during conferences and after we've been in the press and less when I hide in the cupboard and make Brandon answer the phones. It's certainly a valid one, though and deserving of a definitive answer.\nHere's what the \"moz\" in SEOmoz…",
  "content": "What does the moz in SEOmoz mean? Moz News By: Rand Fishkin November 5, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 5, 2006 What does the moz in SEOmoz mean? Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I think I get asked this question on average 4X per week, more during conferences and after we've been in the press and less when I hide in the cupboard and make Brandon answer the phones. It's certainly a valid one, though and deserving of a definitive answer. Here's what the \"moz\" in SEOmoz means: We're building off the history of organizations like DMOZ, Mozilla, Chefmoz, etc. - attempting to be open and engaged with our visitors Our company will be as transparent in its practices as possible, disclosing the kinds of competitive information that is normally kept secret We want to allow our users to participate in our project (thus, in the new version of SEOmoz, anyone will be able to contribute a blog entry in a separate, user-generated section - though this will be moderated) We try to aspire to the ideals of honesty, openness and integrity in everything we do. Although we haven't always perfectly lived up to this standard, it remains our guiding principle, rather than Google's \"Do No Evil,\" SEOmoz is here to do \"as much good as possible\" for individuals, companies, clients and media in the SEO space It's a bit cheesy, and it's actually not the most profitable way to operate a company. But, it is a great marketing tactic - one that's brought us a great deal of visibility - and a great way to make us proud of what we do. The \"moz\" is one of the things about our business that helps me sleep better at night, knowing that almost every day, at least a few people have benefited in their business or with their personal online endeavors, by reading SEOmoz. BTW - I'm in no way suggesting that this is the only ethical way to run a company - far from it. I'm simply saying that this is the way Gillian and I had always wanted to run our company. p.s. Lisa and Susan, now you don't have to capture Rebecca to find out. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What does the moz in SEOmoz mean?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What does the moz in SEOmoz mean?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}