{
  "url": "https://moz.com/blog/what-seos-can-learn-from-publishing",
  "slug": "what-seos-can-learn-from-publishing",
  "title": "Applying Lessons from the Publishing Industry to SEO Consulting - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this post-panda arena, the scramble to produce high-quality, compelling content is as real as ever, and lessons need to be learned fast. Let the publishing industry be your guide.",
  "content": "Applying Lessons from the Publishing Industry to SEO Consulting SEO Consulting By: Sarah Kershaw January 27, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Sarah Kershaw January 27, 2014 Applying Lessons from the Publishing Industry to SEO Consulting SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. \"Search has been less and less relevant since Facebook released News Feed. Now we get the vast majority of our traffic via social, and about 1-2% from search\" – Chris Dannen from Fast Co Labs \"We benefited a ton from an early SEO audit thanks to IAC's SEO pros, but once the right framework was in place, it's been up to us as content creators to really dig deep into Google Analytics to determine where the opportunities lie…\" – Jordan Shakeshaft, editorial director of Life by DailyBurn \"None\" was another person's response to my question about the role of SEO within her company. \"There's very little of actual value in it for us.\" This from a respected British magazine. In preparation for this post, I started thinking about publishers and their plans for 2014, specifically their growth strategies for the coming year. My thought was that as the publishing industry usually leads the way when it comes to new content techniques and products, it is at the forefront of publishing initiatives. As publishers blaze new trails, we as consultants have the opportunity to learn by proxy, observing what has worked and what has not. These observations can then be applied to our own clients' content creation. In this post-panda arena, the scramble to produce high-quality, compelling content is as real as ever, and lessons need to be learned fast. Let the publishing industry be your guide; come, walk with me. In researching this post, I spoke to a combination of editors, industry analysts and publishing company employees. The quotes are representative of my contacts and their responses, but it is in no way comprehensive for the publishing industry as whole. As per the quotes above, the sobering reality is that, at best, publishers see SEO as just one small part of their marketing strategy. Moz's very own legend, Dr. Pete, has been trying to tell us this for a while, encouraging the search community to look beyond rankings. Our goal as consultants is to continue to add value in this altogether more varied landscape. The good news is that we can if we leverage our technical knowledge and use this to present some of the newer ideas, beyond our usual scope, to our clients. This post is an examination of some of the other opportunities publishers are pursuing this year, along with my dreams for what they could be doing and some tips on how to present these ideas to clients. What are publishers doing for growth? 1) Investing in site redesigns The internet was all aflutter earlier this month, when The New York Times launched its site redesign. That project, in addition to generating buzz, traffic, and links, was the site's first major redesign since 2006. The main visual changes include: Changing of fonts and font colours so it more closely resembles the print edition. The links from the home page to the categories page are now black, not blue for example. Article comments now appear on the right-hand side of the article, allowing comments to receive the same level of visibility as the article. Infinite scroll, rather than pagination. A much more minimal look on article pages with more white space. This redesign freshens up the look of the page as a whole and the cleaner, sparer UI is more in keeping with what other publications are doing. This video from Fi talks us through its process for redesigning USAToday.com, which has several design features in common with the Times' update. The insight: Good design matters. Your access point: When presenting ideas of this ilk to your clients, it is important to be in cahoots with the designers. Your aim is to collaborate in these projects, ideally from initial conception. The advantage of being an outsider weighing in on a site redesign is that you are invariably not bound by the limitations of a CMS or the like; you are free to see the site and where it stands in relation to industry competitors with a detached view. You can represent SEO and call on your experiences with redesigns to offer suggestions. 2) Embracing social You probably already know that social networks are an increasingly important means of discovery, and amongst the under-45s, they are the most popular method of finding content. Social becomes more and more important as user groups get younger. For example, 44% of 18- to 24-year-olds rely on social, versus just 19% of users over 55. This is illustrated by this graph from the Reuters Institute's Digital News Report 2013: Clearly, if you wish to build long term trust with your users, social networks are critical for getting your content in front of younger users. It goes without saying that social networks are also now critical for engagement among all age groups. What is surprising is the extent to which publishers are still missing this opportunity, whilst newer companies such as Upworthy and Buzzfeed are swooping in and winning traffic. This recent article from the Media Briefing visualizes how some of the media players are doing on Facebook, and the newsworthy part is that none of the more established players feature at all. In short, they are not getting it right. The winners in this particular data set are companies that have been formed within the last eight years (Buzzfeed was formed in 2006, Upworthy in 2012); the Huffington Post is the old guard here, and that is only nine years old. The results are clear Upworthy and Buzzfeed have mastered the sort of content that gets people sharing. Whilst the audience may eventually tire of cats in unlikely situations, photoshop-shaming, and listicles, you can be sure that both companies are investing time and effort to evolve from their current strategy. Mark Suster expanded on this idea in a recent post, saying \"I think companies like Upworthy can build really compelling businesses in the future – but I'm willing to bet serious cash ... that it won't be by sticking to the playbook [that is, writing content to generate as many social shares as possible] that has worked tremendously well to date.\" The insight: For all of the chatter about social networks, publishers are still not getting it right. Your access point: Present working in social networks as a series of easy-to-implement A/B tests. Using the Upworthy premise, as outlined below, clients have a quick, clean testing method that should give them confidence to test their social network content. Upworthy produced a wildly popular slide deck back in 2012 that outlines some of their tactics, which makes for an interesting read. The key takeaway, regardless of the sort of content your client might produce, is the idea of testing multiple headlines. Upworthy writes 25 different headlines for a post, and then tests the headlines in two demographically similar cities within Facebook for an hour or so. They then push the headline with more shares. This is both agile and data-driven; keep this example in mind, as it's deliciously simple and reasonably easy to implement. It can also be applied to subheadings, images, and more. As consultants, A/B Testing is very much within the traditional scope of your work. By using this experience (and the client's trust in this experience) you are moving into new terrain via a familiar method. Let social embrace you back To approach the opportunities of social networks from another angle, Facebook and Twitter are both making a concerted effort to woo publishers. Facebook's algorithm tweak in August 2013 has increased the amount of traffic sent to news sites. Buzzfeed saw a 69% jump during this time, and they were not the only ones. In December 2013, Facebook gave us more insight. \"We've noticed that people enjoy seeing articles ... and so we're now paying closer attention to what makes for high-quality content and how often articles are clicked on ... \"Starting soon, we'll be doing a better job of distinguishing between a high-quality article on a website versus a meme photo hosted somewhere other than Facebook ... this means that high-quality articles you or others read may show up a bit more prominently in your News Feed, and meme photos may show up a bit less prominently.\" (Is this the end of memes? Maybe so if Facebook gets its way) The insight: Facebook is working to keep its users entertained with your content Your access: Leverage your Analytics prowess; you are an Analytics tiger! Analyse your Facebook referral traffic comparing August-December 2013 with the previous six-month period and the same period in 2012, and assess how much impact the algorithm update had on your site. In the same article quoted above, Facebook claims that they have increased the amount of traffic to media sites by an average of 170%. If you did not see a significant jump it suggests that the site is not sufficiently integrated into Facebook. The sort of numbers referenced by Facebook (the 170%) are considerable, all publishers would love to see traffic increases in this range, let this be your approach to re-evaluate your Facebook strategy. But wait, there's more Beyond sending more traffic to publishers, Facebook is also working with publishers to share the vast trove of data about what is trending so publishers can incorporate it into their stories. Facebook's Public Feed API shares public data and is open to anyone with the functionality. A second API, the Keyword Insights API, is only available to a select number of news organisations. The Keyword Insights API allows news organisations like CNN, Today Show, and BSkyB access to programmatically search through Facebook's public data for anonymous keyword data. This data can be sliced by gender, current city, and age range. There are no plans yet to release it to a wider audience, but it seems inevitable that (if successful) it will be rolled out in the future. (Note, an email to Facebook about this has not yet been answered. I will update in the comments if I hear more.) The insight: other publishers are working with Facebook, if only in the sense that they are incorporating new data sources for their users. Your access: Shaming (gently!). Depending on the size of your client. The Keyword Insights API isn't publicly available yet, but you can present opportunities for anyone consistently producing content to get access to similar data. For example, try Mass Relevance, a Facebook Preferred Marketing Developer, which can provide insights and trends from Facebook slicing data by a variety of metrics, including device. What publishers could be doing Now we have a general sense of how some publishers are trying to grow, I've also compiled a short list of some of the opportunities or ideas that have not been mentioned thus far. This list is based on stealing ideas from other industries, general common sense, and no small amount of wishful thinking. 1) Embracing Google products Google's range of products is staggering. For publishers this can lead to confusion about how to use the products available. To address this, Google has created Google Media Tools, a valuable hub designed to demystify many of the products in the roster, explaining everything from hot searches and trends to Google Earth to Google Crisis Response, and references examples of how publishers are using these products. For example, NBC Today uses Google Trends each Monday to give viewers a sense of what was popular over the weekend. At the Google For Media Summit, hosted earlier in January, attendees tweeted about BBC News' integration with Hangouts. Quick note: Make sure you get it right. This screengrab of a Google search for \"bbc news\" is from 22nd August 2013, not 2001... Clearly, it can be difficult to implement, but do not give up. Again, referring to Dr Pete's slide deck, as Google products increasingly appear in the search results, pure organic search results will be forced lower down the page. Embrace Google's products to maximise your client's chances of staying on the first page. The insight: Competing for organic rankings is only ever going to get you so far. (Again, Dr Pete said so!) Encourage clients to embrace the suite of Google products out there, in the spirit of trying new things and also offering new products to the end users. Your access point: Your expertise. Most people do not differentiate between Google Search, Google News, Google Local, Google Trends, etc. Anything to do with an internet search engine is your domain. Your second access point: Training. Offer your clients and their writers training in using these new products. As an experienced consultant, there will inevitably be a few training slide decks or \"best practices\" guides in your past. Use this didactic approach to showcase your knowledge and support the clients when they start to use them. As with the BBC example above, it might not be perfect immediately, but persevere. 2) Planning for change \"The pace of technological change will not abate, and to think of our current time as a transition between two eras, rather than a continuum of change is a mistake.\" – Richard Gingras, Senior Director of News and Social Products at Google The New York Times appears to have taken this advice seriously, for amidst the redesign fanfare, the most important feature is the Times' decision to change the back end. I interpret this as a commitment to the future; this fluidity is admirable. As referenced in this Fast Co Labs summary of the redesign: \"The new system, however, is more dynamic. \"We can continually iterate on the site and take advantages of the trends as we see them happening, rather than having to do a big unveil.\" Insight: Change is the only constant. (this is probably true of more than just technology used in the publishing industry) Your access point: this will be the toughest sell of anything else recommended in this post. Persuading clients that it is important to invest money in the backend system without any proven ROI is difficult. I'd welcome any ideas in the comments, but know this: It still has to be done. The best method I have so far is to use sites like the New York Times as a case study. The theory being that as they can present new ideas quickly, they get more press (possibly with links), and maybe even more readers. By monitoring new products on The New York Times and monitoring their search visibility using a tool like Searchmetrics, you should hopefully see traffic growth. You can then present this data to your clients. The good news is that you don't have to manually check the Times' site everyday; instead, sign up for the free email digests from Mediagazer, as they monitor new product developments. 3) Understanding paywall models Paywalls are starting to work, and you can be certain that your clients will be watching how competitors are starting to use them. As a consultant, it is important that you understand the variety of paywalls out there and how to implement them. These articles from SEO Book and Mashable are excellent resources to get you started. Google also has some limited information about using First Click Free, their solution for publishers wanting to charge for their content whilst still appearing in the search results. The goal in this instance is to develop an opinion on paywalls as well as an up-to-date idea of how your competitors are using them (and if they are successful). The insight: As paywalls are beginning to pay off, you will be asked about them Your access point: Forward planning. By researching ahead of time, you will be ready with an opinion when asked (and you will be asked). 4) Putting their content to work Publishers are in the enviable position of having plenty of content to play with, however now it's a question of putting that content to work. Here are a few ideas, some riskier than others. i) Creating new page types Creating new page types is a classic tactic to get more traffic. If this is what your client is looking for, look at different ways of categorizing your content. As referenced in Sara Wachter-Boettcher's Content Everywhere, the BBC Food pages tried this approach in 2011 by introducing pages organizing their content by recipe and also by ingredient. This led to an increase of 150,000 in organic traffic, and overall traffic doubled to 1.3 million visitors. The insight: New page types lead to more traffic Your access point: Grounding the creative task of thinking of new page types within standard information architecture best practices. Abby Covert, Information Architect extraordinaire, explains it well: there are 5 methods of categorizing. Use these as a starting point for inspiration when thinking about how to group your client's content: On this theme, I would love to see news publishers in particular tagging their content with zip-codes. I think it would prove a useful resource for tourists, anyone looking to rent or buy in an area, historians, and even schools. This could become even more useful on portable devices if there was an opportunity to tie news stories of particular importance into existing map products. But I'm getting carried away. Some news organisations are already trying new page types, the AP has, frankly, had some fun experimenting with Archive page types to commemorate pivotal moments in history, and has used its own images and stories to add to the narrative. ii) Partnering with new businesses Partnering up with other businesses can be seen as risky because success cannot be guaranteed. One option would be to partner up with some of the newer content creation services on the market. LinkedIn has just bought Pulse, a service that pulls in news it believes will be of interest to you based on your LinkedIn profile.There is also the wistful Kennedy app, which automatically supplies iPhone users with context when taking notes and writing deep thoughts. Insight: Your client's content can live on in different formats. Your access point: Introducing this and other like ideas to your client. In terms of publishers, the opportunity lies in being part of the potential newsfeed as it is a valuable branding opportunity. You might be able to generate revenue from supplying products like this with your content. 5) Looking to other niches within publishing and adapting their best ideas. The academic eBook publishing industry is in a stage of rapid change as it moves beyond the basic eBooks into much more exciting enhanced eBook territory. The broader industry themes are: Interactivity Socially-connected groups Adaptive eBooks Interactivity Bookry, a Welsh company, is just one of the many companies out there building interactive components for eBook. The company specializes in building widgets that allow eBook users to play with data tables. This allows users to see how positive coefficient correlation looks and how the data points, when changed, change the graph. By allowing users to play around with the data, you make them think about the material itself. The most obvious use is to improve educational resources, but there's no reason why it couldn't be applied in a broader sense for all publishers. Socially-connected groups The idea behind this is that eBook publishers are trying to encourage commentary and interaction with the course material. Most publishers are already offering social sharing as a matter of form, however some eBook publishers are going one step further and developing products that allow all the comments, notes and questions to be stored in the cloud, all in one place. This allows the user to keep track of where she has interacted but also is useful for professors looking to grade a student on the quantity and quality of her interactions. It would be incredibly useful for users to track all comments and interactions in one place, other than on the site of the comment. Adaptive technology McGraw Hill launched what they call Smartbooks last year, designed to assess the reader's understanding of the material and then adapt it based on her knowledge of the subject. Another company, Knewton, based in New York, specialize in adaptive technology and offer education publishers the opportunity to personalise the reading experience. The effect on students' pass rates has been impressive, which supports the idea that tailoring content to the user's comprehension boosts retention. Any publisher or content-producing site looking to launch a body of work for a large audience of differing ages might find these developments interesting. This is an extremely top-level summary of some of the developments in the eBook publishing sphere, as documented in the Digital Book World Conference held last week in New York. The insight: use developments in a related industry to inspire your clients, in ebook publishing as per my example, the industry leaders are pushing ebook content in new, exciting, immersive directions, adapt these ideas to suit your customer's content. Your access point: Your expert curation skills. By taking the time to understand the broader industry trends, you can skim the very best ideas and present them as opportunities to your client. If you assume responsibility for industry developments, you save your clients time and headspace whilst also expanding your sphere of influence. Have you seen new publishing products, or been involved in building them? Do you have any strong opinions about where content creation is heading next? Please share in the comments below. In terms of reading around on this subject, I've included a limited list of resources that I have found helpful. Resources Ebook Publishing - useful for quickly gleaming ebook industry trends Future of StoryTelling - the best thing I watch; it covers the new ways to tell stories Understanding Media by Understand Google - a free and useful Coursera course (sign up for the next semester!) People Tim O'Reilly - an ebook pioneer. He's thinking at least two years ahead. Charlie Melcher - of Melcher media, founder of the Future of StoryTelling mentioned above and also involved in Al Gore's Our Choice app, as referenced in this Tedtalk. Frank Rose - Frank Rose writes beautifully on immersive content, he will inspire you to think about the role the audience plays in telling a story. Tim Pool - now at Vice magazine. Tim's livestream of NY's Occupy Wall Street has changed the perception of citizen journalism. Jeff Jarvis - this post from 2008 has some thought provoking ideas. Chris Danen - Fast Co Labs, tends to write about the future of media and often brings in Fast Co examples. Products Circa Flipboard Skim That Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Applying Lessons from the Publishing Industry to SEO Consulting"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Applying Lessons from the Publishing Industry to SEO Consulting"
    },
    {
      "level": "H2",
      "text": "What are publishers doing for growth?"
    },
    {
      "level": "H3",
      "text": "1) Investing in site redesigns"
    },
    {
      "level": "H3",
      "text": "2) Embracing social"
    },
    {
      "level": "H3",
      "text": "Let social embrace you back"
    },
    {
      "level": "H4",
      "text": "But wait, there's more"
    },
    {
      "level": "H2",
      "text": "What publishers could be doing"
    },
    {
      "level": "H3",
      "text": "1) Embracing Google products"
    },
    {
      "level": "H3",
      "text": "2) Planning for change"
    },
    {
      "level": "H3",
      "text": "3) Understanding paywall models"
    },
    {
      "level": "H3",
      "text": "4) Putting their content to work"
    },
    {
      "level": "H4",
      "text": "i) Creating new page types"
    },
    {
      "level": "H4",
      "text": "ii) Partnering with new businesses"
    },
    {
      "level": "H3",
      "text": "5)  Looking to other niches within publishing and adapting their best ideas."
    },
    {
      "level": "H4",
      "text": "Interactivity"
    },
    {
      "level": "H4",
      "text": "Socially-connected groups"
    },
    {
      "level": "H4",
      "text": "Adaptive technology"
    },
    {
      "level": "H4",
      "text": "Resources"
    },
    {
      "level": "H4",
      "text": "People"
    },
    {
      "level": "H4",
      "text": "Products"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Kershaw\n          \n            Sarah Kershaw"
}