{
  "url": "https://moz.com/blog/what-i-learned-from-yahoos-analyst-day",
  "slug": "what-i-learned-from-yahoos-analyst-day",
  "title": "What I Learned from Yahoo!'s Analyst Day - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Some terrific charts, stats and research came out of Yahoo!'s Analyst Day PDF file (too bad it's a PDF). I thought it would be worthwhile to explore some of the trends Yahoo! is pointing to out of self-interest and expand their definition for the whole of the web industry:\n...",
  "content": "What I Learned from Yahoo!'s Analyst Day Search Engines By: Rand Fishkin May 23, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 23, 2006 What I Learned from Yahoo!'s Analyst Day Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Some terrific charts, stats and research came out of Yahoo!'s Analyst Day PDF file (too bad it's a PDF). I thought it would be worthwhile to explore some of the trends Yahoo! is pointing to out of self-interest and expand their definition for the whole of the web industry: One of the things Yahoo! has going for them is their strong foothold in the Asia-Pacific market, which is set to be the world leader in web users in just 4 years. If Yahoo! can win in Asia, they've got a solid chance to re-take the upper hand from Google in the web-control battle. For the rest of us, it's easy to to see how valuable that market will be. If you don't have a project leveraging the Asian market(s), you could be losing out to competitors who do - just remember the advantages that come with being first. This chart shows the pattern of Internet penetration against Cable TV adoption in the US. The pattern for web adoption is obviously much faster, but it remains to be seen if, in 5-10 years, web access reaches 60-80 hours of usage per month (I'd have to cut back to 25% of my current usage to reach that number). The trend has moved up to 3.3 words per search on average last year (the unlabeled box looks should be 4 words - Yahoo!'s error, not mine). If this is a trend that continues, we could easily see that between personalization and long tail searches, the world of SEO changes dramatically. Right now, the power of SEO lies in its ability to capture the right keywords that attract the right visitors, but this data could suggest a switch to content capture, ownership and distribution will eventually power the industry. I love this one. Ours is basically the only media industry not on the verge of stagnation or deep decline. I can't wait until the great newspaper writers of today are hired by the SEOs and bloglords of tomorrow. If I worked at a newspaper, I'd be thinking very hard about my Internet strategy, yet I don't know a single SEO currently working with a major rag... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What I Learned from Yahoo!'s Analyst Day"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What I Learned from Yahoo!'s Analyst Day"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}