{
  "url": "https://moz.com/blog/what-to-charge-for-seo-and-inbound-marketing-services-14703",
  "slug": "what-to-charge-for-seo-and-inbound-marketing-services-14703",
  "title": "What To Charge for SEO and Inbound Marketing Services - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's always a great deal of interest on SEOmoz and other blogs around trying to pin down what the \"going rate\" is for SEO, Inbound marketing and other related agency services, and what most firms charge for those services.",
  "content": "What To Charge for SEO and Inbound Marketing Services SEO Consulting C By: Chris Fernandez February 22, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Chris Fernandez February 22, 2012 What To Charge for SEO and Inbound Marketing Services SEO Consulting This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There’s always a great deal of interest on SEOmoz and other blogs around trying to pin down what the “going rate” is for SEO, Inbound marketing and other related agency services, and what most firms charge for those services. In fact, SEOMoz just released a survey of over 600 agencies that gave us great insight into this topic straight from the horse’s mouth. As a result of all this interest, I thought it would be enlightening and potentially helpful to your agency or firm – especially if you are struggling with your current pricing model and/or client expectations – to see how we charge for our services at Biquitous, why we do it this way, and explain some of the benefits for us and our clients, and how those could extend to your agency. Let’s Start At The Top Before I go into the specifics, I think that it’s really important to first take a step back and look at what we are expected to do as SEOs. For clarity, I’m going to utilize a fantastic graphic that Rand put together in a post some time ago regarding the growth in Inbound Marketing: What this graphic illustrates is that “free” traffic involves a lot more than just SEO, which is usually all that most clients think of when they approach a firm regarding increasing “rankings”, traffic and ultimately sales, to their websites. As we know, increasing traffic involves a lot more than just spiffing up a client’s website through content updates, META tag refreshes and site architecture fixes. When we inevitably get the call to “help us with our rankings…” I can’t help but chuckle, or roll my eyes – whichever is appropriate at the time – in thinking that it must seem so damn easy from the outside looking in to try and qualify and quantify what we do as Internet marketers. From a client’s perspective I’m sure it seems that all we do is snap our fingers and magically ratchet up a client’s rankings with almost no effort at all. Part of this stems from ignorance on the part of a client who just doesn’t understand the time and effort it takes to increase the profile of their website and online presence – especially if there is heavy competition in their niche. And why should they? They’re experts in their business and they have inevitably come to us to tap into our expertise in ours. But another, perhaps darker and more insidious reason our services aren’t as valued and respected as they should be, is because of the commoditization of SEO through outsourcing and “package” deals that these same business leaders are bombarded with every single day. While beyond the scope of this post, it pains me deeply that our industry is so severely misunderstood, such that the value that oftentimes is placed on our services is seen as a necessary evil at best, and a loss leader at worst, rather than a viable cash flow generating initiative. So, with all that being said, if you really want to set yourself apart from other firms and agencies, I suggest you try a fresh new approach to Internet marketing in general, and SEO and Inbound Marketing services in particular. A New Approach The reason I included Rand’s illustration above is because it ties in directly with our own approach to “SEO,” or more correctly, Internet marketing, of which Inbound Marketing services are a piece – albeit a very large piece. In fact, because what your agency does probably involves a lot more than just SEO, email marketing, PPC or any single aspect of Internet marketing, I decided to put together a graphic that illustrates the many ways that Internet marketers generate traffic for clients, above and beyond just “free” traffic or Inbound Marketing: This is not meant to be a comprehensive list by any means, but focuses on the most well-known and utilized strategies to increase traffic to a client’s website through the Internet. Don’t Put The Cart Before The Horse Ultimately, when most clients are ready for our services they usually want to jump directly into one or many of these traffic-generating initiatives because they think that focusing on increasing traffic will solve their underlying business problem. However, instead of focusing on any of these Internet marketing strategies to help a client increase their traffic, I urge you to instead begin your strategy with the end result in mind – that of converting the visitor into a tangible lead, action or sale. I’m sure your agency is probably already focused on this outcome – and if not, you should be – for a very simple reason: If a tangible Return On Investment (ROI) isn’t delivered, you will quickly lose a client. Therefore, a detailed and comprehensive action plan is necessary to implement a client’s SEO/Internet marketing strategy in order to create a thriving and sustainable business – oftentimes before any actual Inbound Marketing work is done. With that background in mind, let’s dive right into the meat of how we do things and how you can apply this model to your own client interactions. Strategy First, Execution Second, Traffic LAST The actual implementation of an Inbound/Internet marketing strategy is the LAST thing that we do at Biquitous – and I suggest it be the last thing you do as well. Instead you should be more concerned with making sure that the client’s website is ready to receive the additional traffic and convert those visitors into high quality leads and sales. Not to mention the very real probability – and added bonus – that the client will see an immediate increase in traffic and sales simply from the work you do to prepare their site for an Inbound Marketing strategy. In fact, most websites fail miserably because the owner or business leader responsible for a company’s Internet presence, executed this entire process backwards. Here’s the way we fix things before beginning a traffic driving strategy: (Note: The above image was taken from a post I wrote on why most websites fail. You can read the entire post by clicking here.) We call this approach our Three-Phase Internet Marketing Execution Framework: Phase 1 involves deep research and strategy into the client’s needs, industry, competition, business model, purpose, passion, keywords, target audience and end game. Phase 2 involves executing that strategy. So for instance, if a client came to us with a website or social media presence that was atrocious and wouldn’t convert regardless of how many visitors it received, we need to first rebuild their entire online presence from the ground up. Phase 3 then builds upon the work we did in the first 2 phases to drive traffic to the client’s website and allows us to then use various Internet marketing strategies for ultimate effect. Now that the client’s website and online presence are ready to roll, we then turn our attention to the full spectrum of Internet marketing services – of which SEO is a large part. This stage is where you can and should, differentiate yourself from other agencies What To Charge For Inbound Marketing/SEO Services and How To Execute With that background to our thought process in mind, now we can dig deeper into our business model and how it has allowed us to be very successful with the types of clients that we serve. I’ll preface this by saying that even if this model isn’t right for your agency or firm, I think there are some valuable insights here that you can still use to better serve your clients and potentially alleviate a problematic industry-wide dilemma with regards to “what to charge” in addition to handling client expectations. What To Charge: Because of the initial investment in Phases 1 and 2 of our Internet Marketing Execution Framework outlined above, we require all of our clients to agree to a minimum six month term of SEO or ongoing Internet marketing services before we’ll even begin working with them. This is billed as a flat fee at the beginning of each month that starts at no less than $2,500 per month. Since most of our clients have revenue in the range of $1-30 million, or are startups ramping up a new business, our minimum required investment is usually not a problem for them. The upside to this model (more below) is that the client becomes fully invested in the process and in seeing all this time, money and effort pay off. This creates loyal and collaborative relationships because the client has to really analyze their online business structure, and in many cases modify it, based on our advice and expertise. Therefore, they are committed to creating a thriving and successful online presence. These are ideal clients because they understand the time, investment and resources necessary to get this right – often after having gotten it wrong previously. When you commit to a 6-12 month project you are more likely to actually LISTEN to your Internet marketing agency, work closely with them, trust them, and appreciate the results that you get. This in turn breeds fierce loyalty. In other words, your services become VALUED! This is a word, and a concept, that many SEO and Internet marketing firms and agencies struggle with because many clients don’t see the value (even after a ROI analysis) in what we do. So, the first thing that I highly recommend for your agency is to price your services such that a client has to make a REAL commitment to you, and more so, to themselves. Otherwise they weren’t very committed in the first place. This approach has been so successful for us that most of our clients remain with us for years and depend on us to be their Senior Vice President of Internet Marketing. How To Execute: Now that we’ve secured a client for at least 6 months after our initial engagement, we can roll up our sleeves and get to work. How do we deliver our entire suite of Internet marketing services? Here’s the same “Inbound Marketing” graphic from before: So what we do instead of charging a client for the “Super Deluxe SEO Package” and doing the same routine tasks each month (directory submissions, press releases, link outreach, guest blogging, etc.), we instead offer an a la carte suite of potential ways that a client can increase market share, brand awareness, rankings, traffic, and ultimately, cash flow. What we do is deploy their monthly budget for the highest ROI initiatives that we feel would help the client based on their specific industry, budget, competition, sales cycle, timeline, sales structure and other factors. For instance, most medium sized businesses are ranking terribly for their major search terms because they simply have poor on-site SEO factors. We take care of that in Phase 2. Therefore, our clients often see immediate ranking and traffic increases because their websites already had high authority and backlink profiles, and simply needed some tweaking. In these cases, we don’t have to begin with the usual heavy dose of off-site SEO strategies like content marketing, guest blogging, link outreach, Q and A, PR’s, etc. to try and get them more authority – at least not initially. Instead, for example, we can apply that client’s budget to creating an iPhone app if appropriate (see example below), or creating a specific social media campaign or Infographic campaign for that particular month. In other words, while we’ll likely always incorporate some form of off-site link building initiatives, our structure allows us to deviate from this tried-and-true approach and cycle through various other traffic drivers when appropriate. A Quick Example: Say a client already has an authoritative web presence and wants to focus on other initiatives to drive traffic, loyalty, brand awareness and customer interaction. After assessing their goals and objectives, we determine that at this juncture, creating an iPhone app is a great way to utilize some of their marketing budget. We determine that a simple iPhone app that they want will cost about $5,000 to complete (all hypotheticals here). We’ll then apply that client’s monthly “SEO” investment towards creating that app. In the case of a smaller budget of $2,500 per month, we’ll use two month’s worth of dues to complete and deliver that specific project. Another Example: Likewise, if a site is brand new and has a very poor SEO profile, no link outreach, and low authority, we’ll go right into traditional SEO initiatives and work to improve the site’s overall Internet profile, and commit to that specific goal by using all available (white hat!) methods until we see traction. What If They Exceed Their Budget? If a client wants other services above and beyond their specified budget and the initiatives that we have implemented for them, we are happy to accommodate whatever they want/need and simply charge them a flat or hourly rate depending on the services rendered. For example, if a client needs a social media manager, or someone to write blog posts for their company blog, we’ll take care of the logistics, find the writer and deliver a polished, end-to-end solution for which the client simply pays us separately from their monthly Internet marketing investment. This “a la carte” approach allows us to not only explore and expand on traditional Internet marketing and Inbound Marketing methods, but to further serve the client on a deep and personal level and construct an action plan based off of our work and research in the first two phases of our Internet Marketing Execution Framework that will best serve their immediate and long term needs. Why This Model Works: Takeaways For Your Agency So why does this work so well for us and how can you implement some or all of these strategies into your own agency’s pricing or business model? Here are a few reasons broken down from our perspective as well as that of the client. Why This Model Works – Agency Perspective: Budgetary Certainty: Obviously, having a known revenue run rate for each client allows us to effectively map out an Internet marketing plan and effectively gather and utilize our resources. Product Roadmap: With a firm timeline in hand, we’re able to project a product roadmap for the client and implement complex product and service launches to take advantage of the various stages of our initial action plan. Measurement of Results: This gives us ample time to test and measure results and effectiveness, and implement improvements on the fly. Adjust Initiatives: Similarly, we are also able to make adjustments to initiatives that aren’t delivering the desired outcomes without having to worry about the client bailing because they aren’t seeing immediate results. Internal Pressure: This is a personal favorite of mine because we are on the clock. Having that external and internal pressure is a great motivating and driving force for the team involved to deliver specific and measurable results in order to retain the client long-term. Flexibility: Because the client’s budget can be utilized for virtually ANY initiative, this gives us great flexibility to spread our wings and try new and innovative marketing initiatives while remaining within budget. Internet marketing initiatives sometimes take a long time to bear fruit; this pricing model allows us that flexibility. Motivated, Vested Client: It goes without saying that one of the largest frustrations that most agencies face is a client who won’t listen to them or work with the agency. As a result of our pricing structure, our clients are intent on working closely with us and alignment is much easier to attain. Long-Term Partnership: Provided we delivered on our commitments, the usual outcome of this process is a happy client who enjoys working with us, appreciates our workflow, and ultimately becomes a long-term client. Why This Model Works – Client Perspective: Cost Certainty: The client can properly budget their resources for the length of the contract and have cost certainty within their business. Measurement of Results: This approach allows the client to measure their results and effectiveness without having to succumb to instant gratification. Changes can be made based on iterative testing, feedback and collaboration. Freedom for Experimentation: Most companies would never try a new initiative for fear of losing their budget with little to no results. This approach allows much more flexibility and experimentation because the investment is already committed, so there is a higher willingness to try more non-traditional initiatives to generate a higher ROI. Collaborative Experience: We’re in this together. When our client succeeds so do we, as cliché as that sounds. Therefore, from a client’s perspective, having the benefit of knowing they can speak with us anytime to brainstorm new initiatives, modify existing ones or just strategize on a new product launch is comforting and akin to having your own in-house marketing team. Flexibility: Similar to freedom for experimentation, a client in this cost structure has the flexibility to move around their budget and allocate it to various initiatives because they know that, even if that initiative costs more than their monthly budget, the flexibility of our pricing model allows them to pay for the new initiative without having to invest additional funds. In addition, if the client does need additional work done, we offer a full suite of services and merely charge them on a per project or hourly basis for additional work. Commitment: As I stated before, this approach oftentimes produces a motivated and fully invested client who wants to see results as much as we do. Therefore, they are fully committed not just to the process, but also to the end game. Clients appreciate an agency that is working closely with them on a direct 1-1 basis that they can count on for literally anything that encompasses any of their Internet marketing initiatives. Final Thoughts As I said earlier, this model may or may not be right for your agency based on many factors such as your business model, client base, work structure, expertise, logistics, etc. My intent was to share our model and how we mold it for each of our clients so that you can take away some of the most salient points and apply them to your business to increase your retention level, customer satisfaction, and ability to deliver results. At the very least, you can see an example of how an a la carte, flat fee monthly structure can work while not pigeonholing your firm into doing the same exact tasks over and over without allowing you the flexibility necessary to sculpt a custom action plan for each client to help facilitate the results you need and they expect. I would love to hear your comments below and get your take on how your agency or firm handles the “what and how to charge” dilemma. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What To Charge for SEO and Inbound Marketing Services"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What To Charge for SEO and Inbound Marketing Services"
    },
    {
      "level": "H1",
      "text": "Let’s Start At The Top"
    },
    {
      "level": "H1",
      "text": "A New Approach"
    },
    {
      "level": "H1",
      "text": "Don’t Put The Cart Before The Horse"
    },
    {
      "level": "H1",
      "text": "Strategy First, Execution Second, Traffic LAST"
    },
    {
      "level": "H1",
      "text": "What To Charge For Inbound Marketing/SEO Services and How To Execute"
    },
    {
      "level": "H3",
      "text": "A Quick Example:"
    },
    {
      "level": "H3",
      "text": "Another Example:"
    },
    {
      "level": "H1",
      "text": "What If They Exceed Their Budget?"
    },
    {
      "level": "H1",
      "text": "Why This Model Works: Takeaways For Your Agency"
    },
    {
      "level": "H2",
      "text": "Why This Model Works – Agency Perspective:"
    },
    {
      "level": "H2",
      "text": "Why This Model Works – Client Perspective:"
    },
    {
      "level": "H1",
      "text": "Final Thoughts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Chris Fernandez\n          \n            Chris Fernandez\n          \n            Chris Fernandez"
}