{
  "url": "https://moz.com/blog/what-kind-of-content-gets-links-in-2012",
  "slug": "what-kind-of-content-gets-links-in-2012",
  "title": "What Kind of Content Gets Links in 2012? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Back in 2009, Casey Henry wrote two of the greatest posts ever on SEOmoz - What Makes A Link Worthy Post - Part 1 and What Makes A Link Worthy Post - Part 2. Since we’re getting close to three years since those posts went live, and the SEO world has changed considerably, some of us thought that it…",
  "content": "What Kind of Content Gets Links in 2012? Content Marketing By: John Doherty October 2, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: John Doherty October 2, 2012 What Kind of Content Gets Links in 2012? Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Back in 2009, Casey Henry wrote two of the greatest posts ever on SEOmoz -What Makes A Link Worthy Post - Part 1 and What Makes A Link Worthy Post - Part 2. Since we're getting close to three years since those posts went live and the SEO world has changed considerably, some of us thought that it was about time to pull some new numbers and see how the community has changed in regards to what people link to. Just like Casey's posts, I have pulled the individual linking root domains (LRDs) instead of the total link counts, which gives us a better picture of how wide content spreads since we are eliminating the fact that one site could have the link on 1,000 pages. I have done this for just the posts since Casey's Part 2 went live on November 4th, 2009. I also took a random sample of 500 posts since then and pulled the link metrics for them. For the purposes of this post, I pulled: Number of LRDs Number of thumbs up Number of comments Types of media in the post (videos, images, lists, presentations) Category Word count Author I decided not to pull social data because I did that back in July 2011 and people hated on it. I decided to keep it to links and the other numbers, and not try to imply correlation or causation. What I am not doing here To be clear, I am not talking about whether or not these posts rank well, or whether or not they were \"good\" posts. Rather, I am presenting you the data/numbers and letting you decide what to do with them. I should also state that since some categories had more posts in them than others, I normalized the data by dividing the number of posts against the sum of the metric, to get an average. This took away any skewing based on popularity of the category. Here is an example of non-normalized linking root domains to a category: And this is what it looks like normalized: It's not a HUGE difference, but for the integrity of our data, we want to do this to give a true picture. Let's go! Posts with images First, it has long been postulated that posts with images receive more links than posts without images, but is that true? Does the data tell us this? Yep, it sure does. Comments by category I also wondered if the number of comments on a post correlated to links. Does getting more comments on a post mean that there will probably be more links to it, thus we should encourage more comments so that we have a better chance of getting links? First, here are the categories that get the most comments (aka generate the most discussion): We see that the whitehat/blackhat posts tend to generate the most discussion, followed by conversation rate optimization, consulting tips and tricks, and search engine trends. Surprisingly (to me), linkbuilding comes in at #10. But do comments correlate to links? There seems to be a bit of a correlation, but I don't think it is large enough to necessarily justify generating comments and community just for the links. There are other reasons to do it that are stronger than linkbuilding. Amount of content Our dear Dr Pete wrote a post back at the end of 2011 about Moz’s most popular content, in which he saw that there was possibly a correlation between longer content and the number of links a post gained. I’ve always loved the longreads websites and longer pieces of writing and journalism, but is it true that longer pieces may attract more links than shorter pieces? Let’s let the data speak again. If we visualize the 500 posts based on word count, we get this graph from largest to smallest: Without changing the order of the data, if we visualize the links that these posts have gained, there seems to be a correlation between longer content and links: Interesting! #longreads has long been one of my favorite hashtags to check out on Twitter and this validates another reason for writing longer content. Does linking out increase links? I tire of all the posts that I see written talking about “building links by linking out.” These posts confuse correlation with causation. However, I decided to use the data provided by the ScreamingFrog export and see if linking out really did correlate to linking root domains in. Here’s what I found: There does seem to be a slight correlation between the number of links going externally and the number of linking root domains coming in. Once again, remember that correlation does not equal causation and you cannot say that since you link out, you’ll get more links. What kind of content do we like to talk about? Even though tag clouds don’t help your SEO onsite, and in my opinion look dumb and even could get you gobsmacked by a Penguin, they can be useful for finding common themes. So, here are the themes often used in SEOmoz blog headlines: Average LRDs by type of media Here’s the one you’ve all been waiting for. In Casey’s post, he showed the following graph, which showed that content with all three media types he pulled was most likely to have the most links: Since this is an updated post, I wanted to run the data again. This was the most surprising graph I found, because it seems that on SEOmoz, posts with just images tend to get more links than posts with all three media types I pulled (lists, images, and video)! Check it out: I really do not know how to explain this, other than maybe these are the posts that are most often scraped? In regards to video, notice that most of the posts on the SEOmoz blog that just have video are Whiteboard Fridays. Therefore, I must say that your mileage may vary when it comes to posts with just videos, as this data shows that the links are probably influenced by the fact that Whiteboard Friday has been branded and is always high quality and educational. You can’t just put videos into a post and expect it to attract more links simply because of video. Just for fun Let's have a little fun with the data. Just for fun, guess who gets the most links per post? Let me give you a hint: there is only one. And guess who ranks #22? This guy. Who gets the most thumbs up on average? Rand wins with Eppie, Oli, and Wil close behind. That’s it! I hope this post has been instructional and enlightening for you, or at least used data to confirm what you’ve already always believed. I’d love to hear your comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Kind of Content Gets Links in 2012?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Kind of Content Gets Links in 2012?"
    },
    {
      "level": "H2",
      "text": "What I am not doing here"
    },
    {
      "level": "H2",
      "text": "Posts with images"
    },
    {
      "level": "H2",
      "text": "Comments by category"
    },
    {
      "level": "H2",
      "text": "Amount of content"
    },
    {
      "level": "H2",
      "text": "Does linking out increase links?"
    },
    {
      "level": "H2",
      "text": "What kind of content do we like to talk about?"
    },
    {
      "level": "H2",
      "text": "Average LRDs by type of media"
    },
    {
      "level": "H2",
      "text": "Just for fun"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John Doherty\n          \n            John Doherty\n          \n            John Doherty"
}