{
  "url": "https://moz.com/blog/what-digital-experience-does-your-ceo-need",
  "slug": "what-digital-experience-does-your-ceo-need",
  "title": "What Digital Experience Does Your CEO Need? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of my strategic objectives this year is to get Distilled access to decision-makers closer to the boards of some of our large clients. It should be clear to all of us in search that the companies winning the search game are those prepared to think about it most strategically.\n\nI believe that in…",
  "content": "What Digital Experience Does Your CEO Need? Marketing Industry By: Will Critchlow March 6, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Will Critchlow March 6, 2009 What Digital Experience Does Your CEO Need? Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. One of my strategic objectives this year is to get closer to the boards of some of our large clients. It should be clear to all of us in search that the companies winning the search game are those prepared to think about it most strategically. If nothing else, the trends towards brands performing increasingly well (as discussed eloquently by Aaron recently) reflects changes to the underlying algorithms and / or an increasing sophistication from (some) big brands when it comes to search. I have a bunch of posts to write about how brands can position themselves to benefit from this and also how agencies can work alongside them (clue: agencies - think about how you support internal efforts rather than outsourcing). But this isn't one of those posts. There is an element of advice for agency-side and in-house SEOs at the end, but you're gonna have to wade through a load of speculatin' first. Good luck! The hypothesis At the moment, most people running large companies (think: Fortune 500, FTSE 100) are, by training and inclination, either: Lawyers Economists Accountants There are a (noisy) few who are engineers or who worked their way up from the 'shop floor', but this post is less about them. When large companies are looking for a safe pair of hands to steer these companies, they seem to seek out people who understand the flow of money (can I put lawyers in that category? Sorry - couldn't resist). My hypothesis is: In 30 years' time, the people running these large companies will be those who understand the unchecked flow of information - the marketers - and more specifically that technically-inclined breed of marketers currently only found in search The great thing about a prediction as bold as that is that I can't be proved wrong for 30 years! Why on earth do I think that? The face of business is changing. Forces are being exerted on large businesses that they have never had to contend with before. Large businesses feel invincible - we have a tendency to think that the ones we see now will be around pretty-much-unchanged in 30 years' time. This is not likely. In most 30 year periods there is significant 'creative destruction'. Even those businesses that look superficially the same will have had to adapt to survive. At the moment, the biggest impacts are being seen on the businesses that have moved online quickest (retail and media) but we are increasingly seeing impacts on consumer brands that don't operate online as the internet becomes the place where consumers - especially younger consumers - hang out. As this generation of net-savvy consumers become the buyers and managers in businesses of all sizes, we will see the internet have an increasing impact on the way business is done. We have already seen effects on the web development and search industry as the early-adopter CEOs increasingly base B2B buying decisions on search (and, yes, on twitter - is it actually possible to write a blog post without mentioning twitter at the moment?). As this spreads more widely (and I'm confident that it will), even traditionally boring B2B businesses will need to treat the web with a new marketer mentality. They are not well-equipped to do this - the boards typically understand the flow of money better than they understand the flow of information. The first thing I anticipate is big-company marketing directors being recruited out of the digital industries. If I were the chairman of Ford or Barclays, I'd do something like the following: buy a digital agency (optional), install the CEO as marketing director, ???, profit. Lest anyone think I am seeking this role myself, Distilled is not for sale, and I don't want to be marketing director of a big company, unless you're offering *obscene* money ;) If I'm right about this, I think the effective ones will push their companies to market in much more strategic ways - they will be changing the way they do business in order to change the way they get business. It's but a small step from there to the corner office. What does this have to do with SEO? Sometimes I write here on SEOmoz about pure technical SEO stuff. Sometimes I bore you with business thoughts. This post is supposed to get you thinking about the future of agencies and the future roles for individuals with the kind of experience we have. In the long-run, I believe that in-house is going to rule when it comes to large companies, but with a place for specialist external advisers. If you run an agency: it is going to be increasingly important to support and complement in-house efforts and teams you are going to be dealing with increasingly savvy clients you will have to change the way you approach, and sell to, big businesses you could have an opportunity to take your digital skills into the running of bigger businesses (in the long-run) If you are in-house: you should expect your bosses to increasingly come from the same world you do your career progression could (if you want it to) take you out of 'digital' (and certainly out of technical) and towards the comms and strategy teams you can aim for the C-suite after all... Once again, I find myself ending a potentially controversial post by asking if you agree? Disagree? Think I'm an idiot? In either of the first two cases, I'd love to hear your thoughts... If you liked this post, you might like some posts by Alex (Tom's old boss at Bloom): I was partly inspired to write this post by his thoughts on a new agency model and he also wrote a challenging YOUmoz post recently asking if SEO agencies should exist. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Digital Experience Does Your CEO Need?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Digital Experience Does Your CEO Need?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Critchlow\n          \n            Will Critchlow\n          \n            Will Critchlow"
}