{
  "url": "https://moz.com/blog/what-does-your-trained-eye-see",
  "slug": "what-does-your-trained-eye-see",
  "title": "What Does Your Trained Eye See? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently I've started working with Rand on doing site analyses for our clients. He's taken me under his wing by walking me through a typical site analysis and telling me what to look for. Obviously, since Rand is the resident expert, it is easy for him to know what to look for and what to recommend…",
  "content": "What Does Your Trained Eye See? Design By: Rebecca Kelley September 12, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley September 12, 2006 What Does Your Trained Eye See? Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Recently I've started working with Rand on doing site analyses for our clients. He's taken me under his wing by walking me through a typical site analysis and telling me what to look for. Obviously, since Rand is the resident expert, it is easy for him to know what to look for and what to recommend to the client.Unfortunately, up until I started working for SEOmoz, I was accustomed to surfing into a site and taking it at face value. I now have to train my eyes to see things as an SEO expert would. How do I train myself to do that? I'm currently taking the hands-on, shadowing approach with Rand, but I recently read an interview with Michael Gray (aka Graywolf) on the Sootledir Marketing Blog that offered another site analysis tactic:When I was first starting out I’d do it with index cards writing down all of the onsite factors for site1.com on one index card. Then I would do the same for site2.com and site3.com. Do the same for links. Then take all the links cards and spread them out on the table looking for commonalities in linking patterns.In terms of visual, hands-on exercises, his advice is pretty sound. It's a good way to get assimilated and accustomed to comparing and contrasting different sites and training yourself to catch site weaknesses.Do any of you have additional advice to offer an untrained eye? What's an innovative, clever, or simply tried-and-true way to train yourself to know what to look for when analyzing a site (other than the typical get-better-the-more-you-do-it approach)? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Does Your Trained Eye See?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Does Your Trained Eye See?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}