{
  "url": "https://moz.com/blog/what-link-building-success-really-looks-like",
  "slug": "what-link-building-success-really-looks-like",
  "title": "What Link Building Success Really Looks Like - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this examination of content marketing successes, Mark Johnstone adds more perspective and depth around what successful link building looks like in the wild versus what we might expect.",
  "content": "What Link Building Success Really Looks Like Content Marketing | Link Building By: Mark Johnstone December 7, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mark Johnstone December 7, 2016 What Link Building Success Really Looks Like Content Marketing | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A few weeks ago, a post was published entitled The SEO Myth of Going Viral. It referenced 8 pieces of content across 4 different sites that went viral and, most importantly for SEO, gained hundreds of linking root domains. I was the creative director on a lot of those campaigns while working as the VP of Creative at Distilled. Today, I’d like to add some important context and detail to the original post.I actually agree with much of what it said. However, it's based on the assumption that one big viral piece of content would result in a visible jump in rankings across the domain within about 3 months of the content being released. There are a few challenges with this as a basis for measuring success.I wouldn’t advise setting your hopes on one big viral hit boosting your rankings across the domain. Not by itself. However, if that viral hit is part of ongoing link building efforts in which you build lots of links to lots of pieces of content, you can begin to see an upwards trend.\"Trend\" is the important word here. If you’re looking for a dramatic step or jump as a direct result of one piece of viral content, this could cause you to overlook a positive trend in the right direction, and even tempt you to conclude that this form of content-based link building doesn’t work.With regards to this type of link building and its impact on domain-wide rankings, I’d like to focus on the follow 4 points:How success really looksWhy success looks like it doesOther factors you need to considerHow we can improve our approachWhat successful link building really looks likeSimply Business was held up in the SEO myth post as an example of this kind of link building not working. I would argue the opposite, holding it up as an example of it working. So how can this be?I believe it stems from a misunderstanding of what success looks like.The post highlighted three of the most successful pieces of content Distilled created for Simply Business. However, focusing on those three pieces of content doesn’t provide the full picture. We didn’t make just three pieces of content; we made twenty-one. Here are the results of those pieces:Note: Data missing for the first two pieces of contentThat’s links from 1466 domains built to 19 pieces of content over a period of 3 years.The myth in question is as follows:Building lots of links to one piece of content will result in a jump in domain-wide rankings within a reasonable timeframe, e.g. 3 months.Though this wasn’t the hypothesis explicitly stated at the start of the post, it was later clarified in a comment. However, that’s not necessarily how this works.An accurate description of what works would be:Building lots of links to lots of pieces of content sustainably, while taking other important factors into consideration, can result in an increase in domain-wide rankings over time.To hold up, the myth required a directly attributable jump in rankings and organic traffic within approximately 3 months of the release of each piece of content. So where was the bump? The anticipated reward for all those links?No. The movement we’re looking for is here:Not a jump, but a general trend. Up and to the right.Below is a SEMRush graph from the original post, showing estimated organic traffic to the Simply Business site:At first glance, the graph between 2012 and 2014 might look unremarkable, but that’s because the four large spikes on the right-hand side push the rest of the chart down, creating a flattening effect. There's actually a 170% rise in traffic from June 2012 to June 2014. To see that more clearly, here’s the same data (up to June 2014) on a different scale:Paints quite a different picture, don’t you think?Okay, but what did this do for the company? Did they see an increase in rankings for valuable terms, or just terms related to the content itself?Over the duration of these link building campaigns, Simply Business saw their most important keywords (\"professional indemnity insurance\" and \"public liability insurance\") move from positions 3 to 1 and 3 to 2, respectively. While writing this post, I contacted Jasper Martens, former Head of Marketing and Communications at Simply Business, now VP of Marketing at PensionBee. Jasper told me:\"A position change from 3 to 1 on our top keyword meant a 15% increase in sales.\"That translates to money. A serious amount of it!Simply Business also saw ranking improvements for other commercial terms, too. Here’s a small sample:Note: This data was taken from a third-party tool, Sistrix. Data from third-party tools, as used both in this post and the original post, should be taken with a grain of salt. They don’t provide a totally accurate picture, but they can give you some indication of the direction of movement.I notice Simply Business still ranks #1 today for some of their top commercial keywords, such as \"professional indemnity insurance.\" That’s pretty incredible in a market filled with some seriously big players, household UK names with familiar TV ads and much bigger budgets.Why success looks like it doesI remember the first time I was responsible for a piece of content going viral. The social shares, traffic, and links were rolling in. This was it! Link building nirvana! I was sitting back waiting for the rankings, organic traffic, and revenue to follow.That day didn’t come. I was gutted. I felt robbed!I’ve come to terms with it now. But at the time, it was a blow.I assume most SEOs know it doesn’t work that way. But maybe they don’t. Maybe there’s an assumption that one big burst in links will result in a jump in rankings, as discussed in the original post. That’s the myth it was seeking to dispel. I get it. I’ve been there, too.It doesn’t necessarily work that way. And, actually, it makes sense that it doesn’t.In two of the examples, the sites in question had one big viral hit, gaining hundreds of linking root domains, but this on its own didn’t result in a boost in domain-wide rankings. That’s true.Google would have pretty volatile search results if every time someone had a viral hit, they jumped up in the rankings for all their head terms. But if a site continues to build lots of links regularly over time, like Simply Business did, Google might want that site to be weighted more favorably and worthy of ranking higher.The Google algorithm is an incredibly complex equation. It’s tempting to think that you put links in and you get rankings out, and a big jump in one will correspond to a big jump in the other. But the math involved is far more complicated than that. It’s not that linear.Other factors to considerLink building alone won’t improve your rankings.There are a number of other influential factors at play. At a high level, these include:A variety of on-site (and technical) SEO factorsAlgorithmic updates and penaltiesChanges to the SERPs, like the knowledge box and position of paid resultsCompetitor activityI’m not going to go into great detail here, but I wanted to mention that you need to consider these factors and more when reviewing the impact of link building on a site's rankings.Below is the graph from SearchMetrics for Concert Hotels, also via the original post. This is another site to which Distilled built a high volume of links.As you can possibly tell from the large drop before Distilled started working with Concert Hotels, the site was suffering from an algorithmic penalty. We proceeded under the hypothesis that building high-quality links, alongside other on-site activity, would be important in the site’s recovery.However, after three or four large link building successes without any corresponding uplift, we recommended to the client that we stop building links and shift all resources to focus on other activities.As you’ll see at the end of the chart, there appears to be some positive movement happening. If and when the site fully recovers, we’ll never be able to tell exactly what contribution, if any, link building made to the site’s eventual rankings.You can’t take the above as proof that link building doesn’t work. You have to consider the other factors that might be affecting a site’s performance.How can we improve our approach?As I mentioned at the start of this post, I actually agree with a lot of the points raised in the original post. In particular, there were some strong points made about the topical relevance of the content you create and the way in which the content sits within the site architecture.Ideally, the content you create to gain links would be:Topically relevant to what you doIntegrated into the site architecture to distribute link equityValuable in its own right (even if it weren’t for links and SEO)This can be a challenge, though, especially in certain industries, and you might not hit the sweet spot every time.But let’s look at them in turn.Topical relevanceIf you can create a piece of content that gains links and is closely relevant to your product and what you do for customers, that’s great. That’s the ideal.To give you an example of this, Distilled created a career aptitude test for Rasmussen, a career-focused college in America. This page earned links from 156 linking root domains (according to the Majestic Historic Index), and the site continues to rank well and drive relevant search traffic to the site.Another example would be Moz’s own Search Engine Ranking Factors. Building lots of links to that page will certainly drive relevant and valuable traffic to the Moz site, as well as contributing to the overall strength of the domain.However, your content doesn’t have to be about your product, as long as it’s relevant to your audience. In the case of Simply Business, the core audience (small business owners) doesn’t care about insurance as much as it cares about growing its businesses. That’s why we created several guides to small business marketing, which also gained lots of links.As Jasper Martens explains:“Before I left Simply Business, the guides we created attracted 15,000 unique visits a month with a healthy CTR to sign-up and sales. It was very effective to move prospects down the funnel and make them sales-ready. It also attracted a lot of small business owners not looking for insurance right now.”Integrating the content into the site architectureDistilled often places content outside the main architecture of the site. I’ll accept this isn’t optimal, but just for context, let me explain the reasons behind it:It creates a more immersive and compelling experience. Consider how impactful New York Times’ Snowfall would have been if it had to sit inside the normal page layout.It prevents conflicts between the site’s code and the interactive content’s code. This can be particularly useful for organizations that have restrictive development cycles, making live edits on the site difficult to negotiate. It also helps reduce the time, cost, and frustration on both the client-side and agency-side.It looks less branded. If a page looks too commercial, it can deter publishers from linking.While it worked for Simply Business, it would make sense, where you can, to pull these things into the normal site architecture to help distribute link equity further.Content that's valuable in its own right (even if it weren't for links and SEO)Google is always changing. What’s working now and what's worked in the past won’t necessarily continue to be the case. The most future-proof way you can build links to your site is via activity that’s valuable in its own right — activities like PR, branding, and growing your audience online.So where do we go from here?Link building via content marketing campaigns can still make a positive impact to domain-wide rankings. However, it’s important to enter any link building campaign with realistic expectations. The results might not be as direct and immediate as you might hope.You need to be in it for the long haul, and build links to a number of pieces of content over time before you’ll really see results. When looking for results, focus on overall trends, not month-to-month movements.Remember that link building alone won’t solve your SEO. You need to make sure you take other on-site, technical, and algorithmic factors into consideration.It’s always worth refining the way you’re building links. The closer the topics are aligned with your product or core audience’s interests, the more the content is integrated into your site’s architecture, and the more the content you’re creating is valuable for reasons beyond SEO, the better.It’s not easy to manage that every time, but if you can, you’ll be in a good position to sustainably build links and improve your site’s rankings over time. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Link Building Success Really Looks Like"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Link Building Success Really Looks Like"
    },
    {
      "level": "H2",
      "text": "What successful link building really looks like"
    },
    {
      "level": "H2",
      "text": "Why success looks like it does"
    },
    {
      "level": "H2",
      "text": "Other factors to consider"
    },
    {
      "level": "H2",
      "text": "How can we improve our approach?"
    },
    {
      "level": "H3",
      "text": "Topical relevance"
    },
    {
      "level": "H3",
      "text": "Integrating the content into the site architecture"
    },
    {
      "level": "H3",
      "text": "Content that's valuable in its own right (even if it weren't for links and SEO)"
    },
    {
      "level": "H2",
      "text": "So where do we go from here?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mark Johnstone\n          \n            Mark Johnstone\n          \n            Mark Johnstone"
}