{
  "url": "https://moz.com/blog/what-marketers-can-learn-from-tinder",
  "slug": "what-marketers-can-learn-from-tinder",
  "title": "Identity, Affinity, and Personalization: What Marketers Can Learn From Tinder - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Take some marketing lessons from the world of modern dating, and learn about what Tinder can teach us about sales in this Valentine's Day post. What does the modern singleton’s approach to online dating tell us about their shopping behavior? And what should we be doing about it? The answer can be…",
  "content": "Identity, Affinity, and Personalization: What Marketers Can Learn From Tinder Marketing Psychology By: Bridget Randolph February 15, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Bridget Randolph February 15, 2016 Identity, Affinity, and Personalization: What Marketers Can Learn From Tinder Marketing Psychology The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Everyone has an opinion about Tinder. Whether you’re happily single, actively seeking a partner, or in a committed relationship, something about the concept of \"swiping\" yes or no on strangers’ pictures seems to guarantee strong opinions. There are endless articles about what Tinder (and similar apps) say aboutmodern dating, love in the 21st century, and, more broadly, millennial shallowness. And, as someone who can’t resist twisting a good dinner party topic into a marketing blog post, I started thinking about how what we know about Tinder and the way people use it can give us insight into how people shop. After all, some of my friends refer to Tinder usage as “shopping for boys.”[image credit: http://www.techinsider.io/married-after-meeting-on-tinder-2015-8]So what does the modern singleton’s approach to online dating tell us about their shopping behavior? And what should we be doing about it? The answer can be found in a look at social and technological history and the concept of an individual with a sense of personal identity. As a marketer attempting to connect with the “Tinder Generation,” your goal is to tap into your customers’ values at a very personal level, connect with them through their personal network or “tribe,” and help them to avoid choice paralysis while nonetheless providing them with a sense of having plenty of personalized options.The rise of the individual and the concept of personal identityHistorically, in Western society, the family could be considered the basic unit of society. Marriage as a concept was heavily tied to economic factors, along with a diplomatic aspect at the higher levels of social status, and proximity at the lower end of that scale. The local community was a fairly static unit, with individuals being born, marrying, raising a family, and being buried all in the same village. Marrying for love is an age-old theme found in literature, but is not the typical experience for the majority of people until the 20th century. In the wake of the Industrial Revolution, there was mass migration to cities. Over time, as cities were increasingly unable to accommodate all their residents, the concept of \"living in the suburbs\" became more common, but still as a family unit. There's a strong sense of the gendered roles of men and women in this period, who together make up a family unit (particularly with the birth of children). The gendered division of labor is reflected in the dating behavior from this period. The stereotype of \"boy meets girl, boy buys girl a milkshake, boy marries girl\" is a product of this emphasis on the family as the basic unit, where the man is the provider and the woman is the homemaker. This is a society in which a man asks a girl’s father for her hand in marriage, and typically you marry the boy or girl \"next door\" (a callback to the traditional economic and proximity factors).From a marketing perspective, this is the society which produced those charmingly disturbing retro ads like this one:[image credit: http://all-that-is-interesting.com/20-bizarre-vintage-ads]Following the Sexual Revolution of the 1960s, and the zeitgeist which produced feminist works like Betty Friedan’s The Feminine Mystique, this focus on gendered division of labor, and viewing of the individual only as he or she contributes to the family unit, began to shift. The individual becomes the basic social unit rather than the family. There is also far less emphasis on marriage and starting a family as the primary markers of having attained adulthood and respectability.This leads to a much greater emphasis within modern society on personal identity and authenticity (“be true to who you are”). Within this model, the approach to dating is about \"me\": my personal identity, what my choice of partner says about me, and what I want from a relationship at this point in time. There are more options than ever, and we want to be seen as unique and autonomous beings.Despite this, humans are social creatures. We like to connect. We like to share an identity with a group, to feel like part of a tribe. This is why we borrow aspects of different social groups to explain that unique personal identity. This also explains why, as people become more detached from their original location- and family-based communities, they nevertheless find (and create) new tribes and communities which are not based on traditional structures. What used to be a relationship based on kinship by birth is now based instead on personal choice and finding other people \"like us\" in terms of identity rather than genetics. For instance, the concept of an “urban family”, or the close-knit ties represented in popular tv shows like Friends and Buffy the Vampire Slayer. [image credit: http://img2.tvtome.com/i/u/28c79aac89f44f2dcf865ab8c03a4201.png]And this is why marketers have consistently seen the power of social proof — which is all about reinforcing that tribal identity (“1000 other people like you have bought this product!”).Technological innovations and the rise of personalizationIn the meantime, technology has been developing (in parallel to these societal shifts) which supports individual freedom and endless choices. We’ve moved from the more family- and community-oriented devices of the past (radio, tv, even household PCs) to individual devices (smartphones, tablets, smartwatches) which contain all aspects of our lives and our individual identities.The popularity of these hyper-personal devices, combined with the power of the Internet to connect people globally, has enabled big data collection and analysis. This in turn leads to granular personalization and machine learning on a mindblowingly large scale. And this explosion of personalized, high-speed technology has contributed to the expectations that we as consumers have from businesses and their products or services:We expect lots of options that \"work for me\"We expect convenience and ease of useWe expect to have everything in one placeWe expect instant gratification and will do almost anything to avoid boredomWe expect to stay connected to other people digitallyWhen we combine all of this with the social phenomenon of the individual’s personal identity being the most important thing, we get the rise of the blogger, the Youtube celebrity, the Twitter activist - all of these people who want to express their own unique voice and share it with the world. And for the rest of us, we get social media in general, which is all about presenting a particular, curated identity and staying connected to family, friends, and fans digitally and in real-time.The rise of social media leads to the concept of \"viral\" content, which is a piece of content which a lot of people share, often because of what it allows them to say about themselves. Buzzfeed are the masters of creating this type of content, becausethey understand the value of tapping into those personal loyalties and other elements which go into creating a sense of one’s own identity while remaining connected to others.[image credit: http://www.slate.com/features/2014/01/buzz_quiz/htdocs/graphics/130127_buzzfeedQuiz.jpg]But what does this have to do with Tinder? Or marketing?This is where Tinder comes in. Tinder represents the intersection of these two historical trends: the sociological and technological. Modern dating, and particularly online dating, has always been about curating an “authentic” but attractive version of one’s identity and selling that identity to one’s target audience, namely a prospective partner. Tinder takes these elements, combines them with the desire for choices, convenience, and the rise of the smartphone, and turns it all into a fun game to play when you’re bored. And it provides all of these benefits in one simple action: the swipe.[image credit: http://blog.gotinder.com/post/115903239496/introducing-moments] Tinder users are often accused of being shallow and judging people based solely on externals. But in reality, Tinder is the perfect example of this phenomenon of tapping into social cues and semiotics in order to tell a story about the person whose profile you are looking at. It’s a classic example of a phenomenon written about in books such as Blink, Thinking Fast and Slow, and Predictably Irrational. For a more in-depth explanation of this as it applies to Tinder, check out this Buzzfeed article (meta, no?).In essence, Tinder reflects the “acquisition behavior” of a generation who have grown up in the age of the Internet, social media, and the rise of the smartphone. Tinder allows users to curate and announce a personal identity as well as reflect tribal affinities (I’m a traveller, I’m a hipster, I’m a frat boy, I’m an artist … or, I’m some combination of all of these). It then allows these users to browse through countless \"match\" options who reflect these same affinities and values to a greater or lesser degree, and provides the illusion of infinite choice. And it alleviates boredom by providing an entertainment option for when you’re stuck in line at the store or bored on your commute. The interface deliberately plays into this \"gamification\" by rewarding you with an “It’s A Match” screen with two options: “Send a Message,\" or, significantly, “Keep Playing.”[image credit: http://blog.gotinder.com/post/123460733076/introducing-verified-profiles]If you want someone to “convert” from your profile to a real world date, you face a similar challenge as that which the majority of brands are facing: the paradox of choice. With so many potentially better options available, how do you create a profile which will not only earn you a swipe right but also continue to engage your target customer throughout the user journey from match screen to conversation to first in-person date? The principles remain the same as those of any good marketing strategy in today’s world:Reflect your target audience’s values (for example, if you want to meet someone who values intelligence and education, you might use a university photo as one of your pictures); Connect with them on the basis of shared friends or interests (this is the social proof aspect of Tinder’s interface); and Personalize the experience in order to guide them to the conversion point (for instance, don’t start a conversation with “heyyy” or “what’s up” unless you want to be ignored).So how do marketers reach the Tinder Generation?In terms of applying these insights to our marketing strategies, we can break them down into three key areas:Personal valuesTribal affinitiesPersonalizationFor each of these areas, there are tactics which can allow you to tap into these sociological and psychological factors and optimize for your target audience. I’ve included some examples below, but this is by no means an exhaustive list.Personal valuesFind a way in which your product or service enables the customer to \"say something about myself\" by using it. A great example of this is luxury brands like Gucci, whose customers literally self-identify by wearing clothing and other objects with the logo of the brand visible.Recognize that the top of the funnel is becoming smaller as people self-qualify themselves in or out of the funnel before they even enter the customer journey. This is particularly true with the changes to search engine algorithms and interfaces, which allow the search engine to do the lead qualification on your behalf. A great tip for this is to think in terms of what \"actions\" the user can take on your landing pages, and optimize for the action you want them to take. Craig Bradford and I have talked about this over here as part of the Distilled Searchscape project.Entertain your customers and provide distraction when they’re bored. This won’t work for every brand, but a great example of a product brand successfully doing this is Red Bull’s content branch. But even if you can’t build out an entire publication arm of your business, this might be a good way to approach your social media strategy. How much does your social media presence encourage users to visit your page specifically? Sephora’s Pinterest strategy does just that.Tribal affinitiesUnderstand your audience as a social group: who influences them? What do they value as a group? Can you tap into this in your content? Your social strategy? Through an influencer outreach campaign? Remember that it’s not always the influencer with the most followers who is the most influential in terms of a particular segment of their audience.Make use of social signals (language, references, influencers) to indicate your affinity with your target audience, and social proof related to the specific tribe/community which your target audience is a part of (“8 out of 10 moms say…”). Segment your audience and target your campaigns at the most specific level possible. PersonalizationPersonalize the user experience to the individual’s needs. Be as granular as possible. Qubit have some great case studies of companies doing this well.Provide the illusion of choice while making it easy to choose the \"best\" option (choice architecture). This may involve a UX or CRO audit. For more on this topic, read Predictably Irrational and The Paradox of Choice.These are just a few of the ways in which marketers can adopt some of the same strategies that work in the dating world and apply them to business. But even if the specific tactics mentioned here don’t directly apply to your business, you can’t go wrong by paying attention to your audience and their behavior. Consider what they do when they’re in a non-buying context, and see if you can interact with them on that level (if not in that context!). And with a bit of practice, and some well-targeted campaigns, your customers should discover that you’re a match made in heaven!Now it’s your turn! Are there any tactics you’ve noticed in these areas which have worked particularly well for you and your target customers? Do you agree with my theories about dating? Let me know your thoughts in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Identity, Affinity, and Personalization: What Marketers Can Learn From Tinder"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Identity, Affinity, and Personalization: What Marketers Can Learn From Tinder"
    },
    {
      "level": "H2",
      "text": "The rise of the individual and the concept of personal identity"
    },
    {
      "level": "H2",
      "text": "Technological innovations and the rise of personalization"
    },
    {
      "level": "H2",
      "text": "But what does this have to do with Tinder? Or marketing?"
    },
    {
      "level": "H2",
      "text": "So how do marketers reach the Tinder Generation?"
    },
    {
      "level": "H3",
      "text": "Personal values"
    },
    {
      "level": "H3",
      "text": "Tribal affinities"
    },
    {
      "level": "H3",
      "text": "Personalization"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bridget Randolph\n          \n            Bridget Randolph\n          \n            Bridget Randolph"
}