{
  "url": "https://moz.com/blog/what-women-want-on-the-web",
  "slug": "what-women-want-on-the-web",
  "title": "What Women Want on the Web - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the best forum threads I've read in a long time is in progress at Cre8asite. Started by Kim Krause Berg herself, innocently enough with a post about women equalling men online in pure numbers (though it would appear from the latest eMarketer numbers that ...",
  "content": "What Women Want on the Web Keyword Research By: Rand Fishkin May 8, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 8, 2006 What Women Want on the Web Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. One of the best forum threads I've read in a long time is in progress at Cre8asite. Started by Kim Krause Berg herself, innocently enough with a post about women equalling men online in pure numbers (though it would appear from the latest eMarketer numbers that women now outnumber their male counterparts), the thread has expanded to include multiple topics related to the subject, including: Why women go online How women shoppers are different from men in buying, surfing and web-using habits Women in the blogosphere (much higher numbers than you'd think) Joining the topic are luminaries in the business like Scottie Claiborne, Jill Whalen and Donna Fontenot. The best part is... technically, the thread was posted in Cre8asite's \"After Hours\" forum, meaning that while there's a lot of good business information, it's a truly entertaining thread to read, too. A few of my favorite bits: From Debora Geary:I have worked on optimizing a couple of sites that sell to a highly female audience, and one that sells to primarily men. Very different things have proven successful on those sites. The site selling primarily to guys got highest conversion rates from very linear pathways, clear calls to action, and um, \"unsubtle\" BUY NOW buttons. Images got clicks, but often acted as distractions.For the sites with more female shoppers, a much less linear funnel with subtle calls to action and buying cues was most successful - as was \"objective\" information (in written article format - guys liked tables and specs). Women also liked navigation that made it easy to move \"backwards\" (at least in the sense of the linear buying funnels web analysts use to evaluate sites). From Holly Buchanan:Women have more connections between the right and left hemisphere of their brain. they tend to have more questions they need answered when making buying decisions. AND they tend to have a less linear process. I always plan websites with pathways that are non-linear. I've found those sites do extremely well with both women and men. We map out what questions different personas have, but we do not necessarily know in what order they want those questions answered - so we plan for that and it's proven very successful. (though not easy - we had to design our own software in order to create these pathways because we couldn't find anything out there that easily let you plan non-linear pathways) From Elizabeth Able:On gender, more to do with psych than web - Many languages use \"he\" when we don't know a person's gender. As a \"she\" that means I'm always in the minority - kinda lonely, huh? On the other hand, if we expect unknown gender to equal \"he,\" does that infer \"he\" = undecided? \"He\" doesn't sound so nice either! HUMAN is more than gender. Design for humans! Of all the demographics available, gender is certainly a big target that many, many sites have forgotten. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Women Want on the Web"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Women Want on the Web"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}