{
  "url": "https://moz.com/blog/what-we-learned-analyzing-featured-snippets",
  "slug": "what-we-learned-analyzing-featured-snippets",
  "title": "What We Learned From Analyzing 1.4 Million Featured Snippets - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "From optimal snippet length, to practical application tips, to which queries prefer tables, lists, or paragraphs, learn everything you need to know to supercharge your snippet wins.",
  "content": "What We Learned From Analyzing 1.4 Million Featured Snippets Advanced SEO | Content Marketing By: A.J. Ghergich January 17, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: A.J. Ghergich January 17, 2017 What We Learned From Analyzing 1.4 Million Featured Snippets Advanced SEO | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What you should know about featured snippets Recently my agency Ghergich & Co. teamed up with SEMrush to conduct an in-depth study on featured snippets. SEMrush generously compiled and shared 1,400,000 featured snippets from their database for us to analyze. What makes this study different? Our study focused on 30 questions, prepositions, and comparison search phrases instead of a random set of keywords. Anecdotally, many other SEOs and I saw that pages that answer questions — such as who, what, when, where, and how — tend to be great at earning featured snippets. Our goal was to see if our “gut feelings” were backed by data. In most cases they were, but with a few surprising caveats. Let's dive into the findings. Featured snippet questions Group findings The questions group as a whole is fantastic at earning featured snippets, especially paragraph snippets. “How” (46.91%) and “Have” (17.71%) significantly outperformed the other questions when it came to earning lists. “Which” (16.20%) was the top performer by a wide margin for earning tables. Breakdown of featured snippet questions: Featured snippet prepositions Group findings The prepositions group, as a whole, earned lists at the highest rate of any group. “For” (11.38%) was best at earning table snippets. “Like” (94.09%) was the best at earning paragraph snippets. Breakdown of featured snippet prepositions Featured snippet comparisons Group findings The comparison group as a whole excelled at earning tables. “Price” (38.56%) keywords earned tables at more than double the rate any other keyword in the group. Our “SEO gut” told us “vs” and “versus” keywords would rock at earning tables. Our gut was wrong. Instead, they were fantastic at earning paragraph snippets (99%). Breakdown of featured snippet comparisons Featured snippets overall breakdown I find it interesting that each group of keywords had a very telling overall pattern. The comparison group earning 11.72% tables seems like a low number. Remember, though, that the content has to exist in the top 10 search results and be in a proper table format. In my opinion, there are many cases where Google simply does not have a good table to show, so it defaults to an easier format, like paragraphs. Optimal featured snippet lengths Key findings: Featured snippet paragraph lengths The optimal length of a featured snippet paragraph is roughly 40 to 50 words, or around 300 characters. An earlier study by SEMrush also showed 40 to 50 words to be sweet spot for paragraphs, so I feel confident in this number. Key findings: Featured snippet list lengths The average number of items in a list was four, but that number is not what we should focus on. Instead, focus on the maximum number of items in the list. Here’s why that matters: When creating a list, it’s a good idea to make it longer than the eight-item maximum (when possible). This prompts Google to display the “More Items...” text, which can lead to better engagement. For that same reason, make each bulleted item have enough words in it so Google truncates each item. This can also be helpful if your list is shorter than eight items. Key findings: Featured snippet table lengths Like with lists, focus on the fact that Google is going to show a maximum of three columns and up to nine rows per table. A few things are going on here: You can see Google is showing “143 more rows,” just like it does with lists. However, the website Restaurant Meal Prices is actually outranking the best source for this information: Denny’s themselves. The problem is that Denny’s does not have their data formatted the way Google wants to display it — in a table. Google used to show “more columns,” but seems to have dropped that support and now just picks the most relevant 3 rows. Clearly my new low-carb diet is not affecting my search behavior. Practical application #1: Snatch featured snippets from competitors Here’s how: Review your top 10 rankings for keywords that show featured snippets, but that someone else is ranking for. Check to see if your content matches the format of the featured snippet. If you have a format issue, fix it. If the format is correct, tweak your answer to better match search intent. Once you upload your new content, use Search Console to force Google to quickly re-crawl that page. You may earn the snippet within 30 minutes, but it will most likely take a few days. If more than a week goes by, repeat steps three and four. Examples I ran steps one and two on Moz’s The Beginner's Guide to SEO, which is a great example of what foundational SEO content should look like. Let’s look at some low-hanging fruit. Keyword: \"How search engines work\" Moz ranks #1, but Google believes that Makeuseof.com is doing a better job of answering the search’s intent. Keyword: \"What is link building\" Again, Moz’s guide is ranking #1, but it isn’t earning the featured snippet. These are just two examples out of many I was able to quickly find for The Beginners Guide to SEO. I believe Moz could snatch featured snippets like these with simple text or format tweaks. The same opportunities are likely there for your site as well. Bonus: Once you are in a good place with this process, expand it to featured snippet keywords you rank 11th through 20th on. Typically, with a content refresh and some internal linking or promotion, you can move those to at least the 10th position in Google. Once you do that, you can earn the snippet. Practical application #2: Earn featured snippets during content production It’s easier to snatch snippets than to earn them from scratch, so start there. However, you are constantly creating new content, right? ...Right? When you craft new content, tailor it to earn featured snippets right out of the gate. Here’s how: Compile a list of keywords in your niche that show snippets you don’t rank in the top 20 for. Create new content optimized for the format Google uses to display the snippet. Start with content that reaches people in the bottom of the funnel, like comparisons.. The volume is low, but the conversions can be high. Rinse and repeat. Using this technique will give your editorial team a break. I've had the pleasure of presenting with Chris Bennett several times. To paraphrase one of his key points about content creation: When you use data to fuel topic ideation, content creation becomes more about resources and less about brainstorming. Bonus: Once you’re in a groove with new content production, you can branch out to keywords you think Google would show a featured snippet for if the optimized content existed. Keyword: \"How to choose keywords\" Moz ranks second. To earn a featured snippet, it could incorporate a list format on this page or encourage a contributor to create a new post formatted specifically for this topic. Remember, you don’t have to create an ordered list. For example, consider the following: Fine, but not necessary: Collect Underpants ??? Profit! This format works, too: Collect Underpants: The collecting of underpants is a proven way to 10x… ???: This second step has been shrouded in mystery. However, if you RT this post, give me your email and five of your richest and most gullible friends’ emails, I will show you exactly how to… Profit!: I know what you're thinking: Wow! This is too good to be true! But it’s not! Simply input your credit card number to unlock my automated underpants-collection and profit-making system. Believe me! Closing thoughts Do your site a favor. Conduct a featured snippet audit and start snatching, earning, and creating data-driven content targeted toward featured snippets. Do yourself a favor. Follow people like Dr. Pete, Rob Bucci, Eric Enge, Cyrus Shepard, and Glenn Gabe on Twitter. They all share studies, insights, and presentations on featured snippets (among other things). I plan to share a lot more snippets as well, so feel free to follow me, too: @SEO (shameless plug). Lastly, be sure to snag the raw numbers in this Google Doc. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What We Learned From Analyzing 1.4 Million Featured Snippets"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What We Learned From Analyzing 1.4 Million Featured Snippets"
    },
    {
      "level": "H2",
      "text": "What you should know about featured snippets"
    },
    {
      "level": "H3",
      "text": "What makes this study different?"
    },
    {
      "level": "H2",
      "text": "Featured snippet questions"
    },
    {
      "level": "H3",
      "text": "Group findings"
    },
    {
      "level": "H3",
      "text": "Breakdown of featured snippet questions:"
    },
    {
      "level": "H2",
      "text": "Featured snippet prepositions"
    },
    {
      "level": "H3",
      "text": "Group findings"
    },
    {
      "level": "H3",
      "text": "Breakdown of featured snippet prepositions"
    },
    {
      "level": "H2",
      "text": "Featured snippet comparisons"
    },
    {
      "level": "H3",
      "text": "Group findings"
    },
    {
      "level": "H3",
      "text": "Breakdown of featured snippet comparisons"
    },
    {
      "level": "H2",
      "text": "Featured snippets overall breakdown"
    },
    {
      "level": "H2",
      "text": "Optimal featured snippet lengths"
    },
    {
      "level": "H3",
      "text": "Key findings: Featured snippet paragraph lengths"
    },
    {
      "level": "H3",
      "text": "Key findings: Featured snippet list lengths"
    },
    {
      "level": "H3",
      "text": "Key findings: Featured snippet table lengths"
    },
    {
      "level": "H2",
      "text": "Practical application #1: Snatch featured snippets from competitors"
    },
    {
      "level": "H3",
      "text": "Examples"
    },
    {
      "level": "H4",
      "text": "Keyword: \"How search engines work\""
    },
    {
      "level": "H4",
      "text": "Keyword: \"What is link building\""
    },
    {
      "level": "H2",
      "text": "Practical application #2: Earn featured snippets during content production"
    },
    {
      "level": "H4",
      "text": "Keyword: \"How to choose keywords\""
    },
    {
      "level": "H2",
      "text": "Closing thoughts"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "A.J. Ghergich\n          \n            A.J. Ghergich\n          \n            A.J. Ghergich"
}