{
  "url": "https://moz.com/blog/what-to-content-to-create-expert-articles-or-shallow-blog-posts",
  "slug": "what-to-content-to-create-expert-articles-or-shallow-blog-posts",
  "title": "Which Content to Create: Expert Articles or Shallow Blog Posts? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you are a SEO, no matter, if it is your first week or another year of practice, you probably have a blog or a site to publish articles to get more visitors and, hopefully, customers. What kind of content should you create?Jasob Nielsen Speaks OutIn case you are new to SEO, or haven't bothered to…",
  "content": "Which Content to Create: Expert Articles or Shallow Blog Posts? Content Marketing A By: A.N.Onym July 10, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! A By: A.N.Onym July 10, 2007 Which Content to Create: Expert Articles or Shallow Blog Posts? Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. If you are an SEO, it doesn't matter if it's your first week or years into the practice, you probably have a blog or a site to publish articles to get more visitors and, hopefully, customers. What kind of content should you create? Jakob Nielsen Speaks Out In case you are new to SEO, or haven't bothered to touch on usability, Jakob Nielsen is widely recognized as a knowledgeable website usability person, though occasionally sneered at by practitioners for his condescending tone and occasionally peculiar advice. Recently, Jakob posted an article (or was it a newsletter entry?) about creating content for your website. In it, he states that you should focus on investing more time in your writing and creating the very top, expert articles in your niche. He also advises against writing short, shallow blog posts, which contribute little to the Web and diminish the value of your brand. The article is backed up by graphs, which summarize that more in-depth content draws more paying customers and that much more in-depth content generates more income (citing his report sales as an example). What Jakob Got Wrong In my very, very humble opinion, what Jakob got wrong is that he equated expert writing with articles and shallow writing with blogs. While this may be true in general, there are many more instances of quality blog posts and plenty of shallow articles (article directories for instance.) It doesn't really matter what software you use to create a piece of content, be it a static page or a blog post, but the amount of value you put in it. Speaking of value. Jacob seem to be considering that the more time you put in your post, the better it is. Generally, this is true. But if you are an expert in your field and have spent a lot of time on some specialized area of your practice, you'll be able to write plenty of solid posts in a much smaller amount of time. Also, Jakob seems to think that luxury item sellers don't need great content. That makes little sense. The harder it is to sell the item, the more authority (brand, expertise) you need to sell the item. Quality content in any form, be they articles, blogs, newsletters, forum postings, comments, etc. will help you to increase your authority. This point of view shouldn't contradict to Jakob's, it is just for various products and services different types of content will get different benefits. For example, on a nuts selling website, creating expert articles will still get relevant links and visibility, albeit little direct customers (for a nuts seller, a social media piece of content seems more worthwhile). What You Need to Know Inaccuracies aside, however, Jakob did get a couple of things right: more quality content is worth more (that's easy, right?), so you need to focus on quality, not quantity quality content takes time to create you need to strive to be a leader in your niche (if the niche is too broad, make a smaller one) by creating great content you make it harder for your rivals to compete with you absolutely great content creates above-linear value (that's a subtle, but important difference) you still need to format your content well for it to be well received By creating great content, you: move closer to the top of the recognized industry experts add focused, on-topic (with right words) pages to your website gain more links to your articles than to random posts make it easier to put your ideas to practice through partners and customers convert visitors to partners, employers, clients and customers Of course, as mentioned earlier, you shouldn't limit yourself to rigidly producing articles. You can run a blog, communicate with other bloggers and industry people by writing about some noticeable events in the industry, share opinions and tips with others. This all will help build relationships with the people you are interested in, as well as assist in making your great content noticeable. An Example A good example of such practice would be SEOmoz itself. First of all, Rand not only publishes expert articles, but also: publishes random thoughts on events in the industry, as well as responses to other blog posts, thus building conversations allows other mozzers to contribute invites you to write for the YouMOZ section, too. Take Web 2.0 Awards, for example. Though the awards are not related to the SEO industry and bear not as much expert information value, though created by apparent Web 2.0 experts, they have gained a lot of visibility, as well as plenty of links. Rounding up Though listening and following the advice of the experts seems easy and error-proof, you should find your own way. Creating expert articles or blog posts, or discussing important topics on your blog, it is your own way to build authority in your field. Sooner or later, you'll find the most suitable way to go, if you keep on learning, anyway. p.s. Read a great discussion of Jacob's article at Cre8asite Forums. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Which Content to Create: Expert Articles or Shallow Blog Posts?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Which Content to Create: Expert Articles or Shallow Blog Posts?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "A.N.Onym\n          \n            A.N.Onym"
}