{
  "url": "https://moz.com/blog/what-im-thankful-for-this-thanksgiving",
  "slug": "what-im-thankful-for-this-thanksgiving",
  "title": "What I'm Thankful for this Thanksgiving - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm just going to go crazy with this one because I have so much to be thankful for (note that a lot of this will be Pubcon-centric, due to the timing).\n\n    Getting out of debt and turning SEOmoz into a profitable company - I owe almost all of it to the people who read this blog (and the rest…",
  "content": "What I'm Thankful for this Thanksgiving SEO Events By: Rand Fishkin November 23, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 23, 2006 What I'm Thankful for this Thanksgiving SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm just going to go crazy with this one because I have so much to be thankful for (note that a lot of this will be Pubcon-centric, due to the timing). Getting out of debt and turning SEOmoz into a profitable company - I owe almost all of it to the people who read this blog (and the rest directly to Danny Sullivan). Mystery Guest - I know we struggle when I'm on the road, but she's everything to me. Joe Morin, who's been a friend through thick and thin My team here at SEOmoz - Matt, Gillian, Si, Rebecca, Scott, Brandon, Jane & Jeff; you're all amazing. Chris Hooley's Drinkbait - that Bombay Sapphire will get me through a hard day next week :) Great people like Todd Malicoat. I can't believe what a geniunely good person he is. Rae Hoffman - for showing me the wonders of Paigow, Craps & high-priced call girls at the Wynn (and for being incredibly sweet to me during all of Vegas) Stanford Publishing - I had a fantastic time with Leslie & Beth (photo) in Monterey. Brett Tabke for the invitation to speak at my first Pubcon Scott, Aaron & Andy for organizing a terrific lobster & steak dinner in Vegas (despite the fact that I got berated for being a white hat) Mike McDonald from Webpronews, who posted a nifty video of me, four beers into Pubcon, chatting with Lee & Todd about links. Note how I say \"like\" and \"you know\" much more frequently than normal - it's practically embarassing :) Kim Krause, who's been struggling to balance work and family but still writes one of the most captivating and personal blogs in the tech world. Three pro football games on Thanksgiving - thanks NFL (even if the first game is Miami v. Detroit) Wil from ThinkSeer, with whom I exchanged only a few words at Pubcon, but was thorougly impressed and blown away by his kindness. Lee Odden, whose terrific staff members Karen & Jolena were incredibly friendly and warm throughout the conference (Lee also shot this short video of me and has a whole set of great videos from the conference here). Google, Yahoo!, MSN and Ask, who've given all of us a profession. Barry Schwartz's keen photographic skills (and Flickr on the whole for being such a great photo resource). Bob Rains, who flat out rocks. Maybe most of all, I'm thankful that tomorrow, I get to spend the day with my family, eating, talking, and sharing time together. You can't ask for more than that. I'm sure I've forgotten a ton of people and will have to make amends next week. Until then... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What I'm Thankful for this Thanksgiving"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What I'm Thankful for this Thanksgiving"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}