{
  "url": "https://moz.com/blog/what-microsoft-edge-means-seos",
  "slug": "what-microsoft-edge-means-seos",
  "title": "Goodbye Internet Explorer, Hello Microsoft Edge - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We've all felt the pain of dealing with Internet Explorer in one way or another. Now that Microsoft is deprecating IE and introducing Edge as their new browser, it's good news for SEOs and web devs alike!",
  "content": "Goodbye Internet Explorer, Hello Microsoft Edge SEO Basics By: Billy Hoffman December 10, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Billy Hoffman December 10, 2015 Goodbye Internet Explorer, Hello Microsoft Edge SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With the release of Windows 10, the general public can now use Microsoft Edge, Microsoft's new flagship web browser. Microsoft is striking out in new directions with Edge — they're deprecating Internet Explorer for all modern platforms. Such a drastic change is rare in the web development world, so it makes sense to take a moment to understand what this change means. In this article, we'll discuss Microsoft Edge and see how it removes many of the annoying issues of cross-browser development, making it easier for SEO professionals to focus their time and energy on content creation, rather than browser optimization for said content. Where did Edge come from?To fully understand how Microsoft Edge impacts the SEO and web landscape, it's important to understand where it came from. Microsoft Edge started as a project to improve the rendering engine inside of Internet Explorer. The rendering engine is pretty important, since it's the lens through which your content has to pass. Unfortunately, much like a game of telephone, this process can distort or degrade the experience the author intended by the time it gets to the end user. Indeed, working around browser quirks or bugs which are impacting the experience of viewing your web page is an all-too-common task web developers and content creators have to deal with. IE's rendering engine, Trident, is nearly 20 years old. Much like a snowball rolling downhill, over time it's grown large and unwieldy with 20 years' worth of old technology and relentless browser bugs. Edge started as an attempt to create a new rendering engine from start, which could leave behind much of the cruft and bulk that had accumulated in Trident. Eventually, this \"replace the core of a legacy web browser\" project became a \"create a new, modern web browser\" project, and thus Microsoft Edge was born. By completely replacing IE with Edge, it's clear that Microsoft believes Edge represents the path forward. This means that Edge and its capabilities will directly affect SEO professionals in the years to come. With this in mind, let's discuss how Edge is different and represents a change in strategy both for Microsoft and for web development at large. Improving by discardingOne of the biggest differences and primary benefits of Microsoft Edge over IE could be summarized as \"better standards support and bug fixes.\" However, such a statement really doesn't convey the huge benefits this brings. Supporting new standards not only allows you to create great online experiences across all browsers, it also means that you won't need to do anything special to make your web sites work properly in Edge. Intriguing, right? You'll spend less time writing custom markup or working around browser quirks and more time focusing your time and efforts elsewhere. By more closely adhering to web standards, there's a lot of cruft in your markup you'll no longer need. A few that come to mind: Dozens of JavaScript polyfills which attempt to add features to IE IE conditional comments Extra <div> or <code><span> nesting tags to work around CSS bugs Using the X-UA-Compatible header to target specific IE Render modes Quirks mode triggers Luckily, we can see exactly what web standards Microsoft is implementing on the Edge platform status page. We can see support for new web standards like HTTP2 and asm.js are already adopted. The progress of Edge over Internet Explorer is even more obvious in this comparison page from CanIUse: There are dozens and dozens of new APIs and browser features that have already been implemented. By adopting new standards and fixing bugs, the deprecation of IE and introduction of Edge allows web professionals to focus on what's really important when it comes to their online marketing strategy. Imitation begets functionality The mobile web is an area where Microsoft has historically suffered. Apple's iOS and Google's Android dominate the smartphone market, and their mobile browsers are both based on WebKit, an open source rendering engine. As a result, many mobile websites are written specifically to work with WebKit features. These WebKit-specific sites then look at the incoming user agent string from a visiting browser. When developers fail to account for this, the site will think the mobile IE browser is actually a desktop site, and will render as the desktop version instead of as the mobile version. Microsoft discussed this in a blog post last year, and you can see an example of the Hawaiian Air site being rendered as a desktop site on a mobile device in the screenshot below, alongside the proper mobile version: Image via Microsoft Obviously, this creates a pretty poor user experience. With Edge, Microsoft's browser is actually impersonating both Apple's Safari browser and Google's Chrome browser in its user agent string. In other words, Edge is telling websites it's actually a different, non-Microsoft browser in an attempt to get the correct content and to render the web page properly. Beyond just pretending to be WebKit, Microsoft wants Edge to work just like WebKit. So much so, in fact, that Microsoft has declared they consider any difference between how Edge and WebKit render a page to be a bug that they'll fix. While this might be the single most damning indictment of Microsoft's ultimate position in the web browsing space, it's an enormous benefit for web devs and content creators. Microsoft is so committed to implementing new standards and achieving feature and functionality parity with the other web browsers, it actually pretends to be those other browsers. This is a huge win: It means that Microsoft is spending ample resources to ensure that content is rendered the same across browsers. It's one less thing for you to worry about. More frequent updates We know that when browsers support new web standards, developers can focus on creating content instead of fighting with browsers to render that content. But we need more than support for standards — we need that support in a timely fashion. After all, the promise of an amazing, up-to-date browser years in the future doesn’t help anyone. So the rate that browsers get these new features is pretty important. New versions of Firefox and Chrome are released rapidly, usually on a 4–8 week time scale. While a release might contain relatively few features, this rapid release schedule means that support can be added quickly for new standards, and major bugs can be addressed before they become a widespread problem. With IE, Microsoft only made changes to its rendering engine or added support for new standards with major releases. Thus, IE8 didn't get any new features until IE9 beyond monthly security patches. While each major release of IE could bring an enormous amount of improvements, they could be 1 or 2 years apart. This \"seldom but large\" release cadence has 2 big issues. Support for new web standards — in real timeFirst, consider a world where some version of IE came out that perfectly supported every known web standard. Now, let's say the day after that version of IE was released, a new web standard was created. It would be at least year or more before IE would support that standard, whereas Chrome or Firefox could support it in a month or two. Faster bug fixesThe impact of bugs is also magnified by this type of release schedule. If another browser had a bug or shortcoming in their rendering engine, they could just patch the bug and put out a release. With IE, developers had to deal with bugs for years. In one example, developers were forced to deal with IE not recognizing or rendering new HTML5 tags for years. In fact, they had to create a JavaScript polyfill to provide some level of support themselves with the HTML5 Shiv library. Thankfully, with Microsoft Edge, it appears this \"seldom but large\" release cadence is being changed to more closely mirror the \"small and often\" approach of the other browsers. From the Microsoft Edge Dev FAQ: In Windows 10, we are delivering Windows as a service, updated on a cadence driven by quality and the availability of new features. We won’t have a fixed schedule for browser feature updates. We’re committed to providing regular updates to our evergreen platform for web developers and customers alike. By embracing a faster release cycle, we should see even faster adoption of web standards and shorter windows for problems if any browser bugs do slip through. Edge's impact and the future Microsoft Edge represents a shift in how Microsoft is developing and releasing web browsers. With greater standards support, SEO and web professionals can devote less time to working around browser compatibility problems and more time on what's important, like creating compelling content. Since Microsoft Edge impersonates other browsers, you don't even really need to know that it exists, much less go to extra lengths to take advantage of its features. Additionally, if any problems surface or new standards are released (as they inevitably will be), the accelerated development cycle of Microsoft Edge means those items will quickly be resolved. In many ways, time is your most valuable asset — Microsoft is doing SEOs a favor by introducing a browser that saves so much of it. In the end, the rise of Microsoft Edge should make it far easier to create high-quality sites with a great user experience, which is something we're super passionate about at Rigor. If you're interested in how you can make a fantastic web experience for your visitors, be sure to check out our free performance report. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Goodbye Internet Explorer, Hello Microsoft Edge"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Goodbye Internet Explorer, Hello Microsoft Edge"
    },
    {
      "level": "H2",
      "text": "Where did Edge come from?"
    },
    {
      "level": "H2",
      "text": "Improving by discarding"
    },
    {
      "level": "H2",
      "text": "Imitation begets functionality"
    },
    {
      "level": "H2",
      "text": "More frequent updates"
    },
    {
      "level": "H3",
      "text": "Support for new web standards — in real time"
    },
    {
      "level": "H3",
      "text": "Faster bug fixes"
    },
    {
      "level": "H2",
      "text": "Edge's impact and the future"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Billy Hoffman\n          \n            Billy Hoffman\n          \n            Billy Hoffman"
}