{
  "url": "https://moz.com/blog/what-do-you-expect-to-get-out-of-image-search-traffic",
  "slug": "what-do-you-expect-to-get-out-of-image-search-traffic",
  "title": "What Do You Expect To \"Get\" Out Of Image Search Traffic? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At any given time, our Q&A section usually features a question or two about image optimisation. People want to know why their images haven't been indexed or aren't appearing for their key terms, even after they have added keywords to every imaginable attribute. Appropriate anchor text,…",
  "content": "What Do You Expect To \"Get\" Out Of Image Search Traffic? Advanced SEO By: Jane Copland April 2, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland April 2, 2008 What Do You Expect To \"Get\" Out Of Image Search Traffic? Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. At any given time, our Q&A section usually features a question or two about image optimisation. People want to know why their images haven't been indexed or aren't appearing for their key terms, even after they have added keywords to every imaginable attribute. Appropriate anchor text, nearby-keywords and relevant surrounding content don't seem to have made a difference. The images don't show up. In their place, ridiculously irrelevant things rank for a person's keywords.I, and others, have puzzled over Google Images' approach to image search for quite a while. We've carried out experiments, silly and serious, and have discerned various truths about how Google indexes and ranks image files. However, all knowledge aside, I wonder what exactly the average website owner or SEO expects to gain from image search traffic.Firstly, let me tell you how I use Google Images, or any other image search engine. If I venture to the second link atop Google's search pages, I have one of four three objectives: Find out what something looks like. I click all the way through to the file, bypassing the page on which the image is hosted. After all, it might take me longer than two and a half seconds for the page to load, and it will probably take me at least as long to locate the image. This is precious time that I can't waste in search of my picture. I am, after all, acting as a typical web user for whom one extra second one second too long. To swipe an image for my own purposes. Too lazy to Photoshop something? Need a quick pic for a blog post so it's not totally devoid of aesthetically pleasing content? On the hunt for a new desktop image but not bright enough to head straight to Flickr? I won't be sticking around to find the picture in its original context this time, either. I'll click straight to the (usually) jpeg file. To see if any of my experiments are producing interesting results. For this, I don't even have to click through. Um. I thought that list would be longer when I started it, but I can't think of another reason why I use image search. I don't use image search engines to find products that I'm actually going to buy. I definitely window-shop, but my presence on these sites is as profitable to the sites' owners as I am when I try on clothes in a store and don't buy anything. The only time I've done anything vaguely commercial with an image search was at Best Buy last weekend when I searched for my television set to determine whether I should purchase the grey or graphite-coloured sound system.If a person is researching a product in order to make a purchase, I wonder how likely it is that the image searches they carry out result in conversions on the same site. I feel that the equation is very different if a search starts at a regular search page. For me, image search is often a prerequisite for purchases, but I search for something I'll eventually buy elsewhere. In fact, I rarely notice which sites host the images through which I'm browsing.Although I'm basing these assumptions purely on my own search habits, I'm prepared to back up the idea that image visitors are pretty useless with some data of my own. Over a nine month period, a site I manage has enjoyed a relatively high amount of image search traffic. However, out of that traffic: The average time spent on the site is 1 minute, 22 seconds. Looking through the visits, this number has been skewed a bit by a couple of people who seem to have opened the site and subsequently forgotten to close their browser / tab. These people like to come by every now and again to really screw up averages. Without them, the average time on the site for image traffic is 32 seconds. The average number of pages viewed is 1.63. Invariably, the second click is to the homepage. 64.95% Bounce rate. This doesn't strike me as too awful for an image search, but together with the other stats, it adds to the fact that these people aren't sticking around.Not-so-incidentally, the images are completely relevant to the search terms by which they're found and they're also very relevant to the general topic of the site as a whole. However, day after day, image traffic doesn't stay for longer than a minute and very rarely returns.So what, if anything, are we doing wrong? Image search issues being so popular lately, there seems to be a notion out there that this traffic can be captured. Perhaps I'm atypical of the average image search user, although I highly doubt it, since I was searching this way long before I got into SEO. In other words, since when I was a \"normal.\"We can generally accept that the more technical and specific the search query, the more likely it is that a person is in the mood to buy, rather than window-shop. Example: a search for \"car stereo\" is less likely to result in a purchase than \"Panasonic CQ-TX5500D Vacuum Tube Car Stereo.\" Most of the time, the image search queries I see fit squarely into the first camp. Do people perform complex, conversion-suggestive searches for images? As I mentioned above, I did just that this weekend in order to remember what my television looks like (come on - I look at what's on the screen, not the colour of the plastic!) but I had no intent of buying anything from the site whose picture I looked at... for about ten seconds.What do you generally wish to gain from image search traffic? Do you even care about it? Of course, I ask in the knowledge that people who run image libraries, photography businesses and similar sites for which aesthetics are important need to appeal to image search users. However, for general web business, should we really continue to fret over the odd choices Google makes when sorting its index of pictures? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Do You Expect To \"Get\" Out Of Image Search Traffic?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Do You Expect To \"Get\" Out Of Image Search Traffic?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}