{
  "url": "https://moz.com/blog/whats-new-in-moz-pro",
  "slug": "whats-new-in-moz-pro",
  "title": "Fresh Features & Functionalities: A Six-Month Lookback at What’s New in Moz Pro - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "From our Product Manager to you: See what we've been up to for the past six months to help improve your day-to-day workflows.",
  "content": "Fresh Features & Functionalities: A Six-Month Lookback at What’s New in Moz Pro Moz Tools | Marketing Industry By: Rachel Goodman Moore August 20, 2019 Table of Contents Copied! By: Rachel Goodman Moore August 20, 2019 Fresh Features & Functionalities: A Six-Month Lookback at What’s New in Moz Pro Moz Tools | Marketing Industry If you’re anything like me, you might be wondering how the heck it's already August — where did the first half of the year go? As we move into the last months of 2019, it’s a great time to reflect on what we’ve accomplished so far this year. And here at Moz, we’ve been hard at work getting a bunch of cool features out the door. We’ve made these improvements with you in mind, to help your day-to-day workflows and make your experience in our tools easier and more efficient. Ready for a quick look back at the new functionalities we’ve rolled out? Let’s do it! Not a Moz Pro user yet? Start a free trial today! Domain Authority 2.0 Gauging the strength of a website can be a complicated task. Moz’s Domain Authority (DA) metric has served the SEO industry for years as one such method of measurement. In March, we updated the algorithm that powers DA — to keep pace with the search engines and predict ranking ability better than ever before. You can use DA to identify the growth of your own site over time, understand the strength of your website against competitors, determine the difficulty to rank on a particular SERP, and much more. Pro tip: Always use DA as a relative metric in comparison to your competitors’ sites, rather than as an absolute metric in isolation. Want to know how others are using Moz Pro to get the competitive edge? See how TopSpot increased their organic traffic by 29 percent within 90 days of switching domains by leveraging Link Explorer, Page Authority, and DA. Read the case study Editor's note: Want to check your Domain Authority? You can use Link Explorer, our original Domain Authority Checker, or find DA metrics with MozBar - our SEO toolbar, the free Domain SEO Analysis tool, or in your Pro campaigns. Keyword Clustering Keyword clusters are groups of closely-related keywords — and tracking keywords as clusters (rather than as individual terms) allows you to more accurately track your ranking, understand your search visibility, and stay ahead of your competitors. In June, we introduced fresh functionality in Campaign setup that supports clustering of semantically-related keywords. We’ll even help you get started by automatically suggesting potential clusters and keywords you might want to track as part of these groups! As you set up a Campaign to begin tracking a site, you’ll have the opportunity to group keywords into different clusters. Once you’ve got your Campaign set up, the Search Visibility graph in the Rankings section will allow you to compare multiple clusters to each other. To see a keyword cluster’s performance, use the filter. Click the plus sign, and type in the names of the clusters you’d like to compare. This will give you a visual representation for how each keyword cluster is performing – including which are your strongest topics, and which are your weakest, to identify what areas need more attention. Pro tip: Consider building separate clusters for each of the product types you offer, the types of services your business provides, or related query types that you hope to rank for. Bulk upload keywords by CSV Speaking of labels and keyword clusters, we’ve made one of your most-requested features a reality and added the option to bulk upload keywords to a Campaign. Rather than adding keywords manually, use a CSV to quickly and easily upload keywords, with labels and locations tied to them. In your Tracked Keywords Overview, simply click Add Keywords and toggle to the Upload CSV tab. Filter by SERP Feature in Keyword Lists Having trouble prioritizing keywords? Identify opportunities for featured snippets and other SERP features faster than ever. If you already have a keyword list in Keyword Explorer, simply hop into the list and refresh all keywords. Once the list is refreshed, you’ll be able to quickly view, filter, and export SERP Feature data for your keywords. Don’t have a list yet? Just add keywords from Keyword Explorer into a list, and you’ll be off and running! Pro tip: Want the inside scoop on which content is most likely to win you a particular feature snippet type on a SERP? Use this filter to get a glimpse into which terms already have featured snippets; then apply what you’ve learned to drive your own content creation. Advanced filtering in Keyword Suggestions Keyword research can take even the savviest SEO quite a bit of time to navigate. Advanced filtering in Keyword Explorer helps you to keep your keyword research laser-focused and saves you major time and effort. Filter your keyword suggestions to include a particular term that is important to you— or exclude a term that you don't need mucking up your suggestions list. Stack up your \"includes\" and \"excludes\" to refine your suggestions list and ensure you're seeing the types of keywords that meet your needs. Pro tip: Try excluding branded terms (your own, or your competitors’ branded terms) to keep keyword suggestions brand-agnostic. Format annotations in Custom Reports Custom Reports allow you to share your hard work and SEO efforts with stakeholders, providing the opportunity to pull in areas of your Moz Pro Campaign. Drag and drop modules from your Campaign into your custom-ordered report, and add customizable notes to help your readers understand and interpret your SEO work. All-new custom formatting of those notes allows you to add in your preferred formatting — from headers to font formatting, to bullets, links, images, and more, using Markdown. Ensure that the stakeholders reading your reports know exactly what your work means and see the value of the SEO efforts you've been working on. Improved Moz Pro navigation We’ve improved navigation within Moz Pro to help you quickly access all areas of the tool. In the left navigation, you’ll have the option of toggling between Campaigns, navigating around a Campaign easily, and hopping straight into the research tools. \"Make a Suggestion\" button If you’ve ever been in the Moz tools and thought, “I wish I could tell Moz how I feel about this feature!” this one is just for you. When you hop into a Campaign, you’ll notice a button on the top of your Dashboard that says “Make a Suggestion.” A click of this button will give you the power to tell us what you want to see. We love hearing from you and we're always looking for ways to iterate and improve our product for you so that your job as an SEO is as easy as possible. Outside of Moz Pro, other big things are happening Moz Certification We launched the Moz Certification in April — an instructor-led, six-part course covering the SEO Essentials. The Certification brings six hours of online content that you can take at your own pace and includes exams to test your knowledge as well as and a LinkedIn badge to share your credentials with your network. Client Onboarding Course Outside of the Certification, we also have standalone courses on additional topics, including our newest addition: The Client Onboarding Course — perfect for when you've just signed a new SEO client and want to know what the next steps are. This course delves deep into internal communication processes, how to best get to know your new client, setting expectations—and even provides a new client questionnaire that Moz’s SEO experts have developed. New Moz Local As local search continues to evolve, we’ve been working to evolve our toolset in a number of ways. The launch of the new Moz Local in June brought features like real-time profile management and sync, data cleansing, automated duplicate detection and deletion, and deep integrations with Google and Facebook. The new platform also provides the chance to manage your reviews and post to social networks, straight from the Moz Local interface! Check out how PAPYRUS saw a 42 percent increase in direction requests and a 26 percent increase in click-to-call requests after Wpromote harnessed Moz Local to optimize their business listings. This drove 90,000 more potential in-store shoppers annually and was celebrated by the US Search Awards! Read the case study And there’s more to come! That's just the tip of the iceberg. We have oodles of exciting more launches on the docket before the end of the year is through. Stay tuned! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Fresh Features & Functionalities: A Six-Month Lookback at What’s New in Moz Pro"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Fresh Features & Functionalities: A Six-Month Lookback at What’s New in Moz Pro"
    },
    {
      "level": "H2",
      "text": "Domain Authority 2.0"
    },
    {
      "level": "H2",
      "text": "Keyword Clustering"
    },
    {
      "level": "H2",
      "text": "Bulk upload keywords by CSV"
    },
    {
      "level": "H3",
      "text": "Filter by SERP Feature in Keyword Lists"
    },
    {
      "level": "H3",
      "text": "Advanced filtering in Keyword Suggestions"
    },
    {
      "level": "H3",
      "text": "Format annotations in Custom Reports"
    },
    {
      "level": "H3",
      "text": "Improved Moz Pro navigation"
    },
    {
      "level": "H2",
      "text": "\"Make a Suggestion\" button"
    },
    {
      "level": "H2",
      "text": "Outside of Moz Pro, other big things are happening"
    },
    {
      "level": "H3",
      "text": "Moz Certification"
    },
    {
      "level": "H3",
      "text": "Client Onboarding Course"
    },
    {
      "level": "H3",
      "text": "New Moz Local"
    },
    {
      "level": "H2",
      "text": "And there’s more to come!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rachel Goodman Moore\n          \n            Rachel Goodman Moore\n          \n            Rachel Goodman Moore"
}