{
  "url": "https://moz.com/blog/what-would-you-want-to-learn-from-a-linkbait-panel",
  "slug": "what-would-you-want-to-learn-from-a-linkbait-panel",
  "title": "What Would You Want to Learn from a Linkbait Panel? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As Rand mentioned in his Rewriting the Beginner's Guide post, he and I will be speaking at SMX Social Media next Monday and Tuesday. Once again, I will be speaking on the Linkbait panel with my buddies Brent Csutoras and ...",
  "content": "What Would You Want to Learn from a Linkbait Panel? SEO Events By: Rebecca Kelley October 9, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley October 9, 2007 What Would You Want to Learn from a Linkbait Panel? SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As Rand mentioned in his Rewriting the Beginner's Guide post, he and I will be speaking at SMX Social Media next Tuesday and Wednesday. Once again, I will be speaking on the Linkbait panel with my buddies Brent Csutoras and Cameron Olthuis (and with Jane speaking on the Linkbait panel at SMX London in mid-November, it seems that Rand has officially passed the Linkbait panel torch to his employees). This will be the third time I'll be speaking on a Linkbait panel. The first time I spoke on it, I provided examples of some of our more successful linkbait campaigns, whereas the last time I spoke on the panel (at SES San Jose), I gave the audience an overview of what linkbait is and why it's important. I've been assigned the same topic for this upcoming conference, but I really want to change things up a bit. I'm not a fan of recycling the same presentation, so I want to come up with something fresh and new that the audience will enjoy. Here's where I seek out the advice of our talented and savvy SEOmoz community. What would you want to learn if you were in the audience during a Linkbait session? What sort of topics do you think I should cover/address? How can I provide both value and entertainment to the attendees? Keep in mind that I only have 15-20 minutes and that Cameron and Brent will likely cover case studies--I just get to present the 101 stuff. Social media is definitely one of the more fun aspects of SEO and Internet marketing, so I'm really looking forward to this entirely social media-focused conference. The sessions should be novel and exciting, and I want to kick ass and take names as well so that Danny won't see me fail, impose a lifelong SMX ban, and reduce me to presenting about how no, I don't work for Google to my family members in the basement of a Budget Inn. So yeah, any advice or suggestions are welcome. Before I go, Cam pinged me to mention the Internet Marketers of New York Charity Party, co-sponsored by Best of the Web. The event is Monday, October 15, at the Town Tavern Bar & Grill, from 7-10 pm. It costs $40 to attend the event, but there will be an open bar plus the door donations will go to the Leukemia and Lymphoma Society. Rand and I will be attending, as well as a bunch of other talented SEOs, so if you're attending SMX Social Media, I highly recommend attending the event to both donate to a great organization and to network with some of the finest folks in the industry. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Would You Want to Learn from a Linkbait Panel?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Would You Want to Learn from a Linkbait Panel?"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}