{
  "url": "https://moz.com/blog/what-super-bowl-commercials-can-teach-us-about-seo",
  "slug": "what-super-bowl-commercials-can-teach-us-about-seo",
  "title": "What Super Bowl Commercials Can Teach Us About SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Now, I know what you're thinking: \"Steve just wrote this post so he could watch old Super Bowl commercials.\" And you're not wrong ;-) I'll jump at any chance to watch (and share) YouTube videos. Fortunately, in the process of sifting through my favorite ads from years past, I was able to select a…",
  "content": "What Super Bowl Commercials Can Teach Us About SEO SEO Basics By: Steve Webb, Ph.D. February 3, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Steve Webb, Ph.D. February 3, 2012 What Super Bowl Commercials Can Teach Us About SEO SEO Basics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Now, I know what you're thinking: \"Steve just wrote this post so he could watch old Super Bowl commercials.\" And you're not wrong ;-) I'll jump at any chance to watch (and share) YouTube videos. Fortunately, in the process of sifting through my favorite ads from years past, I was able to select a few videos that can actually teach us valuable SEO lessons. So sit back, and enjoy these all-time great Super Bowl commercials, while I drop a few SEO nuggets of knowledge along the way. Anything You Can Do, I Can Do Better Our first video is truly a classic... and one of the best examples of one-upmanship you will ever see. Of course, I'm referring to \"The Showdown,\" the 1993 McDonald's Super Bowl commercial in which Michael Jordan and Larry Bird play an epic game of H.O.R.S.E. A few days ago, David Klein wrote a nice post about strategic link building. In this post, David references the old outrun a lion joke, which goes like this: two men are walking in the jungle when they see a lion running towards them. One of the men immediately puts on his running shoes. The other man, in a state of shock, asks, \"Do you seriously think you're going to outrun that lion?!?!\" To which his walking partner replies, \"I don't have to outrun the lion. I just have to outrun you.\" The joke's punchline applies to almost every facet of SEO. Whether it's organic search, PPC, or social media, your strategy doesn't have to be the best in the world. It just has to be better than the strategies of your competitors. So the important question becomes, \"What are my competitors' strategies?\" To help you answer this question, I'll quickly run through a few tools you might find helpful (feel free to add more in the comments). For organic search and PPC, you can identify your competitors' keywords with SpyFu. For link building, you can research competitors' backlinks using Open Site Explorer and SEO Book's link analysis tools. For social media, I recommend reading Rand's post about tracking the ROI of social media. His ideas for tracking your social presence can also be applied to monitoring your competitors. Finally, to learn even more about your competition, I strongly recommend Selena Narayanasamy's guide to competitive research. You've Got To Pick Your Battles In the previous section, I emphasized the importance of doing whatever it takes to beat your competitors. However, going head to head with your competitors is not always the most effective strategy. Sometimes it makes more sense to fly under the radar or employ a completely unique strategy to avoid your competition and accomplish your goals. To illustrate this point, our next video is Coca-Cola's 2008 Super bowl commercial, \"It's Mine,\" which includes a bitter competition between Stewie and Underdog that is ultimately won by a surprise participant. Knowing which battles you can win and which ones will be losing efforts is critically important in SEO, especially when you're creating your initial SEO strategy. For example, you don't want to waste your resources competing against well-established brands for a few highly competitive organic keywords when you can allocate those same resources towards competing for a larger number of less competitive keywords. In fact, this is actually the number one keyword research mistake identified in a recent post by James Agate. The same thought process also applies to PPC management. If you're in an extremely competitive industry with high dollar CPC keywords, you can quickly exhaust your budget if you don't make appropriate strategic decisions. Don't make the mistake of bidding on keywords simply because your competitors are doing so. You need to conduct your own independent research to identify keywords that convert well for your website. Always Get A Second Opinion We all have our own favorite analytics package, reporting system, backlink investigator, etc. And I'm not here to kick off a flame war about which tool or data source is better. I just want you to realize that no matter what your favorite tool or data source is, it never hurts to get a second opinion, which can help capture a more representative view of your problem space. Alternatively, if you rely too heavily on one approach, you might find yourself in a situation where you only see what you want to see (and miss important insights that a second opinion could have offered), which is exactly what happens in our next video: CareerBuilder's 2006 Super Bowl commercial, \"Monkey Business.\" To help you find a second opinion in various areas, I will list a few resources here, and I encourage you to add more in the comments. First, on the analytics side of things, Aaron Wall wrote a great post about why you should use multiple analytics tools, and Mat Bennett recently posted a list of 7 alternatives to Google Analytics. For keyword research, you can use Wordtracker and WordStream as alternatives to Google's Keyword Tool. Finally, for investigating backlinks, I've already mentioned a few options above, but you can also try Ontolo's link building tools. (Social) Sharing Is Caring As we're all well aware, the social Web is stronger than ever in 2012, and there are no signs that it will slow down any time soon. So whether it's getting your content tweeted on Twitter, liked on Facebook, or +1ed on Google+, you should definitely incorporate social signals into your SEO arsenal. And that brings me to our next video, which teaches us the importance of sharing: Emerald Nuts' 2005 Super Bowl commercial, \"Exaggerating Dad.\" I've already linked to Rand's post about measuring social media's ROI (if you haven't already read it, I encourage you to do so), but here are a few more socially relevant resources. First, given Google's strong commitment to Google+, I recommend AJ Kohn's comprehensive Google+ SEO guide. On the Facebook side of things, check out Jennifer Lopez's post about Facebook marketing tactics you might not know about and Adam Sherk's list of Facebook analytics tools. Finally, for Twitter, you can use Twitter Web Analytics, or you can read David Strom's list of Twitter analytics tools. If You Will It, It Is No Dream Our last lesson extends well beyond the world of SEO. Regardless of what activity you're participating in (whether it's SEO-specific like link building or life-specific like getting in shape), perseverance is the key. We're all familiar with the old adage, \"It's a marathon; not a sprint,\" and those words are particularly true for SEO activities. With that in mind, our final video is Volkswagen's 2011 Super Bowl commercial, \"The Force\" (you can't have a list of Super Bowl commercials without this one popping up). Be like Mini Vader, and don't give up! I hope you enjoyed the videos and learned a few things along the way. I don't know about you, but I'm excited to see what this year's Super Bowl commercials can teach us about SEO. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Super Bowl Commercials Can Teach Us About SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Super Bowl Commercials Can Teach Us About SEO"
    },
    {
      "level": "H2",
      "text": "Anything You Can Do, I Can Do Better"
    },
    {
      "level": "H2",
      "text": "You've Got To Pick Your Battles"
    },
    {
      "level": "H2",
      "text": "Always Get A Second Opinion"
    },
    {
      "level": "H2",
      "text": "(Social) Sharing Is Caring"
    },
    {
      "level": "H2",
      "text": "If You Will It, It Is No Dream"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Steve Webb, Ph.D.\n          \n            Steve Webb, Ph.D.\n          \n            Steve Webb, Ph.D."
}