{
  "url": "https://moz.com/blog/what-google-needs-to-do-with-youtube-to-make-me-happy",
  "slug": "what-google-needs-to-do-with-youtube-to-make-me-happy",
  "title": "What Google Needs To Do with YouTube to Make Me Happy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "And now, a brief rant about YouTube:Call me a purist, but when I do a search for something like \"the killers mr. brightside music video,\" I don't want 29 of the 30 search results to be of some a-hole teenager lip-synching to the damn song. You may think your video is cool, Mr. A-Hole Teenager, but…",
  "content": "What Google Needs To Do with YouTube to Make Me Happy Search Engines By: Rebecca Kelley October 17, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley October 17, 2006 What Google Needs To Do with YouTube to Make Me Happy Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. And now, a brief rant about YouTube:Call me a purist, but when I do a search for something like \"the killers mr. brightside music video,\" I don't want 29 of the 30 search results to be of some a-hole teenager lip-synching to the damn song. You may think your video is cool, Mr. A-Hole Teenager, but it's not. It doesn't have Eric Roberts in it. Only The Killers' music video does. And where is said music video? #18 out of 20 at the bottom of the first page.Likewise, the query \"lazy sunday\" brings up this crap, with the original SNL sketch being a needle in the haystack of awful spoofs (not that the original is funny, but still): Yes, I know that lots of videos may have been yanked due to copyright infringements and whatnot, but it's safe to say that I'm probably not looking for the crappy spoof of it. If I wanted a crappy spoof of something, my search query would be \"crappy spoof of __________.\" PUT DOWN THE VIDEO CAMERA, BORED TEENAGER. YOUR SPOOF WILL NOT BE FUNNY OR ORIGINAL.Google, I challenge you to figure out a way to read each searcher's mind and either note in the search results that the requested video was pulled or serve up the relevant YouTube video in the top spots instead of burying it under a mountain of junk. You know, just like you do with your search engine queries! Er, wait a minute... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Google Needs To Do with YouTube to Make Me Happy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Google Needs To Do with YouTube to Make Me Happy"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}