{
  "url": "https://moz.com/blog/what-is-acceptable-for-people-search-engines",
  "slug": "what-is-acceptable-for-people-search-engines",
  "title": "What Is Acceptable For \"People Search Engines?\" - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I don't often get indignant about websites. Even bad ones. Sometimes I complain about what passes for Web 2.0 genius, but never before have I been really horrified by an online service. Spock.com horrifies me. I have never before felt like a website should cease to exist, but I am appalled at my…",
  "content": "What Is Acceptable For \"People Search Engines?\" Mobile SEO By: Jane Copland May 14, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland May 14, 2008 What Is Acceptable For \"People Search Engines?\" Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I don't often get indignant about websites. Even bad ones. Sometimes I complain about what passes for Web 2.0 genius, but I have a problem with one particular site I've come across lately. I find Spock.com vaguely appalling. Spock is a social networking / people search site which allows anyone to edit anybody else's information. If you find that you've been added to the site, you can claim your profile and change your information. However, there is no guarantee that you'll notice you've been added to the site. I only realised I'd been listed there when I received an email alerting me to the fact that I had a profile there. I discovered a page about myself that looked a lot like most other social networking profiles. It also looked like the individual in question - me - had created it. I found such information as my photograph, the breed of dog I own, and which high school I'd attended in New Zealand. Luckily, I could \"claim\" the profile by logging in with my LinkedIn credentials. I thought I had successfully deleted all the information the person had added about me, only to revisit the site today and find that none of it was really gone. It was just included as \"news\" about me. If someone isn't alerted to their presence at the site, they might not come across the listing until it shows up in a search engine result. The web is not designed to let individuals have complete control over what appears in search engine results for their names. Reputation management services exist because we don't have control over search results. However, something strikes me as wrong about this service. The thing that really bothers me is that when a profile is claimed, one still has very little control over its contents. I can't really get rid of any information and I have to request that the page be removed. Spock's Help page explains how users can flag content as inappropriate. However, if you don't know you've been added to their database, there is no way to control the information. Secondly, claiming your profile isn't necessarily instantaneous. If you don't have an email address or social networking account, you have to request access to your profile via the site's \"quality assurance team.\" That's the problem with allowing a social network to act as a wiki: anyone can edit it, so they need a quality assurance team in place to protect you from claiming to be you when you are actually someone else. Spock has a setting to make one's profile private and stop strangers from changing its information. However, it appears to be broken. This is what happened when I tried to privatise my page. I certainly had not attempted to change its settings more than once in seven days. . What do you think? Is this just part of the Internet and something we have to get used to? Or is it overstepping the mark to allow strangers to edit personal information about people, and then not really give those people a quick way to remove the information that they don't appreciate? I believe that people search will become more of an issue in the future, as it becomes more easy to track people's actions online. Most of us who have an online presence are aware of what we put out there, and many of us are aware of what can be indexed. People search needn't necessitate a gross compromise in privacy, but sites like Spock need to make it easier for individuals to control what appears attached to their names. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Is Acceptable For \"People Search Engines?\""
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Is Acceptable For \"People Search Engines?\""
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}