{
  "url": "https://moz.com/blog/what-is-siteadvisor-saying-about-your-sites",
  "slug": "what-is-siteadvisor-saying-about-your-sites",
  "title": "What is \"SiteAdvisor\" Saying About Your Sites? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the folks in my office was searching Google and noticed a tiny icon beside every website in the SERPs - even on the AdWords. At first we thought we thought that Google was testing something new but a mouseover of the button yielded a McAfee SiteAdvisor bubble as shown below.  (We were not…",
  "content": "What is \"SiteAdvisor\" Saying About Your Sites? Moz News E By: EGOL December 4, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL December 4, 2006 What is \"SiteAdvisor\" Saying About Your Sites? Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. One of the folks in my office was searching Google and noticed a tiny icon beside every website in the SERPs - even on the AdWords. At first we thought we thought that Google was testing something new but a mouseover of the button yielded a McAfee SiteAdvisor bubble as shown below. (We were not searching for \"Porn\"... Honest!... I posted a screen capture from the \"Porn\" SERP here because it shows an amusing array of information.) In summary, this is a program that resides on your computer and activates when you visit the website of a major search engine. It works on Google, Yahoo and MSN - didn't check any others.Green Checkmark icons mean that McAfee has sniffed your site and they don't have anything bad to say about it. They check your site for popups, safe downloads, spam, viruses, who you are linking to - and they even subscribe to your email list to see what you will send to them. Then when a surfer mouses over the icon next to your SERP listing a brief report can be seen. (SEOMOZ had a Green Checkmark).This brief report lists how many downloads were tested, how many emails they received from you and even rates the content of the email. If your site has a Red X beside it (like the one above) that means you have been doing something naughty like sending out 18 \"spammy\" emails per week (lol). Yellow Exclamations mean that users should be careful on your site. I saw some fairly well known sites with Yellow Exclamations for downloads that might have spyware or adware or other unwanted programs. And a Grey QuestionMark means that McAfee has not evaluated your site yet - and I saw very few of these in the SERPs - but did spot Grey on Oilman's site and Chris Hooley's AdWords - funny ads :-)So, why am I reporting on this here? We didn't turn this product on intentionally and I did not buy it. It must have been included in a recent install of McAfee. However, it did divert us from \"work\" for about thirty minutes. The first thing we did after learning about this tool was to search for our own websites to be sure that they didn't have us flagged for spammy emails, dirty downloads, or worse. I wanted to be sure that anyone using the product didn't see any of my sites in a bad light. Fortunately they were all fine - but data like this in front of surfers could be damaging to your sales. If you own some important sites, send lots of email to your list, or have some programs served by download, it might be worth the time to be sure that you have Green Checkmarks. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What is \"SiteAdvisor\" Saying About Your Sites?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What is \"SiteAdvisor\" Saying About Your Sites?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}