{
  "url": "https://moz.com/blog/what-separates-search-marketing-novices-from-experts",
  "slug": "what-separates-search-marketing-novices-from-experts",
  "title": "What Separates Search Marketing Novices from Experts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Our field has grown tremendously over the last 5 years. When Danny Sullivan launched the first Search Engine Strategies conference, I'd estimate that less than 5,000 people worldwide called themselves SEOs. Today, the number of self-referencing \"search marketers\" is probably closer to 100,000 and…",
  "content": "What Separates Search Marketing Novices from Experts Public Relations By: Rand Fishkin February 20, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 20, 2007 What Separates Search Marketing Novices from Experts Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Our field has grown tremendously over the last 5 years. When Danny Sullivan launched the first Search Engine Strategies conference, I'd estimate that less than 5,000 people worldwide called themselves SEOs. Today, the number of self-referencing \"search marketers\" is probably closer to 100,000 and may well be much higher. But, a number of features separate the SEO/M expert from the novice, and today I thought I'd point out a few of these. The following refer specifically to consultants in search - people who help other companies get the most out of their search traffic. Brand Level Experience While experts generally carry experience with a few Fortune 500s (or 1000s), novices often haven't dealt with a recognizable brand name. The difference is in how to approach projects - with small brands, the biggest struggle is getting recognized by the engines, with big brands, the challenge is more frequently (and sadly) with management. Contacts & Relationships After several years of successful projects, an expert's network of contacts can sometimes be the most valuable asset they bring to a project. This doesn't always mean relationships with search engines, but with advertising firms, experts in disparate, related fields or even connections with other SEOs that can help to diagnose problems cooperatively. Holistic Approach While novices often approach a project with on-page SEO basics, a link building campaign, keyword research and a PPC campaign, experts can identify and diagnose weaknesses in site architecture, customer targeting, usability, design, analytics and dozens of other issues. Accepts the Right Projects A novice consultant or firm might be tempted to take any client who can pay the bills (and many times, they must). Experts know how to choose their projects, based on the expected outcomes, the style of the client & the short and long-term ROI. Sixth Sense for Rankings Many experts have what I dub the \"ranking sense.\" They can, in a matter of a few link searches and some competitive analysis determine the scope, difficulty, trends and opportunities of a market, even if they haven't worked in that field before. I believe this prized ability comes from countless thousands of searches with a critical eye, and the repetitive practice of watching the SERPs change over time. Personally, I think my ranking sense has actually slipped, as I don't watch the SERPs day by day and hour by hour the way I used to 6 months ago. A few weeks back in the SEO trenches, though, and I'm sure I could pick it up again :) In addition to these qualities, there's a number of specific mistakes, pitfalls or missed opportunities that I see novices frequently stumble over. Duplicate Content It's not that novices don't recognize duplicate content, but that they often don't realize the best ways to handle it. One of my favorite examples is the SEO who uses \"nofollow\" in links to duplicate content, not realizing that others may link to it in the future (hint: use robots.txt and meta robots instead). Keyword Cannibalization This one is the rookie mistake I see most often - SEOs who try to target the same term on 65 pages of a 100 page site, not realizing they're spreading out their anchor text, link and keyword targeting value rather than concentrating it. Connecting with Offline Campaigns It's critical that offline campaigns for branding or advertising integrate properly with the online property. Drive offline traffic to a URL you can track, measure inbound links, use the same messages on and offline to create a seemless user experience or face the consequences of a less-than-optimal ad spend. Chris Boggs nailed a few of these in his Super Bowl Ads roundup. Analytics Integration & Testing So few novices properly attach action tracking to a site, properly hypothesize, test, measure, and refine. Analytics are a powerful tool for improving the quality of every online campaign, but it's often lost in the search for better rankings and more traffic. Multiple Sites/Domains Why do even savvy SEOs continue the practice of launching separate sites for their sister-projects, blogs, or other related content. The links that come in to a single domain help all of the content at that domain rank, and 100 links from diverse, natural sources will earn you far more than 10,000 links to a Blogspot blog that you interlink with your main domain. Content Separation A great number of content sites split up their articles in multiple pages or create dozens of short pages about minute details of a larger subject. This makes for lots of page views, but very few inbound links. Remember that links are likely to come to \"complete\" resources, and if you make the linker work to identify the specific content piece she's trying to point to, they'll simply give up (and link to the evil Wikipedia, where all the data is always on one page). Misuse of Meta Description Tags I see a great number of sites where the meta description tags are either copied from page to page (i.e. non-unique) or contain only the first 2-3 sentences of the page's content. The former's issue is obvious, while the latter is unwise because the search engines will show whatever content is most relevant to the user's actual query if you provide no meta description, and thus you'll almost certainly get more long tail search clicks by letting the engines supply your description. The exception is if your intro sentences are excellent descriptors of the content on the page, which is sometimes the case with certain article sites or blogs. Aggregation as a Source of Unique Content Many novice site builders and SEOs assume they can trick the search engines by combining snippets of data or content to create pages. The engines, however, have a small army of PhDs to combat every possible re-mix, re-hash or re-purposing and their techniques improve every day. Don't take the engines for idiots - I predict the next few years will see them able to identify not just unique content, but grade the quality of articulation and unique information as well. Measuring Traffic Rather than Conversions Rankings are great and so is traffic, but a website that's improved it's traffic tenfold while ignoring conversions has got the process backwards - your goal isn't (except in a few rare cases) to bring just any visitor, it's about bringing the right visitor. Any novice mistakes you see (or ones you've made) that you can share with us? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Separates Search Marketing Novices from Experts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Separates Search Marketing Novices from Experts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}