{
  "url": "https://moz.com/blog/what-to-do-when-a-new-seo-client-contacts-you",
  "slug": "what-to-do-when-a-new-seo-client-contacts-you",
  "title": "What to Do When a New Potential SEO Client Contacts You - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How do you react when a new potential client contacts you? Discerning between a good fit and an adequate (or poor) fit can be key to both retaining those clients and growing your business. John Doherty walks you through the client vetting process, including the initial call and how to determine…",
  "content": "What to Do When a New Potential SEO Client Contacts You SEO Consulting | SEO Basics By: John Doherty January 16, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: John Doherty January 16, 2018 What to Do When a New Potential SEO Client Contacts You SEO Consulting | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you’re an agency owner or solo consultant, you’re probably constantly thinking about getting new clients. And we’re inundated in this industry with too much advice around new marketing funnels, new marketing ideas, and \"one weird tricks to 10x your traffic overnight.\" But something we don’t talk about enough is what you do when you actually convert that person into a real contact on your site. I’m not talking about “a lead” here, because that word is used widely in our space and has come to mean everything and nothing at the same time. A lead could be an email address and it could be a long-form submission telling you everything about their needs, as well as their budget and their birth city. What I’m talking about here is a marketing qualified lead (MQL) that you are going to turn into a sales qualified lead (SQL) so that you can turn them into a business qualified lead (aka a new client). (Note: I just made up business qualified lead, so don’t go around talking about BQLs. Or do, but credit me!). Over the last two years I’ve helped a lot of businesses connect with great marketing providers through my company Credo, and through that I’ve been able to watch how agencies and consultants alike pitch work. I see all sorts of strategies done to try to close a lead into a client, such as: Send an intake survey to try to vet the lead more; Send them a Calendly link to get them to schedule a call as soon as possible; Send an initial proposal after the first call and then refine it with the client on the phone; Send tracked proposals using a tool like DocSend so you can follow up depending on whether they’ve viewed it or not. There are many more I've seen as well. Some work well, others don’t. This post isn’t going to dig into the various tactics you can use, as you should be testing those yourself. What I care about is that you develop a sales strategy that sets a strong base and that you can build from into the future. I also have a unique view on our industry, because I get to see what kind of sales process actually closes potential clients into actual clients. While you may be doing something that you think works really well, there's a great chance that I know a better way. And today, I’m going to give you a view into what I know closes clients, and the sales process that I use to close a high percentage of projects who want to work with me into clients. What to do when a client contacts you The first rule of sales in a service business like a consulting agency is that the earlier you reply to a prospective client, the more likely you are to close them into an actual client. Over the last couple of years, I've tried to educate businesses that they should speak with multiple agencies and get multiple proposals, to understand what each agency has to offer and be able to compare them in order to arrive at the right decision for their specific business. And yet, time and time again I see the first agency to respond to be the one to close the project probably 70% of the time. This can absolutely be a templated response, and tools like Gmail’s Canned Responses or templates within your CRM of choice can help. I personally use HubSpot’s and push form entries there via Zapier, but there are many different options out there; I'm sure you can find one that connects your form technology to your CRM. In your response, you have to include these three points at minimum: Respond as quickly as possible and thank them for contacting you Acknowledge the project they say they're interested in Schedule a time to chat on the phone as quickly as possible As I said above, I’ve seen many agencies send an intake questionnaire that's a page or two long before even getting on the phone with the potential client. I advise against this simply because this slows down the process. Some clients that you would otherwise win will simply move on to another agency. You’re giving them work when really what you need to do is remove friction from their decision to choose you. This initial contact is also not the place to tell them all of the brands you've helped and the results you've gotten. If they’re contacting you, they're already interested. Don’t make them think. You have one goal with your response: to get them to schedule a phone call with you. What to learn on the first call If you’ve followed my instructions above, you’re getting the client to schedule a call with you (when you're available) as quickly as possible. Don’t forget to have them include their phone number, as well! Schedule the call for 30 minutes so that you can: Get an understanding for their project, and Not invest too much time into them in case they're not qualified enough. As a side note, if you're getting too many “leads” (may we all be so lucky) that are not qualified for your business and thus wasting you or your salesperson’s time, then you may want to look at adding some friction to your lead forms. More is not always better. You should have an idea of who your best clients are and the kind of work they've hired you to do that you are best-in-class doing; you need to walk away from this first call at minimum knowing if they're a good fit or not. If they are a good fit, then you can move them forward in your sales process (usually a recap and another call). You'll also be able to use this process to qualify out the leads who on the surface seem to be a good fit because they were able and willing to successfully fill out your lead form, but when you dig deeper into their business and needs, you realize they're not quite such a good fit. We’ll talk about this more in a minute. On this initial phone call, you need to cover all of these points to determine whether you should pitch the work or not: What their business model is, so that you can understand if they're profitable; The type of project they're looking for, such as strategy or services or a combination thereof; Their internal team structure and their knowledge of the marketing channel they're inquiring to you about; Whether the person you're speaking with is the person who has final sign-off and budgetary control, or if they've been tasked with sourcing an agency but ultimately are not the decision maker; Their budget range; Their timetable for wanting to get started. Thank them for their time and set their expectations about what you'll do next and when they can expect to hear back from you. Now your work really begins. After the first call Assuming the first call with your prospective client goes well, you'll need a process to follow so that followups don't fail and the process moves forward. This part is important. Right after the call, follow up with the person you spoke with via email to recap the call and reiterate your next steps. First, thank them for their time. Regardless of whether or not you ultimately decide to pitch the project, you should be grateful that they decided to speak with you and not someone else. Second, recap what you discussed on the call. I like to take notes with my CRM (I use HubSpot, as mentioned above) and then use those to write the recap. A CRM should integrate with your email system and allow you to email the prospect from directly within it so that you don't have to move between your CRM and your email client. Here's a templated response that I use when replying to someone after our initial call: Hi FNAME,Thank you for the conversation today! I enjoyed learning more about your business and how we can potentially help.As we discussed, COMPANY is looking for TYPE OF PROJECT. (recap the project here)As I mentioned on the call, my next step is to spend some time reviewing your site and your project to determine if it is the right fit for me as well. I will follow up with you within 48 hours (NOTE: THIS CAN CHANGE IF YOU CHATTED ON FRIDAY, IN WHICH CASE SAY END OF DAY ON MONDAY) with my findings and where I think I can add value to your business. In the case that your project is not the right fit for me, I can suggest some other people you should speak with.Thanks FNAME, and you will hear from me soon!John Now you can review their project and website metrics to see where you can add value, and if it’s a project that can be successful within the budget they have outlined for you. Then, decide if you should pitch for the project or refer them elsewhere. Deciding whether to pitch the work Sales is all about determining who the right prospects are and are not, then optimizing your time to focus on the clients you want to sign — not on the ones that are a poor fit for your business. Hopefully you know who your ideal customer is, in terms of budget but also the type of work they need (strategy, services, or some combination thereof) as well as the marketing channel(s). Once you know who your ideal customer is (and is not), you'll have a much easier time determining whether or not you should pitch the work. In my experience with seeing over a thousand projects introduced to marketing providers, the six factors mentioned in the “What to learn on the first call” section are the ones that reliably help you understand whether you should pitch the work or not. Some of the factors to avoid are: Unrealistic expectations or timelines No or low budget No resources to get things done Their last four agencies haven't worked out Going out of business \"unless they get help\" I love that so many in the SEO industry are helpful and genuinely good people who want to help others, but if you start taking on clients that can’t pay you what you need to operate a profitable business or have had issues with many other agencies, then you're doing yourself and your business a disservice. If I had a dollar for every time I heard an agency say that they “pitched the work, but set the budget high” I’d be financially independent and retired to a mountain town in Switzerland by now. Hear me loud and clear here: You do not have to pitch every project that falls into your lap. If the project doesn't meet your minimum project budget, the type of client you can get outsized returns for, or is not within your core competency (your zone of genius), then you should not pitch the project. Let me explain why. If a client is below your minimum project threshold and you pitch them, you've wasted two people’s time. You've wasted your time by creating a proposal and potential project plan, and you've wasted their time because they took time out of their day to review something that they'll never sign off on. Second, if they negotiate back to try to get the budget lower, you're going to spend your time to get a project that is smaller than what they ideally need and can afford. You're literally spending time to make less money, when you could take that time to pitch and negotiate with someone who can easily afford your services. Should you sign the project that is smaller than or right at your minimum while at the same time being at very top end of their budget, you can rest assured that this client will take up more time than they're paying for because they feel pressure to make it work quickly. Unless you set expectations explicitly and are very good at saying no to requests for work that are outside of the scope of what they're paying for, this project will quickly snowball and take up too much time, thus putting it in the red. Don’t pitch a project that's very likely to go into the red budget-wise. That is Business 101, and you will regret it. I promise. Conclusion I hope this post has been helpful to you in learning what to do when a new potential consulting client first contacts you or your agency. First, speed is of the essence. While we want to believe that the best pitch will ultimately win the business, experience tells us that it is most often the first person to respond who actually gets to pitch and sign the business. Second, get the potential client on the phone as quickly as possible. Don't rely on email, as you can gain way more information on a 30-minute call than in a string of emails. People are busy and you don't want to create more friction for them. Get them on the phone. Third, you need to send a followup email within a few hours of the phone call where you thank them for their time, recap what you discussed, and set their expectations for what your next steps are and when they'll hear from you again. Feel free to use my template and adjust it for your specific needs. Fourth, decide if you want to pitch the project. Don’t pitch projects that are too small, outside your/your agency’s zone of genius, where what you have to offer is not their highest leverage option, or where they're not set up internally to make the project successful. Your project will not succeed if any of these are true. I am also writing an ebook, hopefully out in Q1 2018, about everything I’ve learned seeing over 1,100 projects come through Credo. If you’re interested to hear when it launches, sign up. I’d love to hear your comments below and interact with you around better sales for digital marketing consulting work! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What to Do When a New Potential SEO Client Contacts You"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What to Do When a New Potential SEO Client Contacts You"
    },
    {
      "level": "H2",
      "text": "What to do when a client contacts you"
    },
    {
      "level": "H2",
      "text": "What to learn on the first call"
    },
    {
      "level": "H2",
      "text": "After the first call"
    },
    {
      "level": "H2",
      "text": "Deciding whether to pitch the work"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John Doherty\n          \n            John Doherty\n          \n            John Doherty"
}