{
  "url": "https://moz.com/blog/what-should-aaron-do",
  "slug": "what-should-aaron-do",
  "title": "What should Aaron Do? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Aaron Wall is struggling with the forces of the publishing world, who've re-nigged on their original agreement to let him maintain e-book publishing rights if they take his book to press. Aaron has a lot of positives and ne...",
  "content": "What should Aaron Do? SEO Events By: Rand Fishkin October 29, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 29, 2005 What should Aaron Do? SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Aaron Wall is struggling with the forces of the publishing world, who've re-nigged on their original agreement to let him maintain e-book publishing rights if they take his book to press. Aaron has a lot of positives and negatives on both sides of the equation, but the heart of the matter is who will have control over his book moving forward. My personal opinion is that Aaron should walk away from the publishers and self-publish SEOBook, but there's a good bit of discussion. It will certainly be interesting to see what happens to the \"legitimate\" SEO world's most famous author. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What should Aaron Do?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What should Aaron Do?"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}