{
  "url": "https://moz.com/blog/what-small-business-clients-needs-to-know-about-keywords-and-seo",
  "slug": "what-small-business-clients-needs-to-know-about-keywords-and-seo",
  "title": "What Small Business Clients Need to Know About Keywords and SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "OK, so I've worked-on or managed well over 100 SEO campaigns over the last few years and a common trend I've noticed is that many small business clients don't really understand how choosing the right keywords affects and defines an SEO campaign and what it takes to deliver results.",
  "content": "What Small Business Clients Need to Know About Keywords and SEO Keyword Research B By: Brian Austad July 13, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! B By: Brian Austad July 13, 2011 What Small Business Clients Need to Know About Keywords and SEO Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. OK, so I've worked-on or managed well over 100 SEO campaigns over the last few years and a common trend I've noticed is that many small business clients don't really understand how choosing the right keywords affects and defines an SEO campaign and what it takes to deliver results. Let us start off with an example. Say you're a landscaping company in Central Jersey where the bulk of your business comes from Landscape Construction (walls, patios, driveways, etc). What keywords do you want to rank for? Landscaping can cover many things: Landscaping, Landscaper, Landscapers, Landscape Design, Landscape Construction, Landscape Maintenance, Lawn Care, Plantings (Bushes/Shrub/Trees/Flowers), Nurseries, Hardscapes (Patios/Pool Decks/Driveways/Walkways/Stairs/Walls), Water Features/Fountains, Recreation (Golf green/tee/Bocce/Horseshoes/etc), Drainage, and on and on and on. Now, unless you have a huge budget and a team of people working for you, it's unlikely that you can try to rank for all of these terms. And just because your company can do all them, doesn't mean you need to rank for all of them if you specialize in a particular area. Since each of these words are not geo-targeted with a location (such as New Jersey Landscaper) it means you are searching nationally. Doing a search in Google for Landscapers brought back 11,000,000 search results. That's 11 million web pages you have to compete with. Can it be done? Yes, but there are factors you have to consider if you expect your SEO to deliver this. There are 11 million web pages to compete with. It's likely that the top ranking sites are optimizing their sites in some way or another. The sites that are already ranking probably have had a website for a long time now. They've probably started optimizing long before you did, so they have a head start. They are likely known brands in the industry and will get preference in national searches. You're competing verse more than just landscaping companies. This may include How-To sites, manufacturers, wholesalers, suppliers, landscape architects, home goods companies, and more. They probably have tons of natural links. That means people are linking to them without being asked. A ton of natural links means they have great link diversity. These sites are usually very large with a ton of content. Optimized or not, it still counts. They may be trusted sources, or have gained links from trusted sources (such as CNN, Wikipedia, and the Library of Congress). So, before you even choose your keyword term, you should decide on your target area. It can be a town, city, county, region, state, or another geographic name. By geo-targeting your keyword term with a location you narrow down your customer base to who is likely to buy from you and decrease the number of competitors to deal with. This ultimately means faster results and lower costs. Keyword Research Let's look at some keyword research to get an idea of what we're in for. Right now I just want to show how different keywords terms and different locations affect the difficulty of the SEO campaign. Google provides the first three columns of results. The SEOmoz Keyword Difficulty Tool provides the difficulty percentages. NOTE: Google Search Results gives the total search results, intitle and inanchor gives the search results with keywords in the titles and anchor text and shows your likely competition. SEOmoz Keyword Difficulty Score shows the competitiveness of the keyword. You can see by this information that Landscapers get more search results and is more competitive than Landscape Construction. Even though landscape construction gets fewer search results, it would likely provide better traffic results and conversion rates since it is more specific to what our example company does, which is landscape construction. Once you add on \"NJ\" you really cut down on 'search noise' and have a better idea of who your audience is. It also decreases the difficulty by a good amount. If you swap \"NJ\" for \"Somerset County\" in NJ, you lower the difficulty again. Each time you narrow down your focus you can expect faster results and lower costs. A keyword difficulty percentage of 26-50 means it's moderately competitive. A keyword difficulty percentage over 50 means it's highly competitive. The higher the percentage and more competitive the keyword, the more it is going to cost and will take to achieve results. Although they can provide a lot of traffic to your website when you rank high for those keywords, getting there is a challenge and will take some time. You will have to wait much longer before you see a return on investment (ROI). Many small businesses don't really have time to wait for large SEO campaigns to develop. It's a better strategy start with a smaller SEO campaign and upgrade as you go. It's a good idea to choose one competitive keyword and then try to rank well for less competitive keywords related to that category and geography. The Benefits of Starting Small It's not uncommon for a client to say, \"I don't want to limit my business to a specific area.\" SEO people understand this and try to accommodate where possible, but it's not always practical. Here are issues you have to deal with if you choose too large an area: It will take longer to see results It will take longer for the client to get a return on investment (ROI) You'll have less overall web visibility You will see better results if you start by ranking locally and then expand to more competitive markets. Begin by ranking well for your town, then County, then Central Jersey. Once you rank well for Central Jersey it's much easier to gain rankings for NJ than if you started with NJ initially. This enables you to keep your strong search results for your less competitive (and more localized) keywords providing you more reach and web visibility. If you choose to start statewide first you won't rank as well (or at all) for all those local searches. And if most people who search for your product or service are searching on a local level, such as they do with landscaping, you may be missing out on high quality leads. The same goes for the keyword term itself. By optimizing for less competitive, but similar terms (landscape stone wall construction, landscape construction water drainage, etc), you make it easier to rank for the more difficult term landscape construction. Consider this analogy: SEO is like preparing for a marathon. You need to compete in shorter races before you can compete in the marathon. It takes time to build these campaigns. It may take months; it may take years. Switching Keyword Terms When you start an SEO campaign, it's important that you know what you want to rank for. Choose a keyword term that is specific to your business. If you start an SEO campaign with one keyword term in mind, and then change your term to something different, you may be wasting all the effort and money that was spent on your campaign already. Take our landscape construction company. If, in six months, they tell you that they mostly do landscape maintenance rather than landscape construction and want to change the focus of the campaign, it will have wasted much of your previous efforts. Here's why: The set of keywords will be different, so your SEO person will have to do all new keyword research. Your website has been optimized for \"landscape construction\" when it should have been optimized for \"landscape maintenance\". Any content written for landscape construction may be useless. All new content will have to reordered and rewritten. Site architecture and hierarchy may have to be changed. All the internal and external links that were built are using the wrong anchors. Website analytics and traffic data may be meaningless. Each of these is time consuming and costly. Whatever results you achieved in those six months will likely take another six months to achieve with the new set of keywords, if their difficultly is equivalent. For keywords that are more competitive it will take even longer to see similar results. Looking at the numbers below, that is exactly the case for landscaping company. Landscape maintenance is much more competitive on the state and national level than landscape construction. NOTE: Google Search Results gives the total search results, intitle and inanchor gives the search results with keywords in the titles and anchor text and shows your likely competition. SEOmoz Keyword Difficulty Score shows the competitiveness of the keyword. Changing Geography Any affects changing your keyword terms might have is basically the same affects you can expect if you changed your geography qualifier. The affects will be even more dramatic if the new geography is more difficult. If you choose a less competitive (and a more localized) geography, the issues are easier to overcome, depending on how the SEO campaign was being executed. Changing NJ to Somerset County NJ will take the work you've already did for NJ and it count towards Somerset County NJ. From that point on it shouldn't take long to see good results because there has already been work done that is relative to the first campaign (although not exactly the same) and it is less competitive. The biggest downfall to this is that you waited six months before you got on track, so your return on investment (ROI) has been delayed. If you change from NJ to NY, it could be considered a whole different campaign, especially if the new geography is more difficult to rank for. Remember, changing your geography is the same as changing your keyword term. The only time you should really change your set of keywords is if you realized that you chose the wrong keywords from the start. It makes no sense staying with something because the rankings and traffic are good, but it doesn't provide you with any increased business or it brings the wrong type of customer to your website. Only you can tell your SEO person what your business does specifically and what your goals are. Once they have that information they can research the right keywords and work on your campaign. This is why knowing what your business does and what you want to get out of SEO is so important; it will help you choose the correct keywords and geography at the start. Don't waste time and money trying to figure it out. Adding another Keyword Term or Geography Ok, so you've had an SEO campaign running for about a year and it's showing results for Landscape Construction NJ and other terms like Landscape Contractor NJ,and showing up in local search results as well. Now that that's done, you can move onto other words. Wait... What? DONE? No, it's not done. Without continuing an active SEO campaign you allow your competitors to catch up and overtake your search results. This, along with a drop off of relative links being indexed by search engines can work against you. Adding a different set of keyword terms to your list without upgrading and spending more for SEO means that you're splitting the attention of your SEO person. A new set of keywords means new research, re-optimizing your website to include the new keywords, new content and new pages, and many more links. If the new keywords are different enough, it could take longer to see the same type of results you saw earlier, especially if the difficultly is equivalent. This is because you've divided up your SEO person's time between the old set of keywords and the new set of keywords. The proper way to accomplish this is to upgrade your plan to include the new set of keywords. This way your SEO person can increase the amount of time spent working on your campaign. They can spend the proper amount of time researching, strategizing, and executing your new set of keywords while increasing your reach and web visibility for your initial set of keywords. Conclusion Make sure you have the right expectations of what SEO can provide for you. There is no doubt that SEO is a long-term investment that will pay for itself and more over its lifetime. Don't waste time or money SEOing for the wrong keywords; know you business and what your goals are. Be realistic about the geographies you are trying to rank for. Popular areas will be more competitive; expect to pay higher prices for these competitive SEO campaigns. It shouldn't take longer than a month to see improvements, but SEO takes time. The harder the campaign it, the longer it will be before you get a return on your investment. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Small Business Clients Need to Know About Keywords and SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Small Business Clients Need to Know About Keywords and SEO"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brian Austad\n          \n            Brian Austad\n          \n            Brian Austad"
}