{
  "url": "https://moz.com/blog/what-if-the-ron-paul-fans-became-seo-savvy",
  "slug": "what-if-the-ron-paul-fans-became-seo-savvy",
  "title": "What if the Ron Paul Fans Became SEO Savvy? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's late, and I should be wrapping up Q+A (or at least blogging on my promised topic of the Beginner's Guide) and getting some shut eye, but I simply couldn't resist sharing some thoughts about the web-based fervor for Republican Presidential candidate Ron Paul. For those who don't know, Paul's…",
  "content": "What if the Ron Paul Fans Became SEO Savvy? Moz News By: Rand Fishkin October 12, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 12, 2007 What if the Ron Paul Fans Became SEO Savvy? Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's late, and I should be wrapping up Q+A (or at least blogging on my promised topic of the Beginner's Guide) and getting some shut eye, but I simply couldn't resist sharing some thoughts about the web-based fervor for Republican Presidential candidate Ron Paul. For those who don't know, Paul's supporters are possibly the most organized and galvanized web community in the modern political spectrum. Here's just a sample of their accomplishments: How a Fringe Politician Took Over the Web - from Wired Ron Paul Has Lots of Money - from the NY Observer The Ron Paul Effect - ABC News I felt this quote, in particular, was impressively insightful: So are the polls missing a Paul boomlet? Is the famously contrarian ob-gyn -- a libertarian nicknamed \"Dr. No\" because of his propensity to vote against anything he believes contradicts the Constitution's original intent -- poised to surge into contention in the GOP field? Not likely. What's more likely, based on Web traffic over the past week, is that Paul supporters have mastered the art of \"viral marketing,\" using Internet savvy and blog postings to create at least the perception of momentum for his long-shot presidential bid. Paul's supporters certainly have a knack for driving traffic and dominating online polls, as well as flooding mainstream media with calls for more attention to the long-shot candidate. The problem is, the networks running those online polls are starting to get savvy. Here's Allen Wastler, Managing Editor for CNBC.com with An Open Letter to the Ron Paul Camp: I haven't seen him pull those kind of numbers in any \"legit\" poll. Our poll was either hacked or the target of a campaign. So we took the poll down. The next day, our email basked was flooded with Ron Paul support messages. And the computer logs showed the poll had been hit with traffic from Ron Paul chat sites. I learned other Internet polls that night had been hit in similar fashion. Congratulations. You folks are obviously well-organized and feel strongly about your candidate and I can't help but admire that. But you also ruined the purpose of the poll. It was no longer an honest \"show of hands\" -- it suddenly was a platform for beating the Ron Paul drum. That certainly wasn't our intention and certainly doesn't serve our readers ... at least those who aren't already in the Ron Paul camp. If Paul's supporters really were as savvy about viral marketing as they claim to be, they would have long ago discovered the power of anchor text, link bombing and taking over the search results. Imagine - if the thousands of bloggers, hundreds of forums and handful of social networking sites all took it upon themselves to boost Paul's visibility through search engine rankings, they could achieve an effect far greater than the dominance of online polls - they could truly start to influence the campaign by marketing information for their candidate. Say the Paul supporters were savvy enough and dedicated enough; there's no limit to the pages on Paul's site they could get ranking for hot button issues and important, politically relevant queries - everything from Iraq War to Immigration to Health Insurance and 2008 Election could have pages on Paul ranking in the top 1-5 results. With control of the search results, it's likely he'd have considerably more brand recognition than his current 29% (note the Reddit thread - If you don't read Reddit, there's a 70% chance you don't even know who Ron Paul is). The best part? Those Ron Paul supporters are very frequently armchair generals of the web - their fanaticism extends only as far as their blogs' collective RSS readers, but through this strategy, they would, in fact, leverage that weakness into a strength. After all, if you had an army of bloggers at your bidding, wouldn't you distribute a search strategy to rule Google's blue link lists? Naturally, this brings up a fascinating debate - if biased parties start taking advantage of the search algorithms' love of editorial blog links to wage information wars in the SERPs, how high might it escalate before the engines are forced to block or alter the results? If one search savvy political camp were to seize control of the results for a rival faction (picture if every search for George Bush in 2004 had returned a Kerry-based attack or vice versa), how long would it be before bloggers the web over joined the campaign? Perhaps in the future, we really will be voting over the web, but we'll do so with hyperlinks, not checkboxes. Maybe it's best to keep that Pandora's Box shut. And, of course, may the best SEO'd candidate win... p.s. Although this post does discuss political figures, SEOmoz IS NOT a forum for political discussion or the merits of particular beliefs or candidates. Myself, Scott, Rebecca & Jane are likely to quash comments that cross into the realm of political debate. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What if the Ron Paul Fans Became SEO Savvy?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What if the Ron Paul Fans Became SEO Savvy?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}