{
  "url": "https://moz.com/blog/what-would-your-link-building-strategy-be-if-you-were-already-the-1-serp",
  "slug": "what-would-your-link-building-strategy-be-if-you-were-already-the-1-serp",
  "title": "What Would Your Link Building Strategy Be if You Were Already the #1 SERP? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm lucky enough to have a few high-yield websites in some local niches (real estate) with very low competition.For the three or four keyword phrases anyone would use to find my web sites and services, I already rank #1.  In fact, for some of them I rank in the top 20 if you do the search terms…",
  "content": "What Would Your Link Building Strategy Be if You Were Already the #1 SERP? Link Building V By: Vinny Goldsmith October 15, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! V By: Vinny Goldsmith October 15, 2007 What Would Your Link Building Strategy Be if You Were Already the #1 SERP? Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I'm lucky enough to have a few high-yield websites in some local niches (real estate) with very low competition. For the three or four keyword phrases anyone would use to find my web sites and services, I already rank #1. In fact, for some of them I rank in the top 20 if you search for our terms without mentioning the city I am in. Mention the city or county, and I'm right there at #1. However, since it is real estate related, I wouldn't want to target anything outside of my area since selling there would be prohibitive. Thus, I'm stuck in the enviable position of already owning the number one Search Engine Result for the keyword phrases I target. Of course, I don't want to sit on my laurels and do nothing as far as link building goes. If I do, I'll wake up one day to find some other local SEO-minded agent has taken my spot. So, I've come up with the following 3 options regarding link-building for this website: Do a 3-2 way link exchange with other real estate related websites located out of my area. I could ask them to link to one of my lower-ranked sites in return for a link on the front page of my higher ranked site, which pulls in a lot of out-of-state searchers due to long-tail searches. Build links to some of the deeper pages of my high ranking website that have external links to some of my lower ranked web sites, hoping to pass off some of the incoming link juice to my other domains (using nofollow to sculpt the flow of link juice of course). Continue to build links to the website but target related but different anchor text, then have a related affiliate offer on the front page of my website. For instance, instead of \"Springfield Condominiums,\" I would build anchor text around \"Springfield Mortgages and Real Estate\" and then have a link to a mortgage lead affiliate offer on the front page. Maybe monetize the site a little bit. Anyway, I know I'm probably missing about 8 or 80 other things I could do, so I'd be interested in hearing what the SEOMoz community thinks. Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Would Your Link Building Strategy Be if You Were Already the #1 SERP?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Would Your Link Building Strategy Be if You Were Already the #1 SERP?"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Vinny Goldsmith\n          \n            Vinny Goldsmith"
}