{
  "url": "https://moz.com/blog/when-it-comes-to-analytics-are-you-doing-enough",
  "slug": "when-it-comes-to-analytics-are-you-doing-enough",
  "title": "When It Comes to Analytics, Are You Doing Enough? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We all know analytics are important. As marketers, we spend a great deal of time in the data, and should feel that we have the data necessary to make great recommendations, troubleshoot issues, and forecast our efforts accurately. However, data can be intimidating. In today's post, Joanna Lord…",
  "content": "When It Comes to Analytics, Are You Doing Enough? SEO Analytics By: Joanna Lord March 5, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord March 5, 2013 When It Comes to Analytics, Are You Doing Enough? SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We all know analytics are important. As marketers, we spend a great deal of time in the data. We all, hopefully, consider ourselves part analyst in many ways. At the foundation of a good marketing team, there is an accessible analytics platform that is set up to provide actionable insights. We should always feel that the data is just a log in away. We should feel we have the data to make great recommendations, troubleshoot issues, and forecast our efforts accurately. We should all feel totally in control of our analytics, and use them daily. But then unicorns jump out of pink clouds and fly around our heads, because that is simply not the case. Ever. Maybe a handful of you work on teams that are doing all they can do as it relates to analytics. Maybe some of you have even staffed your team with a handful of full-time analysts. More likely, you may all be trying to use data in your jobs, but not doing it as thoroughly or as effectively as you wish you were. So let's talk about that. Let's talk about the different types of analytics and common places to start with them. I believe the number one reason marketing teams aren't as data-driven as they should be is because data is intimidating. However, knowledge trumps intimidation. The more you know, the more comfortable you will be to put on that analyst hat. And analyst hats are cool. So let's jump in. What are the different types of analytics? The goal of all data analytics is to leave us more educated than before so we can perform better in the future. Sounds simple, right? Well, not really. A common misconception among marketers is that all analysis is equal, which isn't exactly the truth. There are actually three types of analytics; predictive, prescriptive, and descriptive. Most marketers spend the majority, if not all, of their time on only one of them: descriptive. As you can imagine, that leaves a lot of awesome data and innovation on the table. Let's run through the three and talk through the differences... Descriptive analytics: Descriptive analytics is when we data mine our historical performance for insights. Often, we are just looking to get context or tell a story with the data. This is most certainly at the heart of what most marketers do on a daily basis, particularly in their web analytics. We look at how we are doing, and we try to understand what is happening and how that is affecting everything else. Typical questions include: \"How did that campaign do?\" \"What sort of performance did we see last quarter?\" \"How did that site's down time affect other performance KPIs?\" Predictive analytics: Predictive analytics takes that one step further. It's less about the questions, and more about the suggestions. It involves looking at your historical data, and coming up with predictions on what to expect next. This is most readily used in our industry when we try to predict how next month will perform based on this month's performance (month over month predictions or MoM). While it seems like an obvious next step for analysis, it's amazing to me just how many marketers stop at descriptive, and fail to push into this arena of predictive analytics. Often, it's because this involves predictive modeling which can, again, be very intimidating. Typical statements include: \"Based on the last few months of data and our consistent growth, we can expect to increase another 25%,\" or, \"Knowing our seasonal drop trend, we can expect to slow down by 10% in the next 6 weeks.\" Prescriptive analytics: This is where things can get fun. Prescriptive analytics takes forecasting and predictions a step further. With prescriptive analytics, you automatically mine data sets, and apply business rules or machine learning so you can make predictions faster and subsequently prescribe a next move. Marketers tend not to think of this \"as their responsibility.\" That is for someone else to think about and solve. I think that is a super dangerous mindset, given we are on the hook for hitting the company's business KPIs. Prescriptive analytics can be a very powerful catalyst for success at a company. Typical questions include: \"What if we could predict when customers leave us before they do, what could we surface prior to that to change their minds?\" \"What if we can predict when they are ripe for a second purchase and suggest it along side other products?\" \"What if we can predict what they would be most likely to share with a friend, how would we surface that?\" So, are you doing enough? I ask this because somewhere along the way, marketers began to believe that descriptive analytics was our job, and \"that other stuff\" was for someone else to figure out. At SEOmoz, we are working hard to have each team working on all three types of data analysis in a variety of capacities. It's not easy. There is a stereotype out there that you have to break through. Data can be fun. It can be accessible, and it can be part of everyone's job. In fact, it really should be. Imagine this for a second: just think about how much could get done if every team felt empower to tell a story with the data, make predictions off of it, and then brainstormed ways to operationalize that data to prescribe next steps for the biggest gains. That is what being an analyst means and I believe we are all becoming more of an analyst as this industry continues to evolve. The platforms out there make it easier than ever, and the competition is more intense then ever. Why not be part of something more than just telling a story with the data? Why not suggest the next move? Why not create crazy ways to use the data? I think it's time we all put our analyst hat back on and had a little fun with it. Hopefully, breaking down the types of analytics above is a great reminder that there is more than just descriptive analytics. At the very least, you can share with your team to inspire them to do more with the data in front of them. Best of luck to you fellow data lovers! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "When It Comes to Analytics, Are You Doing Enough?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "When It Comes to Analytics, Are You Doing Enough?"
    },
    {
      "level": "H2",
      "text": "What are the different types of analytics?"
    },
    {
      "level": "H2",
      "text": "Descriptive analytics:"
    },
    {
      "level": "H2",
      "text": "Predictive analytics:"
    },
    {
      "level": "H2",
      "text": "Prescriptive analytics:"
    },
    {
      "level": "H2",
      "text": "So, are you doing enough?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}