{
  "url": "https://moz.com/blog/when-search-marketing-firms-turn-clients-away",
  "slug": "when-search-marketing-firms-turn-clients-away",
  "title": "When Search Marketing Firms Turn Clients Away - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Thanks to a small team and a lot of publicity, SEOmoz turns away a significant amount of work - sending folks to specific references or our recommended list or, occassionally, recommending they hire in-house SEO help. We're lucky in that we get to picky about the folks we choose to work with - some…",
  "content": "When Search Marketing Firms Turn Clients Away Public Relations By: Rand Fishkin November 3, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 3, 2006 When Search Marketing Firms Turn Clients Away Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Thanks to a small team and a lot of publicity, SEOmoz turns away a significant amount of work - sending folks to specific references or our recommended list or, occassionally, recommending they hire in-house SEO help. We're lucky in that we get to picky about the folks we choose to work with - some of the reasons for turning away business can include: Obvious factors like: Size of the company/project/budget Industry focus Competitiveness of Niche Compared to Potential Profitability Conflicts with existing or past contracts/non-competes And some less mainstream ones: Quality of Linkbait Opportunities (since this has become a primary technique for us, we tend to choose clients that can use it effectively) Ideological Affiliations (politics, beliefs, associations, etc.) Background of the Company or Principal Executives (this most often applies to folks seeking reputation management campaigns) Personality match or conflict with the primary contacts I wondered if other companies do this too, so I've put together a quick poll. If you provide search marketing services (or business services of any kind), I'd love to get your (anonymous) feedback. Note that I removed a few from the above as I felt everyone turns away business based on size/price and competitiveness vs. potential (note that multiple choices are allowed): I'd love to discuss this more as its a fascinating topic to me - client selection seems to be both an art and a science, and I'm not sure if it's something we've always done a good job with... How about you? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "When Search Marketing Firms Turn Clients Away"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "When Search Marketing Firms Turn Clients Away"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}