{
  "url": "https://moz.com/blog/when-it-comes-to-social-media-websites-the-long-tail-doesnt-apply",
  "slug": "when-it-comes-to-social-media-websites-the-long-tail-doesnt-apply",
  "title": "When it Comes to Social Media Websites, the Long Tail Doesn't Apply - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When it comes to social media websites, the long tail theory breaks down a bit.\n\nWe'd expect, in a standard long tail curve, that the pink area represented more demand and value overall than the blue area. However, the reverse is overwhelmingly the cas...",
  "content": "When it Comes to Social Media Websites, the Long Tail Doesn't Apply Social Media By: Rand Fishkin August 8, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 8, 2007 When it Comes to Social Media Websites, the Long Tail Doesn't Apply Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When it comes to social media websites, the long tail theory breaks down a bit. We'd expect, in a standard long tail curve, that the pink area represented more demand and value overall than the blue area. However, the reverse is overwhelmingly the case. There are dozens of lists of Digg clones, Flickr-like image sharing applications, social bookmarking sites, etc. but even if you were to have a dominant presence on all of these, the traffic and mindshare you'd earn would be nowhere close to that of having one listing on the del.icio.us/popular page or the front page of Digg. Why? Social sites have an inherent network effect - the more participants there are, the better the service functions. Thus, joining an unpopular site is of far less benefit to a user than joining a popular site. Social media in general has yet to reach a level of popularity where fragmentation and demand is spread out. It would be akin to saying that in 1930, there was great demand for more broadcast television channels - not only had most folks not heard of the medium, many didn't even know why they might want one Fragmentation and niche demand is already built into the medium - you can sort by what your interests, tags, categories, etc. in many of the major services. Obviously, sites like Sphinn, Bluedot, Menéame and others would suggest that it's possible to break into the market, but your product has to be unique, targeted and have the expectation of popularity at the outset. Sphinn's an excellent example of a site that everyone in the search marketing world is reading, because they expect that everyone else in the industry is also paying attention (and, thus, don't want to be left out). Whenever I see a list like this one - 50+ Social Bookmarking Sites - I'm fairly certain that maybe 5-10 of those will have any long-term shot at success. To my mind, it's simply not a market where the long tail will allow hundreds or thousands of companies to prosper. p.s. In related news, John Andrews wants to bump the SEOmoz post off the top of the most Sphunn page. Sounds good to me! Sphinn it here. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "When it Comes to Social Media Websites, the Long Tail Doesn't Apply"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "When it Comes to Social Media Websites, the Long Tail Doesn't Apply"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}