{
  "url": "https://moz.com/blog/when-money-cant-buy-you-link-love",
  "slug": "when-money-cant-buy-you-link-love",
  "title": "When Money Can't Buy You Link Love - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What do you do when money doesn't appeal to your link targets. This happens to me all the time - sometimes because they're an educational institution, a non-profit or simply a webmaster who doesn't want to \"compromise\". If purchasing \"advertising\" links becomes impossible, there are some great ways…",
  "content": "When Money Can't Buy You Link Love Link Building By: Rand Fishkin September 22, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 22, 2005 When Money Can't Buy You Link Love Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What do you do when money doesn't appeal to your link targets. This happens to me all the time - sometimes because they're an educational institution, a non-profit or simply a webmaster who doesn't want to \"compromise\". If purchasing \"advertising\" links becomes impossible, there are some great ways around it that I've used successfully. Know Before You Ask - When faced with a link requesting situation, it pays to know in advance whether your target is likely to accept $$ or not. Good ways to tell are by judging the site - do they have any paid advertising or revenue streams? If not, you may be looking at a non-monetized link, so be ready to bargain and cajole. If you first ask for a paid link, then try to ply non-paid techniques, you're much less likely to be succesful than if you approach the problem from the right stance initially. Remember, too, that it's always easier to parlay a non-monetized link request into a paid one (rather than the other way around).- Build Targeted, Linkable Content - Everyone says this, but sometimes, you can build exactly the type of content a site is already linking to with a new twist. I've done this via directories, amalgamation of data or charts, news, even tools (although that's a lot of time and money to spend on a single link).- Send a Letter - Yes, using the US Postal Service. A handwritten letter is particularly effective, but it also needs the right message. Explain to them that their audience is a perfect match for your site (don't mention search engines). Tell them that you know you can make a relationship work and you're happy to accept their criticism of your site and implement their suggestions to make it more link-worthy. Make sure you're totally familiar with their site and what they do so as to make the most compelling message possible. Show virtues of honesty, integrity and humility and you'll almost certainly work out something.- Get on the Phone - Using the above tactics from letter writing, get on the phone and make a call. Feel the person out, talk to them about their business (or website). Make friends and build a relationship. Maybe there's some questions you can answer for the person or some shared interests you can discuss. Relationships with webmasters are more valuable than you might think - it often comes back to you in the form of business in the future.- Offer Product(s) - In trying to get a link, we often send out sample product that can be used for photos for the persons site or even just for their personal enjoyment. A gift, despite being basically a substitute for money, can often sway in cases where straight greenbacks don't.- Build a Threeway - (It sounds kinky, but it's just an end-run). If there's a great news article that links to you, maybe a solid directory where you're listed on top, a tool where you've already bought a year's worth of a text link, even a Wikipedia entry that has your site in the references can work. In a spot where you're fairly sure the party won't link directly to you, getting them to link to valuable pages that DO link to you may be just the solution, and it's oftentimes much easier. It's not as powerful as a direct link, but it does provide value, and can be the perfect way to score link power your competition can never get to.- Reciprocate with a 3rd Party - If you've scored a great link from another high-profile site in the industry, and think you've got a shot of doing it again (especially for the nice non-profit, directory or edu sites), let the owner know you can do this. Sometimes the promise of a link from a highly respected competitor or colleague is exactly the incentive you need.- The Truth & Nothing but The Truth - I know it's slimy, but I have, on occassion, neglected to mention my exact affiliation when link searching (besides 2/3 ain't bad; just avoid \"the whole truth\"). It's not always neccessary to say - \"I work for company X and I'm trying to buy/build links\". Just tell them you're an aspiring writer in the field, a student or just a junky for this stuff and you're wondering if they'd be interested in having you write an article or column for them. Then let them know you've got a line on an interview with the CEO of a big firm in the industry. Do they interview (with your client), write up a great article, attach the link (as it clearly belongs there), and away you go. If you have more good ideas, chime in... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "When Money Can't Buy You Link Love"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "When Money Can't Buy You Link Love"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}