{
  "url": "https://moz.com/blog/when-it-comes-to-reputation-management-use-protection",
  "slug": "when-it-comes-to-reputation-management-use-protection",
  "title": "When It Comes to Reputation Management, Use Protection! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There have been a few mentions on SEOmoz regarding online reputation management and public relations. Rand discussed how to remove a page from Google and RZ Awhyles brought up the simple fact that sometimes, you just need to apologize directly. But neither talked about ways to discourage negative…",
  "content": "When It Comes to Reputation Management, Use Protection! Branding W By: WesUpchurch March 24, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! W By: WesUpchurch March 24, 2009 When It Comes to Reputation Management, Use Protection! Branding This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There have been a few mentions on SEOmoz regarding online reputation management and public relations. Rand discussed how to remove a page from Google and RZ Awhyles brought up the simple fact that sometimes, you just need to apologize directly. But neither talked about ways to discourage negative feedback being distributed online in the first place. Taking measures to prevent reputation damage and negative PR is always better than trying to recover from a less than positive review or statement. So what can be done to prevent harm to your brand on the front end? Build Trust with Clients or Customers If your customers trust you, they will worry less and they'll be more likely to remain positive about your interactions with them. You should be honest with your clients in all aspects. Don’t make exaggerated claims in your advertising or sales copy if you can’t back it up. And don’t set deadlines you can’t keep. And if you must break a deadline, it’s always best to alert your clients with an explanation. This means you act professional in your correspondence with customers and are willing to listen to their concerns. For services, communication is key. You should provide regular reports and updates to your clients so that they don’t feel like they are being left out of the loop. There are other discrete ways to build trust, including discrete placement of professional associations and affiliations. You could provide them with testimonials and references. If you are shipping an item, it’s always best to include a tracking number. This lets the customer know you are shipping the product as promised and gives them an estimation as to when they’ll be receiving it. Resolving Disputes and Developing Resolutions So you’ve done everything right on the front end of the transaction, but the customer still isn’t happy. Don’t worry, sometimes for various reasons you’ll encounter problems that you just couldn’t avoid. So what do you do? If you are willing to communicate and work with your customers, they’ll likely be thankful that you were flexible and cooperative. This kind of image leaves them with trust and respect for your brand, even if that particular deal didn’t work out. You should have a support system in place for your site so that customers can express their concerns to you directly. If an unhappy customer can email you about their problem directly, they are much less likely to do so publicly. The more ways you give a customer to contact you, the better. Being a member of business organizations gives unhappy customers a way to get their disputes resolved with the assistance of a third party. Even though there may be a record of this, such as with the Better Business Bureau, at least it is more discrete than a public message board. And it will usually indicate that you resolved the problem, which again helps to build more trust for your brand and demonstrates willingness to satisfy your customers. You should consider offering your customers a warranty or guarantee. If they are unhappy, then you simply need to honor your promise to be free of retaliation from your customer. For those providing a service, I highly recommend including an arbitration clause in your contracts or Terms of Service. In it you can specify that no action damaging to reputation shall be taken against either party, until an arbitrator has heard the dispute. So next time you think about maintaining a positive public image for your brand, remember that preventing damage to your good name is the best medicine. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "When It Comes to Reputation Management, Use Protection!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "When It Comes to Reputation Management, Use Protection!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "WesUpchurch\n          \n            WesUpchurch"
}