{
  "url": "https://moz.com/blog/when-not-to-use-an-infographic-6-examples",
  "slug": "when-not-to-use-an-infographic-6-examples",
  "title": "When NOT to use an Infographic: 6 Examples - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Although I run an agency focused on designing eye-catching infographics, sometimes this is not best solution for a client’s needs. I wanted to share four situations in which infographics should probably not be used or don’t provide a good return on investment (ROI) for the client.",
  "content": "When NOT to use an Infographic: 6 Examples Content Marketing By: Danny Ashton September 4, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Danny Ashton September 4, 2012 When NOT to use an Infographic: 6 Examples Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Although I run an agency focused on designing eye-catching infographics, sometimes this is not best solution for a client’s needs. I wanted to share four situations in which infographics should probably not be used or don’t provide a good return on investment (ROI) for the client. 1. Websites with Shady Links Every SEO expert under the sun is aware of the massive changes caused by Google’s Penguin and Panda algorithms – in fact, we even did an infographic about it. Often, potential clients will ask if an infographic can fix their penalised site. Although an infographic can help diversify backlinks and help push domain authority in the right direction, it can only do so much, and we would need to know about the exact penalty in place before making any recommendations. A bigger problem is when a site has lots of “grey” links and hasn’t been hit by a penalty. We’ve seen situations in the past where using an infographic can actually cause this kind of site to get picked up by filters and penalized. It doesn’t happen all the time, but it’s a risk for this particular type of client. Quality infographics are not cheap – often costing several thousand dollars if it includes independent research and design – so it’s important to work with someone who is aware of how your site might be affected. Investing this kind of money into a website that could be days away from penalisation is a risk that I would not recommend to any of my clients. 2. Under-developed Websites Photo from Komar / Shutterstock.com You have just published your website yesterday... surely an infographic is the best way to tell the world about your wonderful site, right? Well… maybe, but unlikely. Infographics bring more than just links. They also help position “your brand” in front of a receptive audience. Don’t waste the power of an infographic by having a blog with two posts and just the bare bones of a website. Publishing on an immature website can give clients the impression that you’re sloppy or inexperienced. Like many things in SEO, the ROI also depends on how well you leverage your existing assets. Infographics are an awesome way to help leverage your Twitter account, email list, Google+, RSS subscribers, etc. If you want to use any of these, you’ll want to have them in place prior to launching your infographic, and you’ll also want to be sure that existing accounts are updated and relevant. Make sure your site covers the basics before investing in high end content like infographics. 3. No Social Media Plan A proper social media plan involves more than just having a Facebook and Twitter account. An infographic is viral in nature and designed to be passed around online, bringing large amounts of eager social media-savvy eyeballs to your site. If your Facebook account has no content, and you haven’t tweeted since 2009, you’re unlikely to demonstrate value and convert these eyeballs into an enthusiastic audience – limiting your return on investment. As with your website, the basics of your social media plan should be implemented to help you get the most out of your infographic. At minimum, you need to: Update your content regularly (i.e. adding content to Facebook, tweeting at least a couple of times a day, etc.) Have a small audience of followers (12 likes and your mother following you on Twitter doesn’t count) A strategy for identifying, responding to and engaging with individuals who share your content online People need a reason to follow you – beyond the fact you’ve just published a infographic. Giving it to them is easy and effective with a bit of planning! 4. No Mailing List Obviously, if you don’t have a mailing list you can still use an infographic – but you’re missing out on a HUGE opportunity. While 10,000 unique visitors sounds great when you’re telling your mates in the pub, it’s unlikely to provide more than a temporary spike in your Google analytics and a few additional links or mentions on social media. On the other hand, just 50 people signing up to hear more about your company is extremely valuable and an essential part of converting site visitors into potential leads. I have serious reservations about launching an infographic if a client doesn’t have a way to allow visitors to sign up to a newsletter or some other way to maintain direct contact with interested consumers, and it’s also why we don’t recommend that clients choose graphics that are totally irrelevant to their business or brand. Yes, it can be great linkbait (although if Matt Cutts has his way it may not work for much longer), but the traffic is can be pretty useless from a lead generation/audience building angle if there is a total disconnect. Keep in mind: a mailing list can also become a great promotion tool for future graphics... allowing others to help do the hard work of sharing the content virally for you. 5. Having a Budget of Less Than $500 There are plenty of places to pick up an infographic for $299, but I think this kinda misses the point: infographics ONLY work if they can cut through the NOISE. Back in 2009, infographics were new enough that just having one might lead to links and media coverage. But it’s 2012, and according to Topsy 17k tweets contained the term “infographic!” Heavy competition and a savvier audience online have ensured that only awesome infographics capture the attention of the big authority sites (infographic directories are a different story). Creation of a good graphic takes the time and resources of skilled team – usually costing upwards of a $1,000. Don’t get me wrong, I want pricing on infographics to be competitive, but quality research, copywriting and design cost money, because that’s what gets results. If you can only afford to spend $500, then you’re better off with a well-written link bait article or guest post from a ROI perspective. 6. You Don’t Understand what an Infographic is... This is an important issue and isn’t meant to sound condescending. Infographics are about great content – and not necessarily what content appeals to you. It’s focused on the needs of your target audiences and the online media who serve these targets. While converting a 129-page report on potential designs of a one aspect of a widget might sound great in the boardroom – it’s unlikely to get picked up by the media or blogging world. If you wouldn’t publish a 2000-word blog post on this report, converting it to graphical form will not make it any more interesting. It may look nice and make for a great poster in the office, but won’t impress potential consumers or those who care about your business – which is ultimately the goal. If you’re unfamiliar with infographics, the key is to work with someone who understands your objectives, is credible and experienced, and understands how to make this tool work for you and your business. There is also a great book on Amazon that gives you a great overview. Anyway what do you think? I would love to hear what people have to say in the comments. Danny Ashton - Danny is the founder of Neo Mammalian Studios who design and promote awesome infographics. Follow him on Twitter at @neomammalian Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "When NOT to use an Infographic: 6 Examples"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "When NOT to use an Infographic: 6 Examples"
    },
    {
      "level": "H2",
      "text": "1. Websites with Shady Links"
    },
    {
      "level": "H2",
      "text": "2. Under-developed Websites"
    },
    {
      "level": "H2",
      "text": "3. No Social Media Plan"
    },
    {
      "level": "H2",
      "text": "4. No Mailing List"
    },
    {
      "level": "H2",
      "text": "5. Having a Budget of Less Than $500"
    },
    {
      "level": "H2",
      "text": "6. You Don’t Understand what an Infographic is..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Ashton\n          \n            Danny Ashton\n          \n            Danny Ashton"
}