{
  "url": "https://moz.com/blog/when-google-was-not-an-obsession-content-conversion-were-likely-better",
  "slug": "when-google-was-not-an-obsession-content-conversion-were-likely-better",
  "title": "When Google Was Not an Obsession, Content & Conversion Were Likely Better - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Years ago, before I was constantly on the lookout for changes that might affect Internet marketing and had yet to develop my obsession with Google, I used to create content that was designed for people. Yes, you read that right...I used to write with the human being in mind not the search engines.…",
  "content": "When Google Was Not an Obsession, Content & Conversion Were Likely Better Content Marketing By: Foster Web Marketing July 10, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Foster Web Marketing July 10, 2012 When Google Was Not an Obsession, Content & Conversion Were Likely Better Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Years ago, before I was constantly on the lookout for changes that might affect Internet marketing and had yet to develop my obsession with Google, I used to create content that was designed for people. Yes, you read that right...I used to write with the human being in mind not the search engines. The focus as a writer was to create content that was helpful to the intended audience. Each magazine article, book and paper newsletter was all about answering those questions that the reader might be asking in his or her mind. So, what happened along the way? As I moved from “offline” writing to website content and Web marketing it quickly became apparent that words had to be tweaked to also capture the attention of search engines. I don’t think I am alone in this transition. Now, as an Internet marketer I sometimes scratch my head and wonder why the bounce rate is so steep on a page and why more Web visitors aren’t converting into contacts. The traffic is high, so why aren’t sales? Time to Go Back to Our Roots If you can relate to this dilemma, it might also be time for you to go back to your roots. With all of the major updates Google has made, it has acted as a reminder that it really is the end user we need to be thinking about. While we can’t ignore on-page optimization, there needs to be a bigger focus on that human being on the other end reading the Web content. Google is always touting that they want to improve the user’s experience, so shouldn’t we as well? If so, let’s start with creating content online that has worked so well offline. The following tips are what I have already put into practice. Although some aren’t new or “outside of the box,” they are a reminder of where we should be focusing our content efforts, so that we improve our conversation rates. Just answer the question. We all know that you can get thousands upon thousands of visitors to a website, but if they don’t convert, have you really done a good job? Attraction is just the first piece of the Web marketing puzzle. Conversion comes next. People are online looking for information and solutions to their problems, so just answer the question. If a page has been created and optimized for a certain keyword or phrase, it better provide insight into the searcher’s query. Taking it a step further, it should answer the question right away. Here is an introduction from a great blog post that answers the question that is posed in the title: After-Market Motorcycle Parts: Cool or Deadly, Wisconsin Bikers? You’ve just bought a new motorcycle, and you want to personalize it—make it yours. Before you charge up a fortune on cool features and parts to soup it up, you should be aware of some disturbing facts that could result in Milwaukee motorcycle crashes. As reported in The Washington Post on May 27, 2012, many motorcycle after-market parts do not comply with federal safety standards or the Clean Air Act. Some of the parts are widely considered dangerous, such as passenger seats that attach to motorcycles with suction cups. (Note: Starts to answer the question that they could be deadly.) Follow the lead of tabloids and fashion magazines. Do you ever stop and look at the headlines of tabloids and fashion magazines when you are at the grocery store checkout? Come on, you know you do. Those publications recognize how to capture people’s attention with provocative headlines. The same can be done with website content, as long as the headline still matches the information on the page. Our company used to say that a catchy headline plus informative content plus a call to action equals a Web contact. I still believe this formula to be true. It starts with the headline. Here is an example of what this approach might look like: Original Headline: “Lose Weight By Taking These 5 Steps!” New Headline: “Lose Excessive Debt By Following These 5 Strategies!” Be unique. One of the biggest mistakes I see made with content on the Web is that it is very repetitive and often doesn't take a unique angle on the subject. The exact same type of article, blog post or page has already been done countless time. Don’t regurgitate content. It’s annoying. If you want to get traffic and actually convert those visitors, provide something that is at least slightly different and very informative. That might mean you need to bring in a professional copywriter or spend some time thinking of a unique angle to take. It’s well worth the extra effort. The following excerpt is an example of how you can take a subject and put a new twist on it to make it compelling: For the Sake of Your Health, Listen to Your Toenails Toenails. Many people do their best to avoid thinking about them, and therefore do not monitor them closely enough. Some people with infected toenails are unaware of the condition, while others know full well but do their best to hide it. Discolored or chipped toenails are unsightly in summer sandals. However, our foot specialists know that they can also be an indication of a deeper problem. You might be asking yourself: \"Is this YouMoz post like all the others out there regarding content?\" If it made you think about your current strategy and how you are approaching content writing, then I would say the answer is \"no.\" I’m ready to go back to my roots, so I can convert more Web visitors. Is anyone else with me? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "When Google Was Not an Obsession, Content & Conversion Were Likely Better"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "When Google Was Not an Obsession, Content & Conversion Were Likely Better"
    },
    {
      "level": "H2",
      "text": "Time to Go Back to Our Roots"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Foster Web Marketing\n          \n            Foster Web Marketing"
}