{
  "url": "https://moz.com/blog/when-you-should-pause-your-ppc-campaign",
  "slug": "when-you-should-pause-your-ppc-campaign",
  "title": "When You Should Pause Your PPC Campaign - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "After our dismal experiment with trying to track impressions, Rand's course of action was to have me dive in headfirst and manage our PPC campaign for our Premium memberships. I half-assed the campaigns in August '07 and retooled them in November, when we redesigned our landing page and added a few…",
  "content": "When You Should Pause Your PPC Campaign Paid Search Marketing (PPC) By: Rebecca Kelley February 5, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley February 5, 2008 When You Should Pause Your PPC Campaign Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. After our dismal experiment with trying to track impressions, Rand's course of action was to have me dive in headfirst and manage our PPC campaign for our Premium memberships. I half-assed the campaigns in August '07 and retooled them in November, when we redesigned our landing page and added a few targeted pages. The clickthrough rates ranged from \"need improvement\" to \"pretty good,\" with our best campaign averaging around 3.5%. Our conversion rate to our \"Choose\" page was great, ranging from 75-100%. And then I paused our ads. \"Why?\" you ask. After all, our clickthrough rates were decent (though they could be improved) and our conversion rates were astounding. Why on earth would we stop running our campaigns? Because our conversion rate of those who went from the \"Choose\" page to our \"Completion\" page is terrible. In AdWords we track conversion rates from our ad to our \"Choose\" page, which is where users get to choose which membership they'd like to sign up for. However, with our analytics program we track those who actually made a purchase, and those numbers tell a different story. At far lower than a 1% conversion rate, it was time to assess what we were doing wrong. For us, it was a no-brainer--our signup process is awful. We lose a lot of people in that process, and Rand himself couldn't even sign up for an account without experiencing issues. Our devs are in the process of rolling out a new payment system that will make signups much smoother and easier, and that should be deployed at the end of the month. Faced with that knowledge, I had a decision. Do I let our ads run and continue to lose money for the month of February because of our abysmal payment process, or do I pause our ads, wait for the new system to be implemented, and resume them so I can test and see if the change improves our campaigns? I really learned an important lesson here, and I wanted to share this lesson with other PPC noobs like myself. My first encounter with AdWords, when we were running our impressions test, was pretty embarrassing. I thought you could just set up a campaign and let it do all the work for you, but that's certainly not the case. You need to check your campaigns constantly, and you certainly don't want to be losing money in your advertising attempts. In my experience, it's imperative to know when to hold 'em and when to fold 'em, so to speak. If something's wrong with your campaign, sometimes the right thing to do is pause your ads and figure out what's causing the problem, then make those changes and resume for testing. There's no reason why you should have to dump unnecessary amounts of money on your campaigns, and we've now learned that. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "When You Should Pause Your PPC Campaign"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "When You Should Pause Your PPC Campaign"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}