{
  "url": "https://moz.com/blog/where-are-search-engines-most-likely-to-innovate",
  "slug": "where-are-search-engines-most-likely-to-innovate",
  "title": "Where are Search Engines Most Likely To Innovate? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Since Read/Write Web is covering 10 future web trends today, I though it would be a perfect time to present my own theories on how search engines might be innovating their technologies.\n\n    Query Intent Detection\n    It seems that all of the major engines have eschewed disambiguati...",
  "content": "Where are Search Engines Most Likely To Innovate? Moz News By: Rand Fishkin September 5, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 5, 2007 Where are Search Engines Most Likely To Innovate? Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Since Read/Write Web is covering 10 future web trends today, I though it would be a perfect time to present my own theories on how search engines might be innovating their technologies. Query Intent Detection It seems that all of the major engines have eschewed disambiguation in favor of attempting to automatically determine the query intent of a user. My guess is that more robust user data and greater analytical and data mining capacity will result in even more personalization and assumption of intent. Search Term Pattern Analysis I believe we're going to see a lot more tweaking of results and rankings based on how a user has conducted a series of searches from the past. I'm also guessing that advertising is going to be served and tracked to visitors based on search patterns - imagine a Google AdWords interface where you can target any searcher who's made searches for \"used cars\" and \"seattle\" in any combination of search strings over the past 30 days. Powerful stuff, right? Vertical Growth Ask's 3D interface is clearly the future of vertical results, and it's hard to argue that for many searches at the head of the demand curve, Ask is providing the categorically \"best\" SERPs because of this. With expansion into specialized results for recipes, local, news, video, images, flights and many more, I suspect that the other engines are going to try playing leapfrog, rather than catch-up. This will probably mean some very unique interfaces and a whole new set of challenges for search marketers. Social Data Inclusion I may have plenty of bones to pick with Scoble, but that doesn't mean his ideas are wholly without merit, though I think the directions of his predictions were pretty far off. My guess would be that data from sites like Facebook, Del.icio.us, Digg, Reddit, Newsvine, Techmeme and others may eventually find a place in both relevancy detection (by attempting to match behavior with intent) and ranking (using temporal data & human preferences & sharing information). Search & Discovery Suggestion I can't look at the success of sites like StumbleUpon & Digg without thinking that search engines have to be experimenting in those fields. I imagine there are already efforts to attempt to provide \"discovery\" type information, searches, suggestions, etc. to users of the engine. Picture a new tab at Google that offers \"search phrases you might be interested in,\" based on your search history and other profiling data. Link Patterns over Link Numbers PageRank was, without doubt, a remarkable innovation, but brute link juice may eventually fall to more sophisticated analyses of how, when and where certain sites and pages link. Major Vertical Fracturing Why would you run a real estate search on Yahoo! or Google when you can do it on Zillow? Why run a local search on those engines when Yelp offers so much amazing data (full disclosure - they're a client)? Could Avvo do this for the legal industry? Could Technorati (or someone else) do it for the Blogosphere? The possibility that some verticals might be stolen away in large chunks from the major engines is certainly a possibility. Answers Over Results Naver in Korea has shown that when done right, a collection of human answers can be preferrable to a list of relevant web pages. This could be another option for fracturing, a possibility for more vertical creep or even an opportunity for a whole different kind of engine. One thing I see fueling the potential is increased mobile search - that market is still drastically underserved. Semantic AI Picture a Googlebot that could not only read your pages, but \"understand\" what you were saying. A truly intelligent engine is probably still a decade or more away, but with every leap forward in contextual perception, the engines are going to be churning out better and better results. I know - I've only got nine, but it's getting late and I have an investment prospectus to build. For more great reading today, I urge everyone who uses site architecture for SEO to read Dan Thies' brilliant post - How to Get More Pages Indexed with NoFollow. I'd also note that if you ever again need to convince someone to stop using or obsessing over the meta keywords tag, Danny Sullivan has a great reference point for you. Please feel free to suggest your own ideas of how search and search engines will evolve. Who knows, maybe if you post something particularly clever, you'll wind up like our old friend John Mu :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Where are Search Engines Most Likely To Innovate?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Where are Search Engines Most Likely To Innovate?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}