{
  "url": "https://moz.com/blog/wheres-the-love-dmoz",
  "slug": "wheres-the-love-dmoz",
  "title": "Where's The Love, DMOZ? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There was once a directory called DMOZ, which shone forth like a beacon of glorious link-light. From all across the realm, downtrodden webmasters would travel to pay homage to the ones called Editors.",
  "content": "Where's The Love, DMOZ? Link Building By: Dr. Peter J. Meyers February 9, 2011 Table of Contents Copied! By: Dr. Peter J. Meyers February 9, 2011 Where's The Love, DMOZ? Link Building There was once a directory called DMOZ, which shone forth like a beacon of glorious link-light. From all across the realm, downtrodden webmasters would travel to pay homage to the ones called Editors, that those keepers of the Categories might bequeath a link of great PageRank upon them. Woe upon those who did not have the light of the most open directory, as their websites would surely wither and perish. Sadly, that's not far from the way many people saw DMOZ in the past, and that attitude still persists in 2011. It's easy to understand why – a free yet authoritative directory that even now has a Toolbar PR of 8 is certainly an attractive link target. Unfortunately, when we quest after high authority mega-directories, we sometimes miss that the SEO and traffic value of the link we can actually get (one buried deep in subcategories) is virtually non-existent. Where Are The Pages? This post came out of Q&A, where we've had multiple questions about new DMOZ links not showing up in Open Site Explorer. To be honest, the timing and depth of these links means that OSE doesn't always catch them, but in almost every case that I dug into, the DMOZ pages in question weren't being indexed by Google, either. In many cases, these links end up in one of the Regional categories. Let's look at an example, the DMOZ regional listing for website developers in Denver. The URL is a bit too long to display here, but it's 11 folders deep (10 below the root). Although Google shows a cached copy, there's nothing in the index. Even the cached copy is over 2-1/2 months old. Unfortunately, no indexation means no link-juice gets passed. Where Did It Go Wrong? I'm not here just to pick on DMOZ – I want to illustrate how, as you dive deep into a site (even a very high-authority site), it's easy to lose link-juice fast. Let's pick apart that DMOZ link, level by level. The following table shows whether each level is indexed by Google and OSE, as well as the Toolbar PR and SEOmoz PA scores for the page: It's easy to see that PR falls rapidly at Level 6, and indexation stops soon after. It's also interesting that, in this case, OSE is actually crawling deeper than Google (I honestly didn't expect that). I should point out that these listing pages are hardly unloved orphans, in the scheme of DMOZ. The Denver Business_and_Economy page lists 1,017 companies, and even the deepest Web_Design_and_Development level has 35 listings. Keep in mind that these are also web developers, who are probably eager to see their listing count for something. Can You Save The Love? There are cases where enterprising SEOs may find it worth their while to get someone else's page indexed. You could build your own links to the deep DMOZ listing page, promote it in social media, etc., nudging the crawlers to take action. In this case, though, you really have to ask if it's worth the trouble. The final resting place of this link is, unfortunately, just that – a link-juice graveyard. You could give it link-juice by linking to it, of course, but that effort is probably better spent on building your own, direct links. Is There Someone for Me? There are plenty of fish in the sea, even without DMOZ, right? Let's look at another revered PR8 directory and coveted link source, the Yahoo Directory. Surely, the Yahoo regional listing for web developers in Denver must be loved by Google? That's right – that subcategory page is not indexed in Google or OSE, and it has no TBPR or PA, even though it contains 27 active (and presumably bought and paid for) listings. Does this mean big directories are a thing of the past? No, but it does mean that your infatuation may be more shallow than you think. There's a lot more to the value of a link than the TBPR or authority of the domain, and, if you're not careful, you might just find that your love is unrequited. \"Knight in Shining Armor\" image licensed from Getty Images (Tony Garcia Photography). Update (February 10th): Despite my effort to nofollow the link, Google decided to mess with me (thanks for the heads up, Aaron B.) and index that DMOZ page, which now has a 2/10/11 cache date. I'm sure there's a lesson in here somewhere, but I refuse to learn it. It does suggest that even a nofollowed link and a few clickthroughs can kick the crawlers into gear. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Where's The Love, DMOZ?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Where's The Love, DMOZ?"
    },
    {
      "level": "H2",
      "text": "Where Are The Pages?"
    },
    {
      "level": "H2",
      "text": "Where Did It Go Wrong?"
    },
    {
      "level": "H2",
      "text": "Can You Save The Love?"
    },
    {
      "level": "H2",
      "text": "Is There Someone for Me?"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}