{
  "url": "https://moz.com/blog/where-did-all-the-thumbs-go",
  "slug": "where-did-all-the-thumbs-go",
  "title": "Where did all the thumbs go? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When the lovely people at SEOmoz launched YOUmoz all those weeks ago, one of the things that most excited me (being a notorious attentention junkie) was not just the ability to be able to rant to a group of like-minded people on aspects of search and the wider internet that interest me, but the…",
  "content": "Where did all the thumbs go? Moz News C By: Ciaran Norris March 11, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris March 11, 2007 Where did all the thumbs go? Moz News This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. When the lovely people at SEOmoz launched YOUmoz all those weeks ago, one of the things that most excited me (being a notorious attention junkie) was not just the ability to be able to rant to a group of like-minded people on aspects of search and the wider internet that interest me, but the fact that I could then judge the effectiveness of these rants thanks to the thumbing system. So, if people liked what I had written, or found it interesting, they could give me the thumbs up. If however, as my wife often does, they thought that I was talking rubbish, and needed to wind myself back in again, they could instead give me a thumbs down. And I received a MOZ point from each lovely person who gave me a thumbs up, thus helping me on my way to Top 10 status (nearly there - I'll get you yet rmccarley!) and one free month of premium membership. But somewhere since the launch of the YOUmoz section, and indeed since the addition of the thumbs to the main blog, the thumbs seem to have fallen out of favour. What do I mean by that? Well, I'll let fellow YOUmozzer altherrweb explain. In a comment on Rand's post My Advice On Google Sitemaps - Verify, But Don't Submit (which received 100 comments), he said: All of this complaining for a post that has 12 thumbs up and no thumbs down?? This is almost like a forum now.... Whilst it's obviously great that blog posts generate so much conversation and debate, I do wonder why people don't take the time to give a post a quick thumbs up or down. It's not even the case that I'm saying this because I'm so desperate to get into the top 10 (although, sadly, I am); it's more that I think it's a kind of SEOmoz ettiquette. If someone has taken the time to write a post that is deemed publishable by the SEOmoz team, the least that a reader can do is share their appreciation (or disgust). If nothing else, it allows the author to judge the value of what they've written if they don't have time to read all of the comments (admittedly, not a problem on most of my posts). So come on people - give thumbs a chance (and feel just as free to give me the finger)! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Where did all the thumbs go?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Where did all the thumbs go?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}