{
  "url": "https://moz.com/blog/which-link-metrics-should-i-use-part-1-of-2-whiteboard-friday",
  "slug": "which-link-metrics-should-i-use-part-1-of-2-whiteboard-friday",
  "title": "Which Link Metrics Should I Use? Part 1 of 2 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For both personal knowledge and client satisfaction, it's really important to be able to track SEO progress quantitatively as well as qualitatively. In a two part series beginning today, Rand is going to go over the definitions of some of the most popular metrics available right now, as well as the…",
  "content": "Which Link Metrics Should I Use? Part 1 of 2 Whiteboard Friday By: Aaron Wheeler March 24, 2011 Table of Contents Copied! By: Aaron Wheeler March 24, 2011 Which Link Metrics Should I Use? Part 1 of 2 Whiteboard Friday For both personal knowledge and client satisfaction, it's really important to be able to track SEO progress quantitatively as well as qualitatively. One of the benefits and detriments of the field of SEO is that there is a lot of data out there, which helps make SEO tracking easier but at the same time can be overwhelming to even advanced SEOs. In a lot of ways, it's just a matter of choosing which data to use. For instance, just as you wouldn't use a katana to spread chevre, you wouldn't use the PR of a homepage to track a domain's success in search results. In a two part series beginning today, Rand is going to go over the definitions of some of the most popular metrics available right now, as well as the best ways to use metrics in your SEO analysis. Also check out the second part of this series here. Video TranscriptionHowdy SEOmoz fans. Welcome to another edition of Whiteboard Friday. I'm very excited to have you with us today. Today we're talking about a question that plagues a lot of webmasters, a lot of SEOs, and a lot of marketers. And that is: How should I use metrics? There are so many metrics on the Web. How should I use metrics to analyze links, analyze pages, analyze sites, use them in my link building practices, and use them in my outreach efforts?Today I'm going to start with part one of two. In part one of two, what we're going to cover is all of the metrics that are available for links, well, many of the metrics that are available for links from the primary sources, and what each of these mean, because it can be really confusing if you don't know and aren't familiar with these metrics, to apply them in your day-to-day work. But if you know what these mean, you'll be able to have a lot of insight into how they can be used to analyze the sites and pages that you're looking at and what you can do with them. So, let's get started.First off, we've got three big groups of places that link metrics come from, at least from the SEO perspective. There's Open Site Explorer and Linkscape. There's Google, Yahoo!, and Bing. There's Majestic SEO. All three of these – Google, Yahoo!, and Bing of course being separate ones – but all three of these have metrics that they compose on their own.That means if you're looking in lots of different tools, for example, I saw someone asking in the SEOmoz Q&A, I'm using this link diagnostics tool, or I'm using Raven SEO. Or I'm using some other tool sources. I'm using Google Webmaster Tools. I'm using the search engines. I'm using a third party tool that's pulling in different information. Virtually all of those sources come from one of these three.Essentially, they all build their own indices, right? Open Site Explorer and Linkscape builds its own index of the Web. Majestic SEO has their index of the Web. Google and Bing have their own indices of the Web. Yahoo!'s is going away. But all of these can produce individual metrics.So let's start with Open Site Explorer and Linkscape. Linkscape powers Open Site Explorer. It powers the link intersect tool. It powers your pro web app, and it powers lots and lots of other tool bars, so the mozBar, the quirk search status bar, the SEO book toolbar. And you'll find these metrics in tools like Raven, as well.First off, mozRank. mozRank is analogous to Google's PageRank. It's essentially using virtually the same formula. Ours is slightly different, so as not to be patent infringing, but it runs the same way. So it's an iterative algorithm running across the Web's link graph, and essentially, it says links are votes. The pages with more votes have higher page rank, and therefore, they cast more important votes. It's sort of like a representational democracy with mozRank and PageRank.mozRank is for an individual page only, so it's assigned to each URL on the Web. For the 40 billion to 50 billion pages that are in our Web index, most of those pages have very, very tiny amounts of mozRank. So when you see 3, 4, 5, those may not look like big scores, but remember that mozRank is logarithmic. That means that there's a tremendous number of pages with very low scores, and then it's increasingly harder and harder to get more and more mozRank.For example, a mozRank 5 is actually, I think, eight and a half times more important. It means it has eight and a half times more link juice, or more mozRank, than a mozRank 4 web page. So this is a very good thing to know. And that's why it's so granular, why it shows two significant digits, like a 4.56, because 4.56 might actually be substantially more than, say, a 4.21. That's quite a big difference.mozTrust is similar to mozRank, but it does something very unique. It biases so that mozRank, or link juice, can only flow from trusted sites, and then it calculates the same type of thing. Essentially, what it's saying is not every page on the Web passes mozRank, only these initial trusted seed sets of sites, which we essentially gather the same way as we've seen search engines do it in their research papers and patents. Identifying those sites and having those, I believe it's around 250 or 350 sites passing out mozTrust.So the more mozTrust you have, if I've got a 3.75 mozTrust and I move up to a 5.05, if your mozTrust moves up in this fashion, this means that not only have you gotten more links, which will be reflected in your mozRank as well, but it means that you've gotten more trusted links. It means that the sources that are linking to you are coming from better and better places, or the sources that are already linking to you are getting more trust from the sites that are linking to them. Those are both possibilities.Domain mozRank and Domain mozTrust are essentially exactly the same as mozRank and mozTrust, but they happen on the domain-wide level. So the problem with looking at mozRank on a homepage or PageRank on a homepage is that it's not actually for the domain as a whole. If I go to SEOmoz.org and I look at its homepage page rank, it used to be an 8 and now it's a 7. That doesn't actually tell me how important the whole domain is. It just tells me how important the homepage of that site is. That's not what I want. What I want is how important is this domain on the Web compared to all the other domains. That's exactly what these two metrics will do. The first one, mozRank, will look at raw popularity, raw importance. The second one, mozTrust, looks at trustworthiness of that domain.Next, you get some metrics that you should be pretty familiar with. They're fairly self-explanatory. So there's number of links, and number of links will include all the kinds of links that we know about – followed and no-followed links, external and internal links to a page, 301 redirects to a page. Soon, they're going to include rel=canonicals, the number of pages that rel=canonical to a page, and we'll be marking those out as that's become a pretty big part of the Web now. With each of these, you can dig deeper. So if you're in Open Site Explorer or if you're in the mozBar, you can dig deeper into a full list of metrics and get all of those.Number of linking route domains is similar in that it describes the number of links. But rather than saying this is how many unique pages have a link here, it's how many domains as a whole have a link here. Number of linking root domains is well correlated with Google's rankings generally indicating that domain diversity, getting links from lots of different places, is quite good. In fact, the best single metric, non-aggregated metric, that we've got to predict Google's rankings with correlation data is the number of Linking C-Blocks. C-Blocks is a little bit tricky. A domain might be something like SEOmoz.org, but a C-Block might include SEOmoz.org and OpenSiteExplorer.org, and I think we might host a few other domains, SEOmoz.com, which redirects to SEOmoz.org.Linking C-Blocks is essentially saying, \"This C-Block of IP addresses, how many of those are there on the Web that contain at least one link to this page?\" So looking at linking C-Blocks can be quite a good metric, as well. This is currently in our API, so you can download and look at it. I think a few different tools use it. Soon it will be in more of our places. The new version of Open Site Explorer that's coming out in July should have that.Page authority and domain authority are a little complicated. Basically, imagine all of these metrics and lots more of these metrics, lots more pieces and factors of these metrics being calculated using a machine learning model against Google's search results to try and predict what single metric best correlates by aggregating all of these and multiplying them and dividing them and using all sorts of fragments of them to get the highest correlation numbers.Page authority is a number from 0 to 100 that describes how important or how potentially well this page could rank given no other features about it. So we don't know what query it's trying to rank for. We don't know the anchor text that it's trying to rank for. We don't know what keywords are on that page or anything. All we know is based on the links, how well-correlated is this particular page with rankings?The second one, domain authority, is the same thing of 0 to 100, but doing a similar thing for domains. It's essentially saying, \"How well would this domain overall perform?\" As you can imagine, correlation with page authority is better than domain authority. We're going to talk about how to use all these metrics in the next segment, where I might possibly be wearing this shirt. That's just a coincidence, never mind that.Let's jump over to Google, Yahoo!, Bing, and Majestic and talk about some of their metrics, as well. Google obviously calculates PageRank internally. They have PageRank scores for every page on the Web. My understanding is that's updated multiple times per day. But in the toolbar, which is where we get the data, we get the data in the Google toolbar, which looks like this and it's colored in and it's a 4 out of 10, that amount of PageRank.The Toolbar PageRank is only updated every three to nine months, so not particularly regularly. It doesn't always reflect the true numbers. Sometimes Google will penalize pages or sites by removing their Toolbar PageRank, bringing down their Toolbar PageRank if they think they've been selling links and they want to show that they know about those sold links, that kind of thing.The toolbar number from 0 to 10 is a rough indication of how important Google thinks that page is. But I'd be careful about relying on it because it's not updated very frequently. You could launch a new site tomorrow and it would be three or four or five months before it showed PageRank, and yet it would have PageRank probably starting the next day when you got links into it. PageRank does correlate very well to mozRank. They're usually just a few, .5 or .6 apart. But mozRank updates every time the Linkscape web index updates, which is once a month. PageRank is much less frequently.Homepage PageRank or what some people call Site PR – they'll say my website is PR 6 or my website is a PR 5. This is a fallacy. There are no PR 6 websites. There is only a website whose homepage has a PageRank score of a 5 or a 6 or a 7, whatever it is. Site PR is not a particularly good metric, and it doesn't actually describe the site. Sometimes you'll find sites that have a Homepage PageRank of a 5, but internal pages that are a 6 or a 7. That happens quite frequently when there are important resources on those sites that get more linked to than the homepage.This number can be found in Google's toolbar, and there are lots of other toolbars that you can add in and many tools show it. The SEOmoz toolset doesn't show it. Some of you might know that Google asked us a couple years ago not to show PageRank in our web app or our toolbar anymore. So we took it out because we wanted to stay on good terms with those guys.The number of links that Google shows, this is via the link colon command, so link:www.SEOmoz.org will show a number of links that are not particularly interesting or accurate. It's usually a very small sub-sample. I think for SEOmoz they show maybe 1,500 or 1,800 links. Obviously, there are several hundred thousand, maybe millions of links pointing to SEOmoz.The reason that they do that is because they don't want to show all the link information that they've got. If you go inside Google Webmaster Tools, they will show you a more accurate, but still not wholly accurate, link count. But that will only be seen for your particular site that you've registered in Google Webmaster Tools. So do be aware of that.Yahoo! also shows the number of links. They show kind of two link numbers. One comes from Site Explorer, which may or may not be going away. We still haven't heard from Bing about what's happening with that. The other one is from the Yahoo! Web Index, which has gone away in a lot of places, but you can still find it in a few countries. For example, if you go to Yahoo! India, which I think is IN.Yahoo.com, you can still run link commands against that web index and see numbers of links. They don't exactly match up to the Site Explorer numbers, but it's okay. When you're using Site Explorer and the Yahoo! index, it's more about trying to find who's linking to this page, particularly if Open Site Explorer or Majestic is not showing that data. Yahoo! is often fresher and crawls more deeply than some of those other ones.Let's move into Majestic SEO. Before I get started, I just want to say, although they're a competitor, I have a lot of respect for these guys. They've done some great work. I am not intimately familiar, so I hope I'm going to describe them accurately. As far as I know, from talking to the guys over there, what I've got is pretty right, but someone can correct me in the comments if I'm wrong.Majestic does show, like SEOmoz, the number of links. That's just the raw number of pages that are linking to a particular site. That's not a key metric, though. The key metrics that they usually show right on top in the new Majestic explorer is, I think, number of external back links, which essentially says how many links come from sites that are not this site, not counting internal links.They also show referring domains, which is their word for linking root domains, I believe. I think that's root domains, not sub-domains, when you look at referring domains. They have numbers of unique IP addresses as well as number of Class C subnets. So, Class-C subnets correlates to Linking C-Blocks.Here's the tough part. When you look at these numbers, SEOmoz's numbers, Majestic's numbers, Yahoo!'s numbers, Google's numbers, they're all different. The reason is pretty obvious, because they all maintain different web indices. Majestic has an extremely large web index, much larger than Yahoo!'s or Linkscape's, but it's quite old. There is a lot of old data in there that hasn't necessarily been recrawled that might exist or might not. There's not a lot of canonicalization and de-duplication of content, which the search engines and Linkscape are relatively better at.Google and Yahoo!, obviously, have great web indices, but they expose much less data about them and a lot fewer metrics. SEOmoz has a smaller web index that's updated once a month, 40 billion or 50 billion pages, versus Google, Yahoo!, and Bing, which are probably in the 100 to 110, maybe 120 billion range. So when you're comparing these numbers, you're not always going to get good similarity between them.What you will find, though, is if you compare competitors or if you compare different websites with each other, so if I compare SEOmoz.org and Search Engine Land and SEO Book and Webmaster World, I should see that usually, in each of these cases, the link numbers are going to be higher for one of them and lower for another one within a certain percentage range. Those are the numbers that you want to pay some more attention to.Now you've got a really good background on all these link metrics, a ton of link metrics. Next week, we're going to talk about how to use and apply these link metrics in your link building outreach processes. Take care. See you later.Video transcription by SpeechPad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Which Link Metrics Should I Use? Part 1 of 2"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Which Link Metrics Should I Use? Part 1 of 2"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler"
}