{
  "url": "https://moz.com/blog/whiteboard-friday-sitewide-reciprocal-and-directory-links",
  "slug": "whiteboard-friday-sitewide-reciprocal-and-directory-links",
  "title": "Sitewide, Reciprocal, and Directory Links - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Link building sucks. You know it, I know it, everyone knows it. It can be slow, tedious, and exhausting. It's also one of the most crucial aspects of complete search engine optimization. So what do you do when faced with the intimidating challenge of building links? Once upon a time, you could've…",
  "content": "Whiteboard Friday - Sitewide, Reciprocal, and Directory Links By: Scott Willoughby May 20, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby May 20, 2010 Whiteboard Friday - Sitewide, Reciprocal, and Directory Links The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Link building sucks. You know it, I know it, everyone knows it. It can be slow, tedious, and exhausting. It's also one of the most crucial aspects of complete search engine optimization. So what do you do when faced with the intimidating challenge of building links? Once upon a time, you could've just submitted your site to a few hundred cheap directories (or a few thousand like so many of the $99 \"SEO\" shops offer), arrange for a few dozen reciprocal links from sites with decent PageRank, and maybe even negotiate a nice, keyword-targeted footer link from a reasonably popular blog. Bing-bang-boom, you've got several hundred good links with super-optimized anchor text...hellooooo rankings! Those of you who've been playing this game for a while are probably thinking, \"ahh, 2004, those were the days!\" Everyone else is either looking at the screen incredulously or laughing hysterically, \"this stuff doesn't work at all anymore!\" Oh really? Doesn't it? Sitewide, Reciprocal, and Directory links often have a bad rap because in the last several years they've largely become synonymous with cheap, spammy, dishonest, and largely useless scam SEO offers. But here's the catch: if you're careful, reasonable, and practical, these oft-maligned practices can still be effective. Don't go screaming black hat on me, watch this week's video to learn the how, when, and why of what can make these black sheep of the link building world viable tactics. As discussed in the video there are times when these strategies can be legitimate. Rand covered these in a lot of detail in our recent PRO Webinar on Advanced Competitive Link Building, so if you're a PRO Member, be sure to watch the recording. For now, let's look at some situations where these strategies can still work. Sitewide Links The early oughties (aka 2000's) were the like Studio 54 for sitewide links: shady links were snorting coke off of hookers in the dark recesses of footer navigation across the web. Then Google raided the joint looking for manipulative link patterns like the IRS looking for cooked books--the jig was up for footer and sidebar sitewide nav links. To this day you can occasionally stumble across a rogue footer containing a few links out to ridiculously unrelated content (one local theater here in Seattle has links out to branded baby care products), but by-and-large this practice is no longer used...except for when it is. Does Disney link to other sites in its content network? Does Lulu link to their SEOmoz and PC magazine awards? Does SEOmoz link to service partners like Distilled and Exact Target? Yes, they/we do and we do so in sitewide footers. These are legitimate and natural relationships. There's nothing strange or fishy here. In fact, if any of these links were paid, they'd be better off on one or two strong pages rather than on a sitewide navigational element. Basically, you should consider these bad if/when they seem unnatural and/or they're done alongside other shady stuff. Reciprocal Links First things first: within niche industries, natural reciprocal links are completely natural. In fact they're often difficult to avoid. Think about the SEO space; SEOmoz, SEOBook, Search Engine Land, Search Engine Journal, and all the others...we're constantly linking to each other, but do we ever call up Aaron or Loren or Matt and say, \"hey, I'll link to your page if you link back to mine with this exact anchor text\"? No, that'd be ridiculous. 'Reciprocal' becomes a four-letter word when it becomes clear that your site has an unusually high proportion of 1-to-1 links (you and other sites link to each other only once), often with suspiciously consistent anchor text. Those are the phenomena that start to look shady and draw attention. Directory Links Here's the litmus test for a directory: Do they care who you are? Good directories endeavor to actually create a high-value resource by exercising editorial control and restricting listings to sites and businesses that will be of value to their users. Bad directories endeavor to maximize the number of people willing to pay them money to be listed next to Der International Haus of Spamcakes because, hey, it's a PR3 link! It's really that simple. Directory links of the good variety can be really solid link sources (they're often niche or local), but the bad kind (of which you can probably find 20,000 for $99) ain't gonna do a damn bit of good for you. When it comes down to it, you simply need to use good judgement with your link efforts. Is this a link someone would not be surprised to find on this site and in this location? Is the link from a site you could or would legitimately link to in a blog post? Would your site or page be a good resource for someone visiting a particularly directory? What about the rest of the content and links, do they seem legitimate? A little honest evaluation and some common sense is really all you need to avoid engaging in bad linking practices. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Sitewide, Reciprocal, and Directory Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Sitewide, Reciprocal, and Directory Links"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}