{
  "url": "https://moz.com/blog/whiteboard-friday-welcome-to-the-jungle",
  "slug": "whiteboard-friday-welcome-to-the-jungle",
  "title": "Whiteboard Friday - Welcome to the Jungle - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week, along with the Whiteboard Friday video, I've also included a pair of informative and hopefully, entertaining, charts. The video discusses why some companies in more conservative sectors or with more traditional ideas about marketing and PR shy away from social media and blog engagement,…",
  "content": "Whiteboard Friday - Welcome to the Jungle Whiteboard Friday By: Rand Fishkin October 26, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 26, 2007 Whiteboard Friday - Welcome to the Jungle Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week, along with the Whiteboard Friday video, I've also included a pair of informative and hopefully, entertaining, charts. The video discusses why some companies in more conservative sectors or with more traditional ideas about marketing and PR shy away from social media and blog engagement, despite the many benefits those arenas can bring. It's a critique we hear not only from clients, but also at conferences and over the web, as SEO firms offering SMM find themselves pitching to un-receptive ears. In the video, I reference a study that Malcolm Gladwell covered on recognizing emotion through facial expression. It's a great read if you've got the time (he also covered it in his book, Blink). And below are the two charts - first, one that displays the relationship between tact and courage over various methods of communication: And, next, the chart showing the scatterplots of validity/accuracy of information online and offline: Obviously, there are exception to both of the rules presented by these charts, and I'm drawing very general conclusions. Quick note - tomorrow I'm leaving for SMX Stockholm with Mystery Guest. Hope to see many of you there - look for more contributions to the blog and Whiteboard Friday from other mozzers in my absence. p.s. For those who might not be familiar, the gentleman on the far extreme for Validity/Accuracy of Material is Edward R. Murrow. Awards for journalistic integrity and quality now carry his name. UPDATE: Scott left this comment below which I believe provides incredible insight about the value of this material: I agree in general with what Rand is saying in this video/post and always find the phenomenon quite spectacular as it's quite the opposite of what would 'make sense' in terms of communication (especially business/reputation related communication). People seem to have the least tact and the highest degree of bravado (attitude?) and confrontation in the least ephemeral media: email and comments/posts. If you communicate something controversial or offensive in face-to-face or phone conversation (wiretaps not withstanding) any recitation of your statements can be embellished, sure, but they also can't be proven or easily distributed. Electronic communication, on the other hand, provides an easily disseminable means to prove your statements as well as a permanent (possibly public) record of what you've said and your tact/style/attitude in how you've chosen to engage a conflict, question or other interaction. My point? This video points out something valuable not just for pitching clients. Be mindful of the persona you create through your own social media interactions. People who've never met you (but may, including clients) have no other basis on which to judge you and, in lieu of actions, your words can speak very loudly and be difficult to deny or retract. Do note that the graphs above are meant to illustrate an opinion (see our disclaimer), not show actual data or facts. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Welcome to the Jungle"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Welcome to the Jungle"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}