{
  "url": "https://moz.com/blog/whiteaboard-friday-architecture-for-commerce-with-dr-pete",
  "slug": "whiteaboard-friday-architecture-for-commerce-with-dr-pete",
  "title": "Whiteboard Friday - Architecture for Commerce with Dr. Pete - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Dr. Pete Meyers of UserEffect drops by the studio this week to teach us some incredibly valuable tactics for e-commerce site architecture.\n\nE-commerce folks know that once you get up to thousands (or even millions) of products, it can be difficult to make sure the bulk of your juice goes to ...",
  "content": "Whiteboard Friday - Architecture for Commerce with Dr. Pete By: Scott Willoughby July 30, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby July 30, 2009 Whiteboard Friday - Architecture for Commerce with Dr. Pete The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Dr. Pete Meyers of UserEffect drops by the studio this week to teach us some incredibly valuable tactics for e-commerce site architecture. E-commerce folks know that once you get up to thousands (or even millions) of products, it can be difficult to make sure the bulk of your juice goes to your most profitable products, while still getting long-tail traffic for the rest of your inventory. Pete shares some great tricks for large-site architecture that will help you focus your traffic and rankings on your top items, while maintaining visibility for your whole catalog. SEOmoz Whiteboard Friday - Architecture for Commerce with Dr. Pete from Scott Willoughby on Vimeo. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Architecture for Commerce with Dr. Pete"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Architecture for Commerce with Dr. Pete"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}