{
  "url": "https://moz.com/blog/whiteboard-friday-oh-i-got-a-penalty",
  "slug": "whiteboard-friday-oh-i-got-a-penalty",
  "title": "Oh $#!%, I Got a Search Engine Penalty - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Anyone who's been in internet marketing long knows the feeling: you go to check your rankings one day and something's different. Your pulse quickens, a cold sweat spreads across your brow, your eyes widen...they're gone. Your precious rankings are gone! Where did they go? What happened?\nPenalties.…",
  "content": "Whiteboard Friday - Oh $#!%, I Got a Penalty By: Scott Willoughby April 22, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby April 22, 2010 Whiteboard Friday - Oh $#!%, I Got a Penalty The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Anyone who's been in internet marketing long knows the feeling: you go to check your rankings one day and something's different. Your pulse quickens, a cold sweat spreads across your brow, your eyes widen...they're gone. Your precious rankings are gone! Where did they go? What happened? Penalties. They can bring the strongest of us to tears. But sometimes we can be too quick to blame a penalty on sudden changes in our rankings. There are lots of things that can cause fluctuations (even major ones) in the SERPs and it's importnat to know how to figure out why you've dropped. This week, we'll look at how to identify whether or not you've been penalized, as well as what to do if you have been smacked down by our Google-y overlords. Check out this week's Whiteboard Friday and next time you're struck with a moment of SERP Shock, you'll know how to handle it in a cool and strategic manner. If you want more information on penalties, here's a slide deck Rand presented at a recent conference.... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Oh $#!%, I Got a Penalty"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Oh $#!%, I Got a Penalty"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}