{
  "url": "https://moz.com/blog/whiteboard-friday-the-juice-is-loose",
  "slug": "whiteboard-friday-the-juice-is-loose",
  "title": "Whiteboard Friday - Controlling the Flow of PageRank & Link Juice - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week, as Scott heads off on vacation for Thanksgiving, I'm posting our latest Whiteboard Friday on the conecpt of links as votes of importance from the search engines' perspective and how link juice passes. Below the video itself, I've created a few helpful graphics to better illustrate the…",
  "content": "Whiteboard Friday - Controlling the Flow of PageRank & Link Juice Whiteboard Friday By: Rand Fishkin November 21, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 21, 2007 Whiteboard Friday - Controlling the Flow of PageRank & Link Juice Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week, as Scott heads off on vacation for Thanksgiving, I'm posting our latest Whiteboard Friday on the concept of links as votes of importance from the search engines' perspective and how link juice passes. Below the video itself, I've created a few helpful graphics to better illustrate the phenomenon I'm discussing: There are two big topics from the video that would benefit from additional explanation, and I think visual representation is probably the way to go (particularly since these are supposed to be for our more visual learners in the blog audience): How Links Pass Importance from one Page to Another: How Advanced SEOs Can Control the Flow of Link Juice: A word of warning - I don't say \"advanced\" lightly. We've had plenty of experiences where implementing what we thought was a smart nofollow strategy to control link juice has either backfired and cost us traffic or had little to no visible impact. The best way to implement strategies that rely on link flow control is, in my opinion, to start small, test, then refine and push out to the site as a whole. It's most effective in our experience on large domains with tens of thousands to millions of pages and lots of pages in \"supplemental.\" When used properly, link flow can help to get these into the main index. Also - since raw link juice (aka global link popularity, aka PageRank) is one of several hundred factors in the algorithms at the major engines, don't be surprised if this tactic has little impact on competitive rankings. We find it to be much more valuable and effective in pushing up the visibility of very long tail material. Hope everyone has a great Thanksgiving! We will most likely not have a blog post up between now and Cyber Monday, so please enjoy a few days off (or, you know, go check out all the cool stuff inside premium you've been neglecting to read). p.s. Note that the images I've created are not to scale and don't correspond to any given percentage or amount of link juice lost or passed. They're only meant to be representative of the basic link flow concepts. UPDATE FROM RAND: A bit of my logic in the images is in dispute in the comments, and we're asking Si to take a look at some math to help us figure it out. Basically, the strategy of sculpting link juice is still sound, but the idea of a \"leak\" of juice through adding additional links to a page may not be accurate (at least, according to the original Google PR formula). Many thanks to Hamlet Batista for bringing this up :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Controlling the Flow of PageRank & Link Juice"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Controlling the Flow of PageRank & Link Juice"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}