{
  "url": "https://moz.com/blog/whiteboard-friday-why-your-viral-content-isnt-working",
  "slug": "whiteboard-friday-why-your-viral-content-isnt-working",
  "title": "Whiteboard Friday - Why Your Viral Content Isn't Working - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Howdy, Gang, and happy 2008 to you all!  Here we are with our first Whiteboard Friday of the New Year and it's one that many viral marketers out there should pay close attention to.  This week, Rand discusses what it takes to make viral content and linkbait hit home with users in order to gain…",
  "content": "Whiteboard Friday - Why Your Viral Content Isn't Working By: Scott Willoughby January 3, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby January 3, 2008 Whiteboard Friday - Why Your Viral Content Isn't Working The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Howdy, Gang, and happy 2008 to you all! Here we are with our first Whiteboard Friday of the New Year and it's one that many viral marketers out there should pay close attention to. This week, Rand discusses what it takes to make viral content and linkbait hit home with users in order to gain links to boost your rankings, rather than just landing on the front pages of social media sites. All too often we can get caught up in the rush of hitting the homepage of big social media sites through our close-knit networks of spies, informants and Digg spammers, only to be less than impressed with the links that come out of these carefully crafted victories. Why? Well, sometimes the content just ain't link worthy. We, as marketers, know how to game these social promotion systems with the best of 'em. But what we also know, though often fail to keep in mind, is that the real value in hitting the homepage with viral content is the link volume we can get. Just remember, everybody stops to look at a crosswalk sign, but they won't tell their friends about it unless the little dude is break dancing. You can quote me on that...if you want. Most awkward analogy ever. Those of you with an eye to production value may notice things looking a little smoother, spiffier and...umm...soundier (?) this week. As Rand mentions in the video, we've got new mics, lights, cameras, action, and a biggity big-ass new whiteboard! Hopefully some smoother camera work and better audio will help increase your viewing pleasure. Note from Rand: I will try to finish a post on how to separate link-worthy content from visit-worthy, forgettable content for next week. Many thanks and kudos to Scott for putting together a significantly improved version of our Whiteboard Studios and upgrading the video and audio quality. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Why Your Viral Content Isn't Working"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Why Your Viral Content Isn't Working"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}