{
  "url": "https://moz.com/blog/whiteboard-friday-the-biggest-seo-mistakes-seomoz-has-ever-made",
  "slug": "whiteboard-friday-the-biggest-seo-mistakes-seomoz-has-ever-made",
  "title": "The Biggest SEO Mistakes SEOmoz Has Ever Made - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week's Whiteboard Friday features the return of Rand (woo hoo!) and his self declared biggest SEO mistakes. We screw up a lot here at SEOmoz (hell, they hired me), so we feel it is only appropriate to take this opportunity to share what we have learned in an effort to prevent you from making…",
  "content": "Whiteboard Friday - The Biggest SEO Mistakes SEOmoz Has Ever Made Whiteboard Friday By: Danny Dover July 15, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover July 15, 2010 Whiteboard Friday - The Biggest SEO Mistakes SEOmoz Has Ever Made Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week's Whiteboard Friday features the return of Rand (woo hoo!) and his self declared biggest SEO mistakes. We screw up a lot here at SEOmoz (hell, they hired me), so we feel it is only appropriate to take this opportunity to share what we have learned in an effort to prevent you from making similar mistakes. SEO is complicated. The best we can do is practice, work hard and compare notes. 1. Reciprocal Links + Robots.txt NoFollowBack before the formal SEOmoz days, Rand used to dabble a bit in some grayer areas of SEO. The first mistake he mentions is a tactic involving offering reciprocal links but blocking the outbound links via robots.txt/meta robots so that he could get all of the link value. This tactic didn't really work and he ended up having to do a lot more work to get in the good graces of the webmasters he had fooled. Head smack! 2. Buying Links for ClientsThis tactic also took place before formal SEOmoz days. At the time, Rand spent client budgets on paid links. This is a bad idea because the value of the links can't be determined (was Google even counting them?). He later found out through Google employees that the links were not being counted and that they may actually be hurting the client's site ability to rank. Oops! 3. Recommending People Use H1 Tags with KeywordsThis mistake is a little bit more subtle. For years, SEOmoz recommended including keywords in the H1 of pages. After we started doing formal machine learning correlation tests we found out that this tactic didn't actually help very much at all (including the keywords in normal text in bigger fonts worked essentially the same). This was a shame because it meant we wasted time and energy convincing our clients to update their H1s. 4. Recommending People Not To Use XML SitemapsWhen XML Sitemaps first debuted, Rand and SEOmoz recommended not using this. While the idea was sound in theory (having a XML Sitemap can make it difficult to spot information architecture problems) the observation ended up being outweighed by the impact we saw with the increased indexation rates of sites that employed this tool. 5. Incorrectly Redirecting Linkscape to Open Site ExplorerRecently we decided to 301 redirect all of the old Linkscape reports to our newer, better converting, Open Site Explorer reports in a 1-1 relationship. This was in theory a good idea but unfortunately including various tracking components on the redirect URLs resulted in us losing a significant amount of traffic. We later fixed this with rel=canonical but a lot of the damage was already done. Ouch! Do you have any lessons you have learned after making some noteworthy mistakes? If so, we would love to hear what you learned in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - The Biggest SEO Mistakes SEOmoz Has Ever Made"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - The Biggest SEO Mistakes SEOmoz Has Ever Made"
    },
    {
      "level": "H2",
      "text": "1. Reciprocal Links + Robots.txt NoFollow"
    },
    {
      "level": "H2",
      "text": "2. Buying Links for Clients"
    },
    {
      "level": "H2",
      "text": "3. Recommending People Use H1 Tags with Keywords"
    },
    {
      "level": "H2",
      "text": "4. Recommending People Not To Use XML Sitemaps"
    },
    {
      "level": "H2",
      "text": "5. Incorrectly Redirecting Linkscape to Open Site Explorer"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}