{
  "url": "https://moz.com/blog/whiteboard-friday-whatchu-talkin-bout",
  "slug": "whiteboard-friday-whatchu-talkin-bout",
  "title": "Whiteboard Friday - \"Whatchu Talkin Bout?\" - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey Gang,\n\nRand's back briefly to give a quick Whiteboard Friday lesson in reputation management. Following his directory smackdown a couple of weeks ago following the release of the Premium Link Directory, we caught some heat in the forums (albeit largely ...",
  "content": "Whiteboard Friday - \"Whatchu Talkin Bout?\" By: Scott Willoughby August 3, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby August 3, 2007 Whiteboard Friday - \"Whatchu Talkin Bout?\" The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hey Gang, Rand's back briefly to give a quick Whiteboard Friday lesson in reputation management. Following his directory smackdown a couple of weeks ago after the release of the Premium Link Directory, we caught some heat in the forums (albeit largely from disgruntled directory owners). Watch the video and get an idea of how we recommend dealing with these types of situations. Here are the sources mentioned in the video (fill in your brand/domain for the queries): Google, Yahoo!, MSN & Ask Google News & Yahoo! News Forums like Digitalpoint, Cre8asite, SearchEngineWatch, Sitepoint, WebProWorld & SEOChat Voting News sites like Digg, Reddit, Sphinn & Netscape Large UGC Communities like Google Groups, Yahoo! Answers & Wikipedia Google Blog Search & Technorati ONE MORE THING: Today is the LAST DAY to get the Early Bird Discount for the Premium SEO Training Seminar we're hosting on October 1st. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - \"Whatchu Talkin Bout?\""
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - \"Whatchu Talkin Bout?\""
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}