{
  "url": "https://moz.com/blog/whiteboard-on-googles-penguin-update",
  "slug": "whiteboard-on-googles-penguin-update",
  "title": "Whiteboard+ on Google's Penguin Update - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yesterday, I filmed some quick thoughts on Google's Penguin update. You can find the full video on our Google+ page:\n\n\t...",
  "content": "Whiteboard+ on Google's Penguin Update Search Engines By: Rand Fishkin May 8, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 8, 2012 Whiteboard+ on Google's Penguin Update Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Yesterday, I filmed some quick thoughts on Google's Penguin update. You can find the full video on our Google+ page: In it, I cover a few unique items about Penguin: It's (weirdly) not focused on improving search quality It appears to affect some of the worst spam (but not all) and some very light forms of spam/manipulation (oddly) Not tied to on-page or on-site necessarily, though outlinks may be looked at and several other updates occurred at similar times (making it tough to reverse engineer what might have caused a penalty) Appears to affect a disproportionate number of web service industry sites (though that could be correlation, not causation) Not yet clear if this a rolling update (though there are signs it may be) Left a lot of very strange, \"empty\" types of results in many of the spammiest verticals/SERPs I wanted to crosspost about it here so those asking for my opinions about Penguin could check it out. Look forward to some great discussion on G+ (or here in the comments). Oh, and if you haven't encircled SEOmoz on Google+... You totally should! We've got another WB+ video coming out very soon :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard+ on Google's Penguin Update"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard+ on Google's Penguin Update"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}