{
  "url": "https://moz.com/blog/whiteboard-friday-outsourcing-content-creation",
  "slug": "whiteboard-friday-outsourcing-content-creation",
  "title": "Outsourcing Content Creation for SEO - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " This week on Whiteboard Friday, Rand Fishkin describes the methods he recommends for outsourcing content creation. Content is extremely important for SEO and users alike so these best practices are important for those of us without the luxury of an in-house staff of copywriters.\nVIDEO\n...",
  "content": "Whiteboard Friday - Outsourcing Content Creation Whiteboard Friday By: Danny Dover July 29, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover July 29, 2010 Whiteboard Friday - Outsourcing Content Creation Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week on Whiteboard Friday, Rand Fishkin describes the methods he recommends for outsourcing content creation. Content is extremely important for SEO and users alike so these best practices are important for those of us without the luxury of an in-house staff of copywriters. Rand starts this presentation by setting context with his favorite SEO diagram. You can read more about the SEO Pyramid here. Step 1: Requirements Gathering Decide what you are trying to accomplish. Are you doing this for sales? SEO? Engagement? Traffic? Brand awareness? Be clear and write down what you want to accomplish along with the metrics you will use to measure them. Step 2: Locating Potential Resources You have plenty of options for finding potential resources. You can go offshore, in-house or hire web contractors. For web contractors, you can use the traditional services like Craigslist, Upwork, Guru or tap into the world of writing communities and long tail bloggers. These last two recommendations while not as established can many times provide superior quality writing with lower budgets. Step 3: Research Writing Quality & Voice Match In order to do this, we highly recommend you set up a voice document (a written record of how you would like to sound in your company's written communications and promotions). Give this to the writer before getting a sample and use this as the yardstick after they submit their first sample. This will help you gauge if this person is a good fit for your organization. Step 4: Scale, Evaluate, Track Now that you have established a process, you need to put checks into place to make sure the writer is hitting their targets. Look back at the goals you created in the first step and use them to track and improve upon the related metrics. Remember, from both an SEO and from a human perspective, writing is about quality over quantity. Having one great article that engages readers and earns links far outweighs 100 poorly written articles. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Outsourcing Content Creation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Outsourcing Content Creation"
    },
    {
      "level": "H2",
      "text": "Step 1: Requirements Gathering"
    },
    {
      "level": "H2",
      "text": "Step 2: Locating Potential Resources"
    },
    {
      "level": "H2",
      "text": "Step 3: Research Writing Quality & Voice Match"
    },
    {
      "level": "H2",
      "text": "Step 4: Scale, Evaluate, Track"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}