{
  "url": "https://moz.com/blog/whiteboard-takeover-branded-seo-for-page-1-domination",
  "slug": "whiteboard-takeover-branded-seo-for-page-1-domination",
  "title": "Whiteboard Takeover - Branded SEO for Page 1 Domination - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Koozai team are taking over the SEOmoz Whiteboard today with Mike Essex and Samantha Stratton presenting on effective techniques for controlling branded term searches. So if you want to stop negative press, counterfeit goods and bad reviews appearing for your product or brand name searches we…",
  "content": "Whiteboard Takeover - Branded SEO for Page 1 Domination Branding S By: Samantha Noble October 21, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! S By: Samantha Noble October 21, 2011 Whiteboard Takeover - Branded SEO for Page 1 Domination Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The Koozai team are taking over the SEOmoz Whiteboard today with Mike Essex and Samantha Stratton presenting on effective techniques for controlling branded term searches. So if you want to stop negative press, counterfeit goods and bad reviews appearing for your product or brand name searches we will show you how. So for more sales with Page One Domination, watch on: Video TranscriptionHowdy SEOmoz fans. Today's video is brought to you by the Koozai team, and we're taking over the SEOmoz whiteboard to show you how to make more money for brand term searches. Now, we're calling this presentation Page One Domination because that's effectively what it is. You want to dominate your brand when people search for it online in order to make more sales. You don't want people to see negative reviews, bad comments like, \"I hate this product.\" You don't want to see affiliates on there taking money or a cut off your sales, and you don't want to see counterfeit goods on there taking money away and misleading your customers. Bad PR, as well, if that's on there for your brand term search, you're going to damage customers' perception of your brand. Now typical SEO, we will optimise for short tail and long tail keywords to get people to our website initially, which works really well. But the problem is that if they've never heard of your website before, they're going to go back and research you by putting your brand in the search engine. What they see at that stage is a little bit out of your hands, or at least it's thought to be. But what we've seen is that by having strong profiles registered on other properties that are optimised for your brand terms, you can inject extra content into here to push these negative entries down. In this video, we're going to show you how to do that and how the top brands in the world do it as well. What we've done is research the top hundred companies to see how they have positive page ones. We've drawn up a list of ten different strategies that you can use that I'm going to go through now in order. At the bottom we've got videos. Now these are really at the bottom of the list because they're used less frequently, not necessarily because they aren't as good as what is to come next. There is definitely a time investment here, but videos are fantastic for when the search engines want to show multimedia content and results. When people search for your brand, Google doesn't just want to show them text links. In fact, for any search now Google wants to show a nice mixture of content. So if you can have a video entry in here, it will make your brand look more interesting for the people searching for you, and it's better content for the search engines to show. Videos are absolutely worth doing, and it doesn't just have to be a boring corporate advert. You can also show people using your product to help demonstrate the effectiveness of it, or you can have fun videos as well, educational videos about what you do or that help your industry niche. Videos are the first step. Then we've got industry profiles. Industry directories would be a great example of this or local directories as well for people searching in your local area. Registering them as well allows you to have a nice bit of corporate information about your brand that you control as well. So they're nice, safe profiles that brand well. Then we've got voucher websites. Now people always want a bargain. It doesn't matter what the product is or how cheap it is or how expensive it is, if I can find a website that will save me money, I'm always going to search for brand name plus vouchers in the search results. What you want to do is make sure that it's your website that appears for that type of search. If you register your brand name plus the word vouchers, that's a good way to be there every time. Also, you can give vouchers away to other voucher websites that are out there in the industry. So see where your competitors have got them or just see extra voucher websites that rank well for the term \"vouchers.\" If you don't feel that you want to give people any money off your product, the voucher could literally just be free postage and packaging or a 30-day trial. Something that you probably offer already could just be repackaged as a voucher. Then we've got niche websites. These are things like bloggers talking about your product. Your typical blogger engagement here is to go out and find the bloggers who are talking about people and things in your niche, then give them your product to review. Give them your information about your product as well so they can post it on their sites. Keep them informed in what you're doing, and the more times they reference your brand, the more chance they've got of appearing in this set of results for your products. Next up we've got social profiles. We've got Twitter, we've got Facebook and there's LinkedIn. I've grouped them all together here because it seems to be a little bit random what Google will show. The nice thing about social profiles is you control the content. Also, if people search for your brand and they see a social profile with a company that's engaging with their customers and it's got a lot of fans, that helps build trust in the research stage and will help them come back to your website to make that all important sale. Then we've got our customers. We mentioned earlier that customers can actually be a bad thing. Customers can write bad things about you and they can damage your brand. They can also write good things about you as well. They're the type of entries that we want to seek out. We want to search for our brand name, find people who are saying nice things about us, and then optimise those profiles so they rank higher, and that's what Sam is going to show you in the next step of this video. Number four, we've got financial information. This is something I rarely see companies doing, but which is really, really effective, which is why it's so high. If you're a limited company or you've been trading for a while you've already got publicly available financial information, so just provide it to the likes of The Financial Times and other financial websites to track things like share prices and company profits. It'll rank well, and also if your company is performing well, that will help add extra customer confidence when they search for you. News is another one which can be bad for you, but which can be good as well. One thing I always recommend is to always have a press release in reserve that is positive. Write up a press release that isn't time- specific, that could go out any time of year or maybe even in a years' time. Then if someone publishes a bad piece of news about you, you just submit your good piece of news through PR services. It gets picked up over the Internet, and then because it's fresher than the other news stories, a lot of the time it will outrank them straightaway and you can push that bad news down before it's even been read. Number two, we've got Wikipedia. If you search for most one-word, two-word generic phrases, a Wikipedia page is what will appear. This is the same concept. It's a very generic term even though it's a brand name. So Wikipedia entries appear almost all the time when you search for big brands. They are hard to get, but it's really worth trying to get one, asking people to create one for you, adding citations, maybe even doing things for charity so your company seems a bit more worthwhile to appear on Wikipedia will help. Fundamentally, it's the second most important step on here. So try, try, try to get a Wikipedia page whenever you can. The number one tip, register more domains. I really can't emphasise the importance of this one. We've seen exact-matched domains rank really well for generic terms, and they also rank really well for brand. Why do you think your brand website appears and ranks so well? It's because of the exact match relevance of the term. So buy extra domains with your brand name in there and a little bit of extra information. We talked earlier about brand name vouchers. That would be a fantastic example of something to register and put here. But you could also just take a section off your website, put it on another domain, and just link to it from your main website. That's got a very high chance, the number one chance in fact, of ranking on here for your brand name searches. Whatever you do don't copy content off your website. Either pull content and paste it over here or write entirely new content, but don't have two identical sections, because you could get your main website penalised, which really isn't what we're trying to do. These are the steps that I recommend you take. Register these profiles, and the next step that we need to do is to optimise them so that they start to appear in the SERPs, because this isn't enough in isolation. What I'm going to do now is hand you over to Samantha Stratton, who has been instrumental in a lot of these projects here at Koozai, and she'll run you through just that. Samantha Stratton Howdy SEOmoz fans. Thanks for the introduction Mike. What I want to talk to you about now is what you can do to gain domination for your branded searches so that if your potential customers or clients or suppliers are doing a bit of research about your brand, they're going to come across all these nice, positive things for you. There are six points to gaining domination. I'm going to talk through the first four points here, and then I'm going to move over to this part of the whiteboard where I'm going to show you exactly what you need to be doing to gain that domination. First up is research. This is probably one of the most important stages of this process. You need to start researching your branded searches as well as your, say two, three, four competitors that you want to look at. By doing this you're going to be looking at pages one to three of Google, so putting in your brand and then also doing exactly the same thing for your competition, and start making a list of all of those positive mentions that you've already got and also do exactly the same thing for your competitors. What you'll end up with is a spreadsheet of URLs that you're seeing already ranked for your branded searches and those that your competitors are also ranking for. From this, your profiles that you've uncovered that are positive, you need to go through all of them and update them with unique, compelling content, talking about your brands, talking about what your brand offers as a company. You may even have mentions of all your employees, anything that is going to make that profile credible and more authoritative to highlight that as being something associated to your brand. You can include things like images, whether it's your company logo, images of your employees, shopfronts, services, any of the products that you own, any sort of events that you do with your company, any kind of images that you can get to give that page more authority, add those on there. You want to include a URL. So again, that's going to help you with your main SEO for your main site because you've got all these links coming back from various profiles into your main domain. But it's also going to allow anybody that finds these profiles, whether it's your potential customers or the search engines, it gives them another opportunity of a quick route back into your main domain. Finally, you want to go back to your competitor research and register any profiles that you haven't already got. This is where you're going to go through all your competitor listings and look at the ones you don't have, register them, and update them in the same way that you've done with your other profiles& before. Thirdly, Mike talked earlier about the importance of domains and how well they can rank. They're the top thing in all of the items that we've researched. So if you can get your hands on an additional domain, an exact match domain, these can really help you rank. Whether it's something like 'brand'jobs.com or 'brand'careers.com or 'brand'store.com, any type of permutation of your brand plus an additional domain there can help rank for your brand. The importance here is do not copy what you've done on your main site. They need to be standalone sites with unique content throughout them. Otherwise this is not going to work. Fourth on the list is you need to start creating unique content that you can use later on in the process to start link building through to these various profiles. You want to start writing articles. You want to start writing hubs lenses. If there are any press releases, any news is good news, whether you've got a new employee that started, any promotions, a new store opening. Any news that you can write about and you're happy to get out there in the public domain, get press releases written so that you've got stuff there ready to publish out on the Internet and build up these profiles. Now I want to talk to you about link building. What we now need to do if we move over to this area of the board is look at building up the authority of all of these different profiles that we've registered and updated. Back up here, we went out and we registered all of the different profiles and updated our existing ones. Now what we want to do is build the authority around them. We're going to use the content that we've written at stage four to go and build up these profiles. First take Wikipedia. So you've managed to get a Wikipedia page for your site. You might want to link to that from a press release that you've written, because obviously Wikipedia is a really good source of information and it's a very authoritative domain that's going to be talking about your own website. You might also have a hub page that's pointing through to here. The third thing you might want to do is use some of your social profiles. So you might have your Facebook page linking through to your Wikipedia page. So here we're using content and we're also using social to boost your Wikipedia profile. Now down here, your domain, if you've been able to secure a domain that's relevant and appropriate for your brand, you might link that from your press releases. You could have an article coming into that. You may also have directories. There are so many people out there that think oh, directories, boring, not very good, they're not going to work. But we have done a number of projects where we've only used directories to gain page one domination for a brand. Over here you've got your different social platforms. There are over 300 social platforms available. Any of those that you can get out there and register, you've got all these profiles then that have got the potential of getting onto page one for your brand. The beauty of social is that it's not uncommon to use social to link to social. Say this is your YouTube page that you've created for your brand. You can link to that from your Facebook page. You might also link to it from your Twitter account and any other social profiles that you've got. Again, you might also use your articles to drive links into here. You might even talk about using deep link directories in this instance. Here you've got your press releases. You might want to link to your press release from your own website. You've got some great news out there. So linking to that from your own site, as an authoritative site already, that can then drive additional links into your press release. Again, here you might have an article that you want to drive into it, and you might see it fit to link it from your Twitter account. Essentially, what we're doing here is rather than just focusing on SEO-ing to your main site, you're going to be SEO-ing your various other profiles that you've registered and all that nice content that you've got, and you're going to be link building to all of them and using all these different methods that we've spoken about here. Coming back over to point six, this is the final point, and this is by far the most important point if you're going to take anything away from this presentation here. You want to be talking about tracking. There is no point starting a project like this if you're not going to have the time or the resource to actually track it. Creating spreadsheets like we have at the start here at the research stage, you've got a list of all your profiles there. Then you can start to register and track what you're actually driving links into for each of the profiles. That's point number one. At the start of the project, the first thing that you should be doing is taking screen shots of pages one to three for your branded searches. Doing this on a weekly basis will allow you to benchmark against what you started off with, so seeing which profiles are moving quickly. Looking at this on a month-by-month basis you can then compare starting point to month one. If you do see certain profiles moving up the rankings a lot faster than others, these are the ones that you want to focus your priority on first because you're seeing the movement there and you know that the search engines are receptive to those profiles. Then, coming back, once you start seeing movement in those ones, you then start to go back over the profiles that you haven't seen as much movement in and start link building a bit more to those. Is there any way you can add some more content? Start then focusing on those profiles that you haven't seen the movement in. This is an ongoing sort of project here. You can't get to the end of month four and think, oh, done, I've got the whole page in page one domination because moving on from there other people can start to creep into that marketplace as well. Constantly looking at new ways of creating new profiles, creating unique content, and just getting the mentions out there for your brand is going to overall help you gain domination for your branded searches. If you do need any more information, please visit our website, which is Koozai.com, and thank you very much for your time. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Takeover - Branded SEO for Page 1 Domination"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Takeover - Branded SEO for Page 1 Domination"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Samantha Noble\n          \n            Samantha Noble\n          \n            Samantha Noble"
}