{
  "url": "https://moz.com/blog/whiteboard-friday-link-farming",
  "slug": "whiteboard-friday-link-farming",
  "title": "Why Link Farming is bad for SEO - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "\"Old McSpammer had a farm, e-i-e-i-oh,\nAnd on that farm he built some links, e-i-e-i-oh\n\nWith a backlink here, and a backlink there,\nHere a link, there a link,\nEverywhere a link, link...\"\n\nYou get the idea. Back in the day, building your own network of sites designed to link to each other and build…",
  "content": "Whiteboard Friday - Link Farming By: Scott Willoughby May 14, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby May 14, 2009 Whiteboard Friday - Link Farming The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. \"Old McSpammer had a farm, e-i-e-i-oh, And on that farm he built some links, e-i-e-i-oh With a backlink here, and a backlink there, Here a link, there a link, Everywhere a link, link...\" You get the idea. Back in the day, building your own network of sites designed to link to each other and build link popularity was an easy way to help boost your rankings. Nowadays though, link farming is an almost surefire way to get yourself into some big trouble with the engines. Watch this week's Whiteboard Friday to learn why link farming is a bad idea, and how the engines are so quick to identify it. SEOmoz Whiteboard Friday - Link Farming from Scott Willoughby on Vimeo. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Link Farming"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Link Farming"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}