{
  "url": "https://moz.com/blog/whiteboard-friday-correlation-causation-seo",
  "slug": "whiteboard-friday-correlation-causation-seo",
  "title": "Correlation, Causation & SEO - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week, Rand is joined by one of our in-house data geniuses, Ben Hendrickson, to talk more about some of our recently released correlation data to support guidelines for SEO best practices.\n\nWhile correlation doesn't always...",
  "content": "Whiteboard Friday - Correlation, Causation & SEO By: Scott Willoughby June 25, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby June 25, 2009 Whiteboard Friday - Correlation, Causation & SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week, Rand is joined by one of our in-house data geniuses, Ben Hendrickson, to talk more about some of our recently released correlation data to support guidelines for SEO best practices. While correlation doesn't always equal causation, it's still very interesting to look at the attributes and features high ranking sites tend to have in common. Comparing this data to known and accepted SEO practices can help to reinforce widely held notions or give us some insight into how the algorithms are changing; both important areas of analysis for successful online marketers. SEOmoz Whiteboard Friday - Correlation, Causation & SEO from Scott Willoughby on Vimeo. Want to learn even more about what Ben discovered in our data correlation analysis? He'll be presenting his detailed findings at our SEO Training Series Seminar right here in Seattle, August 24th & 25th. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Correlation, Causation & SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Correlation, Causation & SEO"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}