{
  "url": "https://moz.com/blog/whiteboard-mondaysmx-west-interviews-will-critchlow-on-ranking-foreign-domains",
  "slug": "whiteboard-mondaysmx-west-interviews-will-critchlow-on-ranking-foreign-domains",
  "title": "Whiteboard Monday-SMX West Interviews: Will Critchlow on Ranking Foreign Domains - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As promised, here's the first in our series of Whiteboard X-day videos direct from the floor of SMX West.  Our first victim is our good friend and extremely active SEOmoz member, Will Critchlow of Distilled.  Will and his business partner, Duncan Morris, came in from London for SMX West and it was…",
  "content": "Whiteboard Monday-SMX West Interviews: Will Critchlow on Ranking Foreign Domains By: Scott Willoughby March 3, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby March 3, 2008 Whiteboard Monday-SMX West Interviews: Will Critchlow on Ranking Foreign Domains The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As promised, here's the first in our series of Whiteboard X-day videos direct from the floor of SMX West. Our first victim is our good friend and extremely active SEOmoz member, Will Critchlow of Distilled. Will and his business partner, Duncan Morris, came in from London for SMX West and it was great to see them both. As a London-based firm, they have a number of international clients and the ranking discrepancy between .com rankings and those for country-specific TLDs (.co.uk, .ca, .fr, etc) can be dreadfully inconsistent and more than a little frustrating. In this video Will and Rand discuss what causes these differences, how to work around them, and what the engines might try and do to help correct them. Enjoy! Tomorrow's guest for Whiteboard Tuesday: ShoeMoney himself, Jeremy Shoemaker! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Monday-SMX West Interviews: Will Critchlow on Ranking Foreign Domains"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Monday-SMX West Interviews: Will Critchlow on Ranking Foreign Domains"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}