{
  "url": "https://moz.com/blog/whiteboard-friday-movin-on",
  "slug": "whiteboard-friday-movin-on",
  "title": "Whiteboard Friday - Movin' On - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week, Rand talks about moving websites.  Aside from the usual 301'ing of urls, there are a few more steps one should take to make sure that all of their SEO efforts aren't lost when the move is made.\n\nMOVIE HERE\n\n Notes\n\n    My Whiteboard Friday on 301'i...",
  "content": "Whiteboard Friday - Movin' On Whiteboard Friday J By: Jeff Pollard September 27, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! J By: Jeff Pollard September 27, 2007 Whiteboard Friday - Movin' On Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week, Rand talks about moving websites. Aside from the usual 301'ing of URLs, there are a few more steps one should take to make sure that all of their SEO efforts aren't lost when the move is made. Video notes and extras My Whiteboard Friday on 301'ing Still picture of the white board Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Movin' On"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Movin' On"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jeff Pollard\n          \n            Jeff Pollard"
}