{
  "url": "https://moz.com/blog/whiteboard-friday-keyword-strategies-kill-the-head-or-chase-the-tail",
  "slug": "whiteboard-friday-keyword-strategies-kill-the-head-or-chase-the-tail",
  "title": "Keyword Strategies: Kill the Head or Chase the Tail - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's always debate: should you focus on your big head terms, or those wide-ranging tail terms? We've invited one of our best mozMates, Will Critchlow of Distilled, to join us for a look at how to balance your keyword strategy.",
  "content": "Whiteboard Friday - Keyword Strategies: Kill the Head or Chase the Tail By: Scott Willoughby January 7, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby January 7, 2010 Whiteboard Friday - Keyword Strategies: Kill the Head or Chase the Tail The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There's always debate: when conducting your keyword research, should your strategies focus on your big head terms, or those wide-ranging tail terms? We've invited one of our best mozMates, Will Critchlow of Distilled, to join us for a look at how to balance your keyword strategy. A major factor in designing your strategy needs to be analytics data. As Will discusses, many people find that analytics show most of their conversions coming from branded keyphrases, but this doesn't adequately reflect the search path people are following before they make a latent conversion. In the video Rand and Will discuss how to take this into account and make sure you're targeting the best phrases for your business and your audience.Will is currently stuck at the airport trying to get home to the snowed-in United Kingdom, so the post he references in the video isn't available yet. In the mean time, you can view his slide deck from the \"Analytics Every SEO Should Know\" presentation he gave at the SEOmoz London Seminar this winter. Slides 23 and 24 show a little bit about first-touch and multi-touch search analytics. Keep an eye here, or on the Distilled blog for his post about doing first-touch analysis in Google Analytics. Will's post is up! Check it out: How To Get Past Last-Touch Attribution With Google Analytics Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Keyword Strategies: Kill the Head or Chase the Tail"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Keyword Strategies: Kill the Head or Chase the Tail"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}