{
  "url": "https://moz.com/blog/whiteboard-friday-embedded-content-linking",
  "slug": "whiteboard-friday-embedded-content-linking",
  "title": "Whiteboard Friday - Embedded Content & Linking - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week's Whiteboard Friday comes to you courtesy of a few friends from the Twitterverse. We had Lindsay put out a call for WBF ideas and, among the suggestions, a few of our followers asked for tips on linking strategies and embedded content, so here we are, thanks to...\n\n@mattlambert\n@khu...",
  "content": "Whiteboard Friday - Embedded Content & Linking By: Scott Willoughby May 21, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby May 21, 2009 Whiteboard Friday - Embedded Content & Linking The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week's Whiteboard Friday comes to you courtesy of a few friends from the Twitterverse. We had Lindsay put out a call for WBF ideas via the @SEOmoz Twitter account and, among the suggestions, a few of our followers asked for tips on linking strategies and embedded content, so here we are, thanks to @mattlambert, @khughesrise and @seoaudiore (thanks, too, to everyone else who tweeted suggestions - we'll try to follow up on many of those in the weeks to come, too). Creating embeddable content like widgets, badges, or videos can be a fantastic link-building strategy for many reasons. In this video we'll cover some of the big benefits to embed-based linking, as well as some of the challenges you may face in trying to get your embeddable content out there. SEOmoz Whiteboard Friday - Embedded Content & Linking from Scott Willoughby on Vimeo. Rand references several embedded content worth looking at, including this set from Twitter, Vimeo's strategy (which you can see in the video above itself) and Zillow's real estate widgets. Oh yeah, since we mentioned Twitter, I was stuck at 299 followers yesterday, so if you'd like to join the 'Help Get Scott Over 300' campaign, follow me @great_scott. Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Embedded Content & Linking"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Embedded Content & Linking"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}