{
  "url": "https://moz.com/blog/whiteboard-friday-googles-may-day-update-what-it-means-for-you",
  "slug": "whiteboard-friday-googles-may-day-update-what-it-means-for-you",
  "title": "Google's May Day Update & What It Means to SEO - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "May Day, Roodmas, Walpurgis Night, Beltane...a time for dancing around the maypole, enjoying the bounties of Spring, reminising on the battle for worker's rights, and lots of other fun things. But for many a search marketer, May 1st (ish) o fthis year will be  remembered as the day the long tail…",
  "content": "Whiteboard Friday - Google's May Day Update & What It Means for You By: Scott Willoughby May 13, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby May 13, 2010 Whiteboard Friday - Google's May Day Update & What It Means for You The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. May Day, Roodmas, Walpurgis Night, Beltane...regardless of the name, it's a time for dancing around the maypole, enjoying the bounties of Spring, recalling the battle for worker's rights, and lots of other fun things. But for many a search marketer, May 1st (ish) of this year will be remembered as the day the long tail died (bye-bye Misses High ROI...apologies to Don McLean). Old-Timey Folks Gettin' Their Maypole On Okay, okay, maybe that's a bit of a stretch, but the search world (including Search Engine Roundtable and Webmaster World) definitely did notice the effects of Google's so-called \"May Day Update\". Sure, Google makes minor algo tweaks like this all the time, but around April 28th-May 3rd a lot of sites (SEOmoz included) noticed a sudden loss of 5-15% of their normal long tail traffic. Watch this week's video to learn more about what may have happened, and what you should do about it, or continue reading below for a summary. What happened here? Why did you (or someone you love) lose their precious long tail search referrals? There are a lot of theories out there: Google reduced the size and depth of the primary index to keep Caffeine fast; there was broad link devaluation; there was a shift in how phrase match is performed; increased bias was given to authority/brand sites; etc. Some, all, or none of these may be true, the important thing is DON'T PANIC! If you saw a drop in traffic, you need to figure out why...don't start blindly changing things lest you care to break what may not be broken. How do you know if you were affected? Well, start by checking your search referral traffic between April 28th and May 3rd; do you see a drop? If so, is the change in the number of referrals, or the number of pages getting traffic? A drop in traffic to your big terms isn't likely May Day, but a drop in pages getting search referrals (long tail traffic) could be. If you monitor rankings for a handful of obscure tail terms (which you should do specifically for this reason), did your rankings suddenly plummet? Did your indexation or crawl stats change suddenly (you can use Webmaster Tools, site: searches, etc. to check)? These could indicate you were hit by the update. What to do? Run! Hide! Grab your anti-zombie defensive shotgun that you keep on-hand at all times in case of a Zombie Apocalypse! Just kidding; that would be bad. First, look at your links and give yourself a quality check: have you been a little shady lately? If so, maybe you should spend some effort getting a few high-quality links to spruce up the place (Spring cleaning, natch). Can you spare a bit of link juice from a strong page to give those weaker, but targeted long tail pages a little boost? It might help. Again, most importantly of all, don't panic...the engines make little changes to the algos all the time. Google made more than 500 changes last year--more than one per day--and 99% of the time you won't even notice. Even if May Day did impact your site, it could change back next week, so take a deep breath and try to relax. Keep practicing high-quality, fundamental SEO and you'll be okay. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Google's May Day Update & What It Means for You"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Google's May Day Update & What It Means for You"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}