{
  "url": "https://moz.com/blog/whiteboard-friday-whos-house-moz-house#jtc30981",
  "slug": "whiteboard-friday-whos-house-moz-house",
  "title": "Whiteboard Friday - \"Whose House? Moz House!\" - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey Gang,\n\nThis week Rand's out of town so I'm taking over Whiteboard Friday duties. That's right, in my front-of-camera debut I (Scott) will walk you through the process we use to deal with copyright infringement. That is, what do you do when you find your original material illegally redistributed…",
  "content": "Whiteboard Friday - \"Whose House? Moz House!\" By: Scott Willoughby July 27, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby July 27, 2007 Whiteboard Friday - \"Whose House? Moz House!\" The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hey Gang, This week Rand's out of town so I'm taking over Whiteboard Friday duties. That's right, in my front-of-camera debut I (Scott) will walk you through the process we use to deal with copyright infringement. That is, what do you do when you find your original material illegally redistributed on another site? It's a little more business-side and a little less search-side, but I'm bettin' that enough of you have had problems with this that it'll be somewhat useful. I also have the honor of officially announcing the SEOmoz Premium SEO Training Seminar we're presenting October 1st, in Seattle! We're very excited as this is the first live event of this type we've put on. We've got a great program set-up and expect a fantastic turnout (oh yeah, there'll be a party too). Check it out and come join us. As a special bonus (because I have complete and total control of Whiteboard Friday this week), stick around after the credits and I'll take you on a quick, whirlwind tour of the MozPlex, as so many have asked for. Since the Whiteboard's a little difficult to see in this video, here are the four steps I discussed along with links to some sample letters: Send a friendly e-mail to the site owner/manager asking them to remove the copyrighted material. ...wait a few days, if you don't get a response, proceed to... Send a formal Cease & Desist letter to the site owner/manager dictating a strict deadline for removal of the copyrighted material and informing them you will contact their host if they don't comply. ...wait until the indicated deadline, if there's still no response, proceed to... Send a DMCA Violation Removal Request to Google, requesting removal of the offending links from the index. ...AND... Send a DMCA Violation Removal Request to the site's host. Under DMCA, they're required to shut down the offending site if you've followed the above steps and received no compliance. The letter to the host can be substantially the same as the letter to Google, they serve the same function. While I hope this advice and these letter templates are helpful, I do need to remind you once again that the above material is not, and should not be construed as, professional legal advice. Feel free to use the linked-to template documents, but realize that you do so at your own risk. I hope you've found this info helpful or, at least, entertaining. If there are other business or development related topics you'd like us to cover in future episodes or blog posts, let us know...we aim to please. Cheers, Scott Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - \"Whose House? Moz House!\""
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - \"Whose House? Moz House!\""
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}