{
  "url": "https://moz.com/blog/whiteboard-friday-wikiwikiwiki-whack",
  "slug": "whiteboard-friday-wikiwikiwiki-whack",
  "title": "Whiteboard Friday - \"Wiki-Wiki-Wiki WHACK!\" - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey Gang,\n\nThis week, Rand's got some insight for you into a down-and-dirty, nasty little trick Mert Sehinoglu clued us into.  I can see you all drooling right now...wipe it up.  Okay, okay. What if we told you there was a way to bump just about any competitor from the top two positions on Google? …",
  "content": "Whiteboard Friday - \"Wiki-Wiki-Wiki WHACK!\" By: Scott Willoughby August 16, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby August 16, 2007 Whiteboard Friday - \"Wiki-Wiki-Wiki WHACK!\" The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hey Gang, This week, Rand's got some insight for you into a down-and-dirty, nasty little trick Mert Sahinoglu clued us into. I can see you all drooling right now...wipe it up. Okay, okay. What if we told you there was a way to bump just about any competitor from the top two positions on Google? Bollocks, you say? It's true, my dear readers, all you have to do is game Wikipedia through a little process we like to call Wiki-Jacking... FYI - Of note this week is a major instance of social media poisoning at Reddit - Someone is trying to tarnish the name of xkcd.com artist. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - \"Wiki-Wiki-Wiki WHACK!\""
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - \"Wiki-Wiki-Wiki WHACK!\""
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}