{
  "url": "https://moz.com/blog/whiteboard-friday-ignore-the-tail-at-your-peril",
  "slug": "whiteboard-friday-ignore-the-tail-at-your-peril",
  "title": "Ignore the Long Tail at Your Own Peril! - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You do all kinds of keyword research trying to find the highest-volume terms around your niche. You work and work to move one place at a time up the rankings for those competitive terms, and you still don't see the traffic increase you're hoping for. Why?\n\nYou're ignoring the long tail! All of…",
  "content": "Whiteboard Friday - Ignore the Long Tail at Your Own Peril! By: Scott Willoughby September 10, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby September 10, 2009 Whiteboard Friday - Ignore the Long Tail at Your Own Peril! The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. You do all kinds of keyword research trying to find the highest-volume terms around your niche. You work and work to move one place at a time up the rankings for those competitive terms, and you still don't see the traffic increase you're hoping for. Why? You're ignoring the long tail! All of those strange and unique searches people do when looking for your specific products or content! While each of these terms may only have 1-10 searches per month, add them all together and they could represent up to 75% of your search traffic. Watch this video and learn why the long tail deserves your attention and can make a huge impact in your traffic. SEOmoz Whiteboard Friday - Ignore the Tail at Your Peril! from Scott Willoughby on Vimeo. p.s. from Rand: Props to Kristen Acker of Zillow for the \"Fat Head\" and \"Chunky Middle\" naming conventions - thanks Kristen! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Ignore the Long Tail at Your Own Peril!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Ignore the Long Tail at Your Own Peril!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}