{
  "url": "https://moz.com/blog/white-hat-seo-world-championship-how-to-capitalize-seomoz-part-2",
  "slug": "white-hat-seo-world-championship-how-to-capitalize-seomoz-part-2",
  "title": "White Hat SEO World Championship - How to capitalize SEOmoz Part 2 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was surfing the web and I found one of those \"SEO World Championship\" launched by a European Internet Marketing company, Eastpoint. The tournament is starting on January 15th 2007 and I had a funny idea. I haven't spoken with Rand about this yet (i.e. Rand: what do you think of thi...",
  "content": "White Hat SEO World Championship - How to capitalize SEOmoz Part 2 Link Building E By: Ella_D December 10, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: Ella_D December 10, 2006 White Hat SEO World Championship - How to capitalize SEOmoz Part 2 Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I was surfing the web and I found one of those \"SEO World Championship\" launched by a European Internet Marketing company, Eastpoint. The tournament is starting on January 15th 2007 and I had a funny idea. I haven't spoken with Rand about this yet (i.e. Rand: what do you think of this?), but I think we could do something interesting, challenging and potentially rewarding here for all of us, the SEOmoz community.We could probably do a quick sign-up form here for any registered user of SEOmoz who would be willing to participate. Here's the plan (and sorry to anyone who thinks this is silly!): -As SEOmoz community, combine our white hat efforts of linkbuilding and linkbaiting to win the challenge-Share some of the efforts/tactics we will implement to win this tournament-Since we will win something, we give away the prize to a charity cause. Here are the prizes 1st prize: Citroen C22nd prize: A caribbean cruise3rd prize: A plasma TV4th prize: 500$5th prize: 100$Are you ALL IN? P.S. One good idea so far: Give the prize away to a charity cause! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "White Hat SEO World Championship - How to capitalize SEOmoz Part 2"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "White Hat SEO World Championship - How to capitalize SEOmoz Part 2"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ella_D\n          \n            Ella_D"
}