{
  "url": "https://moz.com/blog/whiteboard-friday-which-way-did-he-go",
  "slug": "whiteboard-friday-which-way-did-he-go",
  "title": "Whiteboard Friday - \"Which Way Did He Go?\" - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey Gang,\n\nWhiteboard Friday time again and, since Rand is once again out of town, I've enlisted yet another Mozzer to take his place. This week, developer extraordinaire, Jeff Pollard takes us on a brief tutorial of the wild and crazy world of 301 redirects.  We get a lot of questions about how…",
  "content": "Whiteboard Friday - \"Which Way Did He Go?\" By: Scott Willoughby August 9, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby August 9, 2007 Whiteboard Friday - \"Which Way Did He Go?\" The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hey Gang, Whiteboard Friday time again and, since Rand is once again out of town, I've enlisted yet another Mozzer to take his place. This week, developer extraordinaire, Jeff Pollard, takes us on a brief tutorial of the wild and crazy world of 301 redirects. We get a lot of questions about how and when to use these tremendously valuable little buggers, so we thought it's be a good idea to put some info out there for the masses. Enjoy the video and look below the fold for links to some great resources on 301's courtesy of Jeff. Here is Matt's article on applying 301s: Here is an article on how to 301 in a bunch of different languages Webmaster World thread to do a 301 in IIS Apache manual for \"Redirect\" directive Apache manual for \"RedirectMatch\" directive Note from Jeff: In the video I mentioned that you can use regular expressions to match for a redirect. I neglected to mention that they only work for RedirectMatch and not Redirect. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - \"Which Way Did He Go?\""
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - \"Which Way Did He Go?\""
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}