{
  "url": "https://moz.com/blog/whiteboard-friday-lives-new-webmaster-tools-more-with-nathan-buggia",
  "slug": "whiteboard-friday-lives-new-webmaster-tools-more-with-nathan-buggia",
  "title": "Whiteboard Friday - Live's New Webmaster Tools and More with Nathan Buggia - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What a day! It's our first Whiteboard Friday interview from our new Whiteboard Studios at Mozplex 2.0 (or the Mozoleum as our guest suggest). Who do we have? None other than our good friend and MSN Live Webmaster Center honcho, Nathan Buggia.\n\nAs many of you know, Live just rele...",
  "content": "Whiteboard Friday - Live's New Webmaster Tools and More with Nathan Buggia By: Scott Willoughby August 8, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby August 8, 2008 Whiteboard Friday - Live's New Webmaster Tools and More with Nathan Buggia The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. UPDATE: Sorry for getting this up so late in the day, gang. There were some technical issues with getting the video uploaded in a timely manner. -Scott What a day! It's our first Whiteboard Friday interview from our new Whiteboard Studios at Mozplex 2.0 (or the Mozoleum as our guest suggests). Who do we have? None other than our good friend and MSN Live Webmaster Center honcho, Nathan Buggia. As many of you know, Live just released a whole bunch of cool new features for Webmaster Center. Nathan and Rand discuss how these features can help webmasters, a tease of some things we can expect from Live WMC in the future, and a little bit of the how and why of what makes Live tick. Nathan also offers up his feelings on the blogging-about-black-hat subject that's been coming up lately: He makes some very compelling arguments about why dissemination of black (or even gray) hat tactics can be troubling for both the engines and webmasters. This interview is a bit lengthy (~20 minutes) but it's full of good stuff and definitely worth viewing. SEOmoz Whiteboard Friday - Live's New Webmaster Tools & More with Nathan Buggia from Scott Willoughby on Vimeo. And because Rand is so diligent about providing you, dear Readers, with lots of cool information, here's a bunch of useful stuff he wanted to include because he loves you. A Look at Some of Live Webmaster Tools' Latest Features: I do want to add to Scott's impression that there is really worthwhile material in the interview. Nathan is far more open than some of his search engine representative counterparts and it makes for a really valuable, informational chat. I know 20 minutes is a long time to invest; hopefully you can find some time over the weekend. As Scott said, here's a rundown of some of the features Live's now offering in their Webmaster Tools. The concept of a \"domain score\" is fascinating. As SEOs, we've long suspected that the engines didn't just use page-level metrics, but domain-level metrics as well, and this is one of the first public confirmations we've seen of that nature (though, as I noted to Danny during our talk on WM Radio last week, plenty of Googlers have suggested the idea that certain domains carry more authority and importance than others, too). Above is the standard list of links Live shows. You can download the first thousand in CSV format, and while they're not ordered by \"importance\" per se, they do tend to show more important links before less important ones (much like Yahoo! Site Explorer). This is where the really cool features start. Just as you can do a command like linkdomain:seomoz.org site:.gov at Yahoo!, you can now filter your links by subdomain, domain or subfolder in Live's Webmaster Tools. You can use the same spiffy filters on outbound links - for which Live is currently the only source of information (and also provides some data on this via their linkfromdomain command in the engine). Overall, I'm impressed with the new offerings - with this release, I suspect Live is moving towards a more \"essential\" toolset for search marketers, and I hope that, as Nathan noted, it continues to drive the engine to improve its performance and its market share. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Live's New Webmaster Tools and More with Nathan Buggia"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Live's New Webmaster Tools and More with Nathan Buggia"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}