{
  "url": "https://moz.com/blog/whiteboard-friday-10-things-i-heart-about-you",
  "slug": "whiteboard-friday-10-things-i-heart-about-you",
  "title": "Whiteboard Friday - \"10 Things I Heart About You\" - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week Rand talks about...well...nothing, he's in China. Rebecca Kelley takes over for a sublimely light-hearted Whiteboard Friday in which the rest of the Moz crew show that we can most certainly bring the noise to match anyone's funk.",
  "content": "Whiteboard Friday - \"10 Things I Heart About You\" By: Scott Willoughby May 17, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby May 17, 2007 Whiteboard Friday - \"10 Things I Heart About You\" The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week Rand talks about...well...nothing, he's in China. Rebecca Kelley takes over for a sublimely light-hearted Whiteboard Friday in which the rest of the Moz crew show that we can most certainly bring the noise to match anyone's funk. This installment is...umm...well, it's ridiculous folks. We don't want you all thinking too hard all the time, so happy Friday, and forgive us our occasional (alright, frequent) moments of levity. It's just started getting sunny here in Seattle (good for all of you SMX attendees) so we can't be held responsible for our actions. Blame it on an overload of Vitamin D.Cheers!Also available on YouTube. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - \"10 Things I Heart About You\""
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - \"10 Things I Heart About You\""
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}