{
  "url": "https://moz.com/blog/whiteboard-friday-facebooks-open-graph-wont-replace-google",
  "slug": "whiteboard-friday-facebooks-open-graph-wont-replace-google",
  "title": "Facebook's Open Graph WON'T Replace Google - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Earlier this week Facebook announced its 'Open Graph' at F8. There was all sorts of hubbub (much of it the bye-product of well-orchestrated buzz) about Facebook finally making strides to kill Google's dominance of the web.  So should you hangup your white hat, your black hat, your grey hat, and…",
  "content": "Whiteboard Friday - Facebook's Open Graph WON'T Replace Google By: Scott Willoughby April 29, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby April 29, 2010 Whiteboard Friday - Facebook's Open Graph WON'T Replace Google The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Earlier this week Facebook announced its 'Open Graph' at F8. There was all sorts of hubbub (much of it the bye-product of well-orchestrated buzz) about Facebook finally making strides to kill Google's dominance of the web. So should you hangup your white hat, your black hat, your grey hat, and trade it all in for a blue hat? Much as we love Facebook, the answer, dear reader, is no: SEO is not dead. Watch this week's video to hear Rand's take on how Facebook's 'Open Graph' will impact web marketing and all the ways it won't. There are all sorts of opportunities that will likely emerge out of this new technology, so you should pay attention. So go ahead and keep an eye out for a nice fitting blue hat in the near future, but don't plan to throw away your white hat anytime soon. The sticker we received Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Facebook's Open Graph WON'T Replace Google"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Facebook's Open Graph WON'T Replace Google"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}