{
  "url": "https://moz.com/blog/whiteboard-friday-article-marketing-submission-for-seo",
  "slug": "whiteboard-friday-article-marketing-submission-for-seo",
  "title": "Article Marketing + Submission for SEO | Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Content, content, content...everybody wants it, everybody needs it, and you're great at creating it, but maybe nobody's reading it. Since that brainy brain of yours is already pumping this stuff out, how can you leverage your great content to get some quick and easy links?\n...",
  "content": "Article Marketing + Submission for SEO | Whiteboard Friday By: Scott Willoughby June 3, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby June 3, 2010 Article Marketing + Submission for SEO | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Content, content, content...everybody wants it, everybody needs it, and you're great at creating it, but maybe nobody's reading it. Since that brainy brain of yours is already pumping this stuff out, how can you leverage your great content to get some quick and easy links? \"How 'bout this for a story: 'Man with giant baby head considers gubernatorial bid'?\" There are all kinds of ways to distribute your content: article submission sites, one-off submissions, self-publication...on and on. As with everything else, there are trade-offs to each dissemination vector and that's what we're talking about this week: What are the pros and cons of using article/content marketing as an SEO strategy? Where and how can you identify potential partners to get the highest quality links for your content? When is it better to let someone else publish your work? Are links the best arbiter of value? The answers to all these questions and more await you in this week's Whiteboard Friday... Yes, content creation is a lot of work. It takes time, effort, and creativity to generate high-quality content, and that's why it's in such high demand. While you may hate to send your precious baby off to live on someone else's blog, it may be what's best for the child (and you). Sure, you won't get as many links as you may have by self-publishing, but if you're selective about the site, you'll get one or two very good links, but wait, there's more... By publishing on a larger, more visible site than your own, your content could be seen by many more people. This makes it an excellent branding strategy. The reputation effect of an author byline on a popular piece on a well-read site can pay huge dividends in reputation, traffic, and business if you select the right partners. Do you need to publish somewhere directly in-line with your niche? No. Look for sites with relevant readership--SEO content creators may want to look to email marketing, web design, or ecommerce focused publishers for instance--that will have an interest in your topic but may not have as much exposure to it as they would like. This can quickly help establish you as an authority among a valuable audience segment, and once you're their authority, they'll seek you out for more content and advice. p.s. Someone in the comments pointed us to this Guest Blogging Community Portal from Ann Smarty. I haven't tried it yet, but I think she's certainly on the right path with that approach. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Article Marketing + Submission for SEO | Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Article Marketing + Submission for SEO | Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}