{
  "url": "https://moz.com/blog/whiteboard-friday-the-microsite-mistake",
  "slug": "whiteboard-friday-the-microsite-mistake",
  "title": "The Microsite Mistake and SEO - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week we'll look at an all too common misconception: the idea that building out a microsite to target a particular keyword, and then using that site's strength to link to your primary site is a worthwhile strategy.\n\nIn the video Rand discusses issues such as link pop, domain diversity, and…",
  "content": "Whiteboard Friday - The Microsite Mistake By: Scott Willoughby January 22, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby January 22, 2009 Whiteboard Friday - The Microsite Mistake The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week we'll look at an all too common misconception: the idea that building out a microsite to target a particular keyword, and then using that site's strength to link to your primary site is a worthwhile strategy. In the video Rand discusses issues such as link pop, domain diversity, and strategy while looking at how and why microsites are frequently used ineffectively. SEOmoz Whiteboard Friday - The Microsite Mistake from Scott Willoughby on Vimeo. UPDATE FROM RAND: I've written a bit more about this topic here - Root Domains, Subdomains vs. Subfolders & The Microsite Debate Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - The Microsite Mistake"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - The Microsite Mistake"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}