{
  "url": "https://moz.com/blog/whiteboard-friday-buckets-buckets-of-keywords",
  "slug": "whiteboard-friday-buckets-buckets-of-keywords",
  "title": "Whiteboard Friday - Buckets and Buckets of Keywords - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week Rand's invented a new word: \"bucketizing\".  What the heck does this mean, yous ask?  It's the process of putting keyword groups into different buckets--segmenting them, if you will--by different factors such as traffic volume, intent, conversion rate, etc.  Rand describes the process in…",
  "content": "Whiteboard Friday - Buckets and Buckets of Keywords By: Scott Willoughby February 19, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby February 19, 2009 Whiteboard Friday - Buckets and Buckets of Keywords The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week Rand's invented a new word: \"bucketizing.\" What the heck does this mean, you ask? It's the process of putting keyword groups into different buckets--segmenting them, if you will--by different factors such as traffic volume, intent, conversion rate, etc. Rand describes the process in more detail in the video, but this is a valuable way to organize your gigantic keyword lists into manageable groups to help you prioritize and manage your efforts. SEOmoz Whiteboard Friday - Buckets & Buckets of Keywords from Scott Willoughby on Vimeo. p.s. (from Rand): I don't think I invented the word or first applied it to SEO, actually, but thanks, Scott! :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Buckets and Buckets of Keywords"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Buckets and Buckets of Keywords"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}