{
  "url": "https://moz.com/blog/whiteboard-friday-twitter-as-an-seo-research-tool",
  "slug": "whiteboard-friday-twitter-as-an-seo-research-tool",
  "title": "Twitter as an SEO Research Tool - SEO Tools - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sure, you use Twitter as a social media tool, but have you ever considered it as an SEO research tool? No? Well watch and learn this week to find out how you can harness it in a whole new way.\n\nNow that social signals (particularly Twitter) are becoming more important in the engines, they can help…",
  "content": "Whiteboard Friday - Twitter as an SEO Research Tool By: Scott Willoughby March 4, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Willoughby March 4, 2010 Whiteboard Friday - Twitter as an SEO Research Tool The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Sure, you use Twitter as a social media tool, but have you ever considered it as an SEO research tool? No? Well watch and learn this week to find out how you can harness it in a whole new way. Now that social signals (particularly Twitter) are becoming more important in the engines, they can help you pinpoint when a keyword is going to trip the 'Query Deserves Freshness' switch. If you can figure that out, you can gain a big competitive advantage by publishing fresh content in a targeted, timely manner. Rand mentions a couple of tools for using Twitter to target and time your content. One is Trendistic, which helps you see trends in Twitter; another is our very own Blogscape Social Media Monitoring prototype (inside PRO Labs), which monitors and analyzes a few million key content providers across the fresh web, including over 250,000 influential Twitter accounts. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Twitter as an SEO Research Tool"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday - Twitter as an SEO Research Tool"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Willoughby\n          \n            Scott Willoughby"
}