{
  "url": "https://moz.com/blog/who-loves-ya-baby",
  "slug": "who-loves-ya-baby",
  "title": "Who Loves Ya, Baby? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently, the Food Network posted its list of the most popular recipes of 2007. As I perused it (I’m a little bit of a Food Network junkie), I was struck by the fact that most of the top ten recipes were, for lack of a better phrase, \"comfort food\".  Indeed, the top two were variations on macaroni…",
  "content": "Who Loves Ya, Baby? Online Advertising L By: Lori Bourne January 23, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! L By: Lori Bourne January 23, 2008 Who Loves Ya, Baby? Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Recently, the Food Network posted its list of the most popular recipes of 2007. As I perused it (I’m a little bit of a Food Network junkie), I was struck by the fact that most of the top ten recipes were, for lack of a better phrase, \"comfort food.\" Indeed, the top two were variations on macaroni & cheese, and six of the top ten recipes were from Paula Deen, a southern lady whose down-home cooking is described on her website as having \"that taste of home cooking that takes you back to mama's kitchen!” Clearly, Food Network viewers have decided that they love Ms. Deen and her simple-but-delicious classics. When I started watching the Food Network about eight years ago, it was a gathering place for food snobs. The average recipe was along the lines of, oh, Quail Egg Ravoli with Ricotta and Yak Butter. While I'm sure that's delicious (well, maybe), it's not what people are looking for when it's 5:00 and the kids are hungry. If I were the Food Network CEO, I’d be working hard at putting together a few more \"down-home, comfort food\" style shows for next season. This got me to thinking: do we choose our audience, or do they choose us? We may know what kind of audience we'd like to attract, but it's rarely that simple. In some cases, whole groups of people that we never intended to address may show up anyway. This can be good or bad, but knowing who likes us is important if we're going to capitalize on it. I don't think the Food Network set out to be the recipe hub for comfort food, but that's clearly what people are wanting, and they'd be savvy to take advantage of it. When I started my blog over a year ago, I assumed that most of my readers would be Montessori teachers. After all, that's who comprises the majority of my customers. I've blogged about a wide variety of topics that encompass education and child development, but in recent months I've had to accept the fact that most of my blog audience (the active part, anyway) consists of homeschooling moms like me. The salient point of that last sentence is \"like me.\" I'm blogging about topics that interest me as a homeschooling mom, so it's really not a surprise that homeschooling moms would enjoy reading my blog. I know I still get other kinds of traffic, but fellow homeschoolers are the ones who link to me, blog about me, and leave the majority of comments at my blog. It's made me more aware of the topics I've been choosing to blog about, and I've made an effort recently to include some that are specifically for teachers rather than just homeschoolers. I'm trying to have a nice balance of posts rather than leaning too much in one direction or the other. SEOmoz is a great example of a blog that posts on a wide variety of topics. They have enough talented bloggers that they can do that, but not everyone is in that position. Many people find more success when they narrow their focus and blog really well about a few topics rather than poorly about many. Those of us who run small businesses (where we're either the sole owner or one of a few employees) could put ourselves in an early grave trying to appeal to everyone. With limits on the amount of content we can generate, it's even more important to know who we're writing to so we can provide the best possible experience for our visitors. The recent Whiteboard Friday with Ian Lurie on Creating Marketing Personas demonstrates this perfectly. How you present yourself online determines the kinds of people who will respond to you. What I got from that video was this: you can’t try and reach everyone, but you can try to reach someone, and in doing so, you’ll reach others too. If you only watched the video but didn’t read Ian’s 4-part series on Personas, I recommend you do it even if you're not sure you want to use personas in your search marketing efforts. There's a ton of great info there. How do you find out who your audience is? There are lots of ways, from surveys to polls to asking for info during registration or newsletter sign-up. You can also rely on anecdotal data like blog comments and looking at who links to you (and what they say about you). Rand recently mentioned that SEOmoz is going to launch a survey, and I'm interested to see the types of questions they pose as they try to learn more about all of us. I am certainly not an expert in the area of \"knowing your audience\"; actually, I would say I'm just a beginner. This post isn’t about trying to teach anyone anything, but rather to be thought-provoking and idea-generating. The ancient Greeks may have admonished each other to \"Know thyself\"; online, however, \"Know thy audience\" is definitely the way to go. A few links I found helpful: A Successful Viral Campaign Relies on Knowing Your Audience from Jennifer Laycock at Search Engine Guide Know Your Audience and Establish a Voice from Todd Malicoat (Stuntdubl) Are You Really Writing for Your Blog Audience? from Lorelle VanFossen at the Blog Herald Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Who Loves Ya, Baby?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Who Loves Ya, Baby?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Lori Bourne\n          \n            Lori Bourne"
}