{
  "url": "https://moz.com/blog/whose-afraid-of-rss-feeds-me",
  "slug": "whose-afraid-of-rss-feeds-me",
  "title": "Who's Afraid of RSS Feeds? Me.... - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I am afraid this post is unlikely to be informative.  More a plea for action.  I have been looking at setting up an RSS feed on our site.  I am wrestling with having a feed that publishes new product pages as they appear or one that maybe feeds information on product maintenance and care, or maybe…",
  "content": "Who's Afraid of RSS Feeds? Me.... Link Building J By: Julian de Bosdari September 23, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: Julian de Bosdari September 23, 2008 Who's Afraid of RSS Feeds? Me.... Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I am afraid this post is unlikely to be informative. More a plea for action. I have been looking at setting up an RSS feed on our site. I am wrestling with having a feed that publishes new product pages as they appear or one that maybe feeds information on product maintenance and care, or maybe one on product related trivia (coming from our blog with a different URL), or maybe a combination of all three. In my trawling around SEOmoz and the rest of the internet I have found that although there is a great deal of material, none of it seems particularly well organised, or even UP TO DATE. Is it perhaps time for an SEOmoz HQ post or maybe a Whiteboard Friday on RSS feeds? How should one best set up a feed? Maximise it for building backlinks? Make it easy to maintain? Publicize it? Are RSS (RSSes?) best kept to one theme, or are they attractive because they are broad spectrum? The questions go on. If other Mozzers think this is a valid topic, maybe you would like to contibute or join in on the request? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Who's Afraid of RSS Feeds?  Me...."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Who's Afraid of RSS Feeds?  Me...."
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Julian de Bosdari\n          \n            Julian de Bosdari"
}