{
  "url": "https://moz.com/blog/whos-ready-to-get-googley",
  "slug": "whos-ready-to-get-googley",
  "title": "Who's Ready to Get Googley? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In my new book, Everything I Know about Marketing I Learned from Google, I share 20 \"Googley Lessons\" that the Big G can teach marketers to help them better engage customers and prospects.\n\nOver the past 10 days I've \"appeared\" at 30 blogs as part of a \n...",
  "content": "Who's Ready to Get Googley? Marketing Industry By: AaronGoldman September 10, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: AaronGoldman September 10, 2010 Who's Ready to Get Googley? Marketing Industry This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In my new book, Everything I Know about Marketing I Learned from Google, I share 20 \"Googley Lessons\" that the Big G can teach marketers to help them better engage customers and prospects. Over the past 10 days I've \"appeared\" at 30 blogs as part of a blog tour promoting my book. It's just one way I've been practicing what I preach in chapter 5, \"Be Where Your Audience Is.\" From a Google standpoint, you don't have to go to Google.com to search. You can Google something from other sites via Google syndication or toolbar. You can Google from your desktop. You can Google from your phone, etc. In order to generate more queries, and, of course, revenue, Google make its brand and product accessible wherever anyone with an internet connection is. So, too, must marketers break their brands up into assets that can be distributed into channels where their audiences are -- social media, blogs, even offline environments. My book was written for marketers. So, I've tried to be everywhere marketers are. Rather than make everyone interact with me and my book in a bookstore or at GoogleyLessons.com, I've distributed myself via Twitter, Facebook, YouTube, my digital marketing blog, MediaPost, and every stop on this blog tour. The content for my blog tour has been a mix of guest posts, Q&A, and videos. Just like I'd recommend any marketer to customize their message for the unique audience and environment, I've tired to do the same with my blog tour appearances. Today, for SEOMoz, I've created a custom video that keeps with the Whiteboard Friday theme. I've even included a dramatic reading from my book featuring an excerpt of an interview with SEOMoz CEO, Rand Fishkin. And, as with all the other videos, I close with a freestyle rap. This one begins with a little Hava Nagila action in honor of the Jewish New Year. Please enjoy and, remember, whenever you need marketing inspiration, get Googley! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Who's Ready to Get Googley?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Who's Ready to Get Googley?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "AaronGoldman\n          \n            AaronGoldman"
}