{
  "url": "https://moz.com/blog/why-cctlds-should-not-be-an-automatic-choice-for-international-websites",
  "slug": "why-cctlds-should-not-be-an-automatic-choice-for-international-websites",
  "title": "Why ccTLDs Should Not Be an Automatic Choice for International Websites - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When it comes to the creating the best domain structure for international websites, the information is frequently cloudy and varied, and most authorities recommend using ccTLDs. Is that really beneficial, though? Liam Curley is here to clear things up.",
  "content": "Why ccTLDs Should Not Be an Automatic Choice for International Websites International SEO By: Liam Curley June 23, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Liam Curley June 23, 2015 Why ccTLDs Should Not Be an Automatic Choice for International Websites International SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There are many articles on domain structure for international sites. Many, if not all, recommend the use of ccTLDs due to the geo signals they send to Google; but I’ve read very few articles that substantiate this type of claim with any research or evidence. Is this recommendation outdated? With every passing year, Google gets better at reading and setting geo signals. By introducing hreflang and improving Google Webmaster Tools (recently rebranded as Google Search Console) with regards to setting target countries, it’s so much easier to get geo signals right than it was a few years ago. With the recent changes Google has been making, I am left questioning whether or not we really need ccTLDs to target other countries. Do they have a positive impact on rankings? If they don’t, why would you use them? If you can set geo signals via webmaster tools or hreflang tags, is it better to consolidate your link equity with one domain and separate everything with subfolders? I wanted to look at the market data concerning ccTLDs and their performance on different international versions of Google. I wanted to know whether ccTLDs demonstrated any tendency of outranking sites with gTLDs (as defined here) that had a greater DA or PA. If ccTLDs did demonstrate this trait, then perhaps there is merit in selecting them over subfolder structure. If not, and the ranking of websites on SERPs shows the general trend of order by DA/PA, then surely there is no reason to structure an international website with a ccTLD and the best option is to consolidate all links on one site and geo target the subfolders. I understand that there is more to this decision if we take into account the user's preference to interact with local domain websites. We'll touch on that point later. For now, I just want to focus on how Google seems to treat ccTLDs. The SERP ResearchThe hypothesisccTLDs don’t supersede PA as a ranking signal. I believed that if I gathered a decent sample size, the general trend would show that ccTLDs didn’t tend to outrank sites with a gTLD and higher PA. Local link ratio doesn’t correlate with high rankings. Rand’s research suggests local links have a positive impact on a sites ranking on local search engines. Does the ratio of local links correlate with a higher ranking? If they do, then this could lead us to believe that a consolidation of local links on a local ccTLD would support successful international SEO. If there is no correlation, then this would further support that there is little ranking benefit with this regard to using a ccTLD, as we can receive local links to a gTLD. A local IP address doesn’t improve rankings. There still seems to be some opinion in the community that hosting a site on a local IP address will help rankings on local versions of Google. MethodologyI wanted to gather data for competitive terms from several competitive markets. The first task was determining which markets to select. I made a decision based on the markets that have the highest B2C spend per digital consumer. I initially picked out the top 10, then selected five from those based on which sites I was able to work with (linguistically). The markets selected were: U.S., U.K., Canada, Australia, and Italy. Next, I selected the keyword categories that I would use to analyze SERPs. I picked out the sectors based on the biggest digital B2C market sectors in the U.S.. From the top 10, I selected five: clothes, toys and games, computer and consumer electronics, furniture and home furnishings, and auto parts. Then, I decided to identify 10 keywords for each category in each market. Keywords were selected by inputting a broad keyword into AdWords for each category (say, \"game\"), filtering by search volume, and selecting the highest search entries that had an average AdWords suggested bid of higher than £0.05 which would provide terms that had high search volume and commercial relevance. This was done for each category in each market. I collated data from the top 10 pages ranking for each SERP, giving me a total of 2,500 web pages to analyze. Searches were conducted for each keyword on the local version of Google (e.g., google.it) using the SEO Global Chrome extension from RedFly Marketing, allowing me to see the search results for a local user. Analysis of dataOnce the keywords were selected for each market, I collected the following data from each SERP: Ranking position URL Domain structure Domain authority Page authority Page title IP address location Local link ratio From this information, I would also collect the following on each web page entry on the SERP: Is there an exact keyword match in the domain? Is there a partial keyword match in the domain? Is the exact keyword used in the URL? Is a broad keyword used in the page title? Is an exact keyword used in the page title? Each entry was given a yes or no for the questions above, which would allow me to compare domain performances on a like for like basis with regards some of the basic on-page SEO elements. Once this data was collected, I started to identify the following: Whether the ccTLD was outranking a gTLD that had a higher PA Whether the ccTLD was outranking a gTLD that had a higher PA, where both the ccTLD and gTLD in question had matching on-page SEO implementation for the keyword in question Research limitationsLet’s start with the obligatory \"correlation does not equal causation.\" Nothing discovered in this research will definitively prove or disprove ranking factors for international SEO. However, I believe that this kind of research does throw up interesting data, and any SEO trends and correlations discovered through this type of research can set us on our own path to research further and look for more concrete signals to prove or disprove these results. I had a decision to make regards whether to measure ccTLD ranking over TLDs with a higher PA or a higher DA. I decided to go with PA. Predominantly because I’m looking at the ranking performance of a page, not a website. DA has a direct impact on PA, but if we measured performance against DA, I think we’d be less likely to get a true picture (e.g., blogs on subdomains, and small sites with a keyword in the domain ranking with their home page). The resources available for this research (i.e., me) meant there was a limit to the volume of SERPs and web pages analyzed. My limited linguistic skills meant I couldn’t analyze SERPs from a broader language base (e.g., Nordic and Japanese), and I could only collect data from the top 10 rankings for each SERP. Also, ideally the data would have been drawn from the SERPs over one day. I collected the data manually. (I could have set up a crawl, but at the time I didn’t have the knowledge available to do that.) So, it was taken over the course of around six weeks. Finally, I mentioned that I compare the rank of pages based on like for like on-page SEO. Due to time restraints, I was limited to a handful of what I deemed to be key on-page SEO signals. Therefore, it’s open to debate as to whether the signals I selected are the key signals for on-page SEO. The results DiscussionccTLDs are not outranking gTLDs. Graphs 1 and 2 demonstrate that the majority of ccTLDs are not outranking gTLDs that have a higher PA. Graph 1 shows that 46% of ccTLDs reviewed outrank a gTLD with a higher PA. However, when we only count \"outranking\" to occur when both the ccTLD and the gTLD have the same basic on-page SEO (e.g., keyword in title, URL and/or domain), we see that the percentage of ccTLDs outranking gTLDs falls to 24 percent.This information doesn’t definitively tell us whether or not a local ccTLD is a ranking factor in national SERPs, but it does indicate that it’s probably not a signal that generally outweighs PA. That being the case, from a purely SEO perspective (not considering online consumer psychology), a subfolder must be the best domain structure for the majority of international sites. Unless you or your client is a major brand with a large budget, the resources required to launch several ccTLDs and build enough authority for each to make them visible in their respective search engines makes a ccTLD an unwise selection. A Local IP address doesn’t pack a punch. Again, this research can’t definitively determine whether an IP address does or doesn’t provide ranking signals for national SERPs, but Graph 5 suggests that if it does, the signals are weak. Of the 474 ccTLDs with a local IP address, only 19 percent were outranking a gTLD with a higher PA. This figure suggests that an IP address has little direct impact on rankings, even when combined with a local ccTLD. That said, it's worth checking out this article on IP host location from Richard Baxter, which presents a different finding.A Local link ratio has no relationship with high local rankings. While Rand’s research indicates local links have an impact on local search results, a local link ratio doesn’t have a relationship with high rankings. There doesn’t appear to be a benefit of setting up a ccTLD to gain local links for an international market. Local links can be earned for any domain and any structure, whether ccTLD or subfolder.Implications for international SEOIt is difficult to make an accurate, broad statement on best practice for international SEO. Every market is likely to be slightly different with regards the way that users interact with content, as well as the way that search engines crawl and rank web pages. You also have to take into account that if you’re working with a client on SEO for different international markets, goals and resources will vary. Toys \"R\" Us does very well in the SERPs we analyzed with a ccTLD structure, but then they have the resources available to support multiple domains and earn local authority and PR for each domain. The research looked at SERPs for five countries and 2,500 web pages. The results for each country did vary, and while analyzing 500 web pages for each country doesn’t represent a sufficient sample size to make a sound opinion on each, it does lead me to believe that the choice of whether to use a ccTLD or a gTLD for an international market could vary depending on the market in question. More information is available here on the data collected from each country. To summarize, here are the findings: I’ve omitted the U.S. from the second table, as there were only two web pages with a ccTLD from the 500 analyzed. That confirms what many of us would have suspected or known: ccTLDs aren’t widely used in the U.S. With hindsight, it probably would have been more interesting to swap the U.S. with a different country for analysis.The information above suggests that maybe there is some variation in how sites rank in different international search engines. It’s also interesting to note that ccTLDs are more popular in some markets than other, which could have an impact on the user relationship and interaction with a website depending on it’s domain structure. Consumer psychology and ccTLDsLet’s put aside what I’d consider to be some of the ranking implications behind a choice of domain structure. There’s another consideration to be made when it comes to selecting a domain structure for an international site: Does a local domain have a positive impact on consumer psychology and the choice of buying or browsing on one site over another? As with the SEO argument for a ccTLD, there are plenty of articles and research that suggest consumers prefer to shop on an eCommerce site with a local domain rather than a generic domain (U.S. excluded). Eli Schwartz recently wrote an article summarizing research he’d conducted on the searcher perception of ccTLDs . The post provided some really interesting results. However, I didn’t necessarily agree with the approach taken with one of the questions put to respondents regarding eCommerce and the impact of ccTLDs on purchase decisions. In the study, Eli asked each respondent this: “Of the links below, which is most likely to offer the most reliable express shipping to your home?” The respondent was then asked to select either a website with a .com domain, or one with a local ccTLD. The results are interesting, but if we’re looking for insight into eCommerce buying decisions, I think it’s a bit of a leading question. If you ask the respondent a question like this, and give them the choice of a local domain or a generic domain, they’re likely to answer yes to the ccTLD. However, I don’t believe that this indicates that the ccTLD is used as an aid to make a purchase decision. It tells us if you strip all other buying aids from the process, boil it down to the choice between one domain and another, the respondent selects the local domain. Real-life buying decisions don’t work like this. Following on from my research on international rankings, I wanted to try and create a real life test environment where respondents pick one website over another to purchase a product. Test 1 – Impact of domain structure when a consumer is browsing an ecommerce store Using CrowdFlower and UsabilityHub, I created a test for U.K.-based respondents. First, the respondent was presented with the following information: “You're looking to purchase a new laptop. You've done your research and found the make and model that you'd like to buy. You find this laptop on two eCommerce websites. Based on the page your about to view, which site would you buy the laptop from?” The respondent was then presented with the following two eCommerce sites: Both sell the same laptop with the same specification, same price, same delivery and same returns offer. The key difference between the two is that one is hosted on a .com domain and one is on a .co.uk. The design and layout for each is different, but I’ve attempted to create a real-life situation, and you’d never be choosing between two eCommerce stores with the same design. Two hundred sixty-two respondents participated in the Dabs vs. Laptops Direct selection, and 174 of these respondents provided feedback on why they made their decision. The results are as follows: As you can see, none of the respondents selected either website due to the domain structure of the store. Choices were predominantly made on a preference for less ads or clutter, product information, usability, or branding. It seems clear to me that when the consumer is browsing an eCommerce site, the domain structure plays no part in their purchase decision. Although not tested here, localization indicators such as language, currency, delivery, and returns policy will arguably dictate whether or not you stand a chance of winning their business rather than the domain. Test 2 – Impact of domain structure when consumer is browsing the SERPsAfter I’d reviewed consumer decision-making while on the webpage, I wanted to see if ccTLDs were a genuine factor in consumer psychology on a SERP when the user is making their browsing decision. In the next test, U.K. respondents were presented with the following text: “You're looking to find an eCommerce site that sells car parts. You go to Google and search for 'car parts'. You see the following results page. Which website would you click on first?” The respondent was presented with a SERP for car parts, making sure that one ccTLD of four websites (the third organic result) was available in the organic results. As you can see, the second organic result, a gTLD, contains U.K. within the domain:The following heat map shows the websites selected by the respondents: The 200 respondents were then asked to give a reason for their selection. The results are as follows: It does seem that a ccTLD can play a part in the browsing selection for a portion of the audience. Eleven percent of the respondents indicate they made their selection because the website was based in the U.K., although they don’t specify how they made that assumption (i.e., could be ccTLD, meta description, etc.). Five percent of the respondents specifically mention the local domain as the reason for their choice (although they seem to be confusing the autopartsuk.com as a U.K. domain). Seventeen percent of our respondents made the website selection based on their belief that the website was based in the U.K.The research also shows how important the meta description is in the user-browsing decision, something that I think often gets overlooked by SEOs. In fact, 30 percent of our respondents indicated they made their selection based on information provided in the meta (mentioning things like free delivery, range of stock, and discounts). I think that when we get a website ranking for a really important keyword, SEOs can be a bit like the football (or soccer) team that’s just scored a goal. We’re so engulfed in the success of scoring that we switch off at kickoff, letting the other team score straight away. There is a danger that we think we’ve won when one of our web pages ranks well, when in fact that’s just part of the job. We still need to compete for the user’s attention once we’re on the SERP, and entice them to click on our website instead of the competitor's. Do Google’s new ‘branded breadcrumbs’ change the significance of ccTLDs?We’ve seen that a number of users make a SERP selection based on their assumption that the selected website is based locally. At present, the domain structure is used as a key indicator of a websites location. However, as part of the mobile algorithm update, Google’s announced a move from a URL display to a branded breadcrumb that will remove the domain structure from the SERP. On mobile, from a location perspective, the domain structure will no longer influence a users SERP selection. The 17 percent of respondents making the selection based on location will look for other information to aid their decision. For now, on mobile at least, the SERPs present a level playing field for ccTLDs and gTLDs with regards to consumer psychology. The meta description is even more important in enticing the click. ConclusionsFor me, the research shows that choosing a ccTLD as the domain structure for an international site shouldn’t be the automatic decision that it seems to be for many. While further research is required, I don’t believe that a ccTLD domain structure has a big enough impact on rankings to warrant selecting this option over a subfolder, which allows us to consolidate links and boost DA and PA on all of our international content. We can geotarget subfolders via webmaster tools and hreflang tags, and as a local ccTLD doesn’t seem to supersede PA as a ranking factor, we should act accordingly and launch international sites with the highest PA possible (i.e., subfolders). The research on consumer psychology does show that a ccTLD can have a positive impact on SERP user selections. However, meta descriptions can also be used to promote local service and delivery. The changes announced by Google for mobile SERPs will remove URLs from the selection equation, and we've seen that when a user is on a website, they pay little attention to the domain location. While I feel this is the right advice for most brands, it’s probably not the right advice for all. If you’re working with a large brand, you might have the resources available to earn the marginal gains in every facet of what you do. If further research shows that ccTLDs do have some ranking impact, no matter how small, and that improves your ranking by one position for each keyword, then the impact could result in a significant amount of extra traffic if you’re working for a large eCommerce customer. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why ccTLDs Should Not Be an Automatic Choice for International Websites"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why ccTLDs Should Not Be an Automatic Choice for International Websites"
    },
    {
      "level": "H2",
      "text": "The SERP Research"
    },
    {
      "level": "H3",
      "text": "The hypothesis"
    },
    {
      "level": "H3",
      "text": "Methodology"
    },
    {
      "level": "H3",
      "text": "Analysis of data"
    },
    {
      "level": "H3",
      "text": "Research limitations"
    },
    {
      "level": "H3",
      "text": "The results"
    },
    {
      "level": "H3",
      "text": "Discussion"
    },
    {
      "level": "H3",
      "text": "Implications for international SEO"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Consumer psychology and ccTLDs"
    },
    {
      "level": "H3",
      "text": "Test 1 – Impact of domain structure when a consumer is browsing an\r\necommerce store"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Test 2 – Impact of domain structure when consumer is browsing the SERPs"
    },
    {
      "level": "H3",
      "text": "Do Google’s new ‘branded breadcrumbs’ change the significance of ccTLDs?"
    },
    {
      "level": "H3",
      "text": "Conclusions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "International SEO — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Build a Business Case to Get an International SEO Investment Approved for 2024"
    },
    {
      "level": "H3",
      "text": "Going International: 15 SEO Steps for a Successful Expansion"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Liam Curley\n          \n            Liam Curley\n          \n            Liam Curley"
}