{
  "url": "https://moz.com/blog/why-google-analytics-optout-wont-matter",
  "slug": "why-google-analytics-optout-wont-matter",
  "title": "Why Google Analytics Opt-Out Won't Matter - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As you probably heard, Google announced last week that they are working on a browser plug-in to let users opt-out of Google Analytics tracking. But th...",
  "content": "Why Google Analytics Opt-Out Won't Matter SEO Analytics R By: Ryan Matzner March 24, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! R By: Ryan Matzner March 24, 2010 Why Google Analytics Opt-Out Won't Matter SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. As you probably heard, Google announced last week that they are working on a browser plug-in to let users opt-out of Google Analytics tracking. But this is more about Google having something to point to when users complain about privacy concerns than actually a tool to help people opt out of Analytics tracking. Here's why the new opt-out software won't affect your Analytics: Too Big To Fail The biggest reason this plugin won't take off is because Google won't let it. Google Analytics is simply too important a product for Google and its customers. They simply could not afford to kill it. Plugins Are A Big Hurdle Google doesn't want people to opt out of Analytics and they aren't going to make it easy. The average user doesn't really know what plugins are will have a tough time installing one. Most will not find it worth the bother. These People Are Already Invisible This is the first time Google has created a way for people to opt out of Analytics tracking, but others have devised methods in the past. People who are very concerned with their privacy can already disable javascript and cookies, thus blocking Analytics. In fact, the people who will be installing this plugin probably already disabled their javascript and aren't being counted by Analytics, anyway. So, webmasters won't notice much change in their numbers. It's A Short Bus Frankly, the number of people who are concerned with their privacy to the point that they want to block Google Analytics simply isn't very big. Don't expect a lot of people to install this plugin. But What If It Takes Off? Don't Worry...There's A Backup Plan Of course, there is a slight possibility that this thing could take off. For example, if a bunch of high profile users started advocating using it. It wouldn't be too far of a stretch to imagine a talk show host going on a rant about privacy advocating his/her followers install the plugin. So what's Google's backup plan? This plugin is definitely about pleasing a few privacy advocates and not about giving users an easy to opt out of Analytics. If the installed base gets to the point that Analytics results are tangibly impacted, Google will probably pull the plugin and announce that it is being replaced with a \"better\" solution. They'll argue that they have a new solution, which better protects everyone's privacy and that will allow them to anonymize the data. They might even announce that they're rolling it out across all Analytics. Regardless of what happens, you can be sure that Google will not let privacy concerns get in the way of Analytics. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Google Analytics Opt-Out Won't Matter"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Google Analytics Opt-Out Won't Matter"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ryan Matzner\n          \n            Ryan Matzner\n          \n            Ryan Matzner"
}