{
  "url": "https://moz.com/blog/why-site-speed-still-matters",
  "slug": "why-site-speed-still-matters",
  "title": "Why Site Speed Still Matters (Revisited) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Portent's latest site speed study refresh looked at 10 websites spanning a number of industries and 26,000 different landing pages, ranging in performance from extremely slow pages to extremely fast. The results show that every second you can shave off your page load speed has intense conversion…",
  "content": "Why Site Speed Still Matters (Revisited) Technical SEO | Advanced SEO By: Michael Wiegand April 20, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Michael Wiegand April 20, 2020 Why Site Speed Still Matters (Revisited) Technical SEO | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The marketing stack dictates infrastructure before content Success in an earned media channel like organic search hinges on content. Specifically, on producing helpful content that has the ability to rank. Google has focused its recent algorithmic updates largely on promoting great content and natural links, and penalizing weak content with unscrupulous links (see also: Medic, BERT, and its legacy predecessors like Panda, Penguin, and Hummingbird). But as SEO professionals prioritize content recommendations, keyword research, and link acquisition strategies (the more immediate factors in obtaining rankings), they risk devaluing technical changes — including site speed — that absolutely make clients more money on their existing organic audiences. No content or channel initiative works without infrastructure (i.e. fast websites) and analytics. They are foundational to digital marketing success. Content marketing is undeniably effective at getting sites to rank in search engines, which might satiate a client’s curiosity about what SEO can do for their visibility. And you might even be able to get slow sites to rank consistently, but the lack of attention to infrastructure will eventually come back to haunt you in conversion rates. Site speed study Sending prospective customers generated by good content to websites with slow experiences erodes trust literally by the second. Our latest site speed study refresh looked at 10 websites spanning a number of industries and 26,000 different landing pages, ranging in performance from extremely slow pages (upwards of 9 seconds) to extremely fast (under one second). The results showed that every second you can shave off your page load speed has intense conversion rate benefits that defy differences in verticals or selling approaches. Pages that loaded in under one second converted at a rate around 2.5 times higher than pages that loaded slower than five seconds or more. But the gains weren’t limited to fast vs. slow pages. The difference in conversion rates between “fast” pages (two-second load times) and “really fast” pages (under one second) was also more than double. This brings me to my next point. Users will demand even faster sites We first ran this survey in 2014 and, compared to today, the difference between “really fast” sites and “fast” sites wasn’t as stark as it is now. When we run it again in five years, expect the difference to be even more dramatic. Why? 5G adoption. Ericsson’s mobility report, run back in November of last year, predicted 5G coverage would cover 65% of the world’s population in 2025. Another study run by Parks Associates last April shows that, while gigabit internet adoption has slowed in the US, worldwide broadband adoption is expected to reach one billion households worldwide by 2023. When you factor in both those trends, the only thing throttling a mobile or desktop user’s experience will be poor web infrastructure. Prioritizing site speed If you’ve read this far, then you’ll agree the conversion rate benefits of a fast site are significant and the marketplace demand for fast user experiences is widening quickly. But what practical steps should you take toward a faster page speed and which of those steps should you prioritize? Moz, of course, has a great guide on page speed best practices. From that list, you have the following recommendations: Enable compressionMinify JavaScript, CSS, and HTMLReduce redirectsRemove render-blocking JavaScriptLeverage browser cachingImprove server response timeUse a content distribution network (CDN)Optimize images and video If you were to reorder those recommendations in terms of difficulty to implement for the average search marketer and impact on site speed, it would probably go something like this: Low difficulty, low impact Optimize images and video Marketers at any skill level can install a WordPress plugin like Smush and automatically reduce the size of any image uploaded in a piece of new or existing content. It saves a surprising amount of time when every image on a page is appropriately sized and compressed. Minify JavaScript, CSS, and HTML Minifying code is another quick win. There are plenty of tools out there that minify code, like minifycode.com. These tools essentially strip out all the spaces in the code, which can save a few kilobytes of size here and there. Those add up across an entire experience. It may take a developer to put these changes into place, but anybody can copy and paste code into the tools and send the minified version to the team doing the work. Remove render-blocking JavaScript Migrating to a tag management platform like Google Tag Manager can take the JavaScript weight off of your pages and put them in a container where they can load as fast or as slow as they need to without impairing the rest of the content or functionality on the page. Tag Managers are really easy to use for non-technical folks, too! Medium difficulty, medium impact The three recommendations below can be a little harder depending on who manages your CMS or existing web server. It could be as easy as clicking a checkbox, or as difficult as writing custom redirect rules on your setup. You’ll probably need to consult with either an IT and/or web developer to get these done. Reduce redirects Most SEOs can relay a URL redirect map to a client or internal stakeholder to determine server-side redirects with ease. But some sites include more complicated client-side redirect schemes using JavaScript. Working with a front end developer to tackle changes to script-based redirects can be tricky if those JS files impact the site functionality in other material ways. Enable compression Enabling compression in Apache or IIS is a pretty straightforward process, but requires access to servers and htaccess files that IT organizations are reluctant to hand marketers control over. Leverage browser caching Similarly, browser caching of website resources that don’t change very often is easy to do if you have control of the htaccess file. If you don’t, there are caching plugins or extensions for various CMS platforms that marketers can install to manage these settings. High difficulty, high impact Improve server response time Common ways to improve response times include finding a more reliable web hosting service, optimizing databases that deliver functionality to the site, and monitoring PHP usages. Again, all these things fall under IT purview and require additional decision-makers and costs to execute. Use a content distribution network (CDN) Adopting a CDN can be time-consuming, expensive (hundreds or thousands of dollars per month per domain depending on site traffic), and require expertise that the average marketer or consultant doesn’t have to enable. But if you can do it, studies suggest Google is measuring time to first byte as a ranking factor and the payoffs can be huge. Godspeed, everyone! Hopefully, this inspires you to go out and make progress on site speed initiatives in your organization or for your clients. Not only is it worth the undertaking from a business perspective, but it’s actively making the internet a better place to be for the average person. Those are both things every search marketer can be proud of. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Site Speed Still Matters (Revisited)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Site Speed Still Matters (Revisited)"
    },
    {
      "level": "H2",
      "text": "The marketing stack dictates infrastructure before content"
    },
    {
      "level": "H2",
      "text": "Site speed study"
    },
    {
      "level": "H2",
      "text": "Users will demand even faster sites"
    },
    {
      "level": "H2",
      "text": "Prioritizing site speed"
    },
    {
      "level": "H3",
      "text": "Low difficulty, low impact"
    },
    {
      "level": "H4",
      "text": "Optimize images and video"
    },
    {
      "level": "H4",
      "text": "Minify JavaScript, CSS, and HTML"
    },
    {
      "level": "H4",
      "text": "Remove render-blocking JavaScript"
    },
    {
      "level": "H3",
      "text": "Medium difficulty, medium impact"
    },
    {
      "level": "H4",
      "text": "Reduce redirects"
    },
    {
      "level": "H4",
      "text": "Enable compression"
    },
    {
      "level": "H4",
      "text": "Leverage browser caching"
    },
    {
      "level": "H3",
      "text": "High difficulty, high impact"
    },
    {
      "level": "H4",
      "text": "Improve server response time"
    },
    {
      "level": "H4",
      "text": "Use a content distribution network (CDN)"
    },
    {
      "level": "H2",
      "text": "Godspeed, everyone!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Michael Wiegand\n          \n            Michael Wiegand"
}