{
  "url": "https://moz.com/blog/why-seo-is-like-an-rts-game",
  "slug": "why-seo-is-like-an-rts-game",
  "title": "Why SEO Is Like An RTS Game (and why you should care) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Battlefield control, offensive weaponry, opponent research, and more; in many ways, SEO can be compared to a real-time strategy video game. In today's post, learn how you can lean on your early gaming roots to benefit your grownup SEO initiatives.",
  "content": "Why SEO Is Like An RTS Game (and why you should care) Advanced SEO By: Jayson DeMers April 30, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jayson DeMers April 30, 2013 Why SEO Is Like An RTS Game (and why you should care) Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As a fan of video games, I often compare real-life scenarios to similar elements in games. These elements offer a parallel way to approach many of the same types of challenges that we face in everyday life in a fun, unique way. After all, real life challenges shouldn’t necessarily be unpleasant; if they can be stimulating and entertaining, productivity will improve, and improved productivity usually translates to higher revenue. Growing up, the first genre of video games I fell in love with was the RTS (real-time strategy). While RTS games usually pit warring factions against each other with an assortment of units involving infantry, armored vehicles, and air and sea-borne vessels, to me, SEO is actually a lot like an RTS; it even has its own versions of those classes of units. Let’s take a deeper look at why SEO is like an RTS game and how you can leverage this idea to benefit your SEO initiatives. The battlefield A basic element of any RTS game is the top-down view of the battlefield. From here, commanders have complete control over their campaign. They can devise a strategy, build a base, get real-time information and updates, upgrade technology, and take tactical control over their units to lead them into battle. An Excel or Google Doc spreadsheet may not be the first thing that comes to mind when you think about a battlefield, but in essence, isn’t that what your SEO dashboard (or collection thereof) is? Many SEO professionals use dashboards to manage the various components of their SEO campaign(s), including: Blog content calendar Ranking and traffic monitoring Competitor intelligence and monitoring Guest post content calendar Backlink profile monitoring Brand mention and social media monitoring Onsite optimization monitoring Years ago, one of the revelations I had that led to vastly improved success as an RTS gamer was simple; increase my screen resolution so I can see more of the battlefield at a time. This change increased information flow to me, allowing me to react quicker and smarter to enemy threats, more effectively monitor my enemies, and control my units for offensive purposes more efficiently. I had the same revelation one day when I was working in one my SEO dashboard spreadsheets. I had accidentally decreased the font and cell size of the spreadsheet, bringing more information into view at a time. I immediately started drawing new correlations that I hadn’t previously seen; that’s why this page isn’t ranking well. That’s what my competitor did that caused that page to have so much success in the rankings. This idea extends beyond simply increasing the viewable area of your dashboards, though. Adding a second and third monitor on which you can constantly access dashboards containing information about the state of an SEO campaign, as well as those of your competitors, can allow you quickly detect opportunities for offensive strategies, weaknesses in competitors’ strategies, and tactical advancements being made by competitors. It all comes down to this: information is intelligence, and what isn’t measured isn’t managed. The offensive weaponry In RTS games, success is usually achieved by destroying your enemies completely, and battles are fought with land, air, and naval units. Things aren’t usually so brutal in the world of SEO, but offensive tactics can and do result in harm to your competitors. For instance, moving ahead of a key competitor in the search engine rankings for a highly-trafficked search term will not only increase traffic to your website, but also decrease traffic to that competitor’s website. Repeating this across many keywords will result in significantly decreased traffic for your competitors, as you effectively consume more of the fixed “traffic pie” that exists for your niche or industry. Similarly, while SEO battles aren’t fought with military units, they are fought with different classes of weaponry that can be compared to air, land, and sea: onsite content, inbound links, and social media signals. Onsite content represents the foundation of any SEO initiative’s arsenal; it provides numerous benefits that strongly impact overall search visibility while supporting each of the other types of weaponry (by helping to acquire inbound links and providing discussion content for social media feeds). Onsite content is like the assortment of land units in an RTS game, and consists of text-based blog posts, press releases, infographics, video, images, responsive design, proper optimization of internal pages, and much more. Inbound links are like the air force of an SEO campaign. They provide unparalleled power, and whomever wields the most and best of them generally has superiority on the battlefield (i.e. the best rankings and website traffic). However, getting good inbound links is time-consuming and can be expensive. Social media signals are like the naval force of an SEO campaign; depending on the battlefield, they may not be needed or useful. However, in the right scenario they can be the force that wins the battle. Social signals currently play a significant role in search engine ranking algorithms, though I believe it’s less than that of onsite content or inbound links. Nonetheless, I expect the importance of social media signals to continue to rise, eventually overtaking or matching inbound links in terms of importance in the ranking algorithm. Developing an SEO strategy in which you think about each of these three pillars of SEO as your offensive weaponry is key to a winning battle plan (and a successful SEO initiative). Each facet should be analyzed, actionable conclusions should be drawn, and tactical plans with clear milestones should be developed. Just like a good battle plan, your SEO campaign needs careful and strategic thought and execution. Necessary resources should be calculated and acquired, and the campaign should be monitored and managed by a commander with an expert knowledge of the tools and weapons available (ie, an SEO professional), with a mind for strategy and an aptitude for swift tactical execution. Follow these seven steps to ensure victory: 1. Start with keyword research Performing good, informed keyword research is like building your base. In an RTS game, without a strong foundation from which to launch your attacks, you won’t win the battle. In the game of SEO, without proper keyword research, all your future efforts could be wasted. 2. SEO-optimize your onsite content Optimizing your onsite content is like building your base defenses. In an RTS, your defenses are what will allow you to withstand enemy attacks. In the game of SEO, optimizing your content from an SEO-perspective will patch up any weaknesses in your strategy, making you more resilient to holding your rankings as your competitors engage in their campaigns. 3. Set up Google Authorship Setting up Google Authorship is like enhancing the attack power of your offensive units. When Authorship is set up, your content will show up with visual representation in Google’s search results. Here’s an example: Aside from the ego-boosting appeal of getting your lovable face on Google’s search results page, this has strategic, ROI-generating impact. Since these search results include images, they stand out from normal ones, drawing the searcher’s eye and resulting in more click-throughs. Every time you get a click, that means someone else didn’t. So, as your SEO campaign benefits, your competitors suffer. Furthermore, Google Authorship imbues your name with the ability to accrue Author Rank, which is a growing factor in the ranking algorithm. The better your Author Rank, the better your content (that you authored) will rank. 4. Create amazing content for your blog Creating content for your blog is like building your offensive army. Every great piece of content you create is like dropping another raffle ticket into Google’s hat. The more pages of content you have, the more chances you have to show up in Google’s search results. Furthermore, more content means more linkable assets on your website, and inbound links are the strongest single factor in the ranking algorithm. Without great content (both on and off your website), your SEO campaign won’t be able to get off the ground. But with plenty of great content, you’ll have the ammunition you need to accrue inbound links, climb the rankings, and steal market share from your competitors. 5. Get your content in front of people who will enjoy it using social media marketing Social media marketing is a way to augment and support your “army” of content. Content that receives lots of social mentions and shares will perform much better in search results, garner more inbound links, and generate more referral traffic, brand awareness, and website traffic. 6. Start your guest blogging campaign Your guest blogging campaign is like your special weapon or attack unit. In RTS games, each faction has its own special weapon that the enemy fears. A little later in this article, I’ll discuss one such unit, the Krogoth, from one of my personal favorite RTS games: Total Annihilation (and how that relates to SEO). In SEO, guest blogging is a difficult, time-consuming, endeavor that requires a ton of patience, expertise, and professionalism. The barrier to entry is high, but if you can pull it off, your competitors will fear you; especially if they aren’t doing it themselves. Guest blogging is my favorite way to build brand awareness, authority, and credibility. Best of all, it’s a great way for me to share and add value about the things I know about (like SEO, social media, and entrepreneurship). Knowing that I’m adding value to the community makes me look forward to getting out of bed and writing every morning. The referral traffic is great, too! 7. Build your personal brand Your personal brand is what defines who you are as an individual, and this is important because people like people; not companies. If a personal brand were to be compared to an RTS game, I suppose it could be compared to your playing style. Do you like to rush your opponent quickly before they’ve had time to build their base, or do you prefer to play a long, strategic game? Your personal brand defines how you interact and connect with not only your community, but also your competitors. Earn the respect of your competitors and you’ll surely earn the respect of your target market. This will result in traffic, leads, and sales. Time and effort creates value In most RTS games, the more expensive the unit, the more effective it is in battle. I fondly remember one unit called the Krogoth (from Total Annihilation, my favorite RTS game), which was a massive and devastating offensive unit that required a huge amount of resources and time to build. However, the Krogoth could take down entire armies of enemy units. Just a few of them could march into an enemy base and wreak havoc, severely damaging the enemy if not causing their complete destruction. In the game of SEO, extremely valuable (often expensive and/or time-consuming) content is like the Krogoth. It can attract lots of high-quality inbound links, referral traffic, and social media buzz. Neil Patel of Quicksprout has mastered this concept and represents a perfect example for how to do it correctly. Neil invests a great deal of time and money to create and publish extremely valuable eBooks, videos, infographics, and blog posts which have helped establish him as a well-known and successful entrepreneur. Not only has Neil’s personal brand benefited from this distinction, but so have his businesses. Similarly, SEOmoz specializes in publishing top-notch quality content. They have built their business around the success of this content, using it to build brand awareness, trust, and loyalty, which has helped grow and establish the world’s largest community of SEO professionals, to which they sell their SEO software toolset. Just like it’s more worthwhile to build a Krogoth than an entire army of smaller units, one extremely awesome and highly-valuable piece of content is better than many low-value ones. Conclusion While SEO and RTS gaming may seem totally unrelated at first glance, learning to think like a battlefield commander can mean the difference between a good SEO professional and a masterful one (or a moderately successful SEO campaign vs. a wildly successful one). I hope this unique look into the similarities of SEO and RTS games gives SEO professionals a new perspective with which to view our young industry; one that will breathe some life into the daily grind while yielding more successful SEO campaigns. Please share your thoughts in the comments below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why SEO Is Like An RTS Game (and why you should care)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why SEO Is Like An RTS Game (and why you should care)"
    },
    {
      "level": "H2",
      "text": "The battlefield"
    },
    {
      "level": "H2",
      "text": "The offensive weaponry"
    },
    {
      "level": "H3",
      "text": "1. Start with keyword research"
    },
    {
      "level": "H3",
      "text": "2. SEO-optimize your onsite content"
    },
    {
      "level": "H3",
      "text": "3. Set up Google Authorship"
    },
    {
      "level": "H3",
      "text": "4. Create amazing content for your blog"
    },
    {
      "level": "H3",
      "text": "5. Get your content in front of people who will enjoy it using social media marketing"
    },
    {
      "level": "H3",
      "text": "6. Start your guest blogging campaign"
    },
    {
      "level": "H3",
      "text": "7. Build your personal brand"
    },
    {
      "level": "H2",
      "text": "Time and effort creates value"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jayson DeMers\n          \n            Jayson DeMers\n          \n            Jayson DeMers"
}