{
  "url": "https://moz.com/blog/why-do-i-look-like-a-manga-and-where-has-my-dignity-gone",
  "slug": "why-do-i-look-like-a-manga-and-where-has-my-dignity-gone",
  "title": "Why Do I Look Like A Manga And Where Has My Dignity Gone? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The more keen-eyed of you may have noticed that, if my profile picture is to be believed, I most closely resemble the sort of person only ever seen on Saturday morning kids' TV. A Cartoon if you will. So why is it that I choose to represent myself to a community of like-minded people whom I…",
  "content": "Why Do I Look Like A Manga And Where Has My Dignity Gone? Social Media C By: Ciaran Norris February 12, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris February 12, 2007 Why Do I Look Like A Manga And Where Has My Dignity Gone? Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The more keen-eyed of you may have noticed that, if my profile picture is to be believed, I most closely resemble the sort of person only ever seen on Saturday morning kids' TV. A Cartoon if you will. So why is it that I choose to represent myself to a community of like-minded people whom I respect, with something that suggests I'm the supporting actor in a Japanese anime film? The simple answer is that I don't have any decent photos of myself, and found a cool site called Meez that allows you to construct a cartoon image of yourself. But that still doesn't answer the question of why I would then use this image to be my virtual representative in an online community. Probably just because I can, and also because I don't \"know\" any of the people visiting this site in the real sense of the world. And not knowing people can do wonders for releasing you from any sense of social shame. Which probably explains why on music blog site MOG I appear to look exactly like my pet cat; or why my MySpace page is apparently written by a graffiti'd wall. But is there anything wrong with this? Does any of this really matter? Well yes, if you happen to make your living out of these online communities and your virtual reputation. Then a silly name or picture, and not having your normal social thresholds can be a dangerous thing. Take Robert Scoble, probably one of the most famous & respected bloggers in the world. Most recently seen? Getting involved in a playground name calling session with members of his audience. Hugh at GapingVoid blames what he calls Trolls, trying to bring Scoble back down to earth. But there's never an excuse for someone whose business is based on their blogging to get involved in the sort of \"Tis - Tisn't - Your fault - Is not - I'm calling my Mum - f*** you!\" discussion that this descended to. Then there was Andy Beal and Jeremy Zawodny going at each other like a couple of high-school girls fighting over the quarterback, which was a particularly unedifying spectacle. All fixed up now, but a stark reminder to us all. Unlike the kids who hang round on MySpace spoiling for an internet fight, we have work to do, reputations to build and businesses to grow - all of which depend on our online reputation. So maybe we should all take a deep breath before every post we make, and think twice about having that \"funny\" picture as our avatar. Which is why I'm going to lead by example and start presenting a much more professional image of myself... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Do I Look Like A Manga And Where Has My Dignity Gone?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Do I Look Like A Manga And Where Has My Dignity Gone?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}