{
  "url": "https://moz.com/blog/why-most-conference-presentations-suck",
  "slug": "why-most-conference-presentations-suck",
  "title": "Why Most Conference Presentations Suck - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I tend towards the uncontroversial when I write. I haven't been the author of many posts that have caused debate.\n\nBut I've had enough. I need to speak up.\n\nMost conference presentations suck",
  "content": "Why Most Conference Presentations Suck SEO Events By: Will Critchlow October 3, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Will Critchlow October 3, 2010 Why Most Conference Presentations Suck SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Normally, I tend towards the uncontroversial when I write. I haven't been the author of many posts that have caused debate. But I've had enough. I need to speak up. Most conference presentations suck There. I said it. I remember being amazed (and, back then, pretty heartened) when I went to my first SEO conference and realised I already knew most of what was being said. Amazement turned to disappointment at my second conference, which was billed as \"Advanced\" and where the same old basics were trotted out by too many of the speakers. Since then, I've been to hundreds of presentations. I've learnt a lot, but from a surprisingly small proportion of them. (Thank you to those speakers who consistently turn out the excellent stuff!). I'm no exception This is as much a criticism of myself as anyone else. Looking back, there are some presentations I've given that make me cringe now (especially early ones). Early on in my speaking career, it wasn't necessarily that I phoned them in. I was suitably scared / motivated to do a good job - I think I just didn't know how. More recently, I think it's probably happened when I agreed to talk on a subject I didn't really know enough about. I'm definitely trying to learn that lesson. So before I go any further, if you've had to sit through one of my presentations and learnt nothing, I'm sorry. If it happens in future, email me and tell me (my contact details are easy to find and always on my last slide).I'm a strong believer in the idea that you should praise in public and criticise in private so I'm not asking you to tear presentations apart on Twitter. I'd love it if we saw more strong praise of great presentations, and more honest private feedback to speakers and organisers when they haven't delivered the goods. Basic has its place Before I go any further, I wanted to point out that I am often called upon to give \"SEO 101\" type presentations and these wouldn't teach any of you anything. I hope this doesn't mean that they are bad presentations. It's all about knowing the level of the audience I guess. This rant is squarely aimed at \"advanced\" presentations of one form or another. Delivery is important, but it's not a substitute for content If you start googling \"how to give a great presentation\", you'll find masses of advice on slide design, how to speak at the right speed, the kind of opening line to use, what to wear etc. All of this stuff can help, but I would urge implore you to work harder on the other axis. Make the content kick-ass and I'll listen to you even if you mumble at your feet in a monotone looking like a scarecrow. (Yes, I know I talk too quickly when I present. One day I'll fix that). I do like listening to great speakers and entertaining presentation does improve things, but there are better places than SEO conferences to go for stand-up comedy, so generally, I'm there to learn things. You can get away with slightly weaker content if your delivery is awesome but please remember this highly scientific chart: And you know what? I don't even care if it's a sales pitch if you are teaching me stuff. It sets the bar higher and I'm more likely to criticise you if you pitch your own stuff without teaching me anything, but if you do teach me stuff, you can bet I'm going to check out whatever you're hawking.By content, I mean new stuffIn the past, just to avoid embarrassing myself, I have:Learnt new things (this was about how to do first touch tracking in Google Analytics):Carried out research (this slide shows a correlation I established between search volume for the 2006 world cup and the 2010 world cup before this year's competition started - it was part of a methodology for forecasting search volumes that haven't happened yet):And published data (this is actually one of Tom's slides): Don't worry about being too advanced That's what Google is for. Give me the ideas and the data that I couldn't get anywhere else. If there's terminology I'm not familiar with or you skip over something too quickly, I can easily do my own research. But please don't spend half an hour telling a room full of experts what Google Insights is. Why should you bother? At the Seattle mozinar, I gave a presentation on \"how to pitch SEO\". One of my core themes was that the best way to win business is to avoid competitive pitches by giving yourself an unfair advantage. Being known for being smart is one of those advantages. If people get to know you through learning from your presentations, you will find yourself in a disproportionate number of uncompetitive pitches... Just sayin'. Recipe for success: Speakers At Distilled, I have been thrilled to see great first-time presentations from our guys - this isn't something that only comes with experience. For example, Sam's Advanced Keyword Research presentation at SMX London was more highly rated than those of many more experienced speakers including mine. In advance of the show, Sam asked Tom and I to run through our secret recipe. It's actually pretty simple - just follow these steps: Only agree to speak if you actually know the subject and have something new to sayAsk yourself what you can give away in your talk that will be new for the majority of the audienceWhat action can people take as a result of your talk?Be prepared to do work / research to discover or demonstrate your new stuffUnless you are an incredibly gifted public speaker, practice before the event. There's a huge difference between preparing the slides and giving a great talk. Although I truly believe that content > delivery, it's worth working on the delivery at least a bit! Check out Lisa Barone's post last week about How To Rock Your Presentation for more great presentation delivery recommendations.If you need a little bit more incentive to be awesome, I've found that having a head to head competition and then a vote at the end of your session (thanks Rand!) is a good way to make you up your game. Recipe for success: Organisers This rant is mainly aimed at speakers, who I think are the primary culprits, but for organisers, while I realise that larger conferences especially don't want to micro-manage every session the way Rand and I have been for the Pro training seminars, can I beg for one small thing? Don't invite speakers back if they didn't add value last time Everyone runs those follow-up surveys and knows which speakers were loved by the audiences and who phoned it in. Please stop inviting people back if they don't want to teach things to the attendees. [Rand wrote a whole post a while back with his thoughts on this from an organiser's perspective].[UPDATE: following a bunch of conversations in the comments and offline, I wanted to clarify two things here:I was probably too harsh with my statement above - if everyone took that literally, there's a good chance I wouldn't still be speaking at shows today. I want to encourage new speakers and with that goes a lot of mentoring, feedback and encouragement. Do give people a second chance, do give them support and feedback and definitely do encourage new and unknown speakers. Rephrased, I think I mean \"don't invite speakers back if they repeatedly fail to add value and don't invite them back at all unless you are prepared to coach them\"This isn't a new discovery - ironically, this whole post is more of a rant than it is likely to tell people things they didn't know - and there are many shows that take this seriously. This post is really aimed at speakers not organisers]Rand and I actually tend to harangue our speakers with instructions a little bit like those above asking them to bring their 'A' games. Beyond a certain point, it hopefully gathers momentum because no-one wants to be the guy giving the sales pitch when everyone else's presentation is rocking. At the beginning of September (almost two months before the show), I had a call with every speaker for the London Pro seminar to help shape what they were going to talk about and make sure that they are bringing their secrets. It's not too late to get in on the action and see the result of all that hard work: There are still tickets left for the London Pro SEO seminar It's lucky that we have a bigger venue this year. We passed last year's total (sold out) sales a few weeks ago and unfortunately all the VIP breakfast tickets are gone, but there are still tickets left at the time of writing. Like last year, we anticipate that there will be a rush of bookings as the date approaches so it is likely that we will sell out. If you are wanting to come and see me put my money where my mouth is (yes, I'm feeling the pressure a little bit after writing this) don't leave it too late to book: The Details: Where: The Congress Centre in London's West End When: October 25th and 26th Price: £699 +VAT Book: now! If you are an SEOmoz PRO member, you can get access to special pricing by using the code in the discount store - making it a steal at £499 +VAT / person. You can read a sneak preview of the event that I wrote a few weeks ago to get an idea of the kinds of things that you will see there. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Most Conference Presentations Suck"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Most Conference Presentations Suck"
    },
    {
      "level": "H2",
      "text": "Most conference presentations suck"
    },
    {
      "level": "H2",
      "text": "I'm no exception"
    },
    {
      "level": "H2",
      "text": "Basic has its place"
    },
    {
      "level": "H2",
      "text": "Delivery is important, but it's not a substitute for content"
    },
    {
      "level": "H2",
      "text": "By content, I mean new stuff"
    },
    {
      "level": "H2",
      "text": "Don't worry about being too advanced"
    },
    {
      "level": "H2",
      "text": "Why should you bother?"
    },
    {
      "level": "H2",
      "text": "Recipe for success: Speakers"
    },
    {
      "level": "H2",
      "text": "Recipe for success: Organisers"
    },
    {
      "level": "H2",
      "text": "There are still tickets left for the London Pro SEO seminar"
    },
    {
      "level": "H1",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Critchlow\n          \n            Will Critchlow\n          \n            Will Critchlow"
}