{
  "url": "https://moz.com/blog/why-you-should-blog",
  "slug": "why-you-should-blog",
  "title": "Why You Should Blog - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I got tagged with a blog meme about why I blog by Andy, but rather than simply ennumerate my personal reasons, I decided to go bigger and describe all the reasons, personal and professional, that should encourage you to start a blog (or continue to update the one you write).\n\n    Codify Your…",
  "content": "Why You Should Blog Content Marketing By: Rand Fishkin April 8, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 8, 2007 Why You Should Blog Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I got tagged with a blog meme about why I blog by Andy, but rather than simply ennumerate my personal reasons, I decided to go bigger and describe all the reasons, personal and professional, that should encourage you to start a blog (or continue to update the one you write). Codify Your Thoughts Writing forces you to succinctly, accurately describe your point. Blogs are short form and often contain a single serving of news, opinion, analysis or recommendation. This style provides an easy entrance to the world of journalism & writing in general and it's a perfect fit for those who are seeking to record their experiences & ideas - a diary for the 21st century (and, as we sometimes forget, it can be public or private). Build Name/Brand Recognition Whether your goal is professional or personal (though it's best applied to the former), blogging well builds credibility and creates a readership of devotees. Whil you may not have \"fans\" like a rock star, you'll certainly find people from diverse geographic and professional backgrounds that enjoy your writing and have a positive association with you. Outside of blogging, there's very few channels that offer this reward. Prepare for a Book A blog is an excellent way to display and practice writing skills and to show a potential publisher that you've developed a rapport with a built-in audience, likely to buy your book. A blog itself can even make for the foundation of a book's content or research work (and all those expenses are tax deductible). Grow Your Business Blogging has brought SEOmoz an incredible amount of business inquiries over the last 3 years, and the rate of emails asking us for assistance accelerates every week (last week, I counted more than 2 dozen unique requests, all of whom I sent here). Blogs build familiarity and positive branding and if I remember my business school training, the cardinal rule was - people do business with you because they know you, like you and they trust you - blogging accomplishes all three (and they show off your expertise in a subject). Connect with Co-Workers/Employees Blogs are, as Andy points out, an excellent tool for reaching employees and co-workers. At SEOmoz, the entire crew reads the blog daily and receive the equivalent of a daily lesson in search marketing. Blogging internally at a large or small company, when given the right freedom, creates cohesion and builds shared experiences throughout the firm - I'm a huge fan of it. Share Knowledge I hadn't realized it until a few months ago, but the reason SEOmoz has the open, sharing style that it does isn't because I had some great epiphany about the value, it's because of Gillian (who many of you know is also my mom). When I was little, she would always encourage me to share my food, toys, time and allowance with other kids (particularly my little brother and sister), noting, poignantly, that \"if you share, you always get more.\" Blogging carries that mantra, too - as I've given my knowledge and experience through the blog, so have we (SEOmoz) reaped incredible benefits in terms of our own knowledge, new clients (heck, even trips to Paris). Bolster Your Resume A successful blogger with a considerable readership is a powerful addition to any company, particularly one who's seeking to build branding over the web. The job offers that arrive in bloggers' inboxes are often exceptional, as many folks in the search marketing and tech fields have proven in the last few years. Establish a Written History If, like me, you have (as Mystery Guest puts it), \"the memory of a goldfish,\" blogging can be an excellent way to record your experiences accurately for recollection. You can do this professionally (as I do), or personally in the form of a travel blog or diary. Create a Personal Voice Companies often suffer from an overload of PR-style publishing. Blogs humanize people and companies to the outside world and make far deeper connections than newsletters or press releases. The less formal, more conversational style is an excellent way to truly connect and build fans of the brand. Connect with Industry Leaders OK, so Michael Arrington still doesn't take my calls, but at least Danny Sullivan answers half my emails :) Seriously, if you're looking to build a rapport with the giants of your field, building a blog readership base (while easier said than done) is remarkably effective. Not only can you develop relationships with industry leaders, you yourself can become one... Make Money I put this last on the list because, with the exception of some very smart, talented writers who can create groundbreaking content in their field (or entertain the masses with gimicky gossip), financial success does not always follow blogging. There are probably a hundred other pursuits that will earn you more direct income based on the hours invested (I know Darren probably disagrees). This rule applies only to the personal side of blogging - if you're blogging as a business or for one, it can be an excellent investment with a very direct monetary return. So why do I, personally, blog? From a purely financial standpoint, blogging has had a considerable (if indirect) impact growing SEOmoz's bottom line. Personally, I love to share my experiences, love to hear about how it's helped someone in their job, love the perks of press and VIP status that occassionally accompany the position (usually at conferences) and find the process itself incredibly rewarding. I've never been a talented artist in any way - I can't draw, paint, play an instrument or even produce a great design for a website (lucky thing I've got Matt around) - but blogging is my art. When I blog, my writing creates a voice and a conversation that so many people seem to appreciate (10K+ feed readers and the same number of daily uniques). I take a lot of pride in the SEOmoz blog, and in my entries, and it's thrilling to me that it's brought so many people together and helped to grow a tiny company into a slightly less tiny one. Surely, there are dozens of other reasons to blog, so please do share. Feel free to link out to your own blog in the comments as well (but don't write out the full URL, just use the link icon in the WYSIWYG editor, please). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why You Should Blog"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why You Should Blog"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}