{
  "url": "https://moz.com/blog/why-its-so-easy-to-get-marketing-all-wrong",
  "slug": "why-its-so-easy-to-get-marketing-all-wrong",
  "title": "Why It's So Easy to Get Marketing All Wrong - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I got a couple emails this week I wanted to share in anonymized format. Here's the first one:\n\n\tIt's me again , just wondering I have been learning allot more about how to link build without software like ...",
  "content": "Why It's So Easy to Get Marketing All Wrong Marketing Industry By: Rand Fishkin April 25, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 25, 2012 Why It's So Easy to Get Marketing All Wrong Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I got a couple emails last week I wanted to share in anonymized format. Here's the first one: It's me again <redacted>, just wondering I have been learning allot more about how to link build without software like senuke x and other automatic software and becoming a better manual link builder with google alerts etc. And here's the second: I look after around 6 clients at the moment, but my daily jobs just seem to be very repetitive e.g. finding related blogs, commenting on them, submiting sites to decent directories and guest posting, an now and again creating infographics and sharing them with blog owners and across sites such as reddit/quora etc...mostly I'm just blog commenting though. I get A TON of emails like this. When folks are relatively new to the field of online marketing, or are moving from classic marketing into SEO, they often reach out seeking advice and help. Unfortunately, the volume's become a bit overwhelming of late, and I'm only able to respond to 50%, sometimes less (side note: I tried an experiment w/ email scalability a couple months back that failed). Thus, I wanted to write a post to express some empathy. Yes. Marketing is really, really damned hard. I understand the temptations to phone it in, to spam instead of creating authentic value, to outsource responsibility, to proclaim for all to hear that you HATE marketing, to give up. You're not alone. In fact, I've been just inches from all of those perspectives time and again over the last decade. But that's also what makes great marketing so powerful. When: Very few people are qualified or capable to do something Many people believe that thing to be impossible Only a handful make exceptional investments to achieve it That, in my opinion, is when remarkable things are in your grasp. The marketing channels we invest in - SEO, social media, content marketing, community building, virality - fit these parameters well. It's easy to do the basics, tough to get the intermediate items right and mind-blowingly challenging to get that last few percent that takes us from mediocrity to extraordinary. So many times, marketing professionals are called in to execute on Step 3 after being handed half-assed 1s and 2s. My friend Philip Vaughn told me at a lunch some months ago that \"startups aren't really an engineering, product or organizational problem. They're mostly a marketing problem.\" But if we're handed crap to market, we can't help but do crap marketing. At the risk of pissing a lot of people off - A large portion of SEO is just compensating for not being awesome. — Rob Woods (@robdwoods) April 23, 2012 So many of the questions I see around inbound marketing boil down to the same fundamental challenge: The way I see it, we only have two options: A) Give in to giving up. B) Take/earn responsibility for Step 1 and 2 Embracing option B and taking responsibility for your product -> marketing lifecycle is something very few people are qualified for, or capable of doing, many people believe to be impossible and only a handful ever execute exceptionally well. And it means remarkable results are in your grasp. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why It's So Easy to Get Marketing All Wrong"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why It's So Easy to Get Marketing All Wrong"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}