{
  "url": "https://moz.com/blog/why-feed-tracking-is-hard",
  "slug": "why-feed-tracking-is-hard",
  "title": "Why Feed Tracking is Hard - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Feed tracking is hard.  Jeff explains why, and how Feedburner manages to make it work.",
  "content": "Why Feed Tracking is Hard SEO Analytics J By: Jeff Pollard July 30, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! J By: Jeff Pollard July 30, 2007 Why Feed Tracking is Hard SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A little while ago Rand sent me a rather interesting email... Some folks have been asking me about alternatives to Feedburner and I'm not really aware of anything... But, I do wonder - how hard would it be to develop a hosted solution to compete with them - i.e. something you can install on your own site to track feed subscriptions and access over time? Hard. Not so hard it's impossible, but hard enough that you'll need more than just one developer and 3 months free on the calendar. Tracking RSS subscribers takes a lot of time, work and technology. It's really a lot harder than you think. To develop a hosted solution to compete with them would cost a pretty penny. You'd be serving as the RSS provider for thousands of websites with requests coming all day every day from everywhere on the planet. And on top of that you have to serve web versions of the RSS, have a rather robust admin/backend system and develop an API for pinging and other external requests. That doesn't sound too hard. It just looks like a complicated web app with abnormally large hardware and bandwidth requirements. Couldn't you basically just throw hardware and developers at the problem and you'll be able to pull it off? Not really. One big concern that Rand had at the time was that... \"Feedburner doesn't actually track subscribers... it tracks the number of people who accessed particular posts on particular days.\" We'd seen evidence of this due to the fact that our subscriber numbers were fluctuating a few thousand a day. One day we'd have 10,000 subscribers, and then the next day we'd have 6,000. Feedburner has this to say on the subject... \"FeedBurner's subscriber count is based on an approximation of how many times your feed has been requested in a 24-hour period. Subscribers is inferred from an analysis of the many different feed readers and aggregators that retrieve this feed daily. Subscribers is not computed for browsers and bots that access your feed. If you look at their blog post on serving as the RSS provider for TechCrunch, they add this... FeedBurner calculates subscribers by matching IP address and feed reader combinations, and then using our detailed understanding of the polling behavior of a multitude of readers, aggregators, browsers and bots on the market to make additional inferences. I told Rand this, but he didn't think it was very accurate way of tracking the actual subscribers... \"I would track how many unique users have actually grabbed the feed at least once in the last month to track subscribers, then have separate stats for access. Feedburner's numbers are just not right, IMO.\" Not that bad of an idea. It sounds like a rather simple solution to RSS feed tracking - short, simple and to the point. Oh, I wish it was that easy. Getting accurate numbers of RSS subscribers is hard. Very hard, actually. In the relatively standardized realm of web browsers, 99% of your users are using are IE, FireFox, Opera, Safari or some derivative of one of the four. If a browser wants a web page, it sends a rigidly formatted request to a web server with along with a very useful set of data on the user's browser, computer, OS, IP address and a bunch of other factors. The server then responds with a standardized response to the user, whose browser interprets it and displays it for you to see. It might not sound simple, but compared to the world of RSS, it really is. Tracking \"uniques\" in RSS is a lot different and a lot more complicated than tracking uniques for just web pages. Remember how in for HTML we have 4 main browsers? Well in RSS there are literally thousands of RSS readers all accessing/requesting data from the feed in their own cute unique way. Some feed readers like NewsGator make one request to the server per hour per user, while MyYahoo, NetVibes and BlogLines may make 3 requests a day total - but then serve its hundreds or thousands of users reading that feed the cached local version it collected. Some services (like 5% - 10%, BlogLines is an example) send the total number of subscribers in its requests. But most aren't that nice. What about trying to track conversions? Well, trying to track conversions without a solid subscriber base is pretty much impossible. You could track hits to the feed and where they came from, but that wouldn't be very useful to people. You could make a piece of installable software a user would put on their own web server, which would be better from a hardware end, but you're still faced with developing algorithms for the dizzying array of RSS feed readers in order to generate accurate numbers. Rand was now impressed by the knowledge of his amazing web developer, but also how hard of a task this was ending up being. He did have another idea, though, to track conversions... \"What if, and I'm just throwing this out there, you were to have the users embed something in their posts. Then you'd know, almost like analytics, how many people were pulling those posts, right?\" In theory, yes. But even that won't work. You can't have (java)scripts in RSS. You can have images, which could be a theoretical way to measure impressions, but some feed readers strip out all HTML so they wouldn't record the impression. And still, some readers do cache images on their own server or the users computer. Plus, some people may just mark your entire feed (or just individual posts) as \"read\" and not view the post, thus not rendering the image. But they're still are a subscriber, they just didn't read your post. So do you count them that day as a subscriber then? And even if you did do the image thing, what about all the people who don't know how to or can't change their blog templates? How do they do it? Like I said, it's complicated. A few days later, Rand told me this nice little bit of info... \"Heard from someone here [...] that Feedburner actually has relationships with the folks at Bloglines/Netvibes/etc so they can get more accurate data from those popular places that cache the feed. I also heard that it's getting more accurate due to the Google acquisition and Google themselves providing more solid data for folks who use Google reader/IG/etc. \" That's nice of them, and is one of the many hoops you have to jump through in order to accurately track subscribers. You really need a big, talented and well funded company to even begin to track RSS feeds for customers. It's just one of those barriers to entry you can't get around. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Feed Tracking is Hard"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Feed Tracking is Hard"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jeff Pollard\n          \n            Jeff Pollard"
}