{
  "url": "https://moz.com/blog/why-search-engines-make-it-hard-to-plagiarize",
  "slug": "why-search-engines-make-it-hard-to-plagiarize",
  "title": "Why Search Engines Make It Hard to Plagiarize - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hello fellow Mozzers (hopefully my absence lately doesn't make it wrong to say something like that). This holiday season, I wanted to drop by and say hello and warm wishes to friends I haven't chatted with in a while.  And to post one short article about something that really got under my skin this…",
  "content": "Why Search Engines Make It Hard to Plagiarize Content Marketing By: Joe Rozsa December 10, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Joe Rozsa December 10, 2008 Why Search Engines Make It Hard to Plagiarize Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Hello fellow Mozzers (hopefully my absence lately doesn't make it wrong to say something like that). This holiday season, I wanted to drop by and say hello and warm wishes to friends I haven't chatted with in a while. And to post one short article about something that really got under my skin this evening. Like many of you, I have a boatload of side websites that I run for business and hobby both. One of those sites gets a decent amount of traffic this time of year, due to the annual controversy surrounding a college football playoff system. My site, BCSFootballPlayoffs.com, is a couple of years old and is a place where I post my two cents on what I feel would be an ideal and exciting college football playoff system. My site gets decent traffic and is ranked #3 on Yahoo for \"college football playoff system\". On the site, I list the details of my proposal and award entries to a mythical playoff system based on real world results. I even simulate the games on my Playstation 3 using actual real-time weather conditions and post clips and highlights of the simulated games. And yes, I know that qualifies me as a huge football loving computer nerd. However, this evening, I was reading through some sports online and stumbled across this article by Dan Wetzel of Yahoo. If you take a minute to look at both my site and Dan's article, you will see that his \"proposal\" looks eerily familiar. His bracket is exactly the same as the one posted on my site. The details of \"his\" proposal seem to be cut and pasted from the details of my own. Things such as \"automatic bids for conference winners,\" \"home field to the higher seeded team,\" and even the actual dates the games would be played are exactly the same as those I present on my site. I would like to think that great minds think alike, but when he recommends that this proposal would maintain the integrity of the regular season as I've pointed out, that there would be more meaningful games this time of year with this system as I pointed out, and ultimately that \"First- and second-round losers in a playoff could even take a slot in a late December bowl game\" as my system suggests, I'm leaning more and more along the lines of blatant thievery than amazing coincidence. Obviously, my site doesn't generate the traffic that Yahoo Sports home page generates by even the smallest of fractions. But come on, my site ranks #3 on your own company's search engine for one of the most commonly searched topical keywords out there. Technology has made it very easy to find people stealing your content, and I highly recommend setting Google Alerts like I do to help find things that might otherwise slip under the radar. But when you blatantly take content from someone else without so much as one brief line of credit, it is really a poor practice. I sent Mr. Wetzel a note (he has a \"contact me\" link at the bottom of his article) asking about this, but I doubt I'll get a response. I really don't care enough to pursue the matter further as I'd just like to get my views out there, even if someone else is taking the credit for them. I hope this serves as a notice to anyone else out there that may be improperly taking someone else's copyrighted material (when it is written, it is copyrighted, correct Sarah?). It is very easy for the person that originally created the content to find you. :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Search Engines Make It Hard to Plagiarize"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Search Engines Make It Hard to Plagiarize"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joe Rozsa\n          \n            Joe Rozsa"
}