{
  "url": "https://moz.com/blog/why-roi-is-the-king-of-kpis-and-how-you-track-it",
  "slug": "why-roi-is-the-king-of-kpis-and-how-you-track-it",
  "title": "Why ROI is the King of KPIs -- and How You Track It - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEO is an industry full of numbers and exotic metrics, all of which can be used to paint a picture of the success (or not) of an SEO/PPC campaign. There are so many that it's actually pretty easy to get lost in the numbers, and no matter how bad things are getting, you are always able to find a…",
  "content": "Why ROI is the King of KPIs -- and How You Track It SEO Reporting M By: matthew taylor October 14, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: matthew taylor October 14, 2011 Why ROI is the King of KPIs -- and How You Track It SEO Reporting This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. SEO is an industry full of numbers and exotic metrics, all of which can be used to paint a picture of the success (or not) of an SEO/PPC campaign. There are so many that it's actually pretty easy to get lost in the numbers, and no matter how bad things are getting, you are always able to find a positive somewhere. It's amazing how important some random measures suddenly become when it comes to writing a monthly report or when you are sitting in a client meeting. \"Great news, we have managed to increase your domain age!\" The Most Common KPIs and Why They Are Ultimately Pointless Working for an agency you invariably end up working with a diverse bunch of clients and they all seemingly want you to report on slightly different things. So what are the most common ones, and, more importantly, why you shouldn't you focus on them? Rankings I have to admit that when I started in SEO I was absolutely obsessed with my clients rankings, all I cared about was if they had gone up and by how much, and to a certain extent I still am (a throwback to my sales days, I guess). The main reason for the ranking obsession in the SEO world is that they are a very obvious and easy thing to track and, due to the hype surround ranking 1st for a term, it's what a lot of people see as the holy grail of SEO. So why shouldn't you focus on rankings? Well the main reason is that a ranking guarantees you nothing - not even traffic. All it does is increase the likelihood of extra traffic. At some point, most SEOs will have worked long and hard to achieve a great ranking for a related term with huge search volume, only to find it doesn't provide any visits. Additionally, no matter how many rankings you report on, it is only ever going to be a snapshot. For example, the SEOptimise blog receives visits from well over 10,000 keywords. If we are running a ranking report based on 100 terms, how representative is it going to be? So, although rankings look good, they mean squat. Visits/Page Views/Time on Site Another staple of the SEO reporting world are KPIs that focus on the levels of traffic and how long people spend poking around your site. At this point a few, if not all of you, will be shaking your heads in disagreement/disbelief, thinking that extra site traffic is great. Don't get me wrong; it's great getting to tell a client that site traffic has quadrupled overnight. But like rankings, increasing traffic doesn't necessarily mean anything and isn't guaranteed to help clients achieve their goals. The problem with setting KPIs for traffic or similar measures is that they are too easily affected by external factors, and more traffic doesn't necessarily mean more sales. For example, at one time, one of our clients featured regularly on news sites as a result of making hundreds of people redundant. The result of this was a massive boost in traffic, time on site, contact form submissions - pretty much every measure of site performance. To our clients this looked great - we had smashed all the KPIs they cared about. The problem for them was that none of the traffic generated any turnover; in fact it was quite the opposite. The other problem with it is that it is too easy to \"game\". For the less scrupulous SEOs, it is too easy simply to buy traffic. Not wishing to give anyone ideas, but if you are struggling to hit your traffic KPI, for $5 you can get 10,000 unique visitors from this Fiverr gig - problem solved! Well, right up until the point your client realises that none of it converts. Conversions If you disagreed with my last point, you definitely will when I tell you that web conversions, for a lot of companies, is a bad KPI to focus on to. Before you stop reading, here's my reason why... ...not all conversions are created equal, some conversions don't actually convert, and of those that do, not all of them generate income. If, for instance, a site is focused on lead generation, then the quality of the lead has a big impact on whether a conversion is actually a conversion. Analytics packages would tend to class a conversion as somebody who fills a form. But what happens if none of the enquiries received can afford the service/product, or are spam bots? Your data may show that you have a healthy conversion rate, but you aren't actually getting any business. Equally, the cost per conversion could be higher than the price of the product itself, meaning that you are getting quality conversions but at a loss. Finally, some of the conversions being measured may not have a tangible value, such as newsletter sign-up or number of pages viewed. In all of these cases, using conversions as a KPI to measure success would be fairly pointless. The KPI You Should be Tracking I believe that the main KPI that should be tracked is return on investment (ROI). In addition to being a quantitative measure, by its very nature ROI naturally includes quality indicators. For example, traditionally a campaign that dramatically increases rankings, traffic and conversions would be considered a success. But if you then go further and analyse the ROI, and find that it has decreased, it will indicate that the quality of the traffic and conversions is poor and the campaign is actually a failure. On the flip side, a campaign which does little to rankings, traffic or conversion rates may traditionally be considered a failure. However, if you then look at the ROI and it has shown an increase due to the quality of the conversions being better, then the campaign would be considered a success. Difficulties in Trying to Track ROI So before we all go and jump on the ROI bandwagon there are some practicality issues that need addressing. The biggest one is that it is difficult to measure accurately. The multichannel nature of sales and the length of the buying cycle can make proper attribution of sales difficult for a number of online companies. An SEO campaign may improve the ranking of a non-brand keyword, which then results in an initial visit. The visitor then leaves to carry out a price comparison search externally and returns using a brand search term, and then finally places an order by phone. The majority of companies would probably attribute the sale to telesales or maybe brand search, whereas it should be attributed to the original non-brand term and the SEO campaign that preceded it. This then means that that the ROI for the SEO campaign is lower than it should be and essentially makes it no more useful than the other methods discussed. Even worse, it may appear to be having no effect at all and it is wasted money. Solutions for Improving Sales Attribution and Tracking ROI So how do we overcome these issues? There are a number of tools and solutions available that can help to make ROI easier to track accurately, by improving sales attribution. First Touch and Multi Touch Attribution One of the more established methods of sales attribution for online campaigns is first touch or, for the more advanced, multi touch attribution. The quick explanation of this is that it uses Google Analytics and some cookies to pick up the first way a visitor found your site rather than the standard implementation of the last way someone found your site. For the long explanation and a bit more practical help, you can checkout this post by Will Critchlow. Call Tracking and Auestions Call tracking has been around for ages, and in fact predates the internet, so is definitely nothing new. Despite its age, it is nonetheless incredibly useful for sales attribution. Call tracking, such as Telmetrics and AdInsight, works by presenting different phone numbers to site visitors, allowing the method of discovery to be tracked and the call to be attributed to the correct sales method. For example, you may assign different numbers to be displayed to visitors from organic and paid search, brand and non-brand search, or site referrals and direct entry. You can even display a unique number to each individual user, allowing you to track their complete customer journey. The only drawback to this is the inconsistency of contact details, which can affect local search listings. If you don't want the additional cost that this entails, the low tech and free version of this is getting your call operators to question callers on how they found the site. The drawbacks to this approach are that it is less likely to be accurate, it could be forgotten and may annoy callers. Email Marketing There are plenty of ways to make sure that you are tracking your email campaigns accurately, but one of the simplest is using campaign tags in Google Analytics – check out either of these two posts, one from the Google blog and one from the SEOptimise blog, if you want to find out more. These allow you to track exactly which campaigns are successful and which aren't; you can even track right down to which link in an email is used to click through. If all that seems a bit too much like hard work, you can always use services such as MailChimp and AWeber, which can set campaign tags in your emails for you. CRM or Other Sales Tracking Software Combining the methods detailed above will get you most of the way to being able to correctly attribute sales and accurately calculate your ROI, and for a lot of online retailers who sell immediate purchase products this will probably be as far as they need to go. However, for companies with longer lead times there is a final piece to the jigsaw: CRM. For long lead time sales, if you plug all the data from Analytics and your call tracker into CRM systems such as Salesforce, Workbooks and Microsoft Dynamics, you can then add the final bit of the jigsaw, the quality component. By being able to track the life of a lead through to its conclusion, either sale or not, you'll be able to see an actual conversion rate, rather than the assumed rate you get from Analytics and AdWords. Working in an SEO agency some of the most difficult discussions to have are trying to reassure clients that the tactics being employed, or the ones you want to employ, are working and are the best use of their money and your time. Having accurate ROI information both to back you up and prove your worth can make those conversations a hell of a lot simpler. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why ROI is the King of KPIs -- and How You Track It"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why ROI is the King of KPIs -- and How You Track It"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Value of SEO Beyond Traffic and Leads — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Ensure a Flawless GA4 Setup and Ongoing Tracking Functionality"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "matthew taylor\n          \n            matthew taylor\n          \n            matthew taylor"
}