{
  "url": "https://moz.com/blog/why-i-despise-rfps",
  "slug": "why-i-despise-rfps",
  "title": "Why I Despise RFPs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "RFPs (Request for Proposal) are industry standard in marketing, communication and other consulting service-type organizations in the business world. But lately, as I've looked over a dozen or so that have been sent my way in the past few weeks, I've discovered something intriguing about…",
  "content": "Why I Despise RFPs Public Relations By: Rand Fishkin March 27, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 27, 2006 Why I Despise RFPs Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. RFPs (Request for Proposal) are industry standard in marketing, communication and other consulting service-type organizations in the business world. But lately, as I've looked over a dozen or so that have been sent my way in the past few weeks, I've discovered something intriguing about them... They're evil. The RFPs I've gotten (with the exception of a few wholly reasonable and respectable requests) typically follow a structure designed to grill and intimidate smaller companies and individual consultants while rewarding needless paperwork and excessive self-promotion (an area where many of the worst large firms are particularly skilled). Here's some traits of a few RFPs we've received that highlight the worst of these: List ten companies in our sector/field that you've worked with, what you've done for them, how long the success took, how you measured it and what the results were._News flash - that's all confidential information, right down to the names of most of our clients (only about 10-15% of SEO clients in my experience are willing to share their company name publically, or even privately as part of your marketing). I won't even go into why it might not be a good idea to work with an SEO who's done jobs for ten (ironic number, no?) of your direct competitors._ Describe, in detail, how this project will be completed, how many in-house and outsourced workers will assist, how many hours each will put into the project and a map of the time schedules over the course of the work._Once again, this is all private, internal information. I should send out an RFP like this to the top 20 SEO firms just so I know exactly how to compete against every one._ List the techniques and processes your time will use to accomplish the goals. Include specific details and provide sources of research/reference that prove the effectiveness of your methodology._Yeah... right. RFPs, when done right, should provide about as much information as a personal email, written by the executive or team who needs the work done. It should tell the vendor what the goals are, what the time frame is and the criteria used to judge potential vendors. From there, the proposal that shows the best creativity and price can be weighed against the trust and reputation of the firm and the right provider can be selected. In a world like that, great vendors get the projects and SEO chop-shops with nothing but a savvy sales team doesn't reap the rewards of their BS-ing ability. But, sadly, we live in the corporate world of RFPs. So, if you're wondering why SEOmoz (or ten other folks you contacted off my recommended list) isn't bidding your project, wonder no more. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why I Despise RFPs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why I Despise RFPs"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}