{
  "url": "https://moz.com/blog/why-local-business-dont-need-big-budgets-for-their-content-marketing",
  "slug": "why-local-business-dont-need-big-budgets-for-their-content-marketing",
  "title": "Why Local Businesses Don't Need Big Budgets for Their Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Time and again we hear the same old argument that we shouldn’t be building links, but that we should be focusing on developing exciting and unique content that encourages organic linking all by itself. I completely agree with this statement, but I see businesses misinterpret this far too often.",
  "content": "Why Local Businesses Don't Need Big Budgets for Their Content Marketing Content Marketing By: Matthew Barby September 4, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Matthew Barby September 4, 2013 Why Local Businesses Don't Need Big Budgets for Their Content Marketing Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Time and again we hear the same old argument that we shouldn't be building links, but that we should be focusing on developing exciting and unique content that encourages organic linking all by itself. I completely agree with this statement, but I see businesses misinterpret this far too often. If you run a local business and have a relatively small budget for your online marketing, is spending that money on a flashy infographic going to be the best use of your resources? More often than not, it isn't. Big brands vs. local businesses The marketing goals for local business and multinational brands are often quite similar in basic principle—they want to establish their brand name as a leader within their field and the geographic areas that they serve. The big difference here is that a local business is looking for large levels of brand exposure to their customers on a micro-level (i.e. they want to reach their customers within the local area that they serve). Major brands also want maximum brand exposure to their customers but on a macro level—they want to be recognised the world over, and to do this they need to spend big on reaching everyone. This is where the content of these two types of businesses becomes different. Content is EVERYTHING When we think of \"content,\" we typically think of articles, webpage text, and imagery. This is one of the greatest reasons for failure within content marketing campaigns. Having a very linear and restricted view of what content is will only restrict and inhibit results. Content is the staff within your business. Content is the design of your shop/office. Content is your products and services. Content is the menus on your tables. Content is your company values. Content is your customers. Content is EVERYTHING. Let me elaborate a little on the points I've made above. Let's take the example of a local coffee shop (you can take a look at the discussion I had on inbound.org about this as well). Turning your staff into content Most local businesses are heavily focused around delivering a high level of customer service to gain positive feedback for their business. Herein lies an amazing opportunity for content that will boost the awareness and reach of your brand. Within a coffee shop business, the staff are just as important as the food/drink itself. In some cases they are more important. If you have built in strong customer service that sets you apart from your competitors then, believe it or not, people will talk about you. Considering the work that goes into building local citations and reviews for SEO, utilising your staff to encourage these makes sense. Getting creative with your staff source: http://www.flickr.com/photos/hootersgirls/7735589086/in/set-72157630960120760 For years, major international brands have been looking at ways to differentiate themselves from their competitors. Just look at the likes of Hooters; everyone knows about them because of their staff and the outfits that they wear. One simple thing that has got them where they are today, and that has become one of the most iconic pieces of content within the restaurant industry is the Hooters uniform. I'm not saying that you should start making all your staff wear hot-pants and revealing tops—as fun as that might sound, but what I'm saying is that you can give your staff a unique edge that makes them a piece of creative content. For example, I visited a coffee shop a few weeks back and some of the staff had aprons on with a big QR code on the front that said \"zap me for a 10% discount.\" When you scanned the QR code you had to like their Facebook page and the member of staff would give you a discount there and then... awesome! Turning your shop/office into content Like with your staff, your business premises can become an awesome content example. With the example of a local coffee shop, it's easy to get creative on a small budget to gain attention—create a unique style and do something different. Also, make it easier to tie in your offline presence with your online presence. For example, you could have your Twitter handle stenciled onto the wall. If you want to get really creative then you could have a chalkboard where you write out your recent tweets as they happen in chalk—this would certainly engage your customers within the shop and I can guarantee it would get people talking about you. Design your space to be unique and it could become one of the best evergreen content assets that your business could have. The above photo is one that I took whilst visiting the Shakespeare and Company vintage bookstore in Paris. I read somewhere that this is one of the most photographed bookstores in the world - you will see why when you step inside! Photo: by http://www.camenzindevolution.com at http://mz.cm/17CDwr4 (used with the copyright holder's permission) This is just what many major international brands do—the above image is from the Google Tel Aviv office, and yes, that's a slide! I remember when I visited the Burberry offices in London a couple of years ago and they had a catwalk in the lobby area with models walking down it all day—that certainly got me talking. These ideas are completely relevant and applicable to local businesses, and they don't necessarily need to involve huge slides or catwalks! Your products are content The products and services that you offer can both be used within other content or as creative content in their own right. You don't need to have the most unique product in the world, and sometimes this isn't actually possible within standardised product industries. Let's look at a coffee shop, for example. We might say that our coffee shop sells a range of different coffees, some sandwiches and a selection of cakes/pastries. The first thing you would think of to make them stand out from the competition is quality. The only problem here is that it's hard to show the quality of these products to someone who hasn't actually tasted them; plus, when all of your competitors claim to have the \"best quality products,\" it can be hard to stand out. With this in mind, why not try something a little different... source: http://www.flickr.com/photos/krobison/3346410954/ I know, pretty awesome isn't it? Apparently \"latte art\" is pretty popular, and to be honest, if that was served in front of me, the first thing that I'd do would be to take a picture and share it on Facebook/Twitter. source: http://www.flickr.com/photos/jamieanne/3991004528/ Seasonal product themes can be another fantastic way to augment your current product offering and turn it into creative content. At the local coffee shop that I go to, they create crazy cupcake variations on Halloween and decorate the whole shop. That's just asking to be talked about on social media and can result in some tasty links as a byproduct. Your product/service collateral can be content I'm guessing that you can see where I'm starting to go with this idea that anything can be content, no matter how boring it is. Let's take some food and drink menus as an example. In its purest form, a menu should deliver the goal of displaying what your business has to offer to your customers. Now, when we bear in mind that over 90% of the customers in a coffee shop are going to take a look at this menu, there is a huge opportunity to get creative. The above video shows how the Global Mundo Tapas restaurant in the North Sydney Rydges Hotel has replaced all of its menus in favour of actual iPads. The customer can view the whole menu, get more information on each of the different dishes and they can actually place their order live on the tablet. There could be huge potential for linking this in with social media and really connecting the link between online and offline interactions with customers. Another great example is from Duo restaurant in New York. Their menus actually light up when you open them, which makes them look pretty awesome. Again, this has resulted in the restaurant being mentioned on several niche-relevant blogs that will boost their rankings and give them a wider reach for their brand (it made me notice them, and I'm on the other side of the world!). The branding of your business is content The values, culture and vision of your company says a lot about your brand. Multinational brands use their slogans as one of their most valued content assets. If I mentioned \"Just Do It\" or \"They're Gr-r-r-eat!\" then you would know exactly which companies/products I'm talking about—this can be the same for local businesses, but on a different scale. One hilarious example of some amazing branding was from a local sofa company near the place where I grew up, called \"Sofa King.\" They drove around in these big white vans every day that had \"Our prices are Sofa King Low!\" written on them. They got loads of press coverage from this because they were told they had to remove them and actually got a mention on the TV as well. This may not be the most transferable example but I love telling this story to people because it's just so funny! Another great way that a lot of cafes and restaurants can use their company values to build content is by partnering up with higher welfare suppliers and institutions. If we look at the likes of the Rainforest Alliance, an international charity focused around conserving biodiversity and improving the working conditions of third-world suppliers. They actually offer a way to certify your business as being Rainforest Alliance approved. This can then be used to build some positive PR around the business, especially within local publications. Your customers are content Yes, that's right... your customers are content too. If you run a local business then you're likely to be customer-facing a lot of the time—why not take advantage of that? I worked on a recent campaign with a UK restaurant chain where we ran a competition to eat free for a year at the restaurant. All you had to do to enter was like the Facebook page, send a tweet (that we had pre-defined) and also give some feedback on their experience at the restaurant. We ended up with over 10,000 entries into the competition and the Twitter account was going crazy for weeks. We ended up driving back some good quality links to the website in the process by running an effective link prospecting campaign alongside this, but more importantly we grew the social following dramatically and had loads of people talking about the brand. Another tactic that I've used in the past, and a tactic that could be used within the coffee shop example, is to bring in a group of bloggers and let them eat for free in exchange for writing up a blog on their experience. It's important to keep things impartial here, but getting a write up from a respected blogger can do wonders for your brand and will be an awesome link back to your website—it doesn't cost a lot either. Content is EVERYTHING As you've probably now realised, content doesn't just mean blog articles or infographics. Content can come in the shape of all sorts of things, both online and offline. The important thing is to understand the end goal of your content marketing strategy and how this then ties in with your social media and SEO campaigns. When run on their own, content marketing, SEO and social media can be very expensive for local businesses, but when you integrate these together and take full advantage of the resources at your disposal, it will be both cost effective and bring in far greater results. This doesn't need to apply to just local businesses either. A perfect example of this is with the post that I wrote for Moz a short while ago that was a case study on the link building campaign that I carried out for my travel blog. Case studies are a fantastic way to squeeze out more links to your website and can be awesome pieces of content that can apply to blogs, major brands and small businesses alike. A few actionable content ideas for local businesses Your staff: Have your staff wearing unique uniforms that will get people talking about your brand. Encourage your staff to interact through social media with customers. Record videos of your staff at work that shows off their expertise (this could be a tutorial video on \"how to bake the perfect cupcake,\" or \"how to spray your car bumper\"). It doesn't have to be amazing production work; an iPhone will often do the job here. Leverage your highly skilled staff within the business to become well-known figures within their niche. This can be through holding small meetups with the local community, through answering questions within niche-relevant forums/social media groups or putting together weekly recipe cards. Run themed events on-site and have your staff live tweet with updates throughout. Encourage creativity from you staff and create a working environment that promotes spontaneity—take a look at this article to see what I mean. Have your staff speak at local events. Your premises: Create a funky design to your office/shop that is going to invoke conversation. \"Socialise\" your shop front by including your social media accounts within the décor. For example, having your Twitter handle stenciled on the wall. Offer free WiFi to customers on the condition that they \"like\" your Facebook page. Go old school and have a chalkboard Twitter feed that your staff will write updates on by hand throughout the day. Have a live feed of the shop/office running all day on your website. Run themed nights where you decorate the whole place up in a unique style. Make sure you take loads of photos and share them across your FB/Twitter/Instagram/Pinterest. Your products: Offer discounts on your products when a customer shares them via social media. Differentiate them in a way that will invoke an emotional response from your customers; for example, latte art. Create seasonal product range themes that will get mentioned. Send out free samples of your products for review to bloggers. Run small focus groups to get feedback on your products/services. Record the whole focus group and post the video through your YouTube channel. Even better, run a live Google Hangout focus group and do the whole thing online. Run some promotional coupons and submit them to coupon/discount offers directories. Run product giveaway competitions that require social engagement to enter. You can also do these to gain feedback on products and then share your results within a short blog. Product/service collateral: Spice up your menus and include social media links within each of them. Add QR codes to the bottom of your till receipts. Create 101 guides and eBooks that are related to your niche. Your Branding, Values and Culture: Do something controversial. It doesn't work for everyone but it can be one of the quickest ways to get your brand out there. Partner with local charities and schemes. Sponsor local events. Create a unique and recognisable slogan for your business. Create mascots for your business and give them a full back-story. You can even go to the length of giving them a social media account and start tweeting as them. Look at Roger Mozbot as an example. Your customers: Run surveys and polls with your customers and publish the results on your website and social media accounts. Encourage customers to engage with your brand on social media whilst they're with you for an incentive. Run weekly giveaway competitions on Facebook that involve your customers having to tag a friend in the comments of the post and sharing it to their friends. When they receive their free product/service—get a photo of them and post it across your social media page. Have a ‘customer of the week' that you single out and give a freebie to or record a special thank-you video for their custom. Invite a group of bloggers into the shop for some free product testing and ask them to blog about their experiences. Run a weekly/bi-weekly/monthly live Google Hangout with some of your loyal customers (you may have to incentivise them) to get feedback on their experiences and post it to your YouTube channel. Some comments from our Inbound.org discussion Victor Pan: Content for content's sake doesn't work. ‘Doing' SEO without knowing what you're doing doesn't work. However, both methods work when executed correctly. It's not whether or not it is done, but rather how it is done. Time is scarce for small businesses. They don't have time to learn the ‘how' and execute it correctly on their first try. All too often, they visit the wrong neighbourhood on the web and do what they've learned... or hire the wrong people. Bad blogging (scraping/plagiarism/panda) can get you penalized just as well as bad links (irrelevant neighbourhoods/fishy anchor text/penguin) - so I wouldn't be so quick to say one is better than the other, or that you need both. Have you run into a business that has gone through the hands of a rogue SEO who did low quality content spun from a competitor and a list of comment links from forums? I have. It's not pretty. If I had to choose, I'd say it's easier for small businesses to be smart about content generation. SEO? That's not part of their core business - it's inefficient for them to learn it beyond the absolute fundamentals. Martin Harris: Whilst the above analogies are great, i think the point here is how to get the best out the client's time. Ultimately it's what going to be getting them more traffic and if (like most of my clients) you pay an hourly rate; 3-4 hours a month of SEO specific time, content marketing, won't cut it. But here lies the problem; they should be treated as separate entities. Put it this way: would creating great promotional and traffic relevant content on social media drive more traffic or would ranking for a targeted niche relevant term? It's both. For small businesses, getting natural links from content marketing should be a by-product not a SEO strategy. Slava Rybalka: 1) as for me, content marketing involves both, and first of all, it's like you said, being creative and notice what is going on in your daily business operations and what you can turn into content 2) I have seen the same effect, however, I tend to focus more on content rather than links, because: 1. Links tend to disappear over time, whereas your contents stays on your site, you don't have control over your links but you have control over your content 2.if you have content that resonates with you target audience, great links will come naturally and recently we have seen the cases when few links can make a difference in search results, since Google is focusing more on quality of links. There are other things that come to my mind but these are 2 main points. View the full discussion here: http://www.inbound.org/articles/view/content-marketing-the-ultimate-seo-office-discussion TL;DR Leveraging the assets of your business through content marketing, and tying this in with your SEO and social media campaign can yield awesome business results. Big brand content strategies have similar goals to local businesses but they differ completely in execution. Get all your staff to wear Hooters outfits to work, jazz up the morning coffees with some latte art and install a slide into your office. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Local Businesses Don't Need Big Budgets for Their Content Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Local Businesses Don't Need Big Budgets for Their Content Marketing"
    },
    {
      "level": "H2",
      "text": "Big brands vs. local businesses"
    },
    {
      "level": "H2",
      "text": "Content is EVERYTHING"
    },
    {
      "level": "H3",
      "text": "Turning your staff into content"
    },
    {
      "level": "H3",
      "text": "Getting creative with your staff"
    },
    {
      "level": "H3",
      "text": "Turning your shop/office into content"
    },
    {
      "level": "H3",
      "text": "Your products are content"
    },
    {
      "level": "H3",
      "text": "Your product/service collateral can be content"
    },
    {
      "level": "H3",
      "text": "The branding of your business is content"
    },
    {
      "level": "H3",
      "text": "Your customers are content"
    },
    {
      "level": "H3",
      "text": "Content is EVERYTHING"
    },
    {
      "level": "H2",
      "text": "A few actionable content ideas for local businesses"
    },
    {
      "level": "H2",
      "text": "Some comments from our Inbound.org discussion"
    },
    {
      "level": "H2",
      "text": "TL;DR"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matthew Barby\n          \n            Matthew Barby\n          \n            Matthew Barby"
}