{
  "url": "https://moz.com/blog/why-it-doesnt-pay-to-game-digg-or-other-link-aggregation-sites",
  "slug": "why-it-doesnt-pay-to-game-digg-or-other-link-aggregation-sites",
  "title": "Why It Doesn't Pay to Game Digg (or Other Link Aggregation Sites) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With the popularity of sites like Digg, Del.icio.us, Reddit, StumbleUpon & others skyrocketing, website owners, marketers, bloggers and, of course, spammers are seeking to capitalize on the traffic these portals can drive. Many have taken to creating great content in the hopes that the members of…",
  "content": "Why It Doesn't Pay to Game Digg (or Other Link Aggregation Sites) Content Marketing By: Rand Fishkin October 3, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 3, 2006 Why It Doesn't Pay to Game Digg (or Other Link Aggregation Sites) Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With the popularity of sites like Digg, Del.icio.us, Reddit, StumbleUpon & others skyrocketing, website owners, marketers, bloggers and, of course, spammers are seeking to capitalize on the traffic these portals can drive. Many have taken to creating great content in the hopes that the members of these sites will appreciate it, but others have turned to manipulative practices in the hopes of cheating the systems. There's two fundamental problems with these attempts - first, that both humans & machine algorithms are keeping an eye on spam and second, that spamming Digg carries virtually no value. The first assessment isn't likely to inspire controversy or disagreement. It's well known that systems like Digg's use human participation, but many may not realize just how deep these mechanisms run. Link aggregation sites frequently have a team of moderators watching for spam, members who can report or flag entries as attempts to manipulate and even a site-appointed watchdog assigned to monitor submissions. The second assertion - that gaming Digg, even successfully, carries virtually no value - is hard for many to believe. However, a close look at the results of a front page Digg, a mention on del.icio.us/popular or a listing atop Reddit shows us that it's entirely true. Below, I've listed the primary benefits of making these lists and the reasons why these positive results don't apply to those who spam: Traffic - An average Digg sends us between 20-40,000 visitors over the course of a week, with the vast majority coming in the first 36 hours. This phenomenon exists with del.icio.us/popular, Reddit, Fark & others as well (though to a lower degree). These visitors are passionate about community, Internet news and often web development and publishing itself.So what is the value of getting 30,000 Diggers to your site? Branding. When 30,000 new visitors get to SEOmoz, I want them to come away thinking - \"Hey, that's a pretty good site for SEO. That Rand guy seems pretty smart.\" The goal isn't to get visitors to click ads or buy products, it's to have them remember SEOmoz. And, when we get mentioned at several of these sites 4, 5 or 6 times over 3-4 months, we're gaining a lot of mindshare and branding.If you game Digg, you get none of these benefits. The visitors might click, they might even start reading, but if you don't have truly exceptional content, you're spinning your wheels - no one is going to remember you or your site as being anything other than a waste of their time; that's not a positive brand association._ Links - In the SEO field in particular, many who seek to game the aggregation sites are hoping to achieve high search engine placement via a secondary factor that many may not realize is associated with making Digg's front page. Once a URL hits the Digg homepage, early research (that we're just now compiling) is showing us that 14 days later, Yahoo! reports an average of 500 new inbound links to that URL.What's happening here is what I like to call, the long tail of Digg (or del.icio.us or Reddit). Many thousands of Digg's readers are bloggers, journalists, site owners and web-savvy readers who control content of their own on sites of their own. If you have a great article Dugg, it generally means that many of these folks will start writing about you, linking to you and sending you additional targeted traffic. These links carry weight in the search engines, particularly if the title of the piece (and thus many of the incoming links) include important keywords and phrases that users search for. For example, right now, SEOmoz's posts on increasing blog traffic, HTML elements and interviewing web developers all pull in search traffic thanks to rankings for popular search phrases.However - if you're spamming or manipulating, no one is going to bother to link to the content. You won't rank well and you won't boost your site's link popularity - if the content wasn't good enough to make the top of the link sites naturally, there's little hope that anyone who manages their own content will link to it._ Advertising - Many bloggers and site owners are hoping that Digg can help propel their ad revenues by creating large numbers of impressions on banners or clicks on contextual ads. The bad news here is that the visitors that do come, though high in numbers are exceptionally low in commercial ad value.The link aggregation sites have, arguably, the most tech-savvy demographics on the web. These users DO NOT click ads. Less than 10% (from our metrics) stay on the site longer than 90 seconds (even if the article would take a normal person 3 minutes to read). Digg, in particular, has brought the lowest rate of RSS subscriptions per visitor group of any link we've ever had - under 1/10th of 1 percent. These statistics hold true for every site owner I've ever spoken to that has made it to the top of Digg or the other services. These users simply don't participate/contribute/stick around/click.Now apply those statistics to advertising - the results are dismal. The page views are extremely low, meaning those banner ads you serve on an impression basis are barely pulling their weight. Factor in the high number of Diggers who use ad blockers in their browsers and you're barely covering bandwidth costs. Clickthroughs on AdSense or other contextual programs are equally miserable - I've heard others indicate that a day atop Digg brought fewer ad clicks than 100 visitors from Google - no surprise there. If earning revenue is your goal, you need to create fantastic content that gets legitimately featured - the real earnings come when you get traffic via the engines and the other sites that link to you, not from the initial surge of uniques._ Conversions/Sales - With what we already know about the link aggregators' demographics, it should come as no surprise that getting these visitors to buy is like finding a needle in an ocean. Once again, the goal has to be to build a relationship with the audience - entice them to visit your site in the future and think of your brand as an exciting, dynamic one that's in touch with their needs. Then, in the future when they do need your products or services, that positive brand association can help to steer traffic your way. I've had more than a few clients say they first saw us on Digg (or del.icio.us) and started reading the blog after a few mentions, then got excited to see what we could do for them. Guess what - these are the best kinds of clients in the world - they love your brand, they're excited about what you have to say and they're already 90% through the sales cycle. Gaming Digg gets you nothing, but building great, naturally Digg-worthy content has direct rewards. So where do we draw the line? What are the rules on spam vs. natural results. On the far extreme, there are those who would say that any use of these services by anyone related to the content being discussed or promoted is spam. I'm of a more moderate opinion and I think the following guidelines are clear enough and broad enough that anyone who follows them should stay trouble free. Yes, you can submit your own contentThe rule to remember here is that you absolutely should not submit more than 2-3 pieces per week. If you starting posting every entry to Digg, Reddit and StumbleUpon, the administrators and moderators are going to get mighty suspicious. This limit doesn't apply to sites like Del.icio.us or Spurl; they're designed to accept any and all submissions. Do not have everyone at the office \"Digg\" itFirst off, most offices share a single IP address, so even if you do all have individual Digg accounts and you really do all think the content is Digg-worthy, don't go trigger happy. Again, moderators will see 20-30 Diggs from the same IP and raise their eyebrows. Instead, if you really all do want to Digg something, go home and do it there - my view is that if your co-workers are really that excited about something that they'll do it on their own time, that's reasonably fair. Just watch out - if you're the only Diggers of the URL and the 30 of you are based in Billings, North Dakota, the spam filter will probably still catch you. If you're in Seattle or New York or the Bay Area, you're probably fine. Avoid having the same group Digg time and againEven if you have an email group of 50 friends who all Digg content together, you can be targeted for attempted manipulation. Spotting patterns of the same Diggers voting on the same content is a cakewalk. Don't build bots to Digg for youThis is an obvious one. We've already illustrated that low quality content won't get any value out of being Dugg, and the users of the site will probably be clicking thumbs down faster than you can churn out crap content, so find a better use for your time. If that doesn't convince you, just remember that along with the above two ways of making yourself look suspicious, having 50 new accounts generate Diggs for one particular site over and over looks awful fishy, too. Submit only your best materialBefore you start submitting content, read the entries that do make the top of the charts and see what types of pages you find. If you've got something equally clever, relevant and interesting to offer, go ahead. If not, go back to the drawing board. The highest value comes from phenomenal quality material. It's almost not worth your time if you're only going to get 80 Diggs, a few visits and a lot of people in the comments voting your site down. Design intelligentlyKnowing that link aggregation users are incredibly web-savvy, consider turning off ads while the rush is hitting the site. You'll also benefit if you provide high-relevance links to other articles/blogs/pages on your site (and possibly improve on the typically awful browse rate). Don't spam the commentsUsing the comments at Digg/Reddit/StumbleUpon to bring participants into your pages is OK if you're providing on-topic, worthwhile material. Be wary of linking just for the sake of the traffic boost, though - it's another way the moderators can track down people who might be abusing the system. I've been giving out this advice for several months now, but it's good to have it on the blog. I'm guessing there are a lot of sites aspiring to the top of the link aggregators out there; hopefully you'll heed the recommendations and make it big on your own merit. p.s. I just saw that Loren Baker reported on an automated Digg spam system. Save your $71 and invest it in content creation. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why It Doesn't Pay to Game Digg (or Other Link Aggregation Sites)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why It Doesn't Pay to Game Digg (or Other Link Aggregation Sites)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}