{
  "url": "https://moz.com/blog/why-google-analytics-is-winning-the-web-analytics-war",
  "slug": "why-google-analytics-is-winning-the-web-analytics-war",
  "title": "Why Google Analytics is Winning the Web Analytics War - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With the latest announcement of Coremetrics being sold (or resold if you want to be technical) to IBM, nearly all the major players in the Web Analytics industry are exiting as...",
  "content": "Why Google Analytics is Winning the Web Analytics War SEO Analytics M By: Micah Fisher-Kirshner July 16, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Micah Fisher-Kirshner July 16, 2010 Why Google Analytics is Winning the Web Analytics War SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. With the latest announcement of Coremetrics being sold (or resold if you want to be technical) to IBM, nearly all the major players in the Web Analytics industry are exiting as Google Analytics eats up profits with its free product. What is so special about Google Analytics that it has torn up the web analytics market such that two major players, Omniture and Coremetrics, can no longer support themselves leaving only WebTrends and Unica behind? First, let’s go straight to the bottom line: Google Analytics is a great free product gulping up the lower end of the value chain of businesses that just need a basic level of web analysis for their marketing efforts. Google critter credit: http://www.seomofo.com The long tail of websites that could afford the high price of the paid services saw the value proposition fundamentally change. Instead of paying a large amount to even have any access to data, you now pay the same price for the marginal value of detailed access to data. Essentially, when something free comes along customers think in marginal terms and without either steep price reductions and/or huge new benefit increases, customers begin to leave in droves. Yet, there is still a hidden cost that is sometimes forgotten with free products. Enterprise data level companies (Note: as an example and as a disclaimer, I work at Become.com) that can build their own internal data warehouse but need a back-up data source to double-check for web data, no longer need to purchase expensive packages. In this way, Google Analytics is chomping in different directions into the profits of the web analytics industry. Second: Of course, price alone will not mean anything if a product is a piece of junk. That’s where Google Analytics does its job of hitting into the web analytics market. Google Analytics provides a better standard (without backend customization) level of reporting and analysis than either Omniture or Coremetrics. Need to know how your SEO campaign is doing, by landing page and keyword during the month of July for visits over 50? Done. Need that information from Omniture or Coremetrics? Go talk to the engineers to see if it can be implemented later on. Need to slice and dice that data further? Advanced Segments and Custom Reports for free. Omniture? Buy Discover. Coremetrics? Use up more of your paid credits (and hope you make no mistakes). Image credit to: http://www.kaushik.net/avinash Third: Every online marketing division has some package to use (eg: PPC and AdWords), except SEO. SEOs (Another disclaimer: I am an SEO Manager) are stuck with relying on a web analytics package and if SEOs cannot analyze organic landing pages out of the box nor learn how to use the analytics package without occurring costs, we will not be promoting the product. Google Analytics has a free forum and free help articles that while nowhere perfect, is out there with free promotion for Google Analytics. More promotions, more good will, more talk outside the hard core users (without the technical jargon) means more people switching over. Lastly, think that those purchases by Adobe and IBM will save them? It’s only going to get worse if they stay as a paid product without massive changes. Acquisition means time spent integrating into Adobe or IBM and time away spent on innovating; and the larger the company, the higher likelihood for bureaucratic impasses. In the time Adobe or IBM work on integrating their acquisition, Google Analytics has figured out ways to chomp at non-profits, education, and government websites! Lucrative areas continue to be eaten by Google Analytics and unless the paid packages realize how brutal competition is against free, they will continue to lose this war. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Google Analytics is Winning the Web Analytics War"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Google Analytics is Winning the Web Analytics War"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Micah Fisher-Kirshner\n          \n            Micah Fisher-Kirshner\n          \n            Micah Fisher-Kirshner"
}