{
  "url": "https://moz.com/blog/why-your-public-relations-department-should-be-great-at-link-building",
  "slug": "why-your-public-relations-department-should-be-great-at-link-building",
  "title": "Why Your Public Relations Department Should Be Great at Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A week or so ago, I met up for some Christmas drinks with some fellow London SEO peeps. One of the folks was more than a little frustrated at how his PR (for now this means public relations, not page rank) team was hindering rather than helping his SEO efforts.",
  "content": "Why Your Public Relations Department Should Be Great at Link Building Link Building H By: Helene Hall December 30, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! H By: Helene Hall December 30, 2008 Why Your Public Relations Department Should Be Great at Link Building Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. A week or so ago, I met up for some Christmas drinks with some fellow London SEO peeps. One of the folks was more than a little frustrated at how his PR (for now this means public relations, not page rank) team was hindering rather than helping his SEO efforts. Back when I used to work in offline marketing, I worked pretty closely alongside the PR team and it got me to thinking that these guys should not only be helping in a company’s link building efforts, they should really be leading the way. First and foremost, let’s consider what the role of the PR department is: A traditional PR department is tasked with generating positive column inches in printed press publications. Typically they count up all the column inches generated, and put a figure on the value. This figure is traditionally calculated based upon what it would cost to purchase said column inches if you were to place an advertisement. So how do PR departments do this? They have fantastic contacts at relevant publications They have really good relationships with these guys and gals. On a slow news day our PR team often got a call from the writers of these publications – they were looking for help / ideas with articles. They write terrific press releases There’s not much you can teach a good PR about writing good copy. They keep it short, sweet and to the point, 100% relevant and interesting to their audience, and they find the angle in the story so the writers don’t have to. They make it *really* easy for others to make use of their material. They make themselves available The team is always on call to comment / offer stats, etc. They follow up Now it strikes me that these are all skills which good link builders / link baiters use. So the question is – how can we engage PR teams? In the current climate I think it’s fair to say that everyone has to justify their existence. Now, with this in mind, I would suggest that it’s pretty easy to put a monetary worth on links. Sure, not all links are of equal value, but we can account for this when applying a monetary figure. So we brief the PR team. Sure, this is a little different to what they’ve been doing traditionally, but it’s only a different media – the game’s the same. We can show them how we would typically go about sourcing links. We put in place a monetary value through which they can prove the efficacy of the activity that they’re undertaking. Clearly none of this is easy – there may well be resistance – but why not see if you can negotiate a trial – agree to give it a bash for a month or two and see how you go. The PR team is probably unlikely to be able to take over link building in its entirety, but every little bit helps, right? I’d be really keen to hear your thoughts on this – has anyone had any success with using a PR team to build links? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Your Public Relations Department Should Be Great at Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Your Public Relations Department Should Be Great at Link Building"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Helene Hall\n          \n            Helene Hall"
}