{
  "url": "https://moz.com/blog/why-i-still-do-guest-blogging",
  "slug": "why-i-still-do-guest-blogging",
  "title": "Why I still do Guest Blogging - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Despite what Matt Cutts wrote, here is why I still guest blog.",
  "content": "Why I still do Guest Blogging Blogging By: Asif Dilshad January 30, 2014 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Asif Dilshad January 30, 2014 Why I still do Guest Blogging Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The SEO community is quite sentimental and often exaggerates many issues. You have experienced this situation many times in your SEO career, but enough is enough. Now stop blaming Google and start blaming yourself. “Abuse of anything can be dangerous”, but as SEOs, we often overlook the statement and mishandle every SEO technique. We already ignored the core value of guest blogging a while ago but still stretching it to limits. At-last Google’s spam protection teem make his mind to stop this sh** and give the clear statement. May be we can see another animal from the Google Zoo which eats all our low quality guest posts. Let’s have a look on Matt Cutts' wording again. “Okay, I’m calling it: if you’re using guest blogging as a way to gain links in 2014, you should probably stop. Why? Because over time it’s become a more and more spammy practice, and if you’re doing a lot of guest blogging then you’re hanging out with really bad company. Back in the day, guest blogging used to be a respectable thing, much like getting a coveted, respected author to write the introduction of your book. It’s not that way anymore” But then again I’ll still do guest blogging why let me explain. Why I still do Guest Blogging Each link building technique has a byproduct which we often overlook. These byproducts are much powerful than the original benefits. When you look at the Matt Cutts' wording, it clearly indicates that guest blogging for links is dead but if we take guest blogging as a business technique, we can still use guest blogging. We just have to ignore the link prospect from it. Here are some byproducts which encourage me to continue guest blogging. Free Advertising It gives the opportunity for free advertising. I know, you can say writing a good guest post will take time, research, and effort, which all have their own value. When you do the math you can easily understand it’s almost free as compared to original advertisement cost. With a guest post, you will be featured in front of their audience in all forms i.e. on their blog, their social media account and on their RSS subscribers which otherwise cost you a lot. Let’s do the math of the advertisement cost of Search Engine Journal. But you can have permanent advertisement using guest post with just1-2 hours of writing, costing you just ~ 300 - 350$. Side note: Advertisement doesn’t increase the credibility but guest posts do. Diversify Traffic Sources As we know, search engines are leading traffic source, but what happen if your site suddenly gets penalized and causes you to loss all your business? However, if you have some other source of traffic, you can still have some time to rethink your business strategy and regain your search position. Anyone who has personal experience in doing guest posts for leading sites can tell how much targeted traffic a leading blog can shift towards your business. Referral traffic from guest posts often exceeds the search traffic of same day. Here is an example of my personal SEO blog. You can clearly see over 70% of my traffic comes from referral sites, and all of them are through guest posts. I do not have any fear of a Google penalty anymore until my search traffic exceeds my referral traffic. Side note: I knew it’s difficult to beat big SEO giants in search so I chose other way to survive. Build Relationships The best thing about the guest blogging is relationships, which we often ignore. Strategies would not fail if we humanize it. Here is the example email shared by Matt Cutts: “My name is XXXXXXX XXXXXXXX and I work as a content marketer for a high end digital marketing agency in [a city halfway around the world]. I have been promoting high quality content in select niches for our clients. We are always on the lookout for professional, high class sites to further promote our clients and when I came across your blog I was very impressed with the fan following that you have established.I [sic] would love to speak to you regarding the possibility of posting some guest articles on your blog. Should you be open to the idea, we can consider making suitable contribution, befitting to high standard of services that your blog offers to larger audience……” Can this build an ethical relationship? Obviously not, so instead of reaching out the random, blogger you can reach out to your friend. To survive in today’s era of guest blogging, you have to add one more step in your strategy. Before reaching out for guest post you have to be a friend of a blogger because leading blogs will not publish a guest post from a stranger. This strategy is little bit time consuming and difficult, yet it increases the chance of approval of your request. It will often build the long-term relationship instead of a one-time deal and open new doors of guest posts series. You can the strategy in action in the Guest Post section of this post. Another great example is how Turnbull (founder, SEO Jo Blogs) built the relationship to achieve marketing goals. Bring Traffic You are happy with X number of visitors from search engines, but if I say I can lead more traffic towards your blog, will you refuse it? Of course not, you can get additional traffic from various leading blogs using the guest post. Traffic from referral blogs is often more loyal than the traffic comes from search engines. Let’s have example from my own blog again. Build Authority The trust factor plays an important role in any business success, yet building trust is not an easy task. Guest blogging helps in this regard as well. It builds authority in the eyes of your targeted audience. I will explain this with two simple examples. My friends trust my words and try my recommendations. Will they refuse if I recommend someone? The same case applies on guest blogging. When you are featured on the industries’ leading blog, the blog is actually referring you and your business to their audience. Their audiences starts thinking of you as an authority because you are referred by an authority. Answer the simple question. Did you know me before reading this post? Of course not. Before featured on Moz, I am random SEO guy, but now Moz credibility is attached with me and I became a little more credible SEO. Get Feedback When you do a guest post, you will get different kinds of responses as compared to your audience, because it’s not your audience which already love your work; they are loyal to someone else's work. When you expose your work to them, you can have a truer picture of your brand. They can criticize or appreciate your work. In the matter of time you have a clear image of your brand. Here is a live example when you reach out to a new community this can happens some time http://propakistani.pk/2013/05/03/azmalo-pk-a-rising-online-marketplace-in-pakistan/ Do read the comments carefully. How Guest Blogging help the brands - Case Studies Let me share some success stories of guest blogging which might motivate you to do guest blogging even after Google's direct warning. You can see how big brands take advantage of guest blogging which lead them to success. Brian Dean explains how big brands like Buffer App use guest posting to achieve their marketing goals. http://www.quicksprout.com/university/how-to-rock-guest-posting-by-learning-from-these-5-examples/ This is actually a great piece of content which described the strategy of guest posting used by leading brands including Intel & Xbox. http://www.socialmediaexaminer.com/8-brands-that-benefit-from-guest-blogging/ Jon Cooper (PointBlankSEO), a well-know name in the SEO community explains how he attracts more visitors after doing guest post on Moz. http://pointblankseo.com/case-study-guest-post-seomoz-blog A Few Key Takeaways for the Case Studies If your brand is unable to reach out to leading blogs, hire a professional blogger who writes for targeted blogs. They can act as a brand ambassador and promote your business. If you are not an established brand, mentioning industry leaders in your own blog will not work, but if this is done on leading blog it surely attracts the leader’s attention. Promoting the brand's motive is much easier than promoting the brand. So instead of promoting the brand, start promoting the brand motive. Do guest blogging as a team. Involve every employee to write epic content. Chose the blog for the guest post wisely. Continue guest blogging Having a direct warning from Google is such a nightmare, but we still can do guest blogging with some precautionary measures. Start writing Good content for Guest post. Every piece of content should have a clear purpose. Swap the structure of guest blogging. Relationship and traffic should be target of guest blogging and link should be the byproduct. Stop bargaining for the links. Instead of bargaining with webmaster to give one or two links with exact anchor text, you can lead it to long-tail keywords for blog post on your own blog. Forget about the typical use of author bio with exact anchor text. Make a habit to use your brand name as an anchor text in author bio. To remain on a safe side use nofollow links in Guest posts. Last but not the least, do not abuse guest blogging. Excess of anything can be dangerous, so just you like to diversify your traffic sources, diversify the strategy of link building and go for inbound marketing as a whole. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why I still do Guest Blogging"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why I still do Guest Blogging"
    },
    {
      "level": "H2",
      "text": "Why I still do Guest Blogging"
    },
    {
      "level": "H3",
      "text": "Free Advertising"
    },
    {
      "level": "H3",
      "text": "Diversify Traffic Sources"
    },
    {
      "level": "H3",
      "text": "Build Relationships"
    },
    {
      "level": "H3",
      "text": "Bring Traffic"
    },
    {
      "level": "H3",
      "text": "Build Authority"
    },
    {
      "level": "H3",
      "text": "Get Feedback"
    },
    {
      "level": "H3",
      "text": "How Guest Blogging help the brands - Case Studies"
    },
    {
      "level": "H3",
      "text": "A Few Key Takeaways for the Case Studies"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Asif Dilshad\n          \n            Asif Dilshad"
}