{
  "url": "https://moz.com/blog/why-making-the-wise-choice-is-crucial-for-success-with-domain-redirects",
  "slug": "why-making-the-wise-choice-is-crucial-for-success-with-domain-redirects",
  "title": "Why Making the Wise Choice is Crucial for Success With Domain Redirects - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For a while now I have seen a trend with organizations both large and small. My company performs website audits on a regular basis and this is high on our checklist. It has to do with redirects and the loss of authority that quality links pass on to their websites. When done properly, 301 redirects…",
  "content": "Why Making the Wise Choice is Crucial for Success With Domain Redirects Link Building | Advanced SEO | SEO Basics By: Rob Delory October 9, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Rob Delory October 9, 2015 Why Making the Wise Choice is Crucial for Success With Domain Redirects Link Building | Advanced SEO | SEO Basics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. For a while now, I have seen this trend with organizations both large and small: Many are making a key mistake regarding redirects. As someone who performs website audits on a regular basis, this is particularly frustrating, since I recognize the missed opportunity of not having authoritative links passing equity to these sites.When done properly, 301 redirects are a very valuable tool in maintaining backlink value and an everyday tool for the SEO professional. So why do so many organizations get them wrong?A lack of vigilance can prove costly Let's look at an example: In this instance, I used Ayima Redirect Checker to follow the chain. United Health Group chose to have the WWW version of the website be its default for search engines, a method which Google and the others prefer by selecting one or the other and redirecting the secondary version, UnitedHealth Group, without the WWW.Unfortunately, the brand used a 302 redirect instead of a 301, which meant the value of any link built using the non-WWW version was in jeopardy of not passing along the value to the linked domain.So why does this make a difference? Who cares about one digit? Well, a 302 redirect is a technical tool that allows Internet marketing professionals and website developers to temporarily signal to search engines not to pay attention to the changes that are going on while they are working on a website. When you use a 302 redirect, you are basically telling Google, “Don’t reconfigure your algorithm based on what you see here because we are changing things.”This is why the actual names for these two types of redirects are as follows:Permanent 301 RedirectTemporary 302 RedirectMany businesses miss this small detail, thinking Google will simply throw up a 404 error in webmaster tools. But that's not what happens.You have effectively told them, “Don’t worry about this.\"The link is still active. From the outside, everything looks normal. What usually happens internally is that your team is building great content that is being linked to by other websites, but your rankings have not really improved, and traffic is stagnant, or has dropped.And the issue outlined above—simple though it may be—is the culprit.Don't set yourself up for failureA while back, Google made companies aware that setting up an SSL certificate on their site could improve their rankings; so of course, many companies were happy to oblige. In doing so, marketing professionals followed the correct procedure: They forwarded the WWW and non-WWW version to the HTTPS version of the domain. Many companies did this, however, without realizing they were using 302 redirects instead of 301s.Here is another example. One of the backlinks for Cartridge World came from Fairleigh Dickinson University. The value for Cartridge World, which would have been considered a great link, is now in question. Again, this redirect ending up being a 302 redirect. As a result, this link may not be passing authority to the Cartridge World domain. No matter how many links are created using the non-HTTPS version of the domain, they will likely not pass value. Remember, when you use a 302 redirect in a situation like this, it is a problem because you are telling the search engines, “This is only temporary. When we make it permanent, we will switch it to a 301.”It is sometimes difficult to not sound like a snake oil salesman when reaching out to companies with an opening like this: “Did you know that with five minutes worth of work, I could improve your rankings by 10, 20—maybe even 30 percent—and increase your traffic by similar amounts?”You can’t always rely on a single tool either. In the case below, I had to dig a bit deeper. I went to Screaming Frog to evaluate. Do you have any idea how many links were built to Delta Dental’s non-WWW version of the site?I realize that many SEOs will read this article and think \"I thought everyone knew that.\" As we can see, though, this is not the case. Furthermore, it's not so much that people don't know when to use a 301 redirect instead of a 302, as it is that so many hands are often stirring the pots that using the correct one gets overlooked.We all get busy. Things happen.I'm hopeful this post will be a reminder of how it's often the little things that keep up from reaching our full potential.Let's open up a discussion in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Making the Wise Choice is Crucial for Success With Domain Redirects"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Making the Wise Choice is Crucial for Success With Domain Redirects"
    },
    {
      "level": "H2",
      "text": "A lack of vigilance can prove costly"
    },
    {
      "level": "H2",
      "text": "Don't set yourself up for failure"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rob Delory\n          \n            Rob Delory\n          \n            Rob Delory"
}