{
  "url": "https://moz.com/blog/why-it-pays-to-be-big-popular-than-small-niche",
  "slug": "why-it-pays-to-be-big-popular-than-small-niche",
  "title": "Five Reasons Why It's Better to be Big & Popular than Small & Niche - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today we wrapped up our first ever SEOmoz training seminar - covering topics from keyword research to technical issues to search algorithms and social media. Despite the 7 straight hours of speaking on stage, I feel pretty good - the people in attendance appeared to have a terrific time and our…",
  "content": "Five Reasons Why It's Better to be Big & Popular than Small & Niche Mobile SEO By: Rand Fishkin October 1, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 1, 2007 Five Reasons Why It's Better to be Big & Popular than Small & Niche Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today we wrapped up our first ever SEOmoz training seminar - covering topics from keyword research to technical issues to search algorithms and social media. Despite the 7 straight hours of speaking on stage, I feel pretty good - the people in attendance appeared to have a terrific time and our after-hours party was still going strong when I left an hour ago. One of the most frequently asked questions during the seminar was around building microsites or leveraging microsite strategies for SEO. I know that Stephan Spencer has written about the pros and cons of Microsites on SearchEngineLand, but tonight I wanted to briefly cover why I personally believe that microsites (or any secondary sites for that matter) are almost universally a mistake. Search Algorithms Favor Large Authoritative Domains Take a piece of great content about a topic and toss it onto a small, Mom+Pop website - point some external links to it, optimize the page and the site for the target terms and get it indexed. Now, take that exact same content and place it on Wikipedia or CNN.com or even SEOmoz - you're virtually guaranteed that the content on the large, authoritative domain will outrank the content on the small niche site. The engines' current algos favor sites that have built trust and authority, consistency and history. Multiple Sites Split the Benefits of Links I often use the following illustration to show how a single good link pointing to a page on a domain positively influences the entire domain and every page on it: Because of this phenomenon, it's much more valuable to have any link you can possibly get pointing to the same domain to help boost the rank and value of the pages on it. Having content or keyword-targeted pages on other domains that don't benefit from the links you earn to your primary domain only creates more work. 100 Links to Domain A ≠ 100 Links to Domain B + 1 Link to Domain A (from Domain B) In the diagram above, you can see my take on how earning lots of links to page \"G\" on a separate domain is far less valuable than earning those same links to a page on the primary domain. Due to this phenomenon, even if you interlink all of the microsites or multiple domains you build, it still won't be close to the value you can get from those links if they were to point directly to the primary domain. A Large, Authoritative Domain Can Host A Huge Variety of Content Niche websites frequently limit the variety of their discourse and content matter, while broader sites can target a wider range of focii. This is valuable not just for targeting the long tail of search and increasing potential branding and reach, but also for viral content, where a broader focus is much less limiting than that of a niche focus. Time & Energy Is Better Spent on a Single Property If you're going to pour your heart and soul into webdev, design, usability, user experience, site architecture, SEO, public relations, branding, etc. you're going to want the biggest bang for your buck. Splitting your attention, time and resources on multiple domains dilutes that value and doesn't let the natural order of building on your past successes on a single domain help you out. So when do I suggest using niche sites or microsites? When you own a specific keyword search query domain - e.g. if you own \"usedtoyotatrucks.com,\" you might do very well to pull in search traffic for the specific term \"used toyota trucks\" with a microsite. When you plan to sell the domains - it's very hard to sell a folder or even a subdomain, so this strategy is understandable if you're planning to churn the domains in the second-hand market. As Ciaran pointed out in the comments, if you're a major brand building a \"secret\" or buzz-worthy microsite, it can be useful to use a separate domain (however, you really should 301 them back to your main site after the campaign is over so the link juice continues to provide long term benefit - just as the mindshare and branding do in the offline world). I know there are others in the search marketing and Internet marketing fields who feel very differently, and that's great, but my personal experience has led me to believe that sticking with one domain (or, if you have 50 domains, 301'ing them all to your favorite) is a better move in the long run. What do you think? Do you ever run multiple domains in the same sector? How have you seen that strategy benefit your overall reach, income, success? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Five Reasons Why It's Better to be Big & Popular than Small & Niche"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Five Reasons Why It's Better to be Big & Popular than Small & Niche"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}