{
  "url": "https://moz.com/blog/why-be-white-hat-who-cares-about-morals",
  "slug": "why-be-white-hat-who-cares-about-morals",
  "title": "Why Be White Hat? Who Cares About Morals? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Eric Ward, known as the first link builder, recently wrote:  \"Why not try to fool Google? ... Why should I behave in an ethical and white-hat way when my competitor's aren't, but they still rank way ahead of me? These are all fair questions that probably won't be answered any time soon.\"(Search…",
  "content": "Why Be White Hat? Who Cares About Morals? Blogging N By: Nabha March 5, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! N By: Nabha March 5, 2008 Why Be White Hat? Who Cares About Morals? Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Eric Ward, known as the first link builder, recently wrote: \"Why not try to fool Google? ... Why should I behave in an ethical and white-hat way when my competitors aren't, but they still rank way ahead of me? These are all fair questions that probably won't be answered any time soon.\" (Search Marketing Standard, Winter 07/08) This is the crux of the problem, isn't it? We want to be concerned with what works, and not merely with what morals say is right, if those morals have no bearing on us or our business. But there are answers close at hand, in the experience of our own lives. Kindness Feels Better You've felt this many times, surely – you give a gift, share kind words, or offer free advice, and you feel better afterwards. You feel happier. There's been an an expansion in your consciousness because your interests expanded to include another person. Conversely, unkind acts shrink the mind. Yes, speaking against someone has a certain pleasure in it, but that pleasure is like poisoned honey. Do it enough and you'll begin to feel that people have it against you, too. In time, you'll find it hard to make friends, because you've created a subconscious expectation that people are willing to hurt you to benefit themselves. Black-Hat Tactics Can Produce Anxiety and Distrust – In You The black hat is always on the run: Google and the search engines are always on the lookout, ready to ban him, so he has to continually improve his methods, much faster than the normal SEO. He runs the risk of having an entire site (or many sites) dropped from the search results, and therefore cannot relax completely. I once posted to a forum, promoting the product of a company I work for, but didn't clearly state my connection. Well, that is a black hat tactic, because it relies on manipulation. If you practice black hat techniques, you don't need to change what you do, but watch: see if willingness to fool others doesn't produce distrust in yourself in time. You'll find yourself thinking, \"What are they getting out of this conversation? Are they an affiliate for this product?\" And so on. Why Be White Hat? White hat techniques, which rely primarily on creating useful, helpful content: Attract the most valuable links Produce a sense of well-being, a feeling that you have contributed to the world (as Rand's younger brother said in a different context, you can sleep well at night, knowing that you've helped someone) Will never go out of fashion In his article, Eric follows the above quote by talking about experiences of his where competitors using spammy, black-hat tactics occasionally pass him in the rankings – but if he waits, they always fall. The understanding that lasting success comes from virtuous action is something often I've admired about the leading players in the SEO field – and is a main reason why SEOmoz is the only SEO blog I follow regularly! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Be White Hat? Who Cares About Morals?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Be White Hat? Who Cares About Morals?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nabha\n          \n            Nabha"
}