{
  "url": "https://moz.com/blog/why-listing-accuracy-is-important-whiteboard-friday",
  "slug": "why-listing-accuracy-is-important-whiteboard-friday",
  "title": "Why Listing Accuracy is Important - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Whether you manage a single local listing or hundreds, the consistency of your NAP data across the web can make or break your business. With answers for just about everyone, Moz Local's George Freitag stars in this week's Whiteboard Friday covering all the boons and secrets of listing accuracy…",
  "content": "Why Listing Accuracy is Important Local SEO | Whiteboard Friday | SEO Basics By: George Freitag June 17, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: George Freitag June 17, 2016 Why Listing Accuracy is Important Local SEO | Whiteboard Friday | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Whether you manage a single local listing or hundreds, the consistency of your NAP data across the web can either help grow your business, or serve as a barrier to customer discovery. Find out right now if there are any accuracy issues with your NAP.With answers for business owners, SEOs dabbling in local search, and those at enterprise-level searching for a broad solution, Moz Local's George Freitag stars in this week's Whiteboard Friday covering all the boons and secrets of listing accuracy (give him a warm welcome, folks!). Click on the whiteboard image above to open a high resolution version in a new tab! Video TranscriptionHi. My name is George Freitag with Moz Local, and today I wanted to talk about listing accuracy. The reason why I wanted to talk about it was because it's one of those topics that is brought up a lot in local search. If you work in local search directly or if you work with an agency or an SEO on local search, it's one of those things that you've probably heard a lot about, you understand it's something you have to do, you understand that it's very important because it is, but you might not understand exactly what it means, why it's important, how come you have to do it, or why it takes as much time as it does. So today, I wanted to spend the time to go over why listing accuracy is important, how it works and how you can do that. So to start out, let's just look at an actual local search result. Let's say this is a search for what you do. This is a search for a burger restaurant, if you run a burger restaurant. You've got your three local results. It's on a phone, so that's pretty much all you get, is those three listings, and this is where you want to be, but you aren't.So why aren't you? How come your clients, your competitors are on this search result, but you aren't? It has to do with trust. A story about trustSo to demonstrate why trust is so important, I want to go over a quick story about me when I was looking for a bank a few years ago. I don't go to the bank that often. So when it came time, I got out my phone, punched out Google Maps, and then proceeded to walk for the next seven blocks with my face buried in my phone, checking my Twitter and email and whatever. When the little lady inside told me I'd arrived, I looked up and saw that the place was closed. Not even just closed for the day. It was closed altogether. So that is Google's greatest fear, because if there's one reason why you, me, anyone will stop using Google is if that happens over and over again. If I repeatedly get sent to businesses that don't exist, if I try to call them and the call information is incorrect, then I'm going to stop using Google, and so Google takes that very seriously. In fact, Google is putting itself even more on the line with additional business information. If you've done a local search lately, and I assume that you have if you've watched this video, you'll see that in this Knowledge Graph they're giving you all sorts of information. They're telling you whether or not the store is open. They're linking you to reviews. They are just giving a ton of information in their local search results. And if they're not confident on all the information they have, then they're not going to show it, because if they repeatedly show that a place is closed when it's not, then you're going to stop using Google. So Google takes trust very seriously. Listing accuracy So how does Google determine trust? That is where listing accuracy comes into play. Listing accuracy is Google's method for determining whether or not it can trust a local business search result. So to show how that works, let's go over here and say this is your business and let's say that you've already set up your Google My Business page. You've already set up your name, address, phone, your NAP. If you haven't done anything along those lines, there's plenty of information on our website and on other places online about how to do that. But let's say that you've already set up your Google My Business. It's absolutely perfect with your business name, all your hours, all the images are filled out, and it's still not showing up here. Well, one of the reasons may be because of this concept of listing accuracy. So here's your listing, but what you might not know of or you might be kind of aware of are these other slight variations that exist elsewhere online, and these might just exist somewhere. So let's say you've got one variation where the address is slightly different, like it's a suite number that you don't want to have, but sometimes it mentions a suite number. Maybe it's an old phone number or an old cell phone number that somehow got indexed or an old tracking number. Maybe it's just some general bad information, just about specifically where you are or a website that's slightly different. Then over here, you've got another variation. Maybe this is a different business name. Maybe this is a business that was in your location before you moved in. So these places just sort of exist out there on the web somewhere, and they might even be in a place that you don't even know about. They might be on an obscure website that you don't ever see, and you're not really that worried about because it's something that you know isn't really being seen by your customers. So why should you worry about it? Why should you care about a website that's got bad information, that's on a source that you're never going to go to, you know your customers are never going to go to and probably isn't driving that much traffic your website instead? Well, it has to do with this concept of listing accuracy, because, again, this is how Google is measuring how much it can trust your information. The local ecosystem So over here we've got what we call the local ecosystem. You might've seen our graphic on our website, which sort of explains what the different data sources are. I just want to demonstrate how it works.So for your listing, Google can get its information from a bunch of different places. One of them, of course, is you. So this is you providing your information directly to Google My Business. This can also be the \"Report a problem\" in Google Maps or Google Mapmaker. But in addition to that, it's got all these other places that Google knows it can get business information from, and some of these places provide information directly to Google through feeds and some of them Google just knows about because it can crawl them (because basically it can just crawl anything on the web). These are places like: Phone directories Phone books Business directories for specific businesses like OpenTable or Healthgrades Review sites like Citysearch, Insider Pages News sites A restaurant review about your business Government websites Each time one of these places mentions your business information, it increases the confidence that Google has in the information that you provided. So this place and this place both mention you; that works to increase the confidence that Google has in the business information that you provided, making it more likely for it to show your business in its search results. So the more times it mentions you, the greater confidence it has in your information. But if you have these other variations sort of floating around out there, then all of a sudden Google's got some conflicting sources about your business information. So let's say that all these places are mentioning you the way that you want to be mentioned, but these places are giving slight variations. So all of a sudden Google's getting two different addresses, and so it's becoming a little bit less confident in the information that you've provided. Maybe now this place is giving a completely different phone number. So now it doesn't really want to show you because it doesn't want to have that call button on your search result. Each time it mentions one of these, it decreases the amount of confidence, and you also lose the opportunity to build confidence in your website. In fact, if there's enough sources out here saying one thing that are contradictory to what you're saying in your own Google My Business page, these places can actually override what you're providing and Google will deem them more trustworthy than the information that you're directly providing to them. So if all these places are saying that you're open 'til six and you're telling Google you're open 'til eight, all of a sudden Google is telling everyone that you're closed when you're not, which can be absolutely detrimental to your business. So how do you fix this and what you do about it? Well, it should be pretty clear from this graph. You want to find all these instances of Google locating business information that is not consistent with you and making it consistent. You're going to go out and find the source that's pointing at one of these variations, fix it so it's pointing at your own place. Then all of a sudden, instead of taking away from the confidence and trust Google has in your listing, it's building towards it. Finding NAP variations The way that you find this variation, it can just be through doing some pretty straightforward Google search. So let's go down here to some examples. You're going to use a quoted search to look for different types of information. If you already know about some bad information out there, you already know that there's like an old business name that you used to go under or a variation of your address, you can just do a quoted search for that information directly, find all the sources that bring up that bad information, go to the website, fix it, and then move on. All along you're building the trust that Google has in your business listing. For those places that you're not yet sure about, like I said, there might be some directories that you don't even know about or there might be some variations of your business information that you might not be aware of, so you can't search for it directly, the best way to do that is to search for your phone number in different formats. Darren Shaw of Whitespark did a great Whiteboard Friday just a few weeks ago about exactly this, about how to find all of your NAP variations in Google. I recommend reading it if you want to follow through with this. There are also some tools you can use. Andrew Shotland of Local SEO Guide has a Chrome plug-in, called Local Citation Finder*, that will just open up a whole bunch of different variations of your business information in different Chrome tabs and can really, really help with that. *Editor's note: The tool mentioned here is actually called the NAP Hunter Chrome Extension, but Whitespark's Local Citation Finder tool is another fantastic resource to keep in your local SEO toolkit. ;-) Enterprise-level solutions for cleaning up NAP consistencySo this might work if you've got one, a couple dozen, or maybe a hundred or so businesses. You can probably do this by hand and find all these places yourself. But if you have a ton of businesses — a few hundred or even a few thousand businesses — then this is not that scalable all of a sudden, and then it's time to move to one of these solutions where you're working with some of the primary data sources. So these are the sources that provide the information to all of these places. The big ones are Localeze, Neustar, Infogroup, Acxiom, and Factual. We're getting into the paid options right now. But basically, some of these places have been around for decades. They're the ones who provided the phone books with their information. You might have gone to Yelp and tried to sign up and saw that you're already on there and wondered why. This is why. They're getting their information from these places, and they push out all the information to these other places. So if you go to one or more of these, either directly or through a service like Moz Local or Yext, you can correct your information on one of these platforms. It'll push it out to every place on its network. That will correct the information here and, again, which in turn will make its way over to building Google's confidence in your Google My Business, which will increase the likelihood of it putting your business in its search results. If one of these places finds an inaccurate listing, it will correct it. So let's say that this phone book is in Infogroup's network and it encounters the inaccurate data, it will hit it, fix it, and then all of a sudden instead of hurting you, this is again building confidence in your Google My Business listing. Another benefit of working with these places is that they'll get you into places that you probably weren't even aware of. So, in addition to fixing points of bad data, it's also creating new points of accurate data that didn't even exist in the first place, which again build the confidence in your business listing and then increase the likelihood to show up in those local search results. The last step for this is related to maintenance. This is not a one-time thing. Over time this information can be corrupted because these places not only get their information from a primary data provider, but they also get their information from each other. In some cases, a primary data source might be crawling these sites, that it indirectly provides information to, and so if you ever played a game of a telephone, you kind of know how this will end up. So you do need to go back and revisit these exercises from time to time, looking for business inaccuracies through Google manually or keeping up a relationship with one of these top-level data providers. So in summary, what you want to do is start here, make sure you... Have got your Google My Business listing set up, Find all the variations and inaccuracies in your data, Fix them, and Work with a primary data provider to push out the correct information. And then all of these places will build up the confidence that you're already providing Google in your Google My Business listing, making it more and more likely for Google to show you in its search results. Thanks for watching. If you want to keep up with the latest in local search news, you can follow us on our brand-new social accounts @MozLocal both on Twitter and Facebook. Once again, my name is George Freitag with Moz Local and thanks for watching.\u0003 Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Listing Accuracy is Important"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Listing Accuracy is Important"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "A story about trust"
    },
    {
      "level": "H2",
      "text": "Listing accuracy"
    },
    {
      "level": "H2",
      "text": "The local ecosystem"
    },
    {
      "level": "H2",
      "text": "Finding NAP variations"
    },
    {
      "level": "H2",
      "text": "Enterprise-level solutions for cleaning up NAP consistency"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "George Freitag\n          \n            George Freitag\n          \n            George Freitag"
}