{
  "url": "https://moz.com/blog/why-google-hates-links",
  "slug": "why-google-hates-links",
  "title": "Why Google Hates Links... - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "*** My first post on YOUmoz, so be nice :) *** Well Google doesn't really hates, in fact it eats them for breakfast, most of us in the search engine society know that. However, recently there have been discussions about paid and reciprocal links, both of which I have been involved in during the…",
  "content": "Why Google Hates Links... Link Building M By: moleskin August 15, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: moleskin August 15, 2008 Why Google Hates Links... Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. *** My first post on YOUmoz, so be nice :) *** Well, Google doesn't really hate links; in fact, it eats them for breakfast--most of us in the search engine society know that. However, recently there have been discussions about paid and reciprocal links, both of which I have been involved in during the past. One issue I had specifically was that of paid directories. There are hundreds, if not thousands of them out there, some niche, others more generic, but all have played a role in promoting websites whilst hopefully improving their page rank. After reading that Google now frowned upon paid links I shed a little tear, as paid directories was a strategy I have employed time and time again to help give brand new websites a little push. However, it looks as though that tear was in vain, as what you actually pay for on most directories is for someone to preview your site, and if they like it, they add it to their directory. This is about as close as you can get to a paid link without it \"officially being paid.\" A lot of problems I found using and managing directories over the past has been the issue of reciprocal links. It has been one of the oldest forms of SEO - exchanging links with business partners or websites of a similar nature. In recent years I know some websites have created massive pages dedicated to hosting all reciprocated links in one place. These pages are, in fact, a complete mine field of useless information--any human may have serious trouble trying to navigate or understand them. \"So what?\" you may ask. Well, simple really. All search engines have stated that we need to provide content for humans, not search engines. However, by creating massive lists with hundreds of URLs, we are in actually creating links for the benefit of improving search engine results, and thus removing the human element from our website. So while reciprocal linking on a smaller scale probably won't hurt your site or business, try becoming a bit more creative with your partner links. Consider dedicating a whole blog post about partners--adding the content is good for organic search results anyway, and try to get your linking partner to do the same back. This will create content that humans would more likely read and interact with, and it increases the chances of that link being clicked. Not to mention the old fashioned referral bit of business you have just created. Additionally, try and add links to your website in other ways. My site has a friends page with companies I have dealt with or worked for, plus a few friends I want to link to. Whilst this may not be the best example out there, the fact that the page isn't called links.html might help those links somewhat; however, most of those sites do not link back (therefore removing the reciprocal factor). The page doesn't contain too many companies, so it is easy for a human to digest the information. If, however, I were to suddenly increase the amount of links on my site, I would need to portray the information to make it relevant and simple to use. And this is where my post comes full circle: adding a directory to your site. The great thing about directories is that they are categorized in relevant, logical sections. So within each segment of a directory you always understand what the websites are about and where they fit in context to the site. I am a great believer in directories being fantastic additions to websites, even smaller ones. An example of a project where I implemented a similar directory is shown on Ipswich Central's website. The shopping category was broken down into niche sections, allowing the end user to navigate to the section which immediately interested them, grouping relevant links together. To extend the quality of this particular directory, each link has its own page, giving a brief description about the company, as well as additional contact information and opening hours. Whilst it is a bolt-on directory to a successful site, it is also a great resource for the end user. It has also created over 300 extra pages, which will no doubt help the site improve its traffic from search engines. So that has to be the best way of working with reciprocal links whilst creating an extension of your website that is both a resource to your users and useful from a search engine perspective. That has to be one simple solution to an ever increasing links/reciprocal links section. It builds a resource for your visitors and creates search engine friendly pages which are better than just a <link> to someone else! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Google Hates Links..."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Google Hates Links..."
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "moleskin\n          \n            moleskin"
}