{
  "url": "https://moz.com/blog/why-you-should-give-yourself-the-opportunity-to-cure-in-your-seo-consulting-contracts",
  "slug": "why-you-should-give-yourself-the-opportunity-to-cure-in-your-seo-consulting-contracts",
  "title": "Why You Should Give Yourself the \"Opportunity to Cure\" in Your SEO Consulting Contracts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "May It Please the Mozzers,\n\nLast week, many of you requested more posts on common contract clauses. Your wish is my command:\n\nToday, I'm very briefly going to review \"opportunity to cure\" provisions. This provision is valuable for any one providing a good or service.  \n\n...",
  "content": "Why You Should Give Yourself the \"Opportunity to Cure\" in Your SEO Consulting Contracts E-Commerce SEO By: Sarah Bird July 28, 2008 Table of Contents Copied! By: Sarah Bird July 28, 2008 Why You Should Give Yourself the \"Opportunity to Cure\" in Your SEO Consulting Contracts E-Commerce SEO May It Please the Mozzers, Last week, many of you requested more posts on common contract clauses. Your wish is my command: Today, I'm very briefly going to review \"opportunity to cure\" provisions. This provision is valuable for anyone providing SEO/M consulting services. Why do I need to include an \"opportunity to cure\" provision in my consulting contracts? Unfortunately, many consultants will run into this problem at some point in their careers: You meet a potential client and discuss working together. You are engaged to do the job. You perform the work and send an invoice to the client. The client does not send payment. Instead, the client sues you, requesting a refund for all monies paid to date, lost profits, money equal to the cost of hiring another SEO ,and attorneys' fees. You're completely shocked because you didn't even know there was a problem. Further, it becomes clear that if you had known about it, you could have done something about client satisfaction. The above scenario is not uncommon. It is even more common for the client to refuse payment because he or she is unsatisfied, but you don't find out about the dissatisfaction until they refuse to pay. Having an \"opportunity to cure\" clause can help resolve these issues by requiring the client to talk to you before withholding payment. Please note, perfectly competent and talented consultants have client problems. They arise because (1) everyone is fallible and things fall through the cracks, and (2) miscommunication occurs in every professional relationship. Don't think that just because you are a talented SEO/M that you are immune to client problems and therefore don't need to think about limiting your risk. Having the right contract language can help reduce risk and increase customer satisfaction. What does an \"opportunity to cure\" provision do? An \"opportunity to cure\" contract provision requires the dissatisfied client to give you the chance to fix any problems before terminating the contract or suing you. By requiring the client to contact you about problems, you are given the opportunity to cure any oversights and to transform the unhappy client into a satisfied client. You are also decreasing your risk of liability because the client is required (in most cases) to give you the opportunity to cure before going to court or withholding pay. In short, it requires the client to do what you hope they would do anyway: talk to you about their dissatisfaction so that you can do something about it. By talking about the issues, you can resolve disputes and avoid lawsuits. A few things you should know about \"opportunity to cure\" provisions Contract law varies state by state. Each state has its own rules about enforcing these kinds of provisions. These provisions are generally favored by courts because they help resolve disputes outside of court. HOWEVER, many states don't require a client to follow the notice and opportunity to cure provisions when there has been dishonesty, fraud, or when it is impossible to fix to the underlying problem. In other words, if you're dishonest or if you make a mistake that cannot be fixed, the Court will not require the client to give you an opportunity to fix the problem. They act as a shield against lawsuits. In most cases, the client must give you a chance to fix the problem before coming to court or refusing to pay. If you don't have language in your contract requiring an opportunity to cure defects, the client doesn't have to let you know there is a problem before bringing suit. Here is SEOmoz's standard language: Opportunity to Cure. Prior to any claim for damages being made, you must provide SEOmoz with reasonable notice of any alleged deficiencies in performance and SEOmoz shall have a reasonable opportunity to cure any alleged defect in performance. As you can see, it's pretty basic language. We use the \"reasonable\" opportunity standard, but it is also common to have a specific number of days to fix any problems. It depends on the industry, but anywhere from 10 to 30 days would be reasonable in most SEO/M consulting contracts. Please let me know if you have any questions or concerns about this important contract provision. Best Regards, Sarah Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why You Should Give Yourself the \"Opportunity to Cure\" in Your SEO Consulting Contracts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why You Should Give Yourself the \"Opportunity to Cure\" in Your SEO Consulting Contracts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}