{
  "url": "https://moz.com/blog/why-canadians-are-the-best-seos",
  "slug": "why-canadians-are-the-best-seos",
  "title": "Why Canadians are the Best SEOs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In conversation today at the office, we found ourselves mulling over the disproportionate number of search marketing folks who hail from or live in Canada (aka hockey-land). In trying to ascertain what environmental or cultural factors might account for the propensity of the maple-minded to seek…",
  "content": "Why Canadians are the Best SEOs Public Relations By: Rand Fishkin August 22, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 22, 2006 Why Canadians are the Best SEOs Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In conversation today at the office, we found ourselves mulling over the disproportionate number of search marketing folks who hail from or live in Canada (aka hockey-land). In trying to ascertain what environmental or cultural factors might account for the propensity of the maple-minded to seek employment in the search field, we came across a few ideas: Canadians are disturbingly clean, a trait that helps when it comes to coding, authoring content and sending emails. Plus, a virtual work environment is more natural, as it creates very little refuse. Adding \"eh?\" to queries created problems for many Canadians, forcing them to conduct further research about how search engines operate. During the cold, Canadian winters, many families hovered around their PCs for warmth when other heating devices were unavailable. The all-purpose Canadian verb \"to hork,\" technically means stealing, purloining or taking away, but can also be applied to the SERPs, i.e. \"We totally horked their rankings, eh?\" The trade of SEO requires a high level of geekiness, for which Canadians have an enviable pre-disposition. Precision strikes in games like hockey and curling has given Canadians the uncanny, catlike reflexes necssary to identify links, keywords and crawl errors. While I don't want to overplay the stereotype that all Canadians are good at SEO, this is clearly a case where the shoe fits. Apologies in advance to those taking offense, but it's clear which English-speaking country is most over-represented in the search world, and sweeping this fact under the carpet won't make the US, Australia & the UK any more competitive. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Canadians are the Best SEOs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Canadians are the Best SEOs"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}