{
  "url": "https://moz.com/blog/why-artists-should-use-big-data-systems-like-followerwonk",
  "slug": "why-artists-should-use-big-data-systems-like-followerwonk",
  "title": "Why Artists Should Use Big Data Systems, Like Followerwonk - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Big Data is an expected tech trend to influence and shape how we grow in 2013. There’s an entire mountain of material to dig through. These systems are especially popular among financial and marketing professionals, but big data tools and research can also be very valuable to more creative…",
  "content": "Why Artists Should Use Big Data Systems, Like Followerwonk Moz Tools By: Christopher Ryan February 13, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Christopher Ryan February 13, 2013 Why Artists Should Use Big Data Systems, Like Followerwonk Moz Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Big Data is an expected tech trend to influence and shape how we grow in 2013. There’s an entire mountain of material to dig through like here, here and here. These systems are especially popular among financial and marketing professionals, but big data tools and research can also be very valuable to more creative endeavors. Followerwonk Followerwonk recently joined SEOmoz to provide the Moz community with robust Twitter analytics. The new SEOmoz app allows users to: Search Twitter bios; Measure yourself against competitors; Audit and track followers; Find and cultivate key relationships. Followerwonk isn't just a B2B tool, it's for creative people who enjoy systems too. You see, I have a tiny bit of “marketer” in me but it’s not my main shtick. I believe Dan Zarrella nailed the concept of \"marketer\" in this tweet: That's why I'm not a pure marketer. I don't want to live and die by metrics. I like them and understand that they are a must-have to succeed, just not enough to make it my primary focus or passion. I play in the same sphere and we sometimes tango, but that is all. Creative People Can Use This Tool Customization and personal use is what makes Followerwonk’s analytics and features highly valuable. I'm writing this post with the journalist (/writer), graphic designer, and, generally, the culture hound in mind. Here's three ideas I've been kicking around: Create search segments for your favorite companies. The company account is the brand's face but the people who fuel the organization should be your focus. They're the ones providing the content, after all. See what makes them tick and smile and squirm (really, anything). Just make sure your measurements are aligned with your goals. Is writing at The Verge your dream job? Or, maybe you want to learn more about the people who make your favorite magazine. Either way, carpe diem. With this tool, you can be one step closer to, as Neil Gaiman says, \"your mountain.\" Pro-Tip: Take the Followerwonk results and create a List on Twitter. Here’s one that I made for the Verge. More options include location, name, url, min following, max following, max followers, min followers, min tweets, max tweets, limited search function. Develop an outreach list with targeted keywords. OK, so you have a great idea and maybe you're close to launch, but who will listen? Let's say you're trying to start an online community for people who love traveling and live in Seattle. These people are most likely of high interest to you. They're connected minds in the Seattle travel community who share the same passion(s) as you do. This is something Jeff Jarvis calls \"elegant organization.\" Oh, and remember, you always want to be great when reaching out to people. Find the right words that your audience is sure to love. This last one is a little more tedious than the previous two. Let's continue with the Seattle travel example, but this method is also applicable to creatives who are in-house employees too. Take the list of accounts that you gathered from Followerwonk's targeted search and carry them over to the Analyze Followers tab. (You'll have to manually enter them.) Key the twitter handle you would like to inspect and scroll down to the word cloud results. This is excellent fodder for designing email campaigns, copywriting, and persona development. Finding the right words that your audience will be most receptive to can be difficult ... Not anymore. These word clouds are direct lines to each user's identity. The SEOmoz community is very much concentrated on analytics &optimization, it’s in their robot blood :-). If you're reading this now, you know the importance of analytics and big data. But I bet you have a friend who isn't very familiar with these systems. Show them how big this could be for them and never isolate yourself from the experience because inspiration is everywhere. How has Followerwonk helped you attain your goals? What are some other big data systems you're using to succeed? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Artists Should Use Big Data Systems, Like Followerwonk"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Artists Should Use Big Data Systems, Like Followerwonk"
    },
    {
      "level": "H3",
      "text": "Followerwonk"
    },
    {
      "level": "H3",
      "text": "Creative People Can Use This Tool"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Christopher Ryan\n          \n            Christopher Ryan\n          \n            Christopher Ryan"
}