{
  "url": "https://moz.com/blog/why-you-should-go-through-the-trouble-of-registering-your-copyright-when-everyone-tells-you-that-you",
  "slug": "why-you-should-go-through-the-trouble-of-registering-your-copyright-when-everyone-tells-you-that-you",
  "title": "Why You Should Go Through the Trouble of Registering Your Copyright When Everyone Tells You That Your Work is… - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Did you know that the difference between registration and non-registration could be you owing your attorney 15k versus you getting $150,000 in statutory damages? That's right. If you don't register, you could end up in the hole, even if you win. Alternatively, you could register, get your attorneys…",
  "content": "Why You Should Go Through the Trouble of Registering Your Copyright When Everyone Tells You That Your Work is Protected Automatically E-Commerce SEO By: Sarah Bird November 29, 2007 Table of Contents Copied! By: Sarah Bird November 29, 2007 Why You Should Go Through the Trouble of Registering Your Copyright When Everyone Tells You That Your Work is Protected Automatically E-Commerce SEO May It Please the Mozzers, Apparently I'm on a bit of a copyright kick these days. Copyright is stuck in my head like an annoying song. Does this ever happen to you? No, seriously. There were some excellent follow-up questions and concerns raised after my last post on international copyright issues. For example, folks had important questions about whether copyright can effectively protect \"the little guy\" given the costs of suit and what you could gain from filing suit. I want to touch on these issues while giving you some \"Best Practices.\" Still not convinced that this is worth a read? How about scare tactics? Did you know that the difference between registration and non-registration could be you owing your attorney 15k versus you getting $150,000 in statutory damages? That's right. If you don't register, you could end up in the hole, even if you win. Alternatively, you could register, get your attorneys' fees paid for and maybe actually get some cash back in your pocket. I think this post is worth your time, don't you? So, let's all take a deep breath, grab our caffeinated beverages of choice, and jump back into the exciting and riveting world of copyright registration. Here's what I want to cover: What the schmee can I copyright? How trademark is like copyright and how trademark is not like copyright If my original content is automatically protected, then why on earth would I go through the trouble of registering it and putting a notice on all my pages? I have other things to do with my time! What exactly is \"notice of copyright\" and is this the same thing as registering my copyright? What should my copyright notice contain? How do I register my online copyright? What?! I need to \"deposit\" my online content?! Do I need an attorney to register my copyright? Can I wait until after I want to sue someone to register? I never, ever want to go through the trauma of trial, so what do I care about statutory damages? What to do if you just can't get enough of copyright law Oh, I almost forgot the obligatory CYA paragraph: I am not giving you and cannot give you legal advice. Legal advice is applying the law to a specific set of facts. I am giving you information about the law. If you have a copyright issue, I urge you to seek qualified legal counsel. (Phew. I'm rather attached to my bar license and don't fancy losing it over you lot.) Let's do this. >> What the schmee can I copyright? In the online context, you can claim copyright for your original content, including text, graphics, and sound. This includes your emails, your blog posts, and your webpages filled with original content. This is the general rule. Now let's talk about the exceptions. ⇒ Exceptions to Copyright Copyright does not protect ideas, procedures, systems, or methods of operation. Thus, copyright does not protect my ideas for future blog posts or my delicious recipe for smoked cake. Copyright does not protect facts and purely mechanical, clerical content. The phone book is a great example of this. Copyright does not protect really trite content. Pop music titles/lyrics are often banal to the extreme. If you wrote a song with the lyric \"I love you baby,\" don't count on copyright protection. Copyright does not protect content that is in the public domain. What the schmee is in the public domain? This deserves a more detailed post down the road, but generally it's content that is very old and the copyright has expired. There are a lot of different rules that determine how long copyright will lasts. Thus, I have to break out the \"it depends\" answer. But if the content was first published before 1923, it's in the public domain by now. Copyright does not protect content authored by the U.S. government. Thus, we can quote government reports, laws, etc. extensively without crediting the U.S. federal government. Interestingly, this is not true about other governments; the U.K. for example. Copyright also does not protect so-called \"fair uses.\" This is definitely the topic of a future post because it is an important, controversial, and evolving concept. To put it generally, you can use other people's copyrighted materials, but only for fair uses such as news reporting and teaching. In the U.S. you can also use other people's material for parody. (Yay!) >> How trademark is like copyright and How trademark is not like copyright I want to briefly address the distinction between trademark and copyright because there is a special relationship between them in the advertising context. These concepts are easily confused for SEMs because they are often used in conjunction. Trademark and copyright are similar because both are legal regimes designed to protect intangible intellectual copyright. Trademark is not like copyright because trademark is designed to protect branding, one specific form of IP. Copyright, on the other hand, protects content more generally. Thus, trademark is more likely to cover names and short phrases. The common example here is Kleenex. \"Kleenex\" is a brand name protected by trademark law. It is not original content protected by copyright. I am talking today exclusively about copyright, but you should know that if you ever get sued for a copyright related issue, there will probably be a trademark claim in there too. >> If my original content is automatically protected, then why on earth would I go through the trouble of registering it and putting a notice on all my pages? I have other things to do with my time! It's true that your original content is automatically protected by copyright law even if you never give notice that it's protected and you never register it. You'll hear me say this and you'll read about it all over the web. Consequently, people don't go through the extra steps of drafting notice provisions and registering their copyright. This is a major problem because notice and registration are what give U.S. copyright law teeth. Sure, you're protected without it, but what kind of protection is it if all you get at the end of the lawsuit is a piece of paper from a judge telling you that you were right and a large bill from your attorney. Such a pyrrhic victory is not the way to run a business. In order to really benefit from copyright law, you need to give notice and register your content. If you do these things, then you can take advantage of the law's provisions providing that the infringer must pay the copyright holder's attorneys' fees (yay!) and you can get money awards without having to hire a team of expensive experts to testify about how you were harmed financially. By giving notice of your copyright claims and registering your content with U.S. Copyright office, you are making the copyright laws work for you. >> What exactly is \"notice of copyright\" and is this the same thing as registering my copyright? \"Notice of copyright\" is a short statement that informs would-be infringers that your work is protected. Giving notice of copyright is not the same thing as registering your copyright with the U.S. copyright office. However, it is something relatively simple that you can and should do to protect your interests. By giving notice to the world that your content is protected, you eliminate the infringer's potential defense that the theft was unintentional. How can the defendant successfully argue that she \"didn't know\" the content belonged to someone else if it states in plain view that the content belongs to someone? She can't. If she can't demonstrate that the infringement was unintentional, you have a better chance of proving that it was \"willful.\" If you can prove it was willful, then Ka-Ching! You get more statutory damages. Best Practice: Even if you're too lazy to go through the registration procedures, you can and should AT LEAST be providing copyright notice on your material. >> What should my copyright notice contain? It doesn't have to be a treatise, but it should communicate the following: 1. The fact that the content is copyright protected Um, yeah. It should state the work is protected. [Duh. Aren't you glad you're still reading this?] You can do this with many words: \"This work is owned and copyright protected.\" Alternatively, you could do this with as little as the symbol: © [note: this approach has global appeal for our non-English speaking friends.] I'm partial to the elegant and simple approach: \"Copyright\" I think that abbreviations are tacky, but I'm snobby about things like legal notices: \"Copr.\" [boo!] If you want to go for the TKO, include both: \"Copyright ©\" 2. Who owns the content This is the original author. If you wrote it on your personal time for personal uses, then you're the owner. If you wrote it for work, then your employer owns it. For example, I'm drafting this post, but SEOmoz, Inc. retains the copyright to it. SEOmoz, Inc. is on the copyright notice, not Sarah Bird. If multiple people work on the content, you list them all: \"Copyright 2007 by John Doe and Jane Doe.\" 3. When the content was first published Obviously, for first publications, this is pretty easy. For example, the date for this post will be November 29, 2007. Now, when I revise this post a year from now, I will include the date of revision and the date of the original post: Copyright by SEOmoz, Inc. Originally published November 29, 2007. Revised on November 30, 2008. And if I obsessively tweak with this post every day for the next year, I just might write: Copyright by SEOmoz, Inc. November 2007 to November 2008. Some people like to go crazy nuts and do the date in Roman numerals. This approach is classy, but I just don't want to work that hard. But that's just me. >> How do I register my online copyright? Register your online copyright at the U.S. copyright office. This involves filling out some forms, paying some money, and sending all the materials and copies to the copyright office. I don't want to go into too much detail about the registration process because the process changes and you can all read, so I'll just refer you to the U.S. copyright office's website and tell you the following general things: 1. Get the right form. Assuming that most of you are going to be registering content for websites, and assuming that the content is predominantly text (as opposed to graphics or music), you're probably going to use the Form TX. This is a basic fill-in-the-blanks process. You will need to know things such as the title of the work, a description of the content, the name and nationality of the author, the identity of any known claimants to the work, and whether the work is a revised copy, a derivative, or a compilation. Here's some more specific advice. Remember that this may be used in court some day. It should be legible and it should be accurate. Take special care in writing down the correct legal name of the owner. Don't approximate here. Also, if the owner is a corporate entity, you do not need to include a date of birth, even though they have incorporation date. [Don't get cheeky with the form!] Also, for the love of all that is sacred, please keep a copy of everything you send. Also, when describing your content, don't just say \"website.\" Indicate the kind of content on the website. For example, SEOmoz.org could describe its content as \"Primarily text and some graphics published as a website.\" You would be wise to ask, \"What exactly am I registering? A whole site? A Page? A blog?\" Well, yet again, the law has not caught up with the technology. In fact, the copyright office isn't even publishing a policy clarifying the issue. But if you can get someone on the line, they will tell you to go ahead and copyright the whole website so long as it is not gigantic. You could also choose to do it a page at a time. For example, you will probably need to start by registering your whole website. Then, as you add content, you have to register the new content. You can't re-register the content that's already been submitted and accepted before. So, don't update your website registration for minor revisions, only for substantive changes. Blogs are also a problem for the current system. They don't fit well into the policies for copyrighting other kinds of serials (magazines, newspapers, journals). Thus, while it's not entirely practical to register a new post every time you publish, you should be registering the new entries. One approach is to register all of your new materials on your website/blog every three months. Remember that you cannot re-register content that has been previously registered (or, shouldn't anyway). Thus, you only need to register your new content. One thing is certain: we can expect substantial overhauls in copyright registration policies in the future. The current methods are simply impractical for our current media. I promise to keep you all updated. 2. Pay the Fee. There is a charge for registering copyright. Currently the charge is $45 per work. Thus, you probably don't want to register every email, but you do want to register your more valuable content. 3. Mail in copies of the work, the fee, and the application. Make two copies of your work. These are deposited at the copyright office. Package your copies, the money, and the form, and mail to the copyright office at the address noted here. Your package is going to be pawed through by all kinds of people, so make sure everything is stapled together and that you send your CD in a sturdy case. It never ceases to amaze me how much stuff gets \"lost\" or \"ruined\" in the mail. If you want more detailed information on registering online works, go straight to the fount of knowledge, circular 66. >> What?! I need to \"deposit\" my online content?! Yes. That's part of the process. It gets worse: the U.S. copyright office doesn't allow you to electronically register anything yet. Rumor has it that CORRDS (Copyright Office Electronic Registration, Recordation, and Deposit System) is under development, but not yet operational. The copyright office is looking for beta testers if you are interested. Until CORRDS is operational, you've got to send in a paper print-out [the horror!] or a CD of the materials. These materials will not be returned. And they may be scanned for anthrax. >> Do I need an attorney to register my copyright? Probably not. It depends on how much your time is worth and the nature of your project. If you're trying to copyright something pretty standard, such as a webpage with all original content, you probably don't need expert advice. But if you're trying to make a compilation of other people's work, or revise some previously copyrighted work, you should probably consult with an attorney. >> Can I wait until after I want to sue someone to register? You can register your copyright after infringement, but you won't be able to benefit from the attorneys' fees and statutory damages provisions. Since these provisions are what make copyright suits financially viable for most people, you must must must register before infringement. >>I never, ever want to go through the trauma of trial, so what do I care about statutory damages? If you're thinking that you would never file suit against someone, so this doesn't really apply to you, think again. There are two theories of why this is important to do, even if you never step foot in a courtroom. ⇒ Deterrence. The deterrence theory is that potential infringers will be less likely to steal your material if they know they may have to pay statutory damages. Further, they will be deterred by the sheer intimidation of having to potentially defend against a foe who has been on the offensive in protecting their IP. That's right. You will stun them into inaction by your sheer genius! I'm not sure I believe this theory because it assumes that people who steal copyright understand the finer subtleties of copyright law. Do people who knowingly infringe check whether the IP they are planning on stealing is registered first? This doesn't seem realistic to me. I think most [I didn't say \"all\"] infringers are either (1) innocent (i.e., they are uninformed about the law) or (2) run spam farms from foreign countries and are relying on those complicated jurisdiction and conflict of laws rules to protect them. ⇒ Settlement. The settlement theory is that your case is much more likely to settle if the stakes are higher for the guy faced with defending the claim. I've seen this in action and it's definitely part of the settlement equation. This factor should be enough to motivate you to register your more valuable material. For example, imagine that Tybalt is on the defending side of this equation. Perhaps he copied large portions of something brilliant Mercutio wrote and mixed it in with some of his own ideas. Tybalt then posted the materials on his personal blog. Let's say that Mercutio files suit against Tybalt for copyright infringement. Now, if Mercutio never registered his copyright, Tybalt might choose to defend the case because he thinks he has a pretty good shot of defending the suit under the \"fair use\" doctrine. Further, Tybalt knows that Mercutio is going to have a really hard time convincing a judge to give him lots of money, even if he does prove that Tybalt's conduct infringed his copyright. After all, besides being offended, how has Mercutio been hurt by the infringement? How can Mercutio translate his hurt into provable, monetary damages to the judge? It's not easy. Thus, Tybalt knows that Mercutio's attorneys are going to tell Mercutio that this is not a good case to take to trial and that if Tybalt doesn't agree to settle, he should probably just drop the suit. Tybalt is more willing to risk going to trial because the potential outcome is not so very bad. One the other hand, let's assume that Mercutio read his SEOmoz blog religiously and had timely registered his content. In that case, Tybalt's attorneys would be telling him that it's not worth risking a loss at trial because Tybalt could end up having to pay Mercutio's attorneys' fees and tens of thousands of dollars in statutory damages (all this in addition to his own attorneys' fees! Holy bankruptcy, Batman!). Even if Tybalt had a sporting chance to prove to a judge that his use of Mercutio's material was fair use, it's not worth the risk considering the potential outcomes. Tybalt would be well-advised to swallow his pride and pay Mercutio some nuisance settlement amount. Thus, these statutory fees go a long way towards keeping people out of court simply by raising the stakes. I submit to you that this is often good thing. I happen to enjoy trials, but I know that my clients have not enjoyed trials, even when they had a good case. Trial is harrowing and there is a lot of \"waste\" towards attorneys fees. Is this justice? Probably not. But is it the best outcome considering all the factors? Probably so. >> I just can't get enough. If you too just can't get enough of copyright and you're a fan of funny cartoons, then check out this vid put out by the U.S. government. Great for getting your kiddies on the path to Nerddom. Alright folks. I hope that I've scared some of you into action. If you put copyright notices on all of your work and register your valuable content, your future attorney will thank you. Thanks again for your attention. I know copyright isn't the sexiest topic in the world, but it may be one of the most important for people in communication professions. Please keep your questions and comments coming along. I really enjoy the feedback and direction from the community. Best Regards, Sarah Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why You Should Go Through the Trouble of Registering Your Copyright When Everyone Tells You That Your Work is Protected Automatically"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why You Should Go Through the Trouble of Registering Your Copyright When Everyone Tells You That Your Work is Protected Automatically"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}