{
  "url": "https://moz.com/blog/why-the-vast-majority-of-seos-no-longer-target-individual-search-engines",
  "slug": "why-the-vast-majority-of-seos-no-longer-target-individual-search-engines",
  "title": "Why the Vast Majority of SEOs No Longer Target Individual Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A long time ago (at least, in web years), search engine optimization required specific targeting practices for each of the engines. For Hotbot, you'd need to place two repetitions of every keyword side-by-side in your meta keywords tag, while for Northern Light, a picture of at least one dancing…",
  "content": "Why the Vast Majority of SEOs No Longer Target Individual Search Engines Public Relations By: Rand Fishkin February 17, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 17, 2008 Why the Vast Majority of SEOs No Longer Target Individual Search Engines Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A long time ago (at least, in web years), search engine optimization required specific targeting practices for each of the engines. For Hotbot, you'd need to place two repetitions of every keyword side-by-side in your meta keywords tag, while for Northern Light, a picture of at least one dancing baby in the bottom right-hand corner made all the difference Nowadays, most SEO is done with the same set of search-friendliness and search targeting standards in mind. Using keywords intelligently without stuffing, making static, easily crawlable URLs, building content that people are likely to link to, and promoting sites through social, viral, and directory marketing are relatively consistent across the SEO field. And yet... many people still have questions and concerns about which engines they should target and why they perform better at some engines than others. With this post I want to answer some of these common concerns. Which Search Engines Should I Target in My SEO Campaigns? To figure out the answer, let's take a look at the current leading search engines (via SearchEngineLand): With the big 3 (Google, Yahoo!, and Microsoft) garnering a combined 95.5% of all searches in the US and the big 4 (with the addition of Ask.com) pulling in 99.4% of all searches, it's easy to see why virtually no effort is paid to smaller players. If you're receiving 1,000 visits each day from Google, spending time and effort on that 0.6% of small players has the potential to bring you maybe 10 extra daily visits. As cut and dry as the answers here seem, there are exceptions. Certainly, in markets outside the US, the answers are different. Canada, Australia, New Zealand, the UK, most of Central & South America, Africa, & the Mid-East are all heavily Google-centric (with smaller inroads from Microsoft, Yahoo!, and Ask.com). In Asia, the story's a bit different, as in Russia. Here are some of the search share leaders in these other markets: China - Baidu (Google, Yahoo!, and Microsoft all had share here, but were re-directed to Baidu by the government on multiple occasions, helping to keep Baidu the leader) Korea - Naver Japan - Yahoo! (though Google is also highly relevant) Russia - Yandex Beyond the geographical markets, there are some valuable vertical search properties that aren't owned/controlled by the search giants in arenas like travel, shopping, and video. Newcomers have attempted to make inroads in blog search, news search, financial, and local search as well. SEO for these sites, however, is typically significantly different from the traditional practices for web search engines, so don't expect the same rules to apply. All in all, the right answer is - the search engines that send valuable traffic. For now, that means Google, Yahoo!, Microsoft, & Ask.com. What's more surprising for many newcomers is that SEO for each of these properties is remarkably similar in tactics and execution. Let's take a deeper look with the questions below. What Do I Need to Do Differently to Reach Google vs. Yahoo! vs. MSN/Live? Not much, honestly. The major engines are all, at this point, largely playing catch-up to Google's algorithm and optimizing for on-site search friendliness (spiderability, good keyword targeting, semantic markup, clean URLs, no duplicate content, etc.) is virtually identical for every engine. Even keyword usage, once the big differentiator (you used to hear \"Yahoo! likes 3X as many keyword repetitions as Google\" all the time on SEO forums), has largely fallen by the wayside, with the singular exception that MSN/Live does seem to love keyword-rich URLs and domain names. From a targeting perspective, just concentrate on building great content, marketing it effectively to link savvy audiences, crafting a search-friendly website, and attracting as many links from as many diverse properties as possible. The engines are all chasing the same goals of relevance, so think like a search engineer and build the kind of site they'd be thrilled to see ranking in their indices, then market the hell out of it :-) Why am I Ranking Well at Google, but Not at Yahoo! or MSN? I think this is probably the most common of the questions in this post, and to be perfectly honest, no one can say for certain. Google, Yahoo!, and MSN/Live all utilize different indices of the web and different ranking algorithms. This means that results between the three will, necessarily, have variance. However, I'd be a pretty mean guy if I didn't at least provide some guidance, so here's my honest opinions on the subject. If you're ranking well at Google, but not at Yahoo! or MSN/Live, one of these may be to blame: Google relies heavily on a trust and domain authority based algorithm, meaning that a barely optimized, poorly linked-to URL on a heavily trusted, powerful domain will probably do much better in Google than the other engines. If your content isn't highly targeted (lots of keyword usage and many external links), but it's sitting on a powerful domain, this could be why you're seeing over-representation in Google. Google has the freshest index and the best ability to find new links quickly and count them. If you've released content recently or if many pages have recently linked to yours, this could be a big reason why you're outperforming Yahoo! and MSN/Live with your rankings at Google. Google rewards a few very high quality, trusted links over many lower value links and thus, you'll frequently see pages and sites in Google's rankings because they've won out through the value Google places in their sparse but more trusted link profile. Why am I Ranking Well at Yahoo! or MSN, But Not at Google? As with the above, it's impossible to say for certain, but once again, I'll give my personal opinions: Yahoo! is not as good as Google is at identifying and discounting so-called \"manipulative\" linking. Paid links, link farms, reciprocal links, and even FFA links (like blog comment spam and guestbook spam) will still sometimes provide value in Yahoo!, but rarely do in Google. MSN/Live is still way behind even Yahoo! at catching manipulative links and thus, many of their more commercially focused results (and plenty of non-commercial results) are filled with sites and pages propped up by links that Google simply won't count. Google still employs a series of algorithmic effects that mimic a \"sandbox\" of sorts. This means that new domains launched at Google or old domains moving their content to new sites often run into trouble ranking for what they \"deserve\" under the normal Google algorithm. This effect is much less strong than it was 2-3 years ago, but is certainly still around. In fact, last week, a good friend's site just \"broke out of the box\" in one of the best recent examples I've seen of the sandbox effect lifting. Google's the most \"suspicious\" of the engines, so if you've been overly aggressive in link growth, even through no fault of your own, Google will sometimes penalize or devalue your links, at least temporarily. I see this most often with anchor text issues, where a particular site's backlinks all share the exact same anchor text, but other \"patterns\" can also trigger Google's raised eyebrow. Why Doesn't My Site Rank at Ask.com? Ask.com employs a very different algorithm to the other major search engines. While Google, Yahoo!, & MSN/Live all use global popularity (the link equity built to a site by all the other sites that link to it on the web), Ask.com relies on local popularity, which only counts link equity from other topically-relevant sites in that site's niche. If you imagine the Internet as a model of the Earth, Google, Yahoo!, & MSN/Live are essentially saying that votes from anywhere on the planet count towards a page's ranking. Ask.com takes a different view and feels that only votes coming from your local town or county count towards your rankings. This means that with Ask.com, you'll need a very different set of links to rank well than at Google, Yahoo!, or MSN/Live. Aren't There Any Other Engines I Should Worry About? Other than the aforementioned market leaders in other geographies and any relevant vertical search engines, the answer is \"not really.\" Altavista, Dogpile, Hotbot, Lycos, and the like simply don't provide traffic levels that make them worthy of a lot of effort, and their algorithms tend to mimic the major engines anyway. However, in the future, this may change. Startup engines like Wikia, Cuill, Powerset, and even Mahalo are trying to chip into the market leaders and 2-4 years from now, there may be several Ask.com or even MSN/Live sized competitors worthy of more attention. Hopefully, this post will help you and your nervous clients to get some closure on these pesky issues. As always, comments are greatly appreciated! UPDATE: Nick Wilsdon pointed out in the Sphinn thread on this post that there are many other countries (like Iceland, the Czech Republic, and Estonia) where other search engines are dominant market players. The global search report from 2007 (warning - PDF) covers these in-depth. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why the Vast Majority of SEOs No Longer Target Individual Search Engines"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why the Vast Majority of SEOs No Longer Target Individual Search Engines"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}