{
  "url": "https://moz.com/blog/why-good-unique-content-needs-to-die-whiteboard-friday",
  "slug": "why-good-unique-content-needs-to-die-whiteboard-friday",
  "title": "Why Good Unique Content Needs to Die - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If we're talking about creating \"good, unique content\" and are hoping for it to rank in competitive SERPs, we're not setting the right bar. In today's Whiteboard Friday, Rand shows us what we should be going for instead.",
  "content": "Why Good Unique Content Needs to Die Content Marketing | Whiteboard Friday By: Rand Fishkin May 22, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 22, 2015 Why Good Unique Content Needs to Die Content Marketing | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We all know by now that not just any old content is going to help us rank in competitive SERPs. We often hear people talking about how it takes \"good, unique content.\" That's the wrong bar. In today's Whiteboard Friday, Rand talks about where we should be aiming, and how to get there. For reference, here's a still of this week's whiteboard. Click on it to open a high resolution image in a new tab! Video transcriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about something that I really have a problem with in the SEO world, and that is the phrase \"good, unique content.\" I'll tell you why this troubles me so much. It's because I get so many emails, I hear so many times at conferences and events with people I meet, with folks I talk to in the industry saying, \"Hey, we created some good, unique content, but we don't seem to be performing well in search.\" My answer back to that is always that is not the bar for entry into SEO. That is not the bar for ranking. The content quality scaleSo I made this content quality scale to help illustrate what I'm talking about here. You can see that it starts all the way up at 10x, and down here I've got Panda Invasion. So quality, like Google Panda is coming for your site, it's going to knock you out of the rankings. It's going to penalize you, like your content is thin and largely useless. Then you go up a little bit, and it's like, well four out of five searchers find it pretty bad. They clicked the Back button. Maybe one out of five is thinking, \"Well, this is all right. This solves my most basic problems.\" Then you get one level higher than that, and you have good, unique content, which I think many folks think of as where they need to get to. It's essentially, hey, it's useful enough. It answers the searcher's query. It's unique from any other content on the Web. If you read it, you wouldn't vomit. It's good enough, right? Good, unique content. Problem is almost everyone can get here. They really can. It's not a high bar, a high barrier to entry to say you need good, unique content. In fact, it can scale. So what I see lots of folks doing is they look at a search result or a set of search results in their industry. Say you're in travel and vacations, and you look at these different countries and you're going to look at the hotels or recommendations in those countries and then see all the articles there. You go, \"Yeah, you know what, I think we could do something as good as what's up there or almost.\" Well, okay, that puts you in the range. That's good, unique content. But in my opinion, the minimum bar today for modern SEO is a step higher, and that is as good as the best in the search results on the search results page. If you can't consistently say, \"We're the best result that a searcher could find in the search results,\" well then, guess what? You're not going to have an opportunity to rank. It's much, much harder to get into those top 10 positions, page 1, page 2 positions than it was in the past because there are so many ranking signals that so many of these websites have already built up over the last 5, 10, 15 years that you need to go above and beyond. Really, where I want folks to go and where I always expect content from Moz to go is here, and that is 10x, 10 times better than anything I can find in the search results today. If I don't think I can do that, then I'm not going to try and rank for those keywords. I'm just not going to pursue it. I'm going to pursue content in areas where I believe I can create something 10 times better than the best result out there. What changed?Why is this? What changed? Well, a bunch of things actually.User experience became a much bigger element in the ranking algorithms, and that's direct influences, things that we've talked about here on Whiteboard Friday before like pogo-sticking, and lots of indirect ones like the links that you earn based on the user experience that you provide and Google rendering pages, Google caring about load speed and device rendering, mobile friendliness, all these kinds of things.Earning links overtook link building. It used to be you put out a page and you built a bunch of links to it. Now that doesn't so much work anymore because Google is very picky about the links that it's going to consider. If you can't earn links naturally, not only can you not get links fast enough and not get good ones, but you also are probably earning links that Google doesn't even want to count or may even penalize you for. It's nearly impossible to earn links with just good, unique content. If there's something better out there on page one of the search results, why would they even bother to link to you? Someone's going to do a search, and they're going to find something else to link to, something better.Third, the rise of content marketing over the last five, six years has meant that there's just a lot more competition. This field is a lot more crowded than it used to be, with many people trying to get to a higher and higher quality bar.Finally, as a result of many of these things, user expectations have gone crazy. Users expect pages to load insanely fast, even on mobile devices, even when their connection's slow. They expect it to look great. They expect to be provided with an answer almost instantaneously. The quality of results that Google has delivered and the quality of experience that sites like Facebook, which everyone is familiar with, are delivering means that our brains have rewired themselves to expect very fast, very high quality results consistently.How do we create \"10x\" content?So, because of all these changes, we need a process. We need a process to choose, to figure out how we can get to 10x content, not good, unique content, 10x content. A process that I often like to use -- this probably is not the only one, but you're welcome to use it if you find it valuable -- is to go, \"All right, you know what? I'm going to perform some of these search queries.\" By the way, I would probably perform the search query in two places. One is in Google and their search results, and the other is actually in BuzzSumo, which I think is a great tool for this, where I can see the content that has been most shared. So if you haven't already, check out BuzzSumo.com. I might search for something like Costa Rica ecolodges, which I might be considering a Costa Rica vacation at some point in the future. I look at these top ranking results, probably the whole top 10 as well as the most shared content on social media. Then I'm going to ask myself these questions;What questions are being asked and answered by these search results?What sort of user experience is provided? I look at this in terms of speed, in terms of mobile friendliness, in terms of rendering, in terms of layout and design quality, in terms of what's required from the user to be able to get the information? Is it all right there, or do I need to click? Am I having trouble finding things?What's the detail and thoroughness of the information that's actually provided? Is it lacking? Is it great?What about use of visuals? Visual content can often take best in class all the way up to 10x if it's done right. So I might check out the use of visuals.The quality of the writing.I'm going to look at information and data elements. Where are they pulling from? What are their sources? What's the quality of that stuff? What types of information is there? What types of information is missing? In fact, I like to ask, \"What's missing?\" a lot.From this, I can determine like, hey, here are the strengths and weaknesses of who's getting all of the social shares and who's ranking well, and here's the delta between me and them today. This is the way that I can be 10 times better than the best results in there. If you use this process or a process like this and you do this type of content auditing and you achieve this level of content quality, you have a real shot at rankings. One of the secret reasons for that is that the effort axis that I have here, like I go to Fiverr, I get Panda invasion. I make the intern write it. This is going to take a weekend to build versus there's no way to scale this content. This is a super power. When your competitors or other folks in the field look and say, \"Hey, there's no way that we can scale content quality like this. It's just too much effort. We can't keep producing it at this level,\" well, now you have a competitive advantage. You have something that puts you in a category by yourself and that's very hard for competitors to catch up to. It's a huge advantage in search, in social, on the Web as a whole. All right everyone, hope you've enjoyed this edition of Whiteboard Friday, and we'll see you again next week. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Good Unique Content Needs to Die"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Good Unique Content Needs to Die"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H3",
      "text": "The content quality scale"
    },
    {
      "level": "H3",
      "text": "What changed?"
    },
    {
      "level": "H3",
      "text": "How do we create \"10x\" content?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}