{
  "url": "https://moz.com/blog/why-meeting-people-face-to-face-matters",
  "slug": "why-meeting-people-face-to-face-matters",
  "title": "Why Meeting People Face to Face Matters - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So far this year, I've spent 40 days and nights away from home. It's not that I love travel - in truth, it wears on me and I'm happiest when I'm home. Despite living here my whole life, I'm completely enamored with Seattle and the life that I have here. So why spend more than 1/5 of the year to…",
  "content": "Why Meeting People Face to Face Matters Moz News By: Rand Fishkin June 24, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 24, 2006 Why Meeting People Face to Face Matters Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. So far this year, I've spent 40 days and nights away from home. It's not that I love travel - in truth, it wears on me and I'm happiest when I'm home. Despite living here my whole life, I'm completely enamored with Seattle and the life that I have here. So why spend more than 1/5 of the year to date away? Why log the hundreds of hours in the air, waiting in airports, driving rental cars and sleeping in hotels? It's because meeting people in person is so incredibly important. When I sit down with a potential client, address a crowd of folks in person or just spend time with people I'll be working with in the future, it builds a relationship that lasts and creates a bond that enables far greater communication. Once we've spent time together face-to-face, both parties feel both a connection and obligation to one another, and I've been lucky enough to spend time (almost universally) with people whose company I enjoy. Here's a list of cities I've visited since March of this year (not counting the ones I've passed through): Philadelphia, PA New York, NY San Francisco, CA Vancouver, Canada Twin Falls, Idaho San Francisco, CA Toronto, Canada London, UK Munich, Germany Como, Italy Milan, Italy Venice, Italy Nashville, TN While it looks like a lot, it's nothing compared to guys like Mike, Joe, or Danny. And, in that time, I've met people at all different types of companies and organizations: Serial Entrepreneurs Financial Analysts Film Producers Venture Capitalists Private Equity Investors Dozens of SEOs, SEMs, Web Developers, Designers & Support Folks CEOs & Executives at companies in Fashion Online Auctions Wikis Email Spam Detection Network Security News Portals Online Job Boards Web-Based Identity Creation Non-Profit Assistance Medical Device Production Online Social Communities + dozens more Real Estate Developers Analytics, Usability & Information Professionals I know that I'm incredibly lucky to have the ability and privilege to build connections like these, but I can't recommend it enough. Not only are in-person meetings excellent for relationships with clients, they're also valuable for anyone that you might be working on a project with (say, as SEO & web developer) or simply people who share common interests & goals. Many of the most valuable trips I've taken didn't produce direct business for months, but the ties creates from direct contact have no equal. On the flip side of this - every serious problem we've had as a company with a client has come from people that I haven't met in person. We have several contracts with folks overseas or even here in the states that we haven't yet met, and not all of them have created problems. But, of the three times in the past 2 years that we have had contract disputes or the antagonistic issues, all three have been with clients I've never sat down with. What about your experiences? Do you travel much? Where have you been in 2006? Do you find that strong bonds can be built without in-person meetings? Have you had trouble with \"faceless\" contracts? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Meeting People Face to Face Matters"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Meeting People Face to Face Matters"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}