{
  "url": "https://moz.com/blog/why-link-building-strategies-fail",
  "slug": "why-link-building-strategies-fail",
  "title": "Why Link Building Strategies Fail - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Not all link building strategies are created equal. Learn from my mistakes and avoid these common reasons link building strategies fail.",
  "content": "Why Link Building Strategies Fail Link Building By: Adria Saracino July 16, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Adria Saracino July 16, 2012 Why Link Building Strategies Fail Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've executed a lot of failed link building strategies. Some of these strategies I created. Others were handed to me. Over the years, I've discovered that the same reasons for failure kept cropping up. Thus, I thought it'd be helpful to outline the mistakes I've made and seen. Hopefully this helps you avoid the stress and headaches I've experienced along the way. Here are the ways in which I've seen link building strategies fail and how you can make sure you don't get duped by these common pitfalls. Link Building Strategy Content Strategy which Link Bait Let me break it down... The content strategy is the road map designed to create epic pieces of content. The link building strategy is how you plan on getting links. Sometimes you use content from your content strategy to get links, but sometimes you don't. Sometimes the content from your content strategy helps generate links all by itself, such as when people find it easily in search engines and start sharing it on their own sites. This process is not part of the link building strategy. Producing a piece of link bait isn't a content strategy, either. Link bait is a piece of content that is created with the hopes of attracting a load of links. Link bait creators hope their content will go viral, and let me tell you, it is really difficult to churn out link bait after you produce a piece that goes viral. You're lucky if one goes viral, let alone multiple. Thus, link bait isn't a content strategy as it's not really sustainable. In addition, link bait can create a bad user experience, say in the case that you are churning out infographic after infographic all hosted on your company blog. Frequent visitors to that blog might become alienated, especially in \"boring\" or small niches where you often need to think of tangential topics and audiences to make a successful piece of link bait. Why should you know (and care about) the difference? Because getting link bait and content strategy confused can set your team up for failure. It often results in expectations not being met, as they will be unrealistic from the start. Plus, each of these strategies answers different questions as they are being created — such as the target market, goals, and metrics — all of which are vital to success. Miss one part and you could be missing an important piece of the big picture. How to Win: Create a content strategy that includes link bait (isn't all link bait) and figure out where you can leverage the content for link building. Simultaneously, create a link building strategy that drives additional links above and beyond what your content can do. For even more win, consider how you can coordinate with your social strategy to really leverage both your content and link building efforts. The key here is collaboration and integration, which will ensure you don't miss opportunities for a win. Think you only have the resources to pursue one strategy (which I will call BS on)? I love this controversial article on content marketing being better than link building. I'm not saying I agree or disagree, I just love when authors take an aggressive stance :) The \"Strategy\" Part is Left Out Trusty old Wikipedia defines a strategy as, \"A plan of action designed to achieve a vision.\" Unfortunately, a lot of times the planning and designing parts are left out, leaving a grandiose vision but no real road map for getting there. I see this a lot with companies who pride themselves in being agile. Sometimes they are just too agile, too shotgun and reckless, saying \"let's go, go, go\" and hoping to see some wins later on. How to Win: No brainer here: create a strategy. Know that executing one campaign after another with no connecting thread is not a strategy. Here are the top-level pieces both a winning content and link building strategy should have. What - What is the purpose? What are the goals? Who - This is two part, 1) Who will be accountable for the project? 2) Who is the target audience? How - Again two part, 1) How will you reach this goal(s)? 2) How will you track it? Why - Why is this piece of the strategy being pursued? This should be answered from both the business and user perspective. When - When will this be executed? Create timelines and deadlines to execute each piece of the strategy. Where - Where does this fit in? Knowing how it integrates with other efforts and where it fits into the grand scheme of things is essential. Rather than re-invent the wheel, here are some useful resources for how to create link building and content strategies: The Noob Guide to Link Building - helps see where planning fits into the grand scheme of things, top-level planning tips Brainstorming your Link Building Strategy - pretty good guide outlining the important questions you need to ask yourself Link Building Management - detailed workflow from a management perspective Content Strategy Roadmap (slideshow) - Ignore the useless photos and promotion, the meat of this is good stuff No Defined Goals Part of a strategy is having a vision, but to achieve that vision you need to set goals. Typically, the best strategies have a number of goals, broken into both short term and long term. Some will argue that \"ranking #1 for [insert highly competitive short tail keyword here]\" is a goal, but since it is pretty lofty you need to ask yourself what short term goals can your team action in order to be number one. How to Win: Set up both long-term and short-term goals. Generally, the short-term goals will be stepping stones for reaching long-term goals, creating a tree of goals with actionable milestones. I found an acronym from a UK government agency that I thought was wonderful. It says that all goals are SMART: No Urgency or Tracking in Place In my experience, in-house link building teams tend to fall victim to this more often than agencies. Just as a link building strategy should have goals, there should be some urgency in reaching them. This is where tracking comes into play. I see a lack of urgency is often correlated with not having a system in place for inspiring that urgency. To be clear, what I mean when I say \"urgency\" is a timeline for reaching goals - essentially deadlines. Every link builder is going to find a way to track how many links he/she is getting. It's human nature - we're out trying to get something and we want to see if we won or not. While I still find that the market struggles with developing a completely automated and instant way of tracking incoming links, there are manual processes that can aid in tracking how many links are received. However, this isn't the only tracking that's important. Knowing the number of links is great, but what are those links doing for rankings? How have those incoming links fluctuated over the duration of the project? What does the anchor text spread look like? These are bigger picture questions that some teams fail to answer in tracking. It makes it very difficult to measure the effectiveness and ROI of your link building team if you aren't looking at tracking data over time. And what is more important is making sure you share these results with everyone on the team. The first set of people who should know the results should be the ones doing the work. Too often the link builders are left out of the loop and given indirect feedback like \"we need to get more links.\" How to Win: Here is a top-level road map for implementing tracking procedures: After defining the goals, determine KPIs for measuring if those goals have been reached. Create a system for monitoring these KPIs, such as through Analytics or third-party tracking tools. Regularly analyze the data. Aggregate it into digestible visualizations to help make sense of it all. Draw conclusions. Share these conclusions with the whole team. As more data is collected, compare new data with historical results. Be sure to share these with the team as well. Reassess strategy and determine where changes need to be made if applicable. Expectations Aren't Managed Everyone is going to have his/her own opinion, from the bosses to the link builders themselves. Those who own the project need to set a realistic bar and constantly communicate what everyone can expect. Keep in mind that some people won't be as forthcoming with their expectations, so the key is to ask, and preferably have their expectations documented somewhere for reference to hold everyone accountable. How to Win: It's safe to set the bar low so you can exceed expectations, but the key in that is just generally setting the bar. If you want to go even further, epmphasize constant and clear communication. A good workflow includes: Learning what is expected from each party. Negotiating those expectations. Consistently reporting on where your team is at in meeting those expectations. Reporting on the final results - were those expectations met or exceeded? Resources Spread too Thin I see this all the time. Let's put it in perspective with a hypothetical story. The boss decides the company should try it's hand at some link building, so he designates one person to give it a go. Let's say it's Susy the copy writer. Off the cuff, the boss decides he wants Susy to start getting 30-50 links a week, and of course to complete all the other copy writing tasks required of her. With a pat on the back he tells new link builder Susy good luck. It's not difficult to guess that Susy the link builder comes back with less than stellar results. Not only is the boss disappointed, but he also decides link building isn't good for the company. Susy is left feeling like she failed, disappointed in herself, and aggravated at her boss. Link building isn't a get rich quick scheme..or at least it shouldn't be viewed as one. How to Win: Devote ample resources to your link building project. This can be easier said than done, especially when you operate a small business. A good start is to hire one person whose sole job function is link building. Susy the copy writer shouldn't also be dabbling in link building as nobody simply dabbles in link building. Make sure to monitor everything he/she does in order to make a case study for obtaining more people and resources for link building. Especially when just starting out, companies can see a lot of big wins so make sure to track before and after progress to prove your case. Depending on which strategy(ies) you pursue, the ideal team consists of: Link builder(s) - Remember, results are determined by time x cost = # of wins. For more wins, you need to amp up the variables. Content person(s) - A lot of link building strategies require content, so a strong team of writers and editors can help scale link building. Creative person(s) - Designers and developers can really help amp up the content you produce. Researcher(s) - Having someone who is an expert in data can make sure your resources are credible and your content is solid. PR person(s) - This person has his/her finger on the pulse of media, knowing what is trending and what journalists are interested in. Project manager - Sometimes this role isn't as explicit as this title suggests, but someone in charge of tracking and keeping an eye on the big picture can give your link builders more time to execute, rather than get caught up in monitoring. Social media person(s) - Not essential, but it's great to have a dedicated person to leverage the link building opportunities social media presents. Content is Consistently Crappy This feels like it should be a no-brainer, but plenty of companies fail to make epic content. Sometimes this caused by looking for quick wins, resulting in not enough effort or resources devoted to content creation. However, a more common reason is not due to lack of experience, but falls on the fact that people just don't know. People tend to fall in love with their own ideas (often which are too promotional) and have trouble seeing whether or not the idea will really speak to anyone. How to Win: First, know that the content creation process is not a sweatshop. Content should be made with a lot of blood, sweat, and tears. A case study from Salon.com illustrates this concept well. Essentially, the webiste was able to increase traffic to the site by 40% by creating 33% less content. This supports the idea that content isn't a numbers game; it's a quality game. Second, your content strategy should define accountabilities and create a workflow that implements a checks and balances system to ensure that you are creating epic content. If your content strategy is lacking, make sure you really understand how people are using the Internet and get the link builders involved with brainstorming, even if it's just to ask them. If you have minimal content building experience, it's important to have the people in the trenches involved in the discussion. To make content creation even easier, I've created this checklist for what I believe all epic content should have. If you can't say \"yes\" or provide a compelling answer for each, you might need to go back to the drawing board. Print it out and put it next to your desk right now (high res version available up request). Link Building Isn't Integrated with Other Marketing Channels This section might be a bit misleading as link building can still be successful without being integrated into other channels. However, a lack of integration can be a serious glass roof on the ladder to link building awesomeness. There is only so much traditional link building can do. Big wins often encompass other divisions, such as PR, social media, the product team, and more. This is acknowledged well in Jon's link building strategy list - in the top filter notice the checkboxes under \"Dependencies on Other Resources.\" The bigger your ideas, more departments will need to be involved. Without a seamless plan for integration and collaboration, working together is going to be one big mess (if it's even possible at all). Besides being able to work harmoniously, another big reason you want integration is because you can capitalize on what everybody else is doing and make sure you capture all the wins possible from a particular campaign. A lot of the initiatives your PR team is running can be easily tweaked to fit into the SEO team's agenda as well. It's called \"looking for low-hanging fruit\", and it is impossible to implement this idea if you don't know what the other teams are doing. How to Win: Communicate, communicate, communicate. Especially at first, you are going to have to stay relevant by constantly communicating with the different marketing teams. I've found that taking the initiative and including these teams' interests in your link building initiatives shows them a clear example of how you can work together. For example, if you are running contests with bloggers, looking out for the social media team's interests can help you make a case for why your teams should work together. It's the \"I'll scratch your back if you scratch mine\" philosophy, and you are initiating the \"scratching\". By laying out a work flow through example, you will inspire these teams to get you involved with their projects. To do this, include them in every step from inception to execution and make it clear how you are addressing their goals. Ask questions and ask for input. Consider it internal egobait. Pretty soon, you'll have an open line of communication and your requests for regular cross-team meetings will be taken seriously. Before you know it, you will all be in the loop of what other teams are doing and collaborating on your different project calendars. Tread lightly so as not to step on any toes, and encourage hosting these calendars on a collaborative platform, such as a simple Google Doc. In the end, communication turns into collaboration, and that is where you will gain the most wins from your marketing efforts. Link Building Team Members are Siloed Just as marketing channels can be siloed, so can the different teams involved with link building. I mentioned above the different concentrations that should be represented in a complete link building team. Smaller teams tend to have no trouble including everyone in the strategy, as they all typically sit in the same room. But what if you have a large team? Maybe with offices in different locations? It's easy to leave people out of the link building funnel; people figure the process will ship quicker if there are less chefs in the kitchen. However, this is the easiest way for a link building campaign to fail. Not every person on your team can be an expert in everything, so drawing from the experience and know-how that all team members have to offer will help you succeed. How to Win: Know each person(s) or teams core competencies. By knowing what each person/team can bring to the table, you'll be able to figure out where they fit into a particular link building campaign. The skills that each team member can bring to the table include: Link builder - This person spends all day trolling the Internet and trying to promote content, dealing with rejections, and taking part in observational learning along the way. He/she can tell you if the idea is promotable, as well as insights into how to reach different target niches. Content person - This person spends all day writing. He/she will know how to use the written word to represent the data on your infographic in a comprehensible way, while capturing your brand's voice and style to ensure consistency. Creative person - This person knows how to represent complex data in a beautiful, visual way. He/she will be able to tell you possible roadblocks of the infographic idea from a design perspective, or suggest better ways to represent the information. Researcher - This person crunches data all day. He/she will be able to collect credible sources for your piece, ensuring that the information is statistically sound and that your link builders don't get eaten alive by critics. PR person - This person speaks to the media all day. He/she knows what journalists look for and will be able to tell you if your piece will be promotable to high-value publications. Project manager - This person is the glue that holds the process together. He/she should be responsible for making sure the teams communicate and collaborate. Social media person - This person knows what is trending in the social sphere. He/she can help promote the piece and tell you if the idea will be shared. He/she can help push your piece viral. Without the help from all of these people, you are much more likely to create a piece that: Doesn't target a specific audience. Targets an audience that is difficult to infiltrate. Targets an audience that is too small, making the likelihood of success small. Isn't statistically sound, making it likely that it will be ripped apart during outreach. Is visually limited because your design team was incapable of executing the grand vision. Doesn't take off in the social space. Ensure your teams work collaboratively and communicate to create an inherent checks and balances system for creating winning link building campaigns. Relationships are Left Out I'm a big proponent of link building being renamed relationship building. The lines between traditional PR and link building are being blurred, and to get a link you need to bring it back to basics: networking. People do things for people they know. Bloggers and journalists get solicited to build links all the time, and you need to make sure you are among the people they come to know if you want that link. The \"relationship\" part is left out because link builders are constantly pressured by numbers. Those who aren't in the trenches don't understand how much goes into link building. I would argue that with some link building campaigns, the back and forth with a prospect takes up to 75% of the time. That number is often lost when looking at metrics like number of hours worked versus number of successful link placements. How to Win: First, educate your team and manage expectations. If you are the boss, understand that link building should take time. iAcquire wrote an article on the effort required to build links and I don't think it's far off. As far as measurement, make sure that the time spent negotiating is taken into account. If you have a large team and sense a problem among your link builders of not knowing when to let go (which I think is a big beginner pitfall), sit down with them and role play. Have them fill out a time log to capture back and forth if you have to. Host a link building hack day and get in the trenches to see for yourself just how much back and forth you'll do. No matter the method, make sure that this is taken into account and encourage relationship building. It's what makes link building scalable — as you can go back to the same people and be introduced to new contacts — so don't give up. Pretty soon they'll get to a place where they can manage a relationship quicker and more efficiently. Everyone Forgets the End Goal Disclaimer: this is a #tellmehowyoureallyfeel moment and is my #1 gripe with link building. I think the term has been bastardized - it is so overused that people forget where it came from in the first place. It's not about the number of links. Link building was a means created to increase conversions. Conversions should be what you care about. Not the number of links. Not even how well your SERP positioning improves. If you are increasing the number of links, improving your SERP positioning, and seeing more traffic, absolutely NONE of this matters if that traffic isn't converting. Because of this misconception, I think a lot of SEOs will say a big part of their job is educating their clients/bosses. It's quite easy to get caught up in the minutiae; counting the number of links and watching rank changes are easy to hold onto because they are the easiest to see. These are great short-term goals, but they are not the end goal. My co-worker Carson Ward said this well: How to Win: Constantly remind yourself/your team of the end goal. Do this by measuring changes in conversions that are a result of the smaller wins. Especially while educating your clients/bosses, if they aren't constantly reminded of conversions, they will easily forget. This is where defining goals and managing expectations are super important. Second, remember that link building — and SEO as a whole — is only part of the inbound marketing puzzle. The only reason people have an online business is to capture new customers on the web. SEO is only one way to do this, and link building is only one way SEO makes this happen. Know the big picture and understand how your efforts contribute to the grand vision. In Summary: Checklist for a Winning Link Building Strategy Create separate (and seamless) link building and content strategies. Sprinkle in link bait. Don't forget the \"strategy\" part - you need a road map to be able to take the journey. Define both short and long-term goals. Implement long-term tracking metrics and processes. Work with urgency to reach those metrics. Manage everyone's expectations. Communicate frequently and document. Devote the appropriate amount of resources to execute the strategy. Create epic content. Ideally, integrate your link building strategy with other marketing channels. Don't silo your team members. Make sure they work collaboratively. Remember winning link building = relationship building. Don't forget this takes time. Don't forget the end goal of all link building: Increasing conversions, not # of links. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Link Building Strategies Fail"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Link Building Strategies Fail"
    },
    {
      "level": "H2",
      "text": "Link Building Strategy  Content Strategy which  Link Bait"
    },
    {
      "level": "H3",
      "text": "How to Win:"
    },
    {
      "level": "H2",
      "text": "The \"Strategy\" Part is Left Out"
    },
    {
      "level": "H3",
      "text": "How to Win:"
    },
    {
      "level": "H2",
      "text": "No Defined Goals"
    },
    {
      "level": "H3",
      "text": "How to Win:"
    },
    {
      "level": "H2",
      "text": "No Urgency or Tracking in Place"
    },
    {
      "level": "H3",
      "text": "How to Win:"
    },
    {
      "level": "H2",
      "text": "Expectations Aren't Managed"
    },
    {
      "level": "H3",
      "text": "How to Win:"
    },
    {
      "level": "H2",
      "text": "Resources Spread too Thin"
    },
    {
      "level": "H3",
      "text": "How to Win:"
    },
    {
      "level": "H2",
      "text": "Content is Consistently Crappy"
    },
    {
      "level": "H3",
      "text": "How to Win:"
    },
    {
      "level": "H2",
      "text": "Link Building Isn't Integrated with Other Marketing Channels"
    },
    {
      "level": "H3",
      "text": "How to Win:"
    },
    {
      "level": "H2",
      "text": "Link Building Team Members are Siloed"
    },
    {
      "level": "H3",
      "text": "How to Win:"
    },
    {
      "level": "H2",
      "text": "Relationships are Left Out"
    },
    {
      "level": "H3",
      "text": "How to Win:"
    },
    {
      "level": "H2",
      "text": "Everyone Forgets the End Goal"
    },
    {
      "level": "H3",
      "text": "How to Win:"
    },
    {
      "level": "H2",
      "text": "In Summary: Checklist for a Winning Link Building Strategy"
    },
    {
      "level": "H3",
      "text": "Create separate (and seamless) link building and content strategies. Sprinkle in link bait."
    },
    {
      "level": "H3",
      "text": "Don't forget the \"strategy\" part - you need a road map to be able to take the journey."
    },
    {
      "level": "H3",
      "text": "Define both short and long-term goals."
    },
    {
      "level": "H3",
      "text": "Implement long-term tracking metrics and processes."
    },
    {
      "level": "H3",
      "text": "Work with urgency to reach those metrics."
    },
    {
      "level": "H3",
      "text": "Manage everyone's expectations. Communicate frequently and document."
    },
    {
      "level": "H3",
      "text": "Devote the appropriate amount of resources to execute the strategy."
    },
    {
      "level": "H3",
      "text": "Create epic content."
    },
    {
      "level": "H3",
      "text": "Ideally, integrate your link building strategy with other marketing channels."
    },
    {
      "level": "H3",
      "text": "Don't silo your team members. Make sure they work collaboratively."
    },
    {
      "level": "H3",
      "text": "Remember winning link building = relationship building. Don't forget this takes time."
    },
    {
      "level": "H3",
      "text": "Don't forget the end goal of all link building: Increasing conversions, not # of links."
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Adria Saracino\n          \n            Adria Saracino\n          \n            Adria Saracino"
}