{
  "url": "https://moz.com/blog/why-i-stopped-selling-seo-services-and-you-should-too",
  "slug": "why-i-stopped-selling-seo-services-and-you-should-too",
  "title": "Why I Stopped Selling SEO Services and You Should, Too - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's no longer just about optimizing your website for Google. It's about optimizing your presence across the web. SEO has tentacles that extend well beyond your website, so it's important that you begin to think of search holistically, taking into account all of the areas that can be optimized.",
  "content": "Why I Stopped Selling SEO Services and You Should, Too Local SEO | Advanced SEO | SEO Basics By: Ryan Stewart October 7, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ryan Stewart October 7, 2015 Why I Stopped Selling SEO Services and You Should, Too Local SEO | Advanced SEO | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In my 28 years on this planet, I've come to accept two things as fact: The sun rises every morning. Marketers screw everything up. Because of fact No. 2, I had to stop selling SEO. Why? Here's an interaction I used to have five times a day. *Phone rings* Me: \"This is Ryan Stewart with WEBRIS. How can I help you?\" Caller: \"I'm looking for SEO for [domain.com]. I want to rank for [keyword terms x, y, and z]. Can you guys handle that?\"Me: I'm over it. I'm tired of explaining to people SEO doesn't work that way anymore. And I need the rest of you to get on board with me, because we're driving ourselves out of business. I mean, come on people. Look around. We need to stop trying to jam websites where they don't belong. The SERPs have changed. Google shows search results based on what's best for the user. We can't just rank for whatever keywords we want. Let's take a look at a few examples: Example #1: Search \"best headphones\"What do you notice? Not a single result on the first page is a product page. They're all articles about different headphone types, their benefits, pricing, etc. We're all Google users. We all know these are much better results to get than getting a single brand's product page. I want to shop around, compare products, and read reviews. Don't you? Example #2: Search \"restaurants in miami\"What do you notice? Not a single result on the first page is a restaurant's website. As a matter of fact, the results above the fold are tied to review aggregators and Zagat ratings. Underneath the fold, the results are filled with listicles, reviews, and articles. I'd much rather read reviews about dozens of restaurants than be directed to a singular one. Example #3: Search \"buy a cheap tv\"What do you notice? Ahhhh, yes, I threw this one in for the comment trolls. The top five results are product pages. However, they're all mega-brands. With the current algorithms, we'll never outrank a brand for keywords like that (without spamming the hell out of it). What else do you notice? Articles, not product pages, are ranking at the bottom of the first page. Example #4: Google \"plumbers in san francisco\" What do you notice? Not a single result on the first page is a website. There are only review aggregators: Yelp and Google+.OK, so what's happening? It's a combination of two things: #1: Google's got a lot of data, and they're utilizing itIt's safe to say Google understands what users want by analyzing the massive amount of data it has. If we take off our SEO goggles, it's hard to disagree. Personally, I love the power of choice. I'd rather pick from a list of companies with reviews and comparison data than one that only includes websites that make it to the top of organic listings. In addition (as much as I hate to say it), I trust brands. I'd rather buy a TV from Best Buy than www.shop-cheap-tvs.com. Wouldn't you? #2: We're moving into the \"pay-to-play\" era with GoogleNot too long ago, Facebook moved into the \"pay-to-play\" era. Now Google's headed that way.Google's main source of revenue is advertising, counting for almost 90% of Google's revenue in 2014. And one of their main earners, display, is falling fast. Google's message is clear: If you want to sell directly through the Google platform, then you'll need to pay for it. Let's go back to my last example, \"plumbers in San Francisco.\" Look at what's happening above the fold with that query:That's right, baby! Paid local listings. If this test sticks, it's going to have massive implications on local search. If I were a betting man (and I am), I'm all in that this is the future of local search. But is SEO dead?SEO is absolutely not dead. As long as people use Google search, SEO will be alive. However, let's recap. Money/buyer (i.e., purchase-intent) keywords are: Dominated by huge brands that 99% of the world can't outrank (without spamming) Returning less product pages and more articles and other forms of content Triggering the knowledge graph, review aggregators, and more user-focused results What this means is it's time to seriously reevaluate the landscape. The days of ranking a products or services page first for these purchase-intent keywords are limited. If we want to capture that traffic moving forward, there are three things we can do: #1: Pay for itThis is very straight forward. I like to use paid search as a remarketing tactic. We capture traffic from all corners of the web, and then when those people are ready to buy (using those money keywords), we use highly targeted paid ads to snag their business.#2: Create valuable contentIf we go back to my first example, best headphones, the results are dominated by content that compares ratings and pricing for various headphones. No one shares, engages, or links to products and services pages. The fact is, no one except for us cares. Instead of trying to jam those pages with links, create a piece of content that delivers what Google (and users) want. By creating value with your content, you open it up to earning social media shares and powerful links from relevant sites. If you want to compete against the big dogs for organic search real estate, content is your best option. #3: Optimize your website for the webIt's SEO (Search Engine Optimization), not GO (Google Optimization). Yelp is a search engine. Facebook is a search engine. Twitter is a search engine. Amazon is a search engine. Quora is a search engine. Pinterest is a search engine. YouTube is a search engine. See where I'm going? Each of these platforms offers unique benefits to the user. In a lot of cases, people looking for things on these platforms are likely to bypass Google altogether. For example, l just moved into a loft in downtown Miami. I loathe shopping of any sort, so I allowed my girlfriend to manage the process for me. She ended up purchasing all of the furniture from Etsy (an e-commerce platform I knew very little about). I asked her how she arrived there. This is what she told me: Pinterest - She used Pinterest search to find inspiration on how to decorate. Using keywords like \"loft decorations,\" she narrowed it down to the specific pieces of furniture she liked. Amazon - She then went to Amazon and searched with keywords that were based on the furniture she liked on Pinterest. She was looking for rustic furniture. Amazon didn't have a great selection of that type. Ebay - So she moved to Ebay, knowing that she could find cheap, secondhand (i.e., rustic) furniture there. She found that most things were a little \"too used,\" so she moved on. Etsy - Finally, she landed on Etsy, knowing they specialize in unique handmade items. She purchased all the furniture from there (and simultaneously broke my bank account). Now, I realize she could've used Google to search for all these things. She chose not to, though, because she felt it was an extra step she didn't have to take. She chose to use those specific websites/platforms/search engines because each one was built to handle exactly what she was looking for. Applying this to your websiteThe long-winded point I'm trying to make is this: It's no longer just about optimizing your website for Google. It's about optimizing your presence across the web. By understanding who our target audience is and where they spend their time, we can attack those platforms and build an organic presence. If you're an attorney, you need to be on sites like Avvo, Lawyer.com, and Find Law because they dominate the SERPS If you're a local business, Yelp and Thumbtack are crushing it right now If you have an e-commerce store, get your product on as many platforms where your customers are as possible (including Pinterest) If you sell large-ticket B2B services, SlideShare and LinkedIn are gold mines for connecting with C-suite executives looking for information The list goes on and on...Bringing it all homeThis is why I stopped selling SEO. I'm begging you to follow suit. We need to educate non-marketers that times have changed. We can't just \"rank and bank\" for whatever we want anymore. We don't want to wait around until it's too late. This isn't a phase. This is the way it's going to be going forward, and we all need to get on board with it. As Google gets more intelligent, we need to get more intelligent about how we approach marketing. That doesn't mean looking for ways to beat the search engine algorithms. Instead, we must learn to use them to our advantage. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why I Stopped Selling SEO Services and You Should, Too"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why I Stopped Selling SEO Services and You Should, Too"
    },
    {
      "level": "H2",
      "text": "Example #1: Search \"best headphones\""
    },
    {
      "level": "H2",
      "text": "Example #2: Search \"restaurants in miami\""
    },
    {
      "level": "H2",
      "text": "Example #3: Search \"buy a cheap tv\""
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Example #4: Google \"plumbers in san francisco\""
    },
    {
      "level": "H2",
      "text": "OK, so what's happening?"
    },
    {
      "level": "H3",
      "text": "#1: Google's got a lot of data, and they're utilizing it"
    },
    {
      "level": "H3",
      "text": "#2: We're moving into the \"pay-to-play\" era with Google"
    },
    {
      "level": "H2",
      "text": "But is SEO dead?"
    },
    {
      "level": "H3",
      "text": "#1: Pay for it"
    },
    {
      "level": "H3",
      "text": "#2: Create valuable content"
    },
    {
      "level": "H3",
      "text": "#3: Optimize your website for the web"
    },
    {
      "level": "H2",
      "text": "Applying this to your website"
    },
    {
      "level": "H2",
      "text": "Bringing it all home"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ryan Stewart\n          \n            Ryan Stewart\n          \n            Ryan Stewart"
}