{
  "url": "https://moz.com/blog/why-i-keep-politics-out-of-a-professional-blog",
  "slug": "why-i-keep-politics-out-of-a-professional-blog",
  "title": "Why I Keep Politics Out of A Professional Blog - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the earliest lessons I learned in the forums, blogs & communities of the professional, search marketing sphere was to keep my politics private. It's a sad reality that logical debate and discussion of something critical to our lives must remain sequestered, but the current political…",
  "content": "Why I Keep Politics Out of A Professional Blog Content Marketing By: Rand Fishkin September 12, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 12, 2006 Why I Keep Politics Out of A Professional Blog Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. One of the earliest lessons I learned in the forums, blogs & communities of the professional, search marketing sphere was to keep my politics private. It's a sad reality that logical debate and discussion of something critical to our lives must remain sequestered, but the current political environment in the US and in many places abroad prevents rational presentation of fact and opinion on this divisive subject. Why? What are the factors that make it so inadvisable to present political views or even allow for political discussion? Here's a few that I've noted: BeliefFor many, politics is not a matter of debate or discourse, but rather a conflict of ideology much in the same vein as religion. When these conflicts arise, the parts of the human mind that control analysis and logic are overrun by emotion, passion and (in many cases) desperation. In this kind of an environment, the articulate, intellectual and example-laden arguments used to discuss, for example, linking techniques, programming or even conflicts between users and search engines don't exist. TransferenceMerely presenting political ideas or leanings in a professional blog will create discordance with users who disagree with your beliefs - oftentimes, the reality is that clients who might have used your services, other bloggers who might have linked to you and readers who might subscribe will all be turned away. I've even found myself guilty of transference - lacking respect for a poster's or blogger's professional ideas because I know their political beliefs. Guilty by AssociationThe current political environment has exacerbated sterotypes and tensions in the political spectrum such that overarching assumptions about a person's qualities are built around even the smallest admission of idealogical leanings. For example, in the US specifically, those who put themselves far to the right of the political spectrum may create stereotypes of amorality, anti-family attitudes and military appeasement for those on the left. In the reverse, the accusations might be homophobia, racism, close-mindedness & lack of education. When you claim political affiliations of any kind, some of your readers/clients/colleagues are prone to jump to these type of conclusions. RelevanceAlthough there's no particular problem with cat posts, political leanings are almost always off-topic on a professional blog. With the massive risks and responsibility assumed when taking a specific stand, it's better to choose off-topic subjects with greater universal appeal. There are certain exceptions to the \"no politics in the blog rule,\" including: On your personal blog, it's your choice. You still run the risk of alienating readers, but at that point, they have only themselves to blame, since they took the effort to find out more about you personally, rather than your professional opinions. When the issue is directly related to the profession, it's OK. For example, net neutrality, government use of search data, etc. Expressing a directly relevant opinion on these subjects (i.e. search engines should destroy their data so the gov't won't have access to it in the first place), even if it aligns you with one side of the debate or the other, is kosher. I think we've got a long way to go before politics and professionalism can mix, but it is something we as a planet, a nation and an industry can aspire to. In all honesty, I'm looking forward to the times when this blog post will be an obsolete history lesson for a more enlightened generation. What are your views? Can politics and blogging mix? p.s. I owe this subject to Jim, Aaron and Kim who all were on the topic over the last few days. p.p.s. The other Aaron (Wall) has posted an opposite opinion that's incredibly compelling. I'd invite readers to check out both before making up their minds. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why I Keep Politics Out of A Professional Blog"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why I Keep Politics Out of A Professional Blog"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}