{
  "url": "https://moz.com/blog/why-you-shouldnt-ignore-longtail-clients",
  "slug": "why-you-shouldnt-ignore-longtail-clients",
  "title": "Why You Shouldn't Ignore Long-Tail Clients (Small Business Owners) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I have lived, breathed, eaten, slept, celebrated, and advocated small business internet marketing for the last eight years. Until recently, not even I realized how large the disconnect between the search marketing industry and the small business community is, and just how massive the market…",
  "content": "Why You Shouldn't Ignore Long-Tail Clients (Small Business Owners) SEO Consulting By: David Mihm December 12, 2012 Table of Contents Copied! By: David Mihm December 12, 2012 Why You Shouldn't Ignore Long-Tail Clients (Small Business Owners) SEO Consulting Hopefully most of you have already read the news, but in case you haven’t, I am very excited to be a full-time member of the SEOmoz staff! The announcement came out as I was en route from Blueglass X in Tampa to BIA Kelsey’s ILM West show in Los Angeles. In fact, and I’m still trying to catch up on thanking everyone in my Twitter stream and on the original blog post. Both conferences were excellent, but if you’ve never attended a BIA Kelsey show, it’s a completely different animal from conferences and seminars in the search industry. The conference contains very few “actionable tips that you can implement on Monday morning,” but that’s not the reason you attend. BIA Kelsey recruits executives from the major digital marketing technology and service providers to small businesses for extended 1:1 or 1:2 discussions with their analysts. By and large, these executives are surprisingly open about challenges they face, and although some sessions turn into sales pitches, the best ones give you real insight into the online marketing pain points and opportunities for small businesses across the country. So, keeping that background in mind, I want to focus my first SEOmoz post on my #1 and #1a takeaways from the BIA Kelsey show. (There will be plenty of posts from me coming up over the next several months, and Rand’s excellent Whiteboard Friday last week will hopefully satiate you guys on local for the time being.) Small businesses vs. Search marketing I have lived, breathed, eaten, slept, celebrated, and advocated small business internet marketing for the last eight years. But not even I realized until recently: 1) How large the disconnect between the search marketing industry and the small business community is. 1a) The size of the market opportunity for the consultants and agencies who can bridge this disconnect. One of BIA Kelsey’s forecasts really crystallized this disconnect for me: their annual survey gauging the marketing mindset of the average small business owner. This survey breaks respondents into two categories: “core SMBs” and “plus spenders.” What is incredibly revealing for most people in our industry is the average annual marketing spend of these two groups: $3,000 and $82,600. Note: these numbers are TOTAL marketing spend. Annually, not monthly. Even the “plus spenders” would have a hard time finding anyone on this list willing to take them on for less than a $5,000/month budget, assuming they were looking for an end-to-end, search-and-social-media monthly arrangement. The level to which this segment is being served by the broader search industry is substantial, but economics dictate that more established agencies tend to go after bigger fish. On the other side of the spectrum, BIA Kelsey is one of the few companies out there who even considers the plight of the $250/month small business. And if you think $250 sounds like a small monthly budget, wait 'til you hear that these businesses actually spend closer to $100/month on their website and web presence (see slide 8)! This is the reality of operating a small business, though. Advertising costs for small businesses do not come from a corporate marketing budget; they come from family vacation budgets or college savings funds. Why do I think the market opportunity is so large, then, for agencies who can serve these average businesses? Surely there is no margin in a stable of $250/month clients? #1 You have virtually no competition for these clients Jim Moroney of the Dallas Morning News candidly admitted that his newspaper had effectively “priced out” most small business advertisers years ago. His newspaper has a 600,000 subscriber distribution, and for the mom-and-pop dry cleaner or local restaurant serving one small neighborhood in Dallas-Fort Worth, those types of ads do not pencil out economically. The analogy holds true today even in the digital era. Most small businesses in this $250/month segment are priced out of online advertising. Most of the major Internet yellow pages companies are thinking either of Adwords, display ads (whether they be CPM or CPC), or a combination of the two. There were very few presentations at the show focused on acquiring new customers via inbound marketing. Yet in many categories, $250 will only buy a handful of clicks per month, especially once you consider the Cost-of-Goods-Sold that third-party vendors need to build into their pricing. The bottom line is that inbound marketing, i.e. “free” traffic, is the only sustainable marketing technique for this large segment of small businesses. No other option has enough margin to sustain a business on the sales side, so traditional advertising companies are simply not targeting this enormous potential customer base. The CEO of YP.com roughly admitted as much -- that his company was simply too big and too slow-moving to be able to compete effectively with a 2-3 person agency -- and I don’t think he’s alone in this admission. #2 By default, all of your leads for this business segment are going to be high-quality, inbound leads At $250/month, only companies at the very largest scale (basically, Google, Facebook, and Apple) can sustain a business with a sales force. There is just not enough margin to support feet-on-the-street at this price point. So, at least among the BIA Kelsey audience, everyone is targeting the “plus spenders.” And even if those companies are able to bring on a business at this price point, they usually end up underserving them. Almost every company that has tried serving this segment at scale bemoans the tremendous “churn” rate when these clients cancel their contracts as a result of poor service. No one is targeting these businesses from a sales perspective, so they’re literally forced to do their own research. Business owners making the effort to seek you out are going to be more engaged in the marketing process, more responsive, and more likely to implement changes or give you buy-in on your recommended tactics. #3 The upside for these businesses could be huge Chances are, you are starting from scratch with this segment. If they have a website, it’s probably completely un-optimized, and a few Title Tag and H1 changes will dramatically increase the amount of business they get from the Internet. Maybe only a few have claimed local search listings, or maybe the business only has one inbound link from a local college or community organization. Unlike more competitive categories in organic search (like e-commerce or travel), success can still be achieved relatively quickly in most local categories. You're going to see a \"wow\" factor associated with even moderately effective white-hat tactics. And while small business owners have a reputation for “churn” in this industry, as I mentioned above, most of them are incredibly loyal to companies who actually provide value with their services. So, what can you do to serve business owners at this lower end of the market? Here are just a few basic tasks that rookie or junior search professionals can perform without requiring any time investment by a senior employee: Improve Title Tags and H1 tags Submit citations (whether in-house or outsourced) Set up Google Alerts Set up a WordPress blog Provide editorial advice for weekly blog post topics and Facebook posts Control blog commenting on the business owner’s behalf Draft review solicitation emails on the business owner’s behalf Track the success of review solicitation campaigns via a spreadsheet Reach out to business and community organizations for locally-relevant links Create hyper-targeted Facebook ad campaigns under $50/month in total spend* *In my opinion, Adwords has effectively killed its own small business market opportunity with the increasing number of \"not enough search volume\" long-tail keywords and ever-higher minimum bid levels. Let’s assume your agency wants 100% markup on your employees’ or contractors’ time. Let’s also say that a decent hourly rate for a recent liberal arts college graduate is about $17/hour (this works out to a $36,000/year annual salary). This means your agency can afford roughly seven hours per month of marketing on behalf of an average small business owner. Let’s be even more conservative and say that a more senior employee at $100/hour will need to review each account for 30 minutes per month. This still leaves five hours per month, per business for the college grad. Think of the number of tasks in the list above that could be completed in that amount of time! Helping business owners at the lower end of the marketing spectrum has been a cause for me since I started in the search industry. Beyond the near-moral imperative that I’ve felt personally, I also see incredible economic potential from serving these long-tail customers. OK, that’s enough out of me for today. I’d love to hear from you guys: how many of you serve clients anywhere near this $250/month price point? What kinds of services do you provide them? What has your experience been like? How many have served them in the past but moved onto clients with bigger budgets? Looking forward to the discussion with you in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why You Shouldn't Ignore Long-Tail Clients (Small Business Owners)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why You Shouldn't Ignore Long-Tail Clients (Small Business Owners)"
    },
    {
      "level": "H2",
      "text": "Small businesses vs. Search marketing"
    },
    {
      "level": "H2",
      "text": "#1 You have virtually no competition for these clients"
    },
    {
      "level": "H2",
      "text": "#2 By default, all of your leads for this business segment are going to be high-quality, inbound leads"
    },
    {
      "level": "H2",
      "text": "#3 The upside for these businesses could be huge"
    },
    {
      "level": "H2",
      "text": "So, what can you do to serve business owners at this lower end of the market?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Mihm\n          \n            David Mihm\n          \n            David Mihm"
}