{
  "url": "https://moz.com/blog/why-you-should-consider-breaking-your-subpages-down-to-one-page",
  "slug": "why-you-should-consider-breaking-your-subpages-down-to-one-page",
  "title": "Why you should consider breaking your subpages down to one page - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This is my first YOUmoz post and I am no native speaker so please be lenient ;-)Many SEO consultants know that scenario: A client complains about being nowhere in the SERPs, even though they consider themself being one of the best results for a particular search query. The client mostly is a small…",
  "content": "Why you should consider breaking your subpages down to one page On-page SEO S By: salomonitc June 25, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: salomonitc June 25, 2009 Why you should consider breaking your subpages down to one page On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Many SEO consultants know that scenario: A client complains about being nowhere in the SERPs, even though they consider themselves to be one of the best results for a particular search query. The client mostly is a small local business and if you check out his site, you almost always see the same mistake: there is not enough copy on the homepage. Many sites only have a picture, some welcome text and navigational elements on their homepage. As we all know, the homepage is typically the page with the best link metrics. For a small website it is often the only page which has any links at all. So why does this mistake happen? One reason is, that even the smallest website seems to need a menu nowadays. This leads to a dispersion of relevant content and, of course, keywords. The resulting sub-pages have a relatively small amount of copy, a lower PR and no deep links. Here is a great case study: Look at this site: http://www.fitnessnonstop.de. It is a commercial site for a discount fitness center in a small city (42k people) in Bavaria, Germany. As you can imagine, there is some competition, but it is not too hard to rank for a localized keyword if you do your homework. In 2008 they had a simple site, which consisted of only one single page. You can check it out in the web archive. This single page had plenty of relatively good copy with relevant keywords. However, the user had some scrolling work to do. Therefore a simple navigation was inserted at the top of the page, which just brought you to the corresponding section, if clicked (using hash-urls). The site ranked quite well (around place 1-4) for localized queries like 'fitness weiden'. In late 2008 they decided to use a content management system and to 301 the site to their exiting company site at http://www.orthomed-weiden.de/fitnessnonstop.html. At a first glance one could expect an increase in rankings because the city name is now in the URL. But that's not what happened: the site virtually disappeared from the SERPs. They only kept ranking for specific queries like the company name. Sadly there is no webarchive version of the page, but I will tell you what the page looked like: As they wanted to use their newly gained CMS possibilities, they decided to split up every block of the old page into different sub-pages. On the main page (http://www.orthomed-weiden.de/fitnessnonstop.html) they only left one h1-tag, a picture and some copy which altogether was around 15 words. Nearly every word from the old page was now somewhere on one of 6 sub-pages. The The h1-tag, URL and title tag contained the main keywords, however, their rankings were gone. So I recommended them to grab some copy from the sub-pages an put it back on the main page (as it is today). About two weeks later they were back on place 2 for fitness weiden for example. From a SEO perspective it is easy to explain what happened: It is not enough to have relevant content. As relevancy/popularity metrics a applied mainly on page level and SERPs list only 1-2 pages per domain, you have to break the metrics barrier on every single page. Especially if you have not much content, few 'money words' and no deep links. As you can see, it is often crucial to keep your text together in order to be relevant. Personally I think there could even be a certain amount of copy a website needs in order to rank. Visualising ranking factors in a pie chart is a good approach to teach you where to invest your time, but may not have a correlation to why your rankings are bad. There are conditions under which a ranking factor can 'beat' a more important ranking factor. The concept of getting more relevant text should be applied to landing page optimization as well. Often I see landing pages which are greatly optimized for a good user experience (pictures, call to action, certificates, etc.) and to some extent also for search engines (obviously SEOed footer links for example), but there is just not enough copy to look relevant to the search engines. I am not saying that you should blindly add some obvious seo text or even stuff keywords just to get relevance. Just write naturally about your company, what you do, since when, etc. and keep an eye on keywords. Consider adding an about us section on every landing page! And if you are worried about duplicate content, pay someone to write the same thing in different words over and over again. Another, more scalable option is to have a testimonials database were you can grab data from. I would recommend making the selection deterministic, thought. When I find myself in a situation were I have to quickly explain all that to a person which is not very tech-savvy, I sometimes recommend doing a quick check with ranks.nl (or something similar) for keyword density (goal: 2 to 6 % density for every keyword). Even if this metric is broadly considered to have no effect on rankings, I like that it is easy to understand for somebody who has never really thought about SEO before. It avoids: 1. pages with few copy, 2. missing important keywords, 3. keyword stuffing What do you think: Is there a threshold at Google of how much copy a website needs in order to rank well? Is it a good decision to have a single page site even if usability is slightly worse? Does it make sense to rewrite your \"about us\" a hundred times (for hundred landing pages)? Is it ethical to recommend a metric which is believed to have no effect on rankings? (This is my first YOUmoz post and I am no native speaker so please be lenient ;-)) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why you should consider breaking your subpages down to one page"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why you should consider breaking your subpages down to one page"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "salomonitc\n          \n            salomonitc"
}