{
  "url": "https://moz.com/blog/why-the-ppcseo-disconnect-is-shrinking-for-now",
  "slug": "why-the-ppcseo-disconnect-is-shrinking-for-now",
  "title": "Why The PPC-SEO Disconnect Is Shrinking (For Now) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "PPC gets 15% of the clicks and 85% of the search budget. SEO gets 85% of the clicks but just 15% of the budget. Rand called this a disconnect, I saw it as an opportunity - SEOs are cheap. But now, it appears to be shrinking. Aaron Wall pointed out that paid search spending is down and SEO is up.",
  "content": "Why The PPC-SEO Disconnect Is Shrinking (For Now) User Experience (UX) By: Gabriel Goldenberg March 18, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Gabriel Goldenberg March 18, 2009 Why The PPC-SEO Disconnect Is Shrinking (For Now) User Experience (UX) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. PPC gets 15% of the clicks and 85% of the search budget. SEO gets 85% of the clicks but just 15% of the budget. Rand called this a disconnect, I saw it as an opportunity - SEOs are cheap. But now, it appears to be shrinking. Aaron Wall pointed out that paid search spending is down and SEO is up. This can be explained in terms of simple psychological drivers. PPC is guaranteed traffic. There's no risk. You pay to play, but so long as you do pay, you will play. It's kind of like the rich out of shape guy who rents the soccer field my friends play on in the summer - he's garbage, but since he rents the place, he gets to play. PPC sells comfort. SEO is pay-to-possibly-play. There's a risk you won't be able to get to page 1. SEO sells hope. (Kinda like Jeff Lane, generally cool guy and SEM manager for Obama; he raked in donations for Obama like a bird collects twigs.) Well, it doesn't quite matter what industry you're in, be it dating or affiliate marketing business-opportunity scams (*cough Google Cash/Dollars/Billions etc. cough*), during a recession. People are buying hope. They just got their homes foreclosed (probably your fault for ranking that sketchy mortgage company) and are looking to recover or improve. At this point you're probably thinking, \"OK, Gab, that's nice to know. Now what? How do I take action?\" Adapt your copy. Target those whose risk-tolerances are greater, because they're the ones spending in a recession. Mine social media for problems that express a need for hope. This can help you find new keywords or even entirely new markets. Take my SEO blog and add the feed to your RSS reader ;). Comment about how your situation is hopeless and we'll see what can be done to help you sell hope :). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why The PPC-SEO Disconnect Is Shrinking (For Now)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why The PPC-SEO Disconnect Is Shrinking (For Now)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Unlock Your B2B SEO Content with Structured Resource Sections"
    },
    {
      "level": "H3",
      "text": "The ROI of Accessibility in SEO"
    },
    {
      "level": "H3",
      "text": "How SEOs and UX Designers Can Work Better Together — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gabriel Goldenberg\n          \n            Gabriel Goldenberg\n          \n            Gabriel Goldenberg"
}