{
  "url": "https://moz.com/blog/why-you-may-need-to-hide-your-google-places-address-asap",
  "slug": "why-you-may-need-to-hide-your-google-places-address-asap",
  "title": "Why You May Need To Hide Your Google Places Address ASAP - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A major update to the Google Places Quality Guidelines. Local SEOs and local business owners - don't overlook this important change in Google's handling of go-to-client business models.",
  "content": "Why You May Need To Hide Your Google Places Address ASAP Local SEO By: Miriam Ellis March 25, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis March 25, 2012 Why You May Need To Hide Your Google Places Address ASAP Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editor's note: Since the publication of this post, Google has rebranded Google Places as Google My Business, and has also changed the name of their forum. The contents of this article have been updated to reflect Google's current branding, while maintaining documentation of this important happening in the history of Local SEO. Happy reading! Last month, the inglorious septic system at my little old home in the country backed up and my washing machine erupted, drowning my laundry room and kitchen in two inches of water. I waded right into the flood at 9 o'clock at night with my arms full of grocery bags, shouted some colorful words and then went online. Nota Bene: do not operate a computer while standing ankle deep in water. Find a dry spot to crouch in first and then use Google's local pack to find a 24 hour plumber. This is what I did, and because I live in a rural area, Google showed me a set of plumbers within a radius of about 50 miles. Naturally, I looked for the closest one to home so that I might not be charged extra for the plumber having to take a long drive to get to me. I was successful in finding someone to help me, but if my septic system goes wild in the future, I may not be able to select the business address closest to me because Google has just made a major policy change in their handling of go-to-client business models such as plumbers, maintenance men, carpet cleaners and the like. From now on, Google wants this type of business to use the 'Hide Address' function in the Google My Business dashboard. If you operate a business like these ones or are handling the Local SEO for clients who do, you need to know about this change because failure to get with the program on this could result in your listing dropping out of sight. Here's the story: A Curious Little History On February 24, 2012, Andrew Shotland of LocalSEOGuide.com received a phone call from a Google employee who asked him if served clients at his listed address. He answered that he had both local and national clientele. The call ended, and the next time Andrew Shotland looked, his A-listing had vanished from Google Maps. Around this time, Google My Business forum Top Contributor, Linda Buquet, (Catalyst eMarketing) noticed that some posts were coming into the forum from business owners whose experience of a phone call followed by disappearance of their listing matched Andrew Shotland's, or who had simply had their listings disappear without any preceding phone call. Andrew Shotland started pinging the Places Troubleshooter and received a prompt email from a Google employee quoting an extremely obscure passage in the Google Places Help Files: What are my options when defining a service area? Don’t receive customers at your location? Serve customers at their location? Select the “Do not show my business address on my Maps listing” option within your dashboard — if you don’t hide your address, your listing may be removed from Google Maps. Not one Local SEO I know who has written about this incident had ever drilled down to a place in the files where this information lay buried. After receiving this email, Andrew set his address to hidden, and his listing popped right back. Googler Vanessa Schneider began responding to Google Places Help Forum posts about some listing problems with the advice that certain business owners should hide their address. On March 22nd the official Guidelines for representing your business on Google were updated to include the following language: If you don't receive customers at your location, you must select the \"Do not show my business address on my Maps listing\" option within your dashboard. If you don't hide your address, your listing may be removed from Google Maps. Top Contributor Linda Buquet let me know that she was instrumental in requesting that this language be moved from the old help file out front to the actual guidelines. The Upshot: If your business doesn't serve customers at your own location, you've got to edit your Google My Business listing ASAP to hide the address. Why People May Panic Over This Guideline Change Back in early 2010, Mike Ramsey of NiftyMarketing.com published his results of an experiment with the then-new 'Hide Address' function in what was then called \"Google Places\". He documented an immediate drop in rankings after choosing to hide his address. Others reported similar incidents, and it became standard knowledge in the Local SEO community that hiding your address was almost certain to result in invisibility. Business owners and SEOs who read about this at the time may now be concerned that Google's new policy will solicit the demise of their local rankings. In November of that same year, Mike Blumenthal reported that the 'Hide Address' function no longer appeared to be negatively impacting the newer blended local/organic results, but that it still appeared to be affecting the 7-pack and Maps-based results. Today, Mike Blumenthal left the following comment on my own company's blog: \"Before Venice, the hiding of your address punished your listing. Now that virtually all displays are blended and there is no longer a ranking disincentive, Google is attempting to clean up their approach to businesses based on whether a user should/could use Maps to find them.\" The Upshot: It is now believed that choosing the Hide Address feature will not negatively impact any type of local-focused rankings. So don't panic! Clarifying Your Business Model, According To Google Thanks to Google My Business forum Top Contributor, Mike Blumenthal, I feel that I have arrived at a fairly clear understanding of how Google is now classifying different business models. I'd like to pass this information on in hopes that it will help you determine whether your business needs to hide its address on its GMB listing. Type A Your business is brick-and-mortar and serves all customers at its location. Show your address. Type B Your business is home-based and serves some customers at your home and some on the road. Show your address and use the Service Radius tool. Type C Your business is home-based and does not serve any customers at your home. Hide your address. I believe these are the parameters in a nutshell. Why I'm Not Personally A Fan Of This Policy Change There are two main reasons that I am not jumping out of my seat to applaud this policy change. The first hearkens back to my experience with needing to find a local 24 hour plumber. If the addresses were all hidden in the local results, I would have no way of knowing which of the plumbers was closest to me. I don't want to be charged extra for a service person having to drive for an hour to get to my house because I didn't know he was 40 miles away. Instead of being able to tell, at a glance, that Plumber A is downtown and Plumber B is two cities away, I'm actually going to have to click through to their website to find their addresses. Thus, Google's change of policy has just made their local results less useful. My second objection runs deeper. I've been studying Local for about half a decade, now, and it's my considered opinion that Google just makes the whole thing too hard for busy local business owners. I've compared Google before to a circus ringmaster, requiring local business owners to jump through a series of flaming hoops if they want to participate - and, in fact, even if they don't want to participate. Remember that Google started their local business index by creating listings of businesses without any permission from the business owners, themselves. Suddenly, the average local business owner began to become aware that there was a giant, visible advertisement of his company on the web that he hadn't authorized and that was very likely to contain incorrect data about his business. The hoop jumping began. Over the years, business owners have had to stretch and squish themselves into a variety of odd postures to adhere to Google's ever-changing guidelines, partly out of a wish to be visible, but also out of fear that if they don't get it right, their businesses will surely suffer. While the benefits of visibility in Google's local results are tremendous, you don't have to dig deep to encounter strong, negative sentiment about their manner of interacting with the local business community. I find it unacceptable that business owners like Andrew Shotland and others apparently had their listings zapped over a policy that wasn't even listed in the official guidelines. Wouldn't it have been more helpful if the Google employees making the phone calls had been instructed to let the business owners know they needed to hide their addresses from now own? Why punish first and then make people scurry around trying to figure out how they had given offense? There are better ways to communicate, and I feel that Google still has a lot to learn about this if they ever hope to win participation in their products that stems from love rather than the disquietude of fear. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why You May Need To Hide Your Google Places Address ASAP"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why You May Need To Hide Your Google Places Address ASAP"
    },
    {
      "level": "H2",
      "text": "A Curious Little History"
    },
    {
      "level": "H2",
      "text": "Why People May Panic Over This Guideline Change"
    },
    {
      "level": "H2",
      "text": "Clarifying Your Business Model, According To Google"
    },
    {
      "level": "H2",
      "text": "Why I'm Not Personally A Fan Of This Policy Change"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}