{
  "url": "https://moz.com/blog/why-all-4-of-googles-micromoments-are-local",
  "slug": "why-all-4-of-googles-micromoments-are-local",
  "title": "Why All 4 of Google's Micro-Moments Are Actually Local - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this post, Miriam demonstrates how your local business can claim all four of Google's micro-moments (\"I want to know/go/buy/do\") as your own.",
  "content": "Why All 4 of Google's Micro-Moments Are Actually Local Local SEO By: Miriam Ellis January 3, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis January 3, 2017 Why All 4 of Google's Micro-Moments Are Actually Local Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When America’s first star TV chef, Julia Child, demonstrated the use of a wire whisk on her 1960’s cooking show, the city of Pittsburgh sold out of them. Pennsylvanians may well have owned a few of these implements prior to the show’s air date, but probably didn’t spend a lot of time thinking about them. After the show, however, wire whisks were on everyone’s mind and they simply had to have one. Call it a retro micro-moment, and imagine consumers jamming the lines of rotary phones or hoofing it around town in quest of this gleaming gadget … then zoom up to the present and see us all on our mobile devices. I like this anecdote from the pages of culinary history because it encapsulates all four of Google’s stated core micro-moments: I want to know - Consumers were watching a local broadcast of this show in Pittsburgh because they wanted to know how to make an omelet. I want to go - Consumers then scoured the city in search of the proper whisk. I want to buy - Consumers then purchased the implement at a chosen retailer. I want to do - And finally, consumers either referred to the notes they had taken during the show (no DVRs back then) or might have turned to Julia Child’s cookbook to actually beat up their first-ever omelet. Not only does the wire whisk story foreshadow the modern micro-moment, it also provides a roadmap for tying each of the 4 stages to local SEO via current technology. I’ve seen other bloggers pointing to the ‘I want to go’ phase as inherently local, but in this post, I want to demonstrate how your local business can decisively claim all four of these micro-moments as your own, and claim the desirable transactions resulting thereby! Want to learn more about Local SEO firsthand? Join the experts — grab your tickets to MozCon Local, February 27th & 28th in Seattle! Register now! Understanding Google’s definition of micro-momentsGoogle whisked up some excitement of their own with the publication of Micro-Moments: Your Guide to Winning the Shift to Mobile. Some of the statistics in the piece are stunning: 65% of smartphone users look for the most relevant information on their devices regardless of what company provides that information, 90% of them aren’t certain what brand they want to purchase when they begin their Internet search, 82% consult their smartphones even after they are inside a chosen store, and ‘how-to’ searches on YouTube are growing 70% year-over-year. Google defines micro-moments as “critical touch points within today’s consumer journey, and when added together, they ultimately determine how that journey ends,” and goes on to identify mobile as the great facilitator of all this activity. It’s simple to think of micro-moments as a series of points in time that culminate in a consumer arriving at a transactional decision. For local business owners and their marketers, the goal is to ‘be there’ for the consumer at each of these critical points with the resources you have developed on the web. Let’s reverse-engineer the famous tale of the wire whisk and put it into a modern technological context, demonstrating how a hypothetical cooking supply store in Pittsburgh, PA could become a major micro-moments winner in 2017. A variable recipe for local micro-moments successI want to be sure to preface this with one very important proviso about the order in which micro-moments happen: it varies. For example, a consumer might decide she wants to patch cracks in her ceiling so she watches a video on YouTube demoing this >>> looks up the name of the putty the YouTube personality was using >>> looks up where to buy that putty locally >>> buys it. Or, the consumer could already be inside a home improvement store, see putty, realize she’d like to patch cracks, then look up reviews of various putty brands, look at a video to see how difficult the task is, and finally, purchase. There is no set order in which micro-moments occur, and though there may be patterns specific to auto body shops or insurance firms, the idea is to be present at every possible moment in time so that the consumer is assisted, regardless of the order in which they discover and act. What I’m presenting here is just one possible path. In quest of the fluffier omelet Image courtesy of Prayitno on Flickr Our consumer is a 30-year-old man named Walter who loves the fluffy omelets served at a fancy bistro in Pittsburgh. One morning while at the restaurant, Walter asks himself, “I wonder why I can’t make omelets as fluffy as these at home. I’m not a bad cook. There must be some secret to it. Hey — I challenge myself to find out what that secret is!” I want to knowWhile walking back to his car, Walter pulls out his smartphone and begins his micro-moment journey with his I-want-to-know query: how to make a fluffier omelet. Across town, Patricia, the owner of a franchise location of Soup’s On Cooking Supply has anticipated Walter’s defining moment because she has been studying her website analytics, studying question research tools like Answer The Public, watching Google Trends, and looking at Q&A sites like this one where people are already searching for answers to the secret of fluffy omelets. She also has her staff actively cataloging common in-store questions. The data gathered has convinced her to make these efforts: Film a non-salesy 1.16-minute video in the store’s test kitchen demonstrating the use of a quality wire whisk and a quality pan (both of which her store carries) for ideal omelet results. Write an article/blog post on the website with great photos, a recipe, and instructions revealing the secrets of fluffy omelets. Include the video in the article. Share both the article and video socially, including publishing the video on the company’s YouTube channel (*interesting fact, it might one day show up inside the company’s Google Knowledge Panel). Answer some questions (electric vs. balloon whisk, cast iron vs. non-stick pan for omelet success) that are coming up for this query on popular Q&A-style sites. Try to capture a Google Answer Box or two. Walking down the street, Walter discovers and watches the video on YouTube. He notices the Soup’s On Cooking Supply branding on the video, even though there was no hard-sell in its content — just really good tips for omelet fluffiness. I want to go“Soup’s On near me,” Walter asks his mobile phone, not 100% sure this chain has an outlet in Pittsburgh. He’s having his I-Want-To-Go moment. Again, Patricia has anticipated this need and prevented customer loss by: Ensuring the company website clearly lists out the name, address, and phone number of her franchise location. Providing excellent driving directions for getting there from all points of origin. Either using a free tool like Moz Check Listing to get a health check on the accuracy of her citations on the most important local business listing platforms, or complying with the top-down directive for all 550 of the brand’s locations to be actively managed via a paid service like Moz Local. Walter keys the ignition. I want to buyWalter arrives safely at the retail location. You’d think he might put his phone away, but being like 87% of millennials, he keeps it at his side day and night and, like 91% of his compadres, he turns it on mid-task. The store clerk has shown him where the wire whisks and pans are stocked, but Walter is not convinced that he can trust what the video claimed about their quality. He’d like to see a comparison. Fortunately, Patricia is a Moz Whiteboard Friday fan and took Rand’s advice about comprehensive content and 10x content to heart. Her website’s product comparison charts go to great lengths, weighing USA-made kitchen products against German ones, Lodgeware vs. Le Creuset, in terms of price, performance for specific cooking tasks, and quality. They’re ranking very well. Walter is feeling more informed now, while being kept inside of the company’s own website, but the I-Want-To-Buy micro-moment is cemented when he sees: A unique page on the site for each product sold Consumer reviews on each of these pages, providing unbiased opinion Clearly delineated purchasing and payment options, including support of digital wallets, Bitcoin, and any available alternatives like home delivery or curbside pickup. Walter may be in the store right now, but he’s glad to learn that, should he branch out into soup kettles in future, he has a variety of ways to purchase and receive merchandise. I want to doThe next day, Walter is ready to make his first fluffier omelet. Because he’s already been exposed to Patricia’s article on the Soup’s On Cooking Supply website, he can easily return to it now to re-watch the video and follow the recipe provided. Even in the I-want-to-do phase, Walter is being assisted by the brand, and this multi-part experience he’s now had with the company should go far towards cementing it in his memory as a go-to resource for all of his future culinary needs. It would be excellent if the website’s page on fluffy omelets also challenged Walter to use his new whisk for creating other dishes — perhaps soufflés (for which he’ll need a ceramic ramekin) or chantilly cream (a nice glass bowl set over ice water helps). Walter may find himself wanting to do all kinds of new things, and he now knows exactly where he can find helpful tutorials and purchase the necessary equipment. More micro-moment variablesAs we’ve seen, it’s completely possible for a local business to own all four of Google’s attested micro-moments. What I can’t cover with a single scenario is all of the variables that might apply to a given geography or industry, but I do want to at least make mention of these three points that should be applicable to most local businesses: 1. Understanding how Micro-Moments BeginThe origins of both I-want-to-do and I-want-to-know moments are incredibly varied. A consumer need can arise from something really practical, as in, it’s winter again and I need to buy snow tires. Or, there can be public/cultural happenings (like Julia Child’s cooking program) to which consumers’ ultimate transactions can be directly traced. To discover the sparks that ignite your specific customers’ micro-moments fires, I recommend delving further into the topic of barnacle local SEO — the process of latching onto existing influences in your community in order to speak to existing wishes and needs. 2. Investing in mobile UXGoogle states that 29% of smartphone users will immediately navigate away from any website or app that doesn’t satisfy them. 70% of these cite slow loading and 67% cite too many steps to reach information or purchase as reasons for dissatisfaction. On November 4, 2016, Google announced its major shift toward mobile-first indexing, signaling to all website publishers that Google sees mobile, rather than desktop, as the primary platform now. Google’s statistics and policies make it irrefutable that every competitive local business which hasn’t yet done so must now devote appropriate funds to creating the best possible mobile user experience. Failure to do so risks reputation, rankings, and revenue. 3. Investing in in-store UXThough my story of Walter touches briefly on the resources Patricia had built for his in-store experience, I didn’t delve into the skyrocketing technology constantly being pioneered around this micro-moment phase. This would include beacons, though they have so far failed to live up to earlier hype in some ways. It could involve the development of in-store apps. And, at the highest echelons of commerce, it could include kiosks, augmented, and virtual reality. From shoestring to big-time, micro-moments aren’t so new Image courtesy of Glenn Dettwiler on Flickr KFC may strive to master I-want-to-buy moments with chicken-serving robots, Amazon Go may see micro-moments in checkout-free shopping, and Google Home’s giant, listening ear may be turning whole lives into a series of documented micro-moments, but what makes sense for your local business? The answer to this is going to be dictated by the competitiveness of your industry and the needs of your consumer base. Does a rural, independently owned hardware store really need a 6-foot-high in-store touch screen enabling customers to virtually paint their houses? Probably not, but a well-written comparison of non-toxic paint brands the shop carries and why they’re desirable for health reasons could transform a small town’s decorating habits. Meanwhile, in more competitive markets, each local brand would be wise to invest in new technology only where it really makes proven sense, and not just because it’s the next big thing. Our industry loves new technology to a degree that can verge on the overwhelming for striving local business owners, and while it can genuinely be a bit daunting to sink your teeth into all of the variables of winning the micro-moment journey, take heart. Julia Child sold Pittsburgh out of wire whisks with a shoestring, black-and-white PBS program on which she frequently dropped implements on the floor and sent egg beaters flying across rooms. With our modern capabilities of surveying and mining consumers needs and presenting useful solutions via the instant medium of the web, what can’t you do? The steps in the micro-moments funnel are as old as commerce itself. Simply seize the current available technology ... and get cooking! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why All 4 of Google's Micro-Moments Are Actually Local"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why All 4 of Google's Micro-Moments Are Actually Local"
    },
    {
      "level": "H2",
      "text": "Understanding Google’s definition of micro-moments"
    },
    {
      "level": "H2",
      "text": "A variable recipe for local micro-moments success"
    },
    {
      "level": "H2",
      "text": "In quest of the fluffier omelet"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "I want to know"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "I want to go"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "I want to buy"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "I want to do"
    },
    {
      "level": "H2",
      "text": "More micro-moment variables"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "1. Understanding how Micro-Moments Begin"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "2. Investing in mobile UX"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "3. Investing in in-store UX"
    },
    {
      "level": "H2",
      "text": "From shoestring to big-time, micro-moments aren’t so new"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}