{
  "url": "https://moz.com/blog/why-you-should-attend-localup-5-reasons-to-help-you-make-your-case",
  "slug": "why-you-should-attend-localup-5-reasons-to-help-you-make-your-case",
  "title": "Why You Should Attend LocalUp: 5 Reasons to Help You Make Your Case - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With so many great conferences on the calendar for the first part of 2015, I'm sure many of you are deciding which ones are going to be most worth your time and budget to attend. In my best Jerry Maguire, \"help me help you\" make the case to include LocalUp in your conference itinerary to your boss…",
  "content": "Why You Should Attend LocalUp: 5 Reasons to Help You Make Your Case Local SEO | SEO Events By: David Mihm December 1, 2014 Table of Contents Copied! By: David Mihm December 1, 2014 Why You Should Attend LocalUp: 5 Reasons to Help You Make Your Case Local SEO | SEO Events Editor's note: Hoping to attend a future Moz Conference? We'd love to see you! Hopefully most of you already saw the announcement of our one-day conference coming in February: LocalUp Advanced. If not, here are the details: LocalUp Advanced Presented by Local U and Moz Saturday, February 7, 2015 The MozPlex, Seattle, WA $699 for Local U and Moz subscribers $999 general admission Tickets available here With so many great conferences on the calendar for the first part of 2015, I'm sure many of you are deciding which ones are going to be most worth your time and budget to attend. In my best Jerry Maguire, \"help me help you\" make the case to include LocalUp in your conference itinerary to your boss or finance team. Reason 1: Local U's Track Record In 2014, Local U hosted three events geared towards professional marketers (in addition to a half-dozen events aimed at beginners and typical small businesses). 100% of 2014 attendees who responded to the survey question \"Do you feel like you received good value from the event?\" said \"Yes\" following these events. This kind of feedback is one of the reasons I wanted to make sure Local U was integral in Moz's first Local-focused event. While it's true LocalUp features a slightly different format, you'll hear from all Local U speakers. Reason 1a: MozCon's Track Record You'll also hear from Dr. Pete Meyers, Rand Fishkin, Cindy Krum, Dana DiTomaso, and Darren Shaw. Year after year, these are some of the top-rated speakers at MozCon. Chances are, you know someone who attended either Local U Advanced or MozCon in the last couple of years. And according to Nielsen, 90% of us trust recommendations from friends when making purchase decisions (just one of many interesting nuggets about online reviews you're likely to pick up at LocalUp). Pat on the back, I'm almost done! The flip side is, I still have 10% of the rest of you to convince. So I'll keep going a bit longer. Reason 2: Relationship-building While we don't plan on inviting a representative from the Guinness Book of World Records to the event, LocalUp might represent the highest concentration of local search geeks ever together at one time. At our afternoon roundtables, there will be plenty of knowledge-sharing all-around—not just from the panelists but between the attendees as well. You'll meet people who are struggling with the same things you are—and, hopefully, have figured out how to solve them. Speaking from personal experience, some of my closest friends (many of the speakers at LocalUp!) and people I rely on for professional support, I've met by striking up a conversation at a lunch table or over a beer at various conferences. The critical mass of local marketers LocalUp will bring together means your odds of making similar relationships go through the roof. Reason 3: Talk to a Google My Business representative face-to-face At a typical industry event, Google representatives are swarmed by attendees, and you're lucky to get two or three minutes of 1:1 time. At LocalUp, we've literally got hours of time set aside for you and your fellow attendees to interact with Google in small-group breakout sessions. Not to mention, Google is Jade Wang. If you haven't met her before, Jade is just awesome. She's got thousands of hours of experience helping users in the Google My Business forum and an amazing track record of getting issues resolved for them. Jade won't give away any algorithmic secrets, of course, but in addition to getting specific issues resolved, she'll help you understand Google's perspective on Local. That kind of insight can be incredibly valuable as you develop a sustainable, long-term Local marketing strategy. Reason 4: Financial efficiency of attending Cost to attend LocalUp (all-in): $1,300 - $1,900Cost of ticket: $699 - $999Cost of two nights' hotel: $360Cost of light rail to and from downtown Seattle from the airport: $5.50Cost of two meals on the road (Moz will feed you all day Saturday!): $50Roundtrip Friday-Sunday airfare from major US cities: $185 - $450 Cost of hiring speakers for consulting: $2,250Average hourly consulting rate per speaker: $250Number of hours of content on the agenda: 9 And in the case of some speakers, they're not even available for a consultation no matter how hard you tried to hire them (Rand, Dr. Pete). The opportunity to pick speakers' brains privately at the after-party—and get totally specific advice for your business—is something you'll only get by attending an event like this in person. As opposed to traditional industry events, where there might be a session or two devoted to Local Search, this will be all Local, all the time. We're bringing this amazing set of thought leaders together in one place so you don't have to hunt their wisdom at conferences across the country. Throw in a discounted intro membership to the Local U forums that all attendees will receive and you're already at a 1.5 - 2X return on the money spent on the conference. Reason 5: Pure ROI Of course, every conference should also pencil out on its impact to your business's bottom line. Let me run a couple of scenarios by you that I think demonstrate the ways in which your takeaways from LocalUp will deliver hard dollars. Client acquisition:Dr. Pete, Professor Maps (aka Blumenthal), and Rand will broaden and shift the way you think about local search. The creative enhancements you'll be able to make in your RFPs will give your company a competitive advantage when it comes to persuading new client to sign up. Basically, incorporating their knowledge will help you look smarter to your prospects and lead to a higher close rate. Obviously client receivables will vary based on the size and scope of your business, but I don't think it's a stretch to say LocalUp will help you sign at least 6-8 new clients over the course of 2015 alone. Or, if you work in-house and your \"client\" is really your boss, what you learn from LocalUp will help you get more buy-in and more budget for Local activities. Client retention:LocalUp will also teach you techniques and tactics that'll make your efforts on behalf of your existing clients more effective. Mary Bowling will help you squeeze the most targeted visits out of your clients' digital footprints with her presentation on keyword research. You'll be inspired by Mike Ramsey and Darren Shaw's presentations on content and review acquisition to land more customers for your clients. And Ed Reese will help you package your reports in the most compelling way possible so that clients will see this newfound value. For in-house marketers, scale this expertise across hundreds or thousands of locations and the return is even bigger than it is for a typical consultant or agency. Scope expansion:The presentations at LocalUp will also help you grow your business as you expand and improve your offerings beyond just SEO. Aaron Weiche and Cindy Krum will bring you up to speed on bleeding-edge mobile strategy and best practices, and Will Scott will help you figure out how to tie in the social component for maximum virality. The final analysis Obviously, I'm biased, but I think for local search marketers, LocalUp will be the most valuable conference you will attend next year. Yes, there are nicer places to go in February than Seattle (Maui 2016, anyone?), but as you think about how to spend those remaining 2014 marketing dollars or map out your travel schedule for 2015, I hope LocalUp is at the top of your list. Whether you’re a consultant, agency, or in-house marketer, it’ll be a great investment not only in your professional development, but also in its bottom-line impact on your business's revenue. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why You Should Attend LocalUp: 5 Reasons to Help You Make Your Case"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why You Should Attend LocalUp: 5 Reasons to Help You Make Your Case"
    },
    {
      "level": "H3",
      "text": "Reason 1: Local U's Track Record"
    },
    {
      "level": "H3",
      "text": "Reason 1a: MozCon's Track Record"
    },
    {
      "level": "H3",
      "text": "Reason 2: Relationship-building"
    },
    {
      "level": "H3",
      "text": "Reason 3: Talk to a Google My Business representative face-to-face"
    },
    {
      "level": "H3",
      "text": "Reason 4: Financial efficiency of attending"
    },
    {
      "level": "H3",
      "text": "Reason 5: Pure ROI"
    },
    {
      "level": "H3",
      "text": "The final analysis"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Mihm\n          \n            David Mihm\n          \n            David Mihm"
}