{
  "url": "https://moz.com/blog/why-linkedin-is-a-better-option-than-google-local-for-b2b-providers",
  "slug": "why-linkedin-is-a-better-option-than-google-local-for-b2b-providers",
  "title": "Why LinkedIn is a Better Option than Google Local for B2B Providers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you're like me and run your own business you will know that referrals are a great way of getting a steady stream of new clients. If your client referrals bring in a steady stream of new business, then there’s no doubt you are good at what you do. One of the best aspects of referral customers is…",
  "content": "Why LinkedIn is a Better Option than Google Local for B2B Providers Local SEO By: Will Craig March 11, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Will Craig March 11, 2013 Why LinkedIn is a Better Option than Google Local for B2B Providers Local SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Editor's note: Due to the age of this post, referenced statistics and strategies may no longer be applicable. We're preserving it as-is, for the sake of posterity. If you're like me and run your own business you will know that referrals are a great way of getting a steady stream of new clients. If your client referrals bring in a steady stream of new business, then there’s no doubt you are good at what you do. One of the best aspects of referral customers is that they actively promote your business – you should take advantage of this. If your business regularly excels at the service you provide then you should be looking into a strategy of collecting client reviews and feedback. Google Local is a great service for building client feedback, but does Google Local fit every business? If you're a plumber, plasterer, or drain cleaner then Google Local fits your business perfectly – a profile gives the user exactly the information they need to make a decision: Providers by distance - Great! They are 10 minutes away! Opening Hours – Perfect! I can drop by. Client Work Pictures - I can see the quality they are offering. Coupons and Special Offers – Great – they have a two for one Deal Quality of Service Review - I am sold! This kind of information is great for making a snap decision about who should clean your pipes, plaster your wall or where you and a friend should eat out this week. But what if the decision is which company to award a $5000 web design contract or a $10,000 pay per click campaign? Would this data be useful for making a decision like that? I don't think so. Is Google Local the Right Fit? Personally speaking, if I was planning to invest $5,000, $10,000 or $20,000 in hiring a marketing company, law or accountant firm I would not be swayed by a Google Local profile – actually it might put me off their business if they had a Google Local profile packed with reviews – I might doubt their authenticity. People paying a lawyer $250 an hour do not leave a review. Don't get me wrong I think Google Local is great service for a selected range of businesses. But a law firm using Google Local? That’s a bit of a long shot. Then again it's important to point out that depending on the type of service your business offers not all Google Local profiles get the same level of exposure in local listings. For example, since 2010 Google has not displayed web design and SEO firms in their local results yet we still all look to optimise our profiles for best possible results. Is it possible that our time would be best spent elsewhere? So in good old SEOmoz fashion I set up a test! I completed a check of 100 Google Local accounts under the term “Law Firm London,” used my handy SEOmoz toolbar to export the results into a spreadsheet, then manually checked each profile, recording how many reviews each had. Google automatically creates profiles for businesses, I also checked to see if any images such as logos had been added to each of the profiles. This was a way of verifying if the profiles had been updated since they were created, as adding your logo is a basic step of claiming your profile. The Results Keyword “Law Firm London” Without profile image With profile image Reviews Without Reviews 59 41 14 86 59% of profiles did not have any images Only 14% have reviews Now let's compare the results against a keyword that better fits the five key information fields in a Google Local which I listed earlier. Keyword: “Plumbers London” Without profile image With profile image Reviews Without Reviews 29 71 68 32 71% of profiles have any images 68% have reviews Conclusion The obvious conclusion is that Law Firms and Accountants don't care about Google Local; I think there is some truth in that high value B2B services see Google Local little more than a map listing tool. So the question is, if Google Local is not adequate for B2B services then what is? B2B clients take their time selecting a provider. I often find my company shortlisted for a face-to-face meeting with a client, sometimes an informal chat – almost a pre-screening – on other occasions a full blown five on one “what you can do for us” kind of meeting. From these meetings one thing I am asked more and more often is “Why should we select your company?” followed up with “who have you worked for in the past?” I think this sheds light on what's missing from Google Local from the point of view of a B2B service provider: These questions are not answered. In truth your Local profile offers very little information about your company, products or previous clients. Why LinkedIn Company Page is Better than Google Local For B2B services my strategy is now to focus on LinkedIn personal and business profiles to help promote a client's business. A LinkedIn company profile offers a potential client a much better spectrum of data that will make your business stand out. Here is Our Google Local Page Here is Our LinkedIn Profile LinkedIn Company Page Setup First of all, you need to create a company page (check out this video tutorial created by LinkedIn). Then add your basic business information such as name, address, industry and a website URL. Once the basics are out the way it’s time to optimise your profile. We will be covering the following tasks in this article: Adding your Services Adding Offers Service Recommendations Tips & Tricks - (Footer Links, Google Analytics) Setting Up Your Services Page Unlike Google Local, LinkedIn lets you add products/services to your company profile, up to 25 (25 is a little overkill, but the option is there for you). The services page is set up like a landing page where you can add up to three banners and some informational content about your business with the services listed below. To start editing the services page click the blue edit button. You will see a series of steps from 1 to 4. The editor is fairly intuitive, so I’ll restrict my comments to some key points to help you out. Services Page Step 1: Create Multiple Variations of This Page Your service page can be targeted towards specific industries and job functions. If you offer a range of services that suit all business types then you would most likely target everyone, so just use the default profile that has already been created for you. On the other hand, if your business offers a range of specific services for a wide range of industries then you should create a custom profile for a specific type of industry: Click on “create new audience” button Give your audience a name (e.g., ‘Engineering Industry’) then select one of the refining options (e.g., Job Function, Geographic Area, etc.) Save your audience Now that your audience is saved you should see two variations of your service page: Services Page Step 2: Services Statement Now you can add an overview description about your company, products, and services using the HTML editor. I would not go crazy here – when the page is live it gets snipped off using a “More” tag. Keep it short, simple, and to the point. Services Page Step 3: Banner Setup Your services page supports up to three custom banners (646x222 pixels). My advice here is to spend time creating a set of banners that advertise your services; we opted for a set of promotional banners such as “Free SEO Audit” or “$100 Adwords Credit.” You can link the banners directly to your site so make sure you add Call to Actions. Services Page Step 4: Home Page Services The last step lets you add services directly to your company homepage, so users won’t need to navigate to your services page to see what you offer. Use the dropdown menus to set the order. Now click “publish” (top right of the screen). Adding Services/Products to Your Service Landing Page Now you have your services landing page set up it’s time to add the actual services. This part is very easy, so to save some time I will cover just the key areas. To add a service simply hover over the blue edit button on the services page, then select add service from the drop-down menu that appears. Adding Services Tips Step 4: Adding an Image A quick tip: Your page will look much more professional if all your service images match. Nothing too fancy is needed, just a bit of text and background colour. I would advise you to avoid little grey SEO stick figures, dart boards, and magnifying glasses! Step 7 & 8 Website and Contact Link You can link directly to your website from an individual service – the link appears to the right of the service page. You can also list your team members who also have LinkedIn accounts; a small contact form will open allowing users to email you directly. Step 9 & 10: YouTube and Promotions If you have a video about the service you can easily add this. All videos are viewable on the page so no redirect to YouTube is necessary. You also have the option to add a small promotion to your service page that links directly to your site. Now select “publish” and your service is live. Service Recommendations One of the best features of LinkedIn Company page is that you can request recommendations from previous clients via an easy-to-use interface (please note the person you are asking to recommend your service must already be connected to your personal profile). This feature is what sets LinkedIn recommendations apart from Google Local reviews – with recommendations you can verify who left the review and their position within the company. (A) Click request recommendation (B) Then select a contact Tips & Tricks Footer Link If you run a web design or marketing company often it was common practice to add your company name or – worse – exact anchor text in the footer of a website you might have designed or helped market. Recent Google updates have hit exact anchor text footer links hard. As a development company adding my business link to the bottom of a client’s page brings us possible referral traffic and new clients, but also increases our C-Block links. To stay on Google’s good side, if a client recommends one of our services we now link directly from the footer to our LinkedIn page recommendation. Practical Audience Example The audience feature on your LinkedIn profile page has great potential; remember an audience is a custom version of your services page targeted towards an industry. Say for example you have three blue chip hotel clients you have done work for and you want to target similar clients. You could create a custom services page targeted towards the travel industry, create a custom travel related service i.e. ‘Hotel Marketing’ then gain recommendations from your three big hotel clients under this service. Now when you reach out to other hotels included your LinkedIn profile in your email. Google Analytics While LinkedIn has its own analytics section called Insights which can tell you some useful information about the type of people viewing your profile, Google Analytics also tracks visitors via the source referral, and you will also get their referral path which will tell you what service(s) the visitor looked over. Final Point A LinkedIn Company page is a must if your company is offering business-to-business services. It offers the right mix of features such as verified reviews and company branding. The only negative is that LinkedIn does not give you a “dofollow” link. Google Places is useful to help the client find the location of your office but an optimised LinkedIn account will make them call you in the first place. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why LinkedIn is a Better Option than Google Local for B2B Providers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why LinkedIn is a Better Option than Google Local for B2B Providers"
    },
    {
      "level": "H2",
      "text": "Is Google Local the Right Fit?"
    },
    {
      "level": "H2",
      "text": "So in good old SEOmoz fashion I set up a test!"
    },
    {
      "level": "H2",
      "text": "The Results"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Why LinkedIn Company Page is Better than Google Local"
    },
    {
      "level": "H2",
      "text": "Here is Our Google Local Page"
    },
    {
      "level": "H2",
      "text": "Here is Our LinkedIn Profile"
    },
    {
      "level": "H2",
      "text": "LinkedIn Company Page Setup"
    },
    {
      "level": "H2",
      "text": "Setting Up Your Services Page"
    },
    {
      "level": "H3",
      "text": "Services Page Step 1: Create Multiple Variations of This Page"
    },
    {
      "level": "H2",
      "text": "Services Page Step 2: Services Statement"
    },
    {
      "level": "H2",
      "text": "Services Page Step 3: Banner Setup"
    },
    {
      "level": "H2",
      "text": "Services Page Step 4: Home Page Services"
    },
    {
      "level": "H2",
      "text": "Adding Services/Products to Your Service Landing Page"
    },
    {
      "level": "H2",
      "text": "Adding Services Tips"
    },
    {
      "level": "H3",
      "text": "Step 4: Adding an Image"
    },
    {
      "level": "H3",
      "text": "Step 7 & 8 Website and Contact Link"
    },
    {
      "level": "H3",
      "text": "Step 9 & 10: YouTube and Promotions"
    },
    {
      "level": "H2",
      "text": "Service Recommendations"
    },
    {
      "level": "H2",
      "text": "Tips & Tricks"
    },
    {
      "level": "H3",
      "text": "Footer Link"
    },
    {
      "level": "H3",
      "text": "Practical Audience Example"
    },
    {
      "level": "H3",
      "text": "Google Analytics"
    },
    {
      "level": "H2",
      "text": "Final Point"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Craig\n          \n            Will Craig\n          \n            Will Craig"
}