{
  "url": "https://moz.com/blog/widgetlike-techniques-for-small-business-link-building",
  "slug": "widgetlike-techniques-for-small-business-link-building",
  "title": "Widget-Like Techniques for Small Business Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As much as I’m looking forward to SES San Jose next week, one of the areas for improvement for these kinds of conferences, in my opinion, is more presentations targeted to small businesses and sites with smaller budgets.  Jennifer Laycock (Search Engine Guide) and Matt ...",
  "content": "Widget-Like Techniques for Small Business Link Building Link Building By: David Mihm August 16, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: David Mihm August 16, 2007 Widget-Like Techniques for Small Business Link Building Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As much as I’m looking forward to SES San Jose next week, one of the areas for improvement for these kinds of conferences, in my opinion, is more presentations targeted to small businesses and sites with smaller budgets. Jennifer Laycock (Search Engine Guide) and Matt McGee (Small Business SEM) are among the few mainstream speakers who target their presentations toward this audience. It’s one thing for the guys and gals on the big stage to exhort tactics like linkbaiting, link buying, facebook apps, affiliate programs, etc for Fortune 500 and Fortune 1000 companies. But for the mom-and-pop shop whose $5,000 website is close to breaking the bank already, these aren’t really viable options. (And incidentally, even if your smaller clients CAN afford a few targeted link buys <ahem> linkbait attempts, the cost of the time you spend investigating quality links brainstorming ideas often outpaces the real success of your efforts.) Widgets are another favorite strategy of SEOs with large clients. Like the other tactics above, though, the cost of development for even a cheap widget can be greater than most smaller clients can budget for their entire website. There are widget-like strategies that can work well for smaller clients though. Five are spelled out below. None of these will be earth-shattering to experienced Fortune 500 SEOs, but they’re simple techniques that small business marketers (and importantly, small business clients themselves) can use to build the link base of websites they’re responsible for. They’re not quite as scalable as traditional widgets, but SEOs and developers can structure their contracts so that they’re become win-win solutions for both marketer and client, particularly if the client’s site itself calls for development of similar features anyway. (Incidentally, I’m not exactly what to call these things because they’re not necessarily concrete like traditional widgets. “Smidgets” is the best I’ve come up with, but maybe the ‘moz community can think of something better!) Create blog themes that link to your client’s website in the credits, rather than your own. This is probably the most obvious of the five. Plenty of designers have been using this tactic since the advent of popular open-source blogging systems like Wordpress. But I’ve yet to see a template among the blogs I read that doesn’t link back to the designer’s own website. Why not embed a client’s URL in the credits—particularly if you can create a look-and-feel that will appeal to bloggers in the client’s general industry? There’s obviously a fairly heavy cost of time involved to create a theme, but it’s the most eminently scalable of any of the techniques discussed here, and doesn’t require any brainstorming about what content to include in a widget. Create a Lightbox script that allows businesses to show off their products or satisfied clients. This one clearly depends on the industry, but in many cases, testimonials or products pages are well-suited to a slideshow-style presentation. (For those that aren’t familiar, Lightbox is a popular set of Javascripts that creates an amazing, slick-looking effect that is mind-numbingly simple to set up.) In my experience, small business owners are uniformly impressed by the effect and don’t realize how simple it is for experienced web developers to set up. It can add significantly to the professionalism of their own site and might be worth an unobtrusive link to your client in the footer or sidebar, particularly if your client isn’t a direct competitor. Develop a contact form (especially one that posts to a Google Spreadsheet or Google Calendar for subscriber / customer management). This one may seem obvious to a lot of us, but an astounding number of small business websites don’t have even so much as a simple form on their ‘Contact Us’ page – it’s just the address, phone, and email of the business. It’s hard to know how many companies leave this off because of their aesthetic / marketing preference, but it’s a safe bet a number of them just didn’t know where to start in embedding these forms. This strategy could be extended to other POST-based operations for various industries, like reservations for a restaurant or appointments for hair salon. The main thing is to realize its scalability—once you’ve built a form that works, changing a duplicate with a few keystrokes makes the same form work for any number of additional sites. Again, many small business owners would be happy to have the added functionality on their site in exchange for an unobtrusive link to your client’s URL. (Incidentally, “Contact Us” pages sometimes carry a lot of internal link juice because they’re linked to from every page on the site. :) ) Create a mashup using Javascript and a Google Spreadsheet or Google Calendar API. This one works well if you’re already developing a mashup as part of your client’s contract. Once you’ve got the process of integrating the API down, it’s a cinch to change the API key & pull information from a different spot on Google's server. Clients love Google Spreadsheets and Calendars because they’re so easy to use & there’s no complicated back end to learn when they make updates. A few examples where this might be particularly successful: -product inventory -monthly or seasonal restaurant menus -upcoming event dates With CSS, you can easily customize the look of the information as it’s dropped into any website, so formatting the mashup to match any website is a snap. And it adds a tangible, functional benefit that can be well worth the trade-off of a simple link to non-competitor. Offer to integrate Google Checkout / Paypal for donations or purchases in return for a link to your client. This is probably the easiest strategy of the five to implement, since it only takes about five minutes to get set up on either one of these payment systems. But it’s also the one that’s probably going to be the lowest probability of success, since few organizations are going to give a stranger (even a well-meaning one) access to their private information when it comes to finances. Still, there may be non-profits and other start-up businesses desperate to take credit cards for donations or purchases who appreciate your hand-holding enough to throw your client a link—particularly if your client can vouch for your trustworthiness. So, what are the keys to maximizing the potential of these kinds of strategies? Non-tech savvy people need to be understand the benefit. The average small business owner has about 1/10th the online wherewithal of your average blogger, so it’s got to be something that he/she can see is going to add to the professionalism or functionality of his/her website. If it’s code, it’s gotta be easy to install. Some small businesses take pride in creating and managing their own websites, and the ones who don’t might be hesitant about giving you their login and server info for you to upload changes yourself. Either make your code easy to copy-and-paste, or create a brand-new page for the company using its existing website as a model (with your code embedded), attach it in an email, and let them worry about how to link it within their site. When marketing, search for businesses in the same industry as your client but outside their geographic area. This way, there’s no danger of being rejected as a direct competitor, and the incoming links are from incredibly relevant sites that themselves rank well for terms highly similar to the ones you’re trying to rank for (for instance, “dentists Oakland CA” vs. “dentists Fresno CA”). Rotate the anchor text in your embedded links. This is actually a real benefit of “smidgets” vs. widgets. Yes, it takes more time to create and market “smidgets,” but they allow you rank for many more terms than widgets do, without tripping any spam sensors at the search engines. Train your clients on how to find potential adopters of your “smidget.” You don’t need to be a “Link Ninja” to search for similar businesses around the country that are potential targets for this kind of marketing. Training your clients on what kinds of sites to look for in a half-hour session gets you off the hook for tedious work and reduces the marketing costs for them! Thanks for reading! David Mihm is a small business website designer & SEO consultant based in Oakland, CA. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Widget-Like Techniques for Small Business Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Widget-Like Techniques for Small Business Link Building"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Mihm\n          \n            David Mihm\n          \n            David Mihm"
}