{
  "url": "https://moz.com/blog/wikipedia-finally-makes-the-right-decision",
  "slug": "wikipedia-finally-makes-the-right-decision",
  "title": "Wikipedia Finally Makes the Right Decision - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It may seem odd coming from someone who practices link building and whose clients require the service, but I'm gald to see that Wikipedia has shifted back to nofollow on all outbound links. What surprises me is that a relatively small-time SEO contest was the catalyst (according to ...",
  "content": "Wikipedia Finally Makes the Right Decision Link Building By: Rand Fishkin January 21, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 21, 2007 Wikipedia Finally Makes the Right Decision Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It may seem odd coming from someone who practices link building and whose clients require the service, but I'm gald to see that Wikipedia has shifted back to nofollow on all outbound links. What surprises me is that a relatively small-time SEO contest was the catalyst (according to Wikipedia's talk page on the subject). At Jimbo Wales' directive, all external links within the English language Wikipedia are now coded \"nofollow\" -- this should help cut spamming immensely once word gets out in the SEO community. This was mentioned in the discussion Wikipedia:Administrators' noticeboard#Globalwarming awareness2007/SEO world championship -- expect a spam onslaught. As usual, the \"SEO\" brush is applied as a moniker to mean \"those who spam for links.\" I don't expect this language or reputation to change, but it's always sad to see. What will be interesting to watch is how it really affects Wikipedia's spam problem. From my perspective, there may be slightly less of an incentive for spammers to hit Wikipedia pages in the short term, but no less value to serious marketers seeking to boost traffic and authority by creating relevant Wikipedia links. I'm just keeping my fingers crossed that Wikipedia doesn't revert back and switch back to live links in the future. Since anyone can add them, Wikipedia is practically the definition of where nofollow should be instituted. Matt Cutts mentioned back in our multiple choice interview that: In my ideal world, Wikipedia would add nofollow to their untrusted links, but work out ways to allow trusted links to remove the nofollow attribute. They're halfway to your dream Matt. Here's to hoping they don't go any further :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Wikipedia Finally Makes the Right Decision"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Wikipedia Finally Makes the Right Decision"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}