{
  "url": "https://moz.com/blog/will-variable-minimum-bids-make-yahoo-search-marketing-more-attractive",
  "slug": "will-variable-minimum-bids-make-yahoo-search-marketing-more-attractive",
  "title": "Will Variable Minimum Bids Make Yahoo! Search Marketing More Attractive? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If MSN Adcenter is the red-headed stepchild of the paid search family then is Yahoo! Search Marketing that slightly sozzled uncle you have to put up with once a year at Christmas? But spurious and obvious analogies aside, I know the lesser two rivals of the Adwords behemoth tend to be humored as…",
  "content": "Will Variable Minimum Bids Make Yahoo! Search Marketing More Attractive? Paid Search Marketing (PPC) P By: PaulDOM December 17, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! P By: PaulDOM December 17, 2007 Will Variable Minimum Bids Make Yahoo! Search Marketing More Attractive? Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. If MSN Adcenter is the red-headed stepchild of the paid search family, then is Yahoo! Search Marketing that slightly sozzled uncle you have to put up with once a year at Christmas? Spurious and obvious analogies aside, I know the lesser two rivals of the Adwords behemoth tend to be humored as opposed to embraced by most when it comes to PPC. Still, we received an email this morning from the bods at Yahoo! Search Marketing informing us that the first half of 2008 will see them scrap fixed minimum keyword bids. As the private and confidential email states (but we did get permission to blog it in its entirety here): Variable minimum bids Beginning in the first half of 2008, we plan to change our system so that minimum bids will no longer be fixed for all keywords; they may be higher or lower than $0.10. Minimum bids may vary by keyword, ad group and advertiser. EWS 4.0.0 is configured to work with variable minimum bids. If you do not upgrade to EWS 4.0.0, you may not have full control over your ads and keywords. There was quite a bit of appreciative umming and ahhing at the idea of smaller businesses being able to lower costs on long tail keywords within their niche. Whilst those were our initial reactions prior to us giddily trying to get the word out, I'm sure you fine people will have many more cogent and lucid thoughts. It's good to share.... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Will Variable Minimum Bids Make Yahoo! Search Marketing More Attractive?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Will Variable Minimum Bids Make Yahoo! Search Marketing More Attractive?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "PaulDOM\n          \n            PaulDOM"
}