{
  "url": "https://moz.com/blog/will-seo-for-stock-options",
  "slug": "will-seo-for-stock-options",
  "title": "Will SEO for Stock Options - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "    When does being an SEO consultant and investing in stocks become sketchy? Our firm has worked for several medium to large private companies, but lately we've been contacted by some publicly traded corporations. This can put a savvy SEO/Investor in a precarious situation. Knowing the success…",
  "content": "Will SEO for Stock Options E-Commerce SEO By: Jeremy Dearringer March 26, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Jeremy Dearringer March 26, 2008 Will SEO for Stock Options E-Commerce SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. When does being an SEO consultant and investing in stocks become sketchy? Our firm has worked for several medium to large private companies, but lately we've been contacted by some publicly traded corporations. This can put a savvy SEO/investor in a precarious situation. Knowing the success that our clients have achieved with our SEO campaigns, it can be tempting to take on these projects and invest in the companies that we're working for. Is a SEO contractor much different than an employee that receives stock options when they know that their efforts will increase the success of the company they work for? Social Media and Investing? How about using social media outlets to emphasize positive or negative news about a specific, publicly traded company? Social media and linking campaigns could be used to push positive news up in the SERPs as well as increase exposure and brand recognition. After you ride the upswing it would be possible to digg, sphinn, stumble, etc. the negative news about the same company and short sell the stock. Assuming you're not the author of any of the content and you are merely emphasizing the news, rumors, or ideas of another source, does this violate any SEC regulations? S.E.C. Says Teenager Had After-School Hobby: Online Stock Fraud \"Securities and Exchange Commission charges Jonathan G Lebed, 15, masterminded stock manipulation scheme on Internet that earned him almost $273,000 in illegal gains; says he used fictitious names to send many optimistic messages to investing chat rooms about stocks he bought and sold stocks as prices rose; says he began scheme in Aug 1999, when he was 14; Lebed settles charges, agreeing to pay money he made plus interest; is first minor to be sued by SEC\" I'd really like to hear some thoughts on this. Ethics? Morals? Legality? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Will SEO for Stock Options"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Will SEO for Stock Options"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jeremy Dearringer\n          \n            Jeremy Dearringer\n          \n            Jeremy Dearringer"
}