{
  "url": "https://moz.com/blog/win-a-ticket-to-mozcon-2018",
  "slug": "win-a-ticket-to-mozcon-2018",
  "title": "Win a Ticket + Lodging to MozCon 2018! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Send us an original, unique creation telling us why we need to send you to MozCon 2018 and you could win a free ticket, VIP seating, accommodations at the Grand Hyatt, and an invite to our speakers' dinner!",
  "content": "Win a Ticket + Lodging to MozCon 2018! SEO Events | Moz News By: Erin McCaul April 26, 2018 Table of Contents Copied! By: Erin McCaul April 26, 2018 Win a Ticket + Lodging to MozCon 2018! SEO Events | Moz News Have you been wanting to come to MozCon but just can’t swing the budget? Want to take a selfie with Roger, meet like-minded friends at our afterparties, and learn from leading industry experts? I’m thrilled to announce that you can do it all by winning a free ticket to join us at MozCon this July! Those front-row seats look awfully cushy.I’m one of the behind-the-scenes house elves who helps make MozCon happen, and I’m here to tell you everything you need to know about entering to win!To enter, just submit a unique piece of content telling us why we should send you to MozCon by Sunday May 6th at 5pm PDT. Make sure your entry is both original and creative — the Moz staff will review all submissions and vote on the winner! If you’re chosen, we’ll pick up the tab for your registration and accommodations at the Grand Hyatt. You’ll also have a reserved VIP seat in our front row, and an invite to mix and mingle at our pre-event MozCon speakers’ dinner!Without further ado, here’s the scoop:Step 1: Create! Create a unique, compelling piece of content telling us why you want to come to MozCon. Past ideas have included:Drawings Videos (must be one minute or less) Blog posts Original songs Books Slide decks Anything else you can cook up! Don’t feel limited by these examples. Is this the year we’ll see a Lego Roger stop-motion film, a MozCon-inspired show tune, or Roger-themed sugar cookies? The sky's the limit, my friends! (But think hard about trying your hand at those cookies.) Step 2: Submit! Once you’re ready to throw your hat in the game, tweet us a link @Moz and use the hashtag #MozConVIP by Sunday May 6th at 5pm PDT. Make sure to follow the instructions, and include your name and email address somewhere easily visible within your content. To keep things fair, there will be no exceptions to the rules. We need to be able to contact you if you’re our lucky winner!Let’s recap:The submission deadline is Sunday May 6th at 5pm PDT. Mozzers will vote on all the entries based on the creativity and uniqueness of the content We’ll announce the winning entry from @Moz via Twitter on Friday, May 11. You must be able to attend MozCon, July 9–11 2018, in Seattle. Prizes are non-transferable. All submissions must adhere to the MozCon Code of ConductContent is void where prohibited by law. The value of the prize will be reported for tax purposes as required by law; the winner will receive an IRS form 1099 at the end of the calendar year and a copy of such form will be filed with the IRS. The winner is solely responsible for reporting and paying any and all applicable taxes related to the prizes and paying any expenses associated with any prize which are not specifically provided for in the official rules. Our lucky winner will receive:A free ticket to MozCon 2018, including optional VIP front-row seating and an invitation to our speakers’ dinner (valued at $1,500+)Accommodations with a suite upgrade at the Grand Hyatt from July 8–12, 2018 (valued at $1,300+) Alright, that’s wrap. I can’t wait to see what you folks come up with! Happy creating! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Win a Ticket + Lodging to MozCon 2018!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Win a Ticket + Lodging to MozCon 2018!"
    },
    {
      "level": "H2",
      "text": "Step 1: Create!"
    },
    {
      "level": "H2",
      "text": "Step 2: Submit!"
    },
    {
      "level": "H3",
      "text": "Let’s recap:"
    },
    {
      "level": "H3",
      "text": "Our lucky winner will receive:"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erin McCaul\n          \n            Erin McCaul\n          \n            Erin McCaul"
}