{
  "url": "https://moz.com/blog/windows-vista-performance-problems-solved-get-ubuntu",
  "slug": "windows-vista-performance-problems-solved-get-ubuntu",
  "title": "Windows Vista Performance Problems Solved: Get Ubuntu - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been getting a little tired of Windows Vista lately. It looks fantastic but I've always been disappointed by a somewhat lacklustre performance, especially at startup. Certain that my super quick PC could do much much more, and inspired by the likes of Matt Cutts's numerous Ubuntu posts, I…",
  "content": "Windows Vista Performance Problems Solved: Get Ubuntu Mobile SEO By: Richard Baxter May 15, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Richard Baxter May 15, 2008 Windows Vista Performance Problems Solved: Get Ubuntu Mobile SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I've been getting a little tired of Windows Vista lately. It looks fantastic but I've always been disappointed by a somewhat lacklustre performance, especially at startup. Certain that my super quick PC could do much much more, and inspired by the likes of Matt Cutts's numerous Ubuntu posts, I decided to take the plunge and install the Linux-based OS. Ubuntu Hardy Heron was released in late April, 2008. That's version 8.04! They do a major update once every 6 months. The key reason I felt it was time to give it a try was the press coverage of the Wubi installer. Wubi is this neat little installation package that lets you install Ubuntu from Windows, on the same partition as your current installation. It even sets up a dual boot configuration so you can quickly and easily restart your computer and return to Vista. With this in mind, I thought, what could possibly go wrong? You might be thinking at this point, “What's this got to do with SEO?” Well, it's not my usual 100% pure SEO post, but I do look up to members of the SEO community who have inspired me to give Ubuntu a try, so I hope this post is well received. Last week, Mel did a great post on a Linux tool called Baobab, so I hope my post makes for interesting, informative, supportive, related reading and that perhaps you'll share your resources, link,s or ask questions at the bottom of this post. Want to create yourself an Ubuntu machine that does all this? Check out the video to learn how! Looks good, eh? This is my HP dv9667ea running Ubuntu. The 3D desktop looks amazing! Oh, and yes, that's Windows XP running in a virtual machine emulator called Virtualbox. I couldn't part completely with the concept of a completely Windows free world...well, not just yet, anyway. I think XP running in Ubuntu looks quite cool, too. Here's a list of features you see in the video, and a basic installation guide. I've referenced useful guides where possible: Ubuntu – Download Ubuntu here and open the ISO from Windows. Run Wubi and it installs easily, right from your desktop. It won't break Windows! Oh, and should you get bored of Ubuntu you can uninstall from the add/remove programs menu. When you restart your machine, you'll be given an option to boot from Windows or Ubuntu. Compiz – that's the 3d desktop environment plugin – the best instructions I could find to install Compiz were here – Run those instructions from the terminal command line. Once installed, you should see “advanced desktop effects” settings in the preferences drop down. Switch on “desktop cube”. The keyboard shortcut for the cube on my machine is CTRL,ALT and the right mouse button. There are loads of settings to play with in Compiz, which does take a while to set up. Once it's done, there's no turning back. Get Thunderbird – the best email client I've found for Ubuntu, and it does RSS quite well. You can install Thunderbird using the downloadable install package straight from the website. You saw an episode of Battlestar Galactica playing in VLC viewer. VLC viewer is a great media player for video because it has native XVID support and lots more. You can get VLC by following these instructions. Oh, and anyone who doesn't know Battlestar, I love it.. I'm still working on finding the best mp3 player – I'm using a player called Audacious, but at the time of writing I'm just downloading and installing a player called amarok. The screenshots look awesome. I'm still undecided on which MP3 player to use. Virtualbox is the virtual machine you need to run Vista or XP from Ubuntu. It's a very powerful and fast tool, and easy to install. There are some great instructions on installing Virtualbox here. Of course, you'll need a properly licensed copy of whichever Microsoft operating system you choose to install! Many of the applications named above can be searched for and installed via the Synaptic Package Manager under System>Administration (a bit like add/remove programs), but don't be put off by the few command lines you have to run to get any of these packages working. It's really easy, I promise. Now for some SEO. A warning, actually. If you're running Ubuntu Hardy Heron, it comes with Firefox beta 3. That's great unless you want to install Google Toolbar, which isn't supported at the moment and won't install! I'm sure Google are working on that one.. At the time of writing: “Google Toolbar for Firefox 3.0.20070525L could not be installed because it is not compatible with Firefox 3.0b5.” That said, all of the other great firefox plugins that Vanessa talks about here work just fine. The time may come when you're ready to migrate to Ubuntu for good. Not a decision to take lightly, I can tell you! I certainly haven't moved over completely just yet. When the time comes, you'll need to move your virtual disk file to a dedicated partition. I've found a guide showing how to use LVPM to transfer your install. Right now, though, Ubuntu 8.04 is not yet supported by LVPM, so it'll be a few months until I make the final move. So, fair mozzers, give some thought to the alternatives. The more SEOs out there using Ubuntu, the more software tools we'll get for it. I'm really excited so far and it's working really well. I'd love to hear your thoughts on this post and any experience you've had with Ubuntu. Richard Baxter is Founder and Director of SEOgadget.co.uk, a UK SEO Consulting firm. Follow him on Twitter and Google Buzz... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Windows Vista Performance Problems Solved: Get Ubuntu"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Windows Vista Performance Problems Solved: Get Ubuntu"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Richard Baxter\n          \n            Richard Baxter\n          \n            Richard Baxter"
}