{
  "url": "https://moz.com/blog/winning-seo-buyin-whiteboard-friday",
  "slug": "winning-seo-buyin-whiteboard-friday",
  "title": "5 Key Considerations for Winning SEO Buy-In – Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In today’s episode of Whiteboard Friday, Petra takes you through the main considerations you need to pay attention to when explaining the value of your work: commitment, concerns and objections, status versus purpose, and prioritization.",
  "content": "5 Key Considerations for Winning SEO Buy-In – Whiteboard Friday Whiteboard Friday | SEO Basics By: Petra Kis-Herczegh February 17, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Petra Kis-Herczegh February 17, 2023 5 Key Considerations for Winning SEO Buy-In – Whiteboard Friday Whiteboard Friday | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Petra has plenty of experience talking to C-level decision-makers about their business problems, and translating them into SEO solutions. So in today’s episode of Whiteboard Friday, she takes you through the main considerations you need to pay attention to when explaining the value of your work: commitment, concerns and objections, status versus purpose, and prioritization. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hi, I'm Petra Kis-Herczegh, and welcome to my Whiteboard Friday on five key considerations for SEO buy-in. I'm an SEO and solution engineer, which means I get to talk to C-level decision-makers about their business problems and translate them into SEO solutions. Today, I will take you through the five key considerations, which are audience, commitment, concerns and objections, status versus purpose, and prioritization. We're going to talk about the common pitfalls and what you need to pay attention to and how you can make sure that you optimize this process so you can save time and do what you do best and spend more time executing your SEO strategy. So to start with the audience, the first thing you want to understand is who you are talking to. You want to make sure that you identify your key stakeholders, the decision-makers, and also the blockers because the challenge here is that sometimes you might not be speaking to the right people or you might not be following the right process. So you might be stepping over blockers, going straight to decision-makers, which upsets people, or you might not be involving the relevant stakeholders early on. So what you need to consider here is who to involve and when. The solution here is that you want to build rapport to make sure that the stakeholders and blockers and decision-makers trust you and you want to make sure that you fully understand the process to follow it as you should within the business. The next thing is commitment. So with commitment, you need to make sure that when you're getting buy-in, you're identifying if you're getting real buy-in or fake buy-in. Fake buy-in is when you get a yes, but you're getting it without commitment. We often tend to do this without us even realizing it by pushing to a yes, by asking questions that give no other option. So you can ask things like: Do you want your content to rank and convert better? Or do you want more traffic? These are not really questions, and what you actually do is you damage relationships, which means that you end up in a cycle where you're not being able to execute what you actually wanted to achieve because there is no true accountability on an execution level. So here you want to apply critical thinking, which means that you need to be really skeptical on how are you getting to that yes. That drives us to the next point, concerns and objections, because you need to make sure that you address these early on. So the common pitfall here is our confirmation bias because our confirmation bias really pushes us to start a research. Let's say you're thinking about a local SEO project or a technical SEO project to look at use cases that prove your own point. But what you're doing, when you're doing that, is you're forgetting that there might be concerns and objections coming from different stakeholders and different teams. So the way how you can think about this is that you want to engage in healthy conflict. You want to make sure that you do your research with the idea to preempt these concerns and objections and ask questions like: Well, if this project is so important, why is it not being done already? What are the questions that other stakeholders could raise with changes within the website, how that could impact other teams? Are there going to be trainings required for relevant teams if we introduce, for example, a new tool? So you want to make sure that you understand what sort of concerns could come up so you can actually be really comfortable and confident when you talk about these and address them and bring them up. That leads us to the next point, which is status versus purpose. So what's your real reason on trying to get buy-in for an SEO strategy, project, or idea? What's driving it? Because you really want to make sure that it's purpose that's driving it rather than your ego, which is why you need to check in with yourself. The real solution here is that you want to think about your SEO KPIs and connect them to overall business needs because that's when you can look at a holistic level and think about how your actual strategy is driving purpose rather than status, which leads us to our last point, which is prioritization. Because if everything is important, then nothing is. What that means is that if you focus on everything at once, the likelihood is that nothing will ever get done. So here you actually want to use a prioritization framework. So you can go to your favorite prioritization framework. There are things like ICE, which focuses on impact, confidence, and the effort required to execute your solution. But you probably also want to add a metric on the probability and the chances that you get real buy-in from your leadership in order to make sure that you're not wasting too much time trying to get your ideas and strategy executed. I hope you found this session useful, and hopefully you can adapt some of these to optimize your process of getting SEO buy-in, which means that you will have now more time to execute your SEO strategy. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Key Considerations for Winning SEO Buy-In – Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Key Considerations for Winning SEO Buy-In – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Petra Kis-Herczegh\n          \n            Petra Kis-Herczegh\n          \n            Petra Kis-Herczegh"
}