{
  "url": "https://moz.com/blog/wireds-criticism-of-yahoo-terry-semel",
  "slug": "wireds-criticism-of-yahoo-terry-semel",
  "title": "Wired's Criticism of Yahoo! & Terry Semel - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A Wired News article from yesterday - How Yahoo! Blew It - comes to some interesting conclusions:\n\nSemel has been Yahoo's CEO for nearly six years, yet he has never acquired an intuitive sense of the company's plumbing. He understands how to do deals and partnerships, he ...",
  "content": "Wired's Criticism of Yahoo! & Terry Semel Search Engines By: Rand Fishkin January 18, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 18, 2007 Wired's Criticism of Yahoo! & Terry Semel Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A Wired News article from yesterday - How Yahoo! Blew It - comes to some interesting conclusions: Semel has been Yahoo's CEO for nearly six years, yet he has never acquired an intuitive sense of the company's plumbing. He understands how to do deals and partnerships, he gets how to market Yahoo's brand, and he knows how to tap Yahoo's giant user base to sell brand advertising to corporations. But the challenges of integrating two giant computer systems or redesigning a database or redoing a user interface? Many who have met with him at Yahoo say he still doesn't know the right questions to ask about technology. \"Terry could never pound the table and say, 'This is where we need to go, guys,'\" one former Yahoo executive says. \"On those subjects, he always had to have someone next to him explaining why it was important.\" One could have made a convincing argument two years ago that such deep technical knowledge didn't matter much. But now we have empirical evidence: At Yahoo, the marketers rule, and at Google the engineers rule. And for that, Yahoo is finally paying the price. The article points to Yahoo!'s strategic missteps while praising Google's, but it doesn't touch on what, to my mind, is the most important factor in the search engine wars - market share. Granted, Yahoo! almost certainly should have invested in Google in its early days (pre-2002), and even in that time period, would have been wise to invest $5-10 billion rather than offering only $3. However, Google is the more profitable and more successful company today almost entirely because of their larger market and mindshare. Here's why I believe Google became the bigger search brand: User interfaceGoogle's clean UI was revolutionary and attractive; it's still one of the elements consumers cite most about their use of the engine. Purity of functionGoogle's concentration on search (at least in the early years) made them first and foremost a search engine in people's mind. Yahoo! was a directory, a portal, an email service, etc. and, oh yeah, also an engine. Appeal to GeeksGoogle appealed to tech geeks - the people who set the home pages on computers around corporate offices and at home for Grandma. When thousands of influencers in a field become obsessed with a product, it achieves mass popularity (just look at Apple). Viral spreadGoogle's marketing was nearly invisible at a time when invisible, viral marketing was being embraced by consumers, particularly those in the web world. Early quality advantagePerhaps no single factor is of greater import - Google's early lead in quality was so large that switching to Google was an obvious choice. In my opinion, this was Yahoo!'s biggest failure - letting Google return more relevant results. The funny part - I honestly can't say whether senior management was responsible for or could have controlled this factor. It could be that Google simply had a few people with better ideas and all the hiring and R&D in the world couldn't have saved Yahoo!. Media obsessionBeing a media darling made Google incredibly well placed to get early interest from even the stodgiest of users. And, with no need to market or advertise (since press releases on the average consistency of Googlers snot got more coverage than a major media play from Yahoo!), Google could spend that money in R&D to continue their edge. What do you think? Did Yahoo! and Terry Semel really falter strategically, or was the deck simply stacked against them for the past 5 years? BTW - Yes, I've been very slow on the blog (and my email) of late and sadly, it may continue for another week or so. Many thanks to everyone who has chipped in during my absence. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Wired's Criticism of Yahoo! & Terry Semel"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Wired's Criticism of Yahoo! & Terry Semel"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}