{
  "url": "https://moz.com/blog/without-cro-onsite-optimization-its-tempting-to-abandon-seo",
  "slug": "without-cro-onsite-optimization-its-tempting-to-abandon-seo",
  "title": "Without CRO & On-Site Optimization, It's Tempting to Abandon SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "To make the most out of your SEO, use Conversion Rate Optimization and On-Site Optimization. If you only do SEO, you could find yourself falling short of the bottom line. Skip to the bottom to find some charts to help. To hear how I figured this out the hard way (!), please read on. Maybe the story…",
  "content": "Without CRO & On-Site Optimization, It's Tempting to Abandon SEO On-page SEO By: Mike Murry April 6, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mike Murry April 6, 2011 Without CRO & On-Site Optimization, It's Tempting to Abandon SEO On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Quick Synopsis To make the most out of your SEO, use Conversion Rate Optimization and On-Site Optimization. If you only do SEO, you could find yourself falling short of the bottom line. Skip to the bottom to find some charts to help. To hear how I figured this out the hard way (!), please read on. Maybe the story sounds familiar. Using SEO Tactics Does SEO help in sales? Traffic to your site means more customers, and more traffic means more sales, right? But what happens when you did everything right in SEO and you didn't get the sales? It's tempting to adopt a misconception of SEO, and abandon SEO all together. And that's what almost happened to me. Being new to SEO at the time, I was an avid student. I'd read any article I could get my hands on. I'd attend any webinar possible. I'd follow the instructions to add more content to my site. I'd streamline my targeted keywords, slim my PPC campaigns, and be active with social media. Traffic was going up and we were moving up in the SERPs. Looks good, right? After SEO Tactics For my 6 month-evaluation, I was ready with shining colors. But the owners of the business had other concerns: our sales have been going down for the past few months. I thought to myself, \"No, how can this be? I brought in more traffic to our site. Doesn't that mean more sales?\" After taking a deeper look into Google analytics (with even Dr. Pete helping me), we came to a startling conclusion: my company didn't do anything SEO that triggered the downward sales. SEO-wise, we did everything right. Not Using SEO Tactics That's when I threw SEO out the window for a few months. I resorted to good 'ol fashioned marketing. My company is a web-based time and billing software. So being online, we encourage shoppers to sign up for a free trial of the software. But even though we increased traffic, we weren't getting enough trial users and actual buyers. I needed to bridge the gap, so my team and I did the following: Beefed up the KnowledgeBase and updated it on a regular basis based on the questions recorded in the Tech Support department. Introduced weekly webinars that demonstrated specific aspects of the software. Promoted the KnowledgeBase and webinars by our site, emails, and sales and tech support departments. Called back people who called but didn't leave a message. Reduced the automatic emails. Made the remaining emails more up to-date, concise, and easier on the eye. I figured only “educated buyers” make purchases. If they know what they're buying, they'll buy it. Once they become trial users, they want to know how easy it is for them to use the software. And that's where we were falling short. We needed to educate them on how to use the software. Within months of just good ‘ol fashioned marketing, our sales grew! The rate was so rapid, we now need to grow our tech support staff! Questioning SEO Tactics So what does this all mean? Is SEO useless when it comes to the bottom line? Does it increase sales? Should businesses ignore it all together? I was seriously asking myself these questions. I finally gathered enough courage to ask SEOMoz and it wasn't what I was expecting. Jamie writes: \"Well, SEO and other online marketing initiatives are certainly complementary. But I'll be honest with you: you will see more sales from focusing on conversion rate optimization and site optimization alone than from SEO alone. That said, I'd never recommend you do only one... ...So if your resources are constrained, and you can only focus well on one thing, you would be smart to continue focusing on conversion optimization until you feel like you're hitting diminishing returns with on-site optimization, then it's time to start focusing much more on getting more people to your well-optimized site. Also, it's possible to be doing things that help your SEO while also focusing primarily on conversion optimization. So CRO and SEO really do need to be related, but like I said, if you can truly only do one thing, start with optimizing your site first. Just make sure the optimization is for both humans (who you want to buy your wares) and the search engines that will be crawling and indexing your pages for search queries.” Hello CRO & On-Site Optimization So Conversion Rate Optimization (CRO) and On-Site Optimization is really good 'ol fashioned marketing! Jamie helped me put things into perspective. It makes sense. SEO is part of the puzzle. But here's the thing. These aren't necessarily different things you do in a sequential way. It should all be integrated in each other. I would keep CRO & On-Site Optimization in mind during the entire time you're doing SEO. There are many ways of approaching this. Below is a suggested approach: Click on this chart to get a larger view. It's a general idea of applying On-Site Optimization and SEO to the various areas of the Conversion Funnel. So yes, SEO does indeed affect your bottom line. It may not directly affect your bottom line as CRO & On-Site Optimization, but it would be double the work if you had to redo your CRO & On-Site Optimization efforts because Google didn't see your website clearly. Using a CRO Mindset with SEO Going in the other direction, if you are looking at a site from an SEO perspective, it's essential that you don't loose sight of the CRO. Don't get lost in all the numbers. Make sure that it ties back to the bottom line.To give yourself a good idea where it falls in your priorities, this flowchart should help: These two charts aren't all-encompassing. There's so much more (Check out a recent YOUmoz post about it - it got bumped up to the main blog!). But if you maintain the right approach to SEO, you're on the right track. Feel free to add other suggestions in applying this concept. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Without CRO & On-Site Optimization, It's Tempting to Abandon SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Without CRO & On-Site Optimization, It's Tempting to Abandon SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mike Murry\n          \n            Mike Murry"
}