{
  "url": "https://moz.com/blog/wonderbra-how-it-made-my-day",
  "slug": "wonderbra-how-it-made-my-day",
  "title": "Wonderbra - How It Made My Day! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The last two days I have been attending the SMX London - which was in overall a very satisfactory experience - I got to meet quite a few SEOmozers who turned out to be a very approachable lot even offline (online they are great!). Well earlier today I attended the \"Linkbaiting and Viral Search…",
  "content": "Wonderbra - How It Made My Day! Social Media By: Rishi Lakhani November 20, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Rishi Lakhani November 20, 2007 Wonderbra - How It Made My Day! Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Last week I attended SMX London, which was overall a very satisfactory experience - I got to meet quite a few SEOmozers who turned out to be a very approachable lot even offline (online they are great!). I attended the \"Linkbaiting and Viral Search Marketing\" session - the speakers included Jane Copland , Ciaran Norris, and Thomas Bindl, who all did an astounding job of covering link baiting in the little time that they had. Jane gave excellent case studies and had a very well laid out presentation, and I took away some pointers that I will blog about later. Thomas gave some useful insights in the dos and don'ts of link baiting and how it compares to link building, and actually made me realise how easy it is to spot link building and baiing as trends. But the real star was Ciaran - I have interacted with him on limited comments within various SEOmoz blogs, but hadn't actually met or spoken to the guy before. But I assure you he had the whole room hanging onto his really well illustrated presentation and strong opinions on the use of video for viral and linkbaiting tactics. What does that have to do with Wonderbra, I hear you ask? Well, one of his examples was how Wonderbra had spoofed the well known Cadbury's Gorilla... I have intentionally linked to the least viewed version (1,726, as opposed to the highest viewed 278443 times). This is because I am going to try a viral test using Facebook. There is an excellent application for viral content called the Funwall, so I am going to add it to my Funwall and forward it and monitor the increase in views on this version of the video. Jane reinforced the push power of social networks, and although she focused on Digg and StumbleUpon, I am going to give Facebook a shot - I think that by using slides' application, video viral content can grow much quicker and faster. If it goes well, I will add an update here later. (I am going to give it two weeks.) I think that video is one of the great ways of building a brand campaign, and has tremendous linkbait value, if done right, and I would love to see other examples SEOmozzers have come across. Well I hope for those of you who haven't yet spotted this video enjoyed it (and no, not for the obvious reasons ;-), and I would like to credit Ciaran once again for bringing it within my radar.... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Wonderbra - How It Made My Day!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Wonderbra - How It Made My Day!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rishi Lakhani\n          \n            Rishi Lakhani\n          \n            Rishi Lakhani"
}