{
  "url": "https://moz.com/blog/words-words-words",
  "slug": "words-words-words",
  "title": "Words, Words, Words, and Why SEM is Dependent on Them - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What is the best degree to get when starting a career in Search Engine Marketing?MarketingBusinessAdvertisingCommunicationEnglishThe History of Art Before 1746Okay, I made the last one up. When I was starting college, I don't think I would ever dream of having a career in Search Marketing. Why?…",
  "content": "Words, Words, Words, and Why SEM is Dependent on Them Content Marketing K By: Kate Morris May 12, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! K By: Kate Morris May 12, 2008 Words, Words, Words, and Why SEM is Dependent on Them Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. What is the best degree to get when starting a career in Search Engine Marketing? Marketing Business Advertising Communication English The History of Art Before 1746 Okay, I made the last one up. When I was starting college, I don't think I would ever dream of having a career in Search Marketing. Why? Didn't know about it. I majored in Marketing (which is in the business school) thinking I would be directing TV or print ads someday. That's a funny joke now, huh? I digress. We all know that \"content is king\" and the beginning of any search marketing campaign is keyword research. Debates there? Yes, linking is queen, but what gets relevant links? Content. What makes links strong? Keywords. What's the common denominator? Words. The written word is stronger than ever, we just don't print it anymore. Each day I realize more and more that an in-house team or agency really needs a staff of writers to be successful in SEM. What spawned all this was the Webmaster World thread called \"Keyword Research without a Computer.\" I loved the title, but more than that, the poster made a point. The best keyword research does not depend on a computer, a robot, or another website. To really succeed, you first have to understand language and the way people use it. Use a thesaurus, not Google Tools. Who is best at that? Really? English Majors/Writers. I know a number, and getting a job with an English degree is not easy. I just think that maybe they haven't realized that if they want to write about a wide variety of things that people care about AND get published, they need to get into SEM. Does that mean we are all in the dumps if we aren't the most crafty with words? No, we all speak English (or whatever your language is), but it does help to have someone around whose brain is tuned to words and how people use them. SEM is a world of words. Might as well bring in someone who knows and loves them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Words, Words, Words, and Why SEM is Dependent on Them"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Words, Words, Words, and Why SEM is Dependent on Them"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kate Morris\n          \n            Kate Morris\n          \n            Kate Morris"
}