{
  "url": "https://moz.com/blog/would-you-rather-own-a-million-dollars-in-real-estate-or-in-websites",
  "slug": "would-you-rather-own-a-million-dollars-in-real-estate-or-in-websites",
  "title": "Would You Rather Own a Million Dollars in Real Estate or in Websites? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For the purposes of this thought experiment, let’s ignore the benefits of diversification and assume you can have either a million dollars worth of real estate (say an apartment building or a lot of land) or a million dollars worth of one or more websites.\n\nWhich would you prefer?",
  "content": "Would You Rather Own a Million Dollars in Real Estate or in Websites? Mobile SEO D By: Dan Crean April 20, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: Dan Crean April 20, 2009 Would You Rather Own a Million Dollars in Real Estate or in Websites? Mobile SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. For the purposes of this thought experiment, let’s ignore the benefits of diversification and assume you can have either a million dollars worth of real estate (say an apartment building or a lot of land) or a million dollars worth of one or more websites. Which would you prefer? With real estate, people more or less agree what a property is worth. Take a few appraisers experienced in a geographic area and have them develop independent estimates, and they are likely to come in fairly close to each other. With websites, we have no industry standard for appraisal. Even experienced pros can have widely varying estimates of the value of sites and domains. But let’s ignore that and assume that we all agree that this basket of one or more sites is worth a million bucks. Real estate: Downsides: You have to pay property taxes on it, which can be substantial. Buildings depreciate as they get older, all other things being equal. (The real estate market also goes up and down, but that is a separate phenomenon happening at the same time.) Periodic repair and upkeep costs. Tied to one physical location on the planet. Zoning restrictions could limit future development. Further development and additions must be done in good-sized chunks, requiring substantial cash outlays. Neighborhood kids on your lawn! Upsides: You can use real estate for collateral for loans. You can live in it or on it. Threat of loss of value due to natural disasters, fire means can be mitigated with insurance. Established property rights in most places means if you keep up the taxes, there’s very little chance the government or anyone else will take the property away from you. There’s always some market risk in the value of any asset, but you won’t actually lose the property. Satisfies in-born human desire for a place of your own. In the US anyway, you receive special tax breaks for capital gains on houses. Websites: Downsides: No way to insure the website. State Farm and Allstate do not offer website insurance the way they offer real estate insurance. No way to borrow against the value of the websites, at least from any conventional lender. Bank officers wouldn’t even imagine accepting websites as collateral. Value highly dependent on favorable opinion of search engines and of human users of the internet. Unless you count the domain name as having some intrinsic value (and the very large majority of domains don’t), the site value derives to a large extent from how Google evaluates it (those 200+ factors) and what people think (branding?). What if Google changes its algorithm or penalizes you? Property rights not as well established. You “register” a domain. You don’t “buy” it. Will the authorities someday decide to take your domain back? Probably not, but this is not as sure as the rights to real estate ownership. Might forget to renew your domain registration. Whoops. Flaky hosting companies go down. Your site can get hacked. Competitive situation is much more winner-take-all than in real estate. If competitors build new sites and push you off page 1 of the SERPs, your value substantially declines. If a real estate competitor builds an apartment building across the street, your percentage decline isn’t as much. Websites also depreciate – in that they start to look old after a few years. Periodic redesign may be needed. Upsides: Minimal upkeep cost required. No property taxes -- just pay for the domain name and hosting. You can operate and manage sites from pretty much anywhere in the world. You can switch hosting companies and registrars easily. Easy to add to site a page at a time. You can continually invest at a low level. Unless you do something illegal, it’s pretty much anything goes for what you put on your site(s). No zoning boards or environmental agencies to please. No neighborhood associations complaining that you don’t cut the grass. Anyway, I’m sure I’m missing some pluses and minuses. In the comments please mention them, as well as your thoughts about which is better, real estate or websites. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Would You Rather Own a Million Dollars in Real Estate or in Websites?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Would You Rather Own a Million Dollars in Real Estate or in Websites?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dan Crean\n          \n            Dan Crean"
}