{
  "url": "https://moz.com/blog/yahoo-leveraging-content-for-queries",
  "slug": "yahoo-leveraging-content-for-queries",
  "title": "Yahoo! Leveraging \"Content\" for Queries - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you've been on the Yahoo! home page in the last few days, you've seen this phenomenon:\n\nThe red box around the Indiana Jones 4 link should, by all rights, take the user to a Yahoo! Movies page about the upcoming film - after all, Yahoo! has had links like these for ye...",
  "content": "Yahoo! Leveraging \"Content\" for Queries Search Engines By: Rand Fishkin October 3, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 3, 2007 Yahoo! Leveraging \"Content\" for Queries Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you've been on the Yahoo! home page in the last few days, you've seen this phenomenon: The red box around the Indiana Jones 4 link should, by all rights, take the user to a Yahoo! Movies page about the upcoming film - after all, Yahoo! has had links like these for years on their home page and they've built that expectation into the user experience of the site. However, this is the page you get when you click that link: Why? Because Yahoo! is attempting to drive more search traffic via its homepage - one of the web's most popular destinations. We, the users, are meant to understand that the magnifying glass symbol indicates we won't be taken to content, but instead to a search result. Here's the twist - no one's bidding for advertising on the query they're sending users to - \"george lucas indiana jones and the kingdom of the crystal skull\" - and, the results are organic; there's no specific attempt to drive traffic to a Yahoo! property from the results (which is hard to believe, as this page would be a perfect result. If you see Yahoo! having some inflated search query numbers next quarter - don't forget that not all of those were typed into the search box. Additionally, if you're looking to beef up your traffic, watch the Yahoo! homepage for queries they link to and grab those sponsored results (and optimize your pages) as fast as you can. Yahoo! rotates content out every few hours - sometimes even more frequently during the day. It's all the more reason to stay on the cutting edge of popular trends. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Yahoo! Leveraging \"Content\" for Queries"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Yahoo! Leveraging \"Content\" for Queries"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}