{
  "url": "https://moz.com/blog/yahoo-gets-caught-with-their-hand-in-the-cloaking-jar",
  "slug": "yahoo-gets-caught-with-their-hand-in-the-cloaking-jar",
  "title": "Yahoo! Gets Caught With Their Hand in the Cloaking Jar - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Two days ago Agerhart.com posted their discovery that Yahoo! was cloaking their Autos page. As one of our resident programmers, Jeff, put it, Yahoo! was practicing in standard, run of the mill cloaking, where they look at the IP/user-agent and serve a different p...",
  "content": "Yahoo! Gets Caught With Their Hand in the Cloaking Jar Search Engines By: Rebecca Kelley May 23, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley May 23, 2007 Yahoo! Gets Caught With Their Hand in the Cloaking Jar Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Two days ago Agerhart.com posted their discovery that Yahoo! was cloaking their Autos page. As one of our resident programmers, Jeff, aptly put it, Yahoo! was practicing in \"standard, run of the mill cloaking,\" where they look at the IP/user-agent and serve a different page to the search engine bots than they do to normal Internet users. Ajerhart has some screenshots in the post of what the Autos navigation looks like to a search bot vs. what it looks like to Joe Schmo the Internet surfer. Indeed, the term \"used cars\" is repeatedly injected and stuffed into the bots version, while the normal version uses that key phrase four times. The post ends with this up-in-arms statement: I don’t believe in spam reports and I don’t believe in snitching on competitors. BUT, I don’t feel that this applies to the search engines. They are the ones placing the “quality guidelines”, penalizing websites, banning websites, and trying to enforce the rules that they’ve made up. And they penalize and ban websites for less than what Yahoo! is doing above. How is that fair? With one hand you’re going to ban a site and in effect reduce their revenue and with your other hand you employ the same strategies (or worse)? Come on now. Those are words to rally behind, right? I mean, what SEO wouldn't get angry upon seeing Yahoo! hypocritically not practice what they preach, i.e., Search Content Quality Guideline #8: \"[Thou Shalt Not Have] Pages that give the search engine different content than what the end-user sees\"? No fair! No fair! But wait, here's what Laura Lippay, SEO Program Manager for Yahoo! Media Group, had to say on her Yahoo! 360 page: Although most folks here are very SEO-savvy, every once in a while we'll find a new engineer who might ask about adding lots of keywords or I get an email asking what if we put text the same color as the background (as if it were a brand new idea never heard of before) because I suggested the text be there and they don't really want to change the layout, or a partner who quietly decided to do things their own way. Laura is...right. As she stated in her post, \"There are dozens of groups within Yahoo who manage hundreds of products and properties that maintain some of the largest, most trafficked sites on the internet consisting of millions of pages and gobs of new content being pushed out all day long every day.\" Everyone knows that Yahoo! is a huge corporation. They must have tons of department divisions, and it wouldn't surprise me to hear that *GASP* not every single Yahoo! employee is SEO-savvy. We all know that programming a site and programming an SEO-friendly (not to mention white-hat ethical) site can be entirely different altogether (hell, look at SEOmoz's site--we often enough don't practice what we preach). Any SEO who pokes around Yahoo! and their various portals can see that their pages aren't perfectly optimized. For instance, take a look at this Yahoo! Sports article URL: http://sports.yahoo.com/nfl/news?slug=jc-ownersmeetings052307&prov=yhoo&type=lgns It's pretty ugly, chock-full of parameters, and difficult to deduce just by looking at it what the article's actually about. What about how when I click on the \"Tech\" link from the home page, I'm taken to tech.yahoo.com/fp, even though tech.yahoo.com also resolves? Or how the \"Dads and Grads\" section on Yahoo! Tech has the same title tag as Yahoo! Tech's home page? Or how the title tag for \"Tech Shows\" is \"Slingin' Sports to a Lonhorn Fan : Hook Me Up : Yahoo! Tech\"? I could go on, but you get the point. Many of Yahoo!'s own pages aren't sufficiently optimized, so why is it a shock to see that some engineer or programmer cloaked a page? Call me gullible, optimistic, high on \"let's give them the benefit of the doubt,\" etc., but I believe Laura, I'm quick to forgive, and I don't think it's that big a deal. It wouldn't surprise me if someone at Yahoo! thought he was being clever by using cloaking to try and get Yahoo! ranked well for \"used cars,\" and the SEO teams weren't immediately aware of it. As you can see, Laura acted quickly and addressed the \"scandal\" within a day (how's that for reputation management?), her explanation made perfect sense, and I'm sure whoever was responsible for the hiccup was educated on the wily ways of cloaking. Even search engines make mistakes, so let's put away the torches for now. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Yahoo! Gets Caught With Their Hand in the Cloaking Jar"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Yahoo! Gets Caught With Their Hand in the Cloaking Jar"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}