{
  "url": "https://moz.com/blog/yahoo-sunsets-site-explorer-a-eulogy",
  "slug": "yahoo-sunsets-site-explorer-a-eulogy",
  "title": "Yahoo Sunsets Site Explorer (A Eulogy) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Bing, Yahoo!, members of the Microsoft family, Tim, distinguished guests, inbound marketers and fellow Mozzers today we say goodbye to competitive link intelligence as offered by one of the Big 3 Search Engines. The SEO world will remember the brainchild of Tim Mayer, Yahoo! Site Explorer, as the…",
  "content": "Yahoo Sunsets Site Explorer (A Eulogy) Public Relations M By: Michael King November 21, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: Michael King November 21, 2011 Yahoo Sunsets Site Explorer (A Eulogy) Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Bing, Yahoo!, members of the Microsoft family, Tim, distinguished guests, inbound marketers and fellow Mozzers today we say goodbye to competitive link intelligence as offered by one of the Big 3 Search Engines. The SEO world will remember the brainchild of Tim Mayer, Yahoo! Site Explorer, as the first comprehensive tool that allowed users to find out which sites and pages were indexed, inbound links to any site and submit and track XML feeds. Yahoo, the search engine that could -- and did invent the precursor to not only Bing and Google’s Webmaster Tools but also link indices such as LinkScape/Open Site Explorer and MajesticSEO. Yahoo Site Explorer was born September 29th, 2005 and has been laid to rest November 21st, 2011; you had an amazing run. Yahoo! Site Explorer or YSE as you were known to those closest to you, we will remember your sleek easy to use “Don’t Make Me Think” user interface. It was very clear what you wanted us to do and once we did it you generously shared your data with us as though we were family. You asked no questions of us unless of course we were trying to change your mind. Only then did you require us to prove ourselves. We will remember you for allowing us to submit feeds, URLs, sitemaps to “Tell us what we don’t know. If you don’t find a URL that you expect to be in the index, use free submit. In case you hadn’t heard, we are also accepting lists of URLs, so you don’t have to provide us one URL at a time” as Yahoo! declared at your birth. YSE we will remember you for charming ability to show us more about ourselves and where we could improve to be better in the eyes of the Internet. You shared what information you knew about us almost as fast as you could collect it. YSE we will remember you for your special ability to tell us about everyone else that knew about us and where they’d shared it on the web, before you there was no comprehensive way to do that. Sure Google had the “link:” operator but it was never as forthcoming as you were. Most importantly YSE we will remember you for telling us who linked to our competitors. This is how you truly changed the world. We respect you and commend for all your efforts and the API that once fed a variety of tools such as BackLinkWatch and the SEOBook Link Tool Suite. Your knowledge, speed and freshness will be missed. Many Search Marketers will pause and reflect on Yahoo Site Explorer with feelings of inspiration and serenity: “Y!SE was the inspiration for me to raise capital and build the Linkscape index w/ Nick+Ben. I felt the web's link graph should be a resource that's available to anyone, and that's why we always made sure that users of OSE could get the same functionality Y!SE offered for free (up to 1,000 links, unlimited runs, etc.)” - Rand Fishkin (CEO & Co-Founder of SEOmoz) “YahooSiteExplorer, to me, has become like a well-loved piece of furniture, think Grandma's old couch, that served its purpose at one point, but now sits forgotten in the parlor. Much like Grandma's old couch, I have not used it much in the past year, since I have had full access to OpenSiteExplorer and MajesticSEO, but YahooSiteExplorer will always be remembered fondly.\" –John Doherty “Feels like I'm one of the few that will miss it! I used to love some of the combinations of operators you could use on it” - Paddy Moogan “cos 'All good things are wild, and free' - Henry David” –Himanshu Sharma \"Free backlink research on your competitors will never be the same\" – Dennis Goedegebuure “YSE was simple to use and a great way to find links to competitors other tools might miss.” –Joe Youngblood \"I 'grew up' with it as an SEO, had a nice little link from my desktop, was easy and convenient to access.\" – Carla Marshall “No alternative is as fast as YSE. Gone are the days of same-week link reports. We'll have to get smarter (as always in SEO).” - Tre Jones “I will miss it because it was a very fast way to see if a link was there. And because it was my 1st SEO tool (with other)” –Gianluca Fiorelli \"Even after I switched to OSE for everyday use, it was always strangely comforting to know that YSE was there. It was kind of like that friend you rarely talk to, but you know will be on the other end of the phone if you need them.\" -Dr. Pete While others will dance on your grave and celebrate your death: “YSE was an inspired flank-attack by Yahoo on Google at the time and was the SEO tool of choice for years. But its time has come.” - Dixon Jones (Marketing Director of MajesticSEO) “I actually won't miss it! Sorry YSE!, it was good while it lasted.” –Richard Baxter “I won't miss YSE. There's really been little to no value in site explorer since Yahoo gave up on being a search engine.” –Bill Slawski “I won't miss it, it was a brain melt of information with no logical organisation. There are plenty of tools that give better data” –Wayne Barker “I agree with Bill Slawski I quit using YSE 2 years ago.” –Joe Hall However no one can deny that you’ve changed the game and gave birth to variety of children that have continued to walk in your large footprints. Save for Blekko, no search engine offers the transparency that you did YSE. And while some third party tools have surpassed you in presentation, metrics and breadth of data most are still attempting to attain your speed, freshness and accuracy. Although via the Bing-Yahoo! alliance Bing Webmaster Tools is your named successor Open Site Explorer and MajesticSEO clearly lead the pack with their extensive link indices and in-depth analysis of that link graph only time will tell which of your offspring will emerge victorious as the king of backlink analysis. Open Site Explorer MajesticSEO Link Diagnosis Google Webmaster Tools Bing Webmaster Central Blekko (search [domain] /SEO) SEO Spyglass RavenTools Research Central The Creator in his Own Words I've asked Tim Mayer, the father of Yahoo Site Explorer to say a few words about his about his brainchild, particularly about how it came about, the pitfalls, how he feels it was handled and the future. Without further ado I give you Tim in his own words: \"There were a few reasons for launching site explorer in no particular order: Improve comprehensiveness of the Yahoo Web Search Index so webmasters could let us know what pages were missing in a very transparent manner Attempt to move the Webmaster robotic queries off of the user interface and move these queries onto another interface/api where we could more easily and separately manage it. This would provide cleaner user metrics for the search team Create a site where Yahoo search could interface with webmasters and site owners and improve relationships between webmasters/publishers and Yahoo. The need was that webmasters needed to know who was linking to them, which of these links were being recognized by the search engines as well as how many and what pages were being indexed by the search engines. There were not many pitfalls as I saw them and it became a popular tool for many people. I am sure some SEOs such as Dave Naylor, Greg Boser and Rae can give you some pitfalls... I feel it was handled well [by Yahoo! after I left] for a while. Now Yahoo is no longer an algorithmic engine and the responsibilities to engage and interact with the webmasters and publishers has now become the responsibility of Bing. I have had the opportunity to spend some time with Duane Forrester at Bing and he is a great interface for the webmaster community for Bing. Google has always done a great job interfacing with the webmaster community via people like Matt Cutts, Vanessa Fox and Mail Ohye. It was fun working with them on standards such as open site maps. We also developed some webmaster features of our own such as NOODP and NOYDIR tags to opt out of using directory data in the search engine title and descriptions. I think it is awesome that others have created similar tools such as Majestic and SEOMOZ [Open Site Explorer]. I am always very excited when people come up with upgraded features that site explorer did not have such as when Majestic came out with historical link data which is so cool. I have always been interested in this space having launched a very basic product called URL Investigator when I was at FAST/All The Web in March 2003 then Site Explorer in September 2005. It is important for search engines to focus on the users but also to interface with webmasters and publishers as well. I feel that there are a lot of great tools in the space. I do see a lot of opportunity for these tools to improve and progress in the future as well. For the last year I have been in the Paid Search space working for Trada, a company in Boulder, Colorado. I left Trada the week prior to Pubcon and have been working on a new product. There are a lot of new marketing channels which are causing fragmentation to occur. These new channels are often influencing one another such as social's influence on search which will become more influential in the future. These shifts bring tremendous opportunity for someone with my passions and experience.\" Thank you Tim for you and your teams hard work and Yahoo Site Explorer, thank you for everything you shared with us and may you rest in pixels. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Yahoo Sunsets Site Explorer (A Eulogy)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Yahoo Sunsets Site Explorer (A Eulogy)"
    },
    {
      "level": "H2",
      "text": "Many Search Marketers will pause and reflect on Yahoo Site Explorer with feelings of inspiration and serenity:"
    },
    {
      "level": "H2",
      "text": "While others will dance on your grave and celebrate your death:"
    },
    {
      "level": "H2",
      "text": "However no one can deny that you’ve changed the game and gave birth to variety of children that have continued to walk in your large footprints."
    },
    {
      "level": "H3",
      "text": "The Creator in his Own Words"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Michael King\n          \n            Michael King\n          \n            Michael King"
}