{
  "url": "https://moz.com/blog/yes-virginia-design-can-be-link-bait-too",
  "slug": "yes-virginia-design-can-be-link-bait-too",
  "title": "Yes, Virginia, Design can be Link Bait, too - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've struggled for a while trying to find this URL, that I was sure I emailed myself and sure enough, there it was, right in the email, getting overlooked the last 50 times I searched for it. But, my own tagging problems aside, this site, ...",
  "content": "Yes, Virginia, Design can be Link Bait, too Design By: Rand Fishkin December 6, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 6, 2005 Yes, Virginia, Design can be Link Bait, too Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've struggled for a while trying to find this URL, that I was sure I emailed myself and sure enough, there it was, right in the email, getting overlooked the last 50 times I searched for it. But, my own tagging problems aside, this site, css elite, has some very good looking sites. I don't think all of them are pure CSS, but they do have something very important in common. The Designs (by themselves) Pull in Links. It may sound odd, but it's very true. The digiterati bloggers of the web, the folks who give you furl and del.icio.us and digg love, who link to you through their blog, email your URL to their friends and submit your site to design competitions are the best allies you can have in the fight for search engine relevance. That is, unless you've got 150K blogs that post links to whatever you want through more nefarious means. In all seriousness, though, design is one of the major components of SEO, and if you're not designing with this class of link builders in mind, you're not delivering all the SEO value you can deliver, quite frankly. What's sad is that this is not the knowledge that SEOs seem to spend any time on - while we have caught up with usability, functionality, accessibility and link bait, as a group, the sites you see linked to by SEOs tell a sad story. Luckily, the answer is right here. This CSS Elite site is showing us, through example, exactly what kind of designs, colors, layouts, photos, graphics and logos we need to get the attention we want. Let's get to work. P.S. - This old post has a big list of your \"link solely for design types\", just FYI. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Yes, Virginia, Design can be Link Bait, too"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Yes, Virginia, Design can be Link Bait, too"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}