{
  "url": "https://moz.com/blog/yes-social-media-is-powerful-no-its-not-as-powerful-as-search",
  "slug": "yes-social-media-is-powerful-no-its-not-as-powerful-as-search",
  "title": "Yes, Social Media is Powerful. No, It's Not as Powerful as Search. - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's late. I'm just back from a week of travel and crazy amounts of email (note to other CEOs, when emailing 120K people with a special offer, be wary of putting your email address as the reply-to). I had a terrific time at the Online Marketing Summit - great people, many of whom I'd never met…",
  "content": "Yes, Social Media is Powerful. No, It's Not as Powerful as Search. Social Media By: Rand Fishkin February 9, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 9, 2009 Yes, Social Media is Powerful. No, It's Not as Powerful as Search. Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's late. I'm just back from a week of travel and crazy amounts of email (note to other CEOs, when emailing 120K people with a special offer, be wary of putting your email address as the reply-to). I had a terrific time at the Online Marketing Summit - great people, many of whom I'd never met before, an impressive turnout of more than 500 (even in a down economy; wow!) and some terrific networking parties (the conference even featured catered dinner for the attendees, which was really nice). One of the subjects that arose, as usual, was the emergence and power of social media, and I had some quick thoughts to share.Social media has emerged as a \"next big thing,\" but in fact, it's been around since the dawn of the Internet. Forums are social media. EBay is social media. Craigslist and Epinions and Friendster (remember those guys?) are social media, too. There's definitely a lot to like, but I worry that businesses and marketers are going crazy over social right now simply because it's hot. This is almost always a bad idea - go after a new channel because there's value, a path to revenue and a solid set of tactics that fit with your overall strategy, not just because it's in the press all the time.Social media is great for: Connecting with your users (assuming they're already on social media platforms and talking about you) Building another channel for communication, branding & messaging Appealing to early adopters Wasting time on non-business essential communication :-)But it can't do what search/SEO does: Answer a direct need precisely when it's requested in a scalable fashion Gain visibility from virtually all Internet users with an interest in your brand/product/sector/content at onceAnd if you're ignoring other important fundamentals of online marketing, like: Building a website with a unique value proposition Creating amazingly useful content that people want to share Conducting effective email marketing Finding ways to scalably acquire new users & retain existing ones Leveraging conversion funnels & conversion testing PPCYou should probably concentrate on those first. Don't get me wrong - I love social media (I even wrote a post on social media for CEOs). We have a Twitter account, a Facebook group, lots of clients whom we've helped with social strategies and a ton of experience getting value out of the process, but I worry about the obsession overpowering the logic. When that happens, we see bubbles - don't let a social media bubble cloud your business' real returns from any marketing effort.Looking forward to dissenting opinions (as always).p.s. Big thanks go out to Aaron Kahlow and the rest of the OMS crew. I've been to a lot of conferences, and this was certainly one of the most professional, impressive and well-organized. Oh, and for those seeking some humor, Jeff Rohrs dug up this classic gem thanks to a fun chat we had at the show - $240 worth of pudding. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Yes, Social Media is Powerful. No, It's Not as Powerful as Search."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Yes, Social Media is Powerful. No, It's Not as Powerful as Search."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}