{
  "url": "https://moz.com/blog/yin-and-yang-of-disavow",
  "slug": "yin-and-yang-of-disavow",
  "title": "Yin and Yang of Disavow - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Is Disavowing spam links and reverse engineering spam networks really where Google wants us to spend our time? By the looks of the Disavow process, that answer is a resounding yes.",
  "content": "Yin and Yang of Disavow Technical SEO By: Wil Reynolds May 15, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Wil Reynolds May 15, 2013 Yin and Yang of Disavow Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Image Credit: Vermin When Disavow first launched, many people felt like they were doing \"Google's job.\" At first, I completely disagreed with that sentiment. I loved it. I needed disavow, and yes, Bing did get to it first! However, since Matt Cutts' announcement of Disavow at Pubcon to present day, I have started to change my tune a bit based on experiencing what I can only call disavow hell. I truly do understand Google's position on the tool, but I am thinking a lot of small business owners need more transparency, as they cannot battle what they are up against. SEER recently took on a client for whom we have disavowed what feels like about 85% of their links. Their owner is an amazingly awesome woman whose business is getting hurt due to the efforts of her previous SEO firm. The firm left her business in a bad place. She was doing #RCS already, and had built a real business that helped people find solutions to the issues of her niche. She was doing content marketing and building assets that added value well before she employed an SEO firm. Instead of showing some discretion on their aggressive tactics, they slammed the gas and went full bore on the spam. Her business grew and she hired people, not knowing that her SEO firm was setting her up for failure. At first, I was a big fan of disavow. Now that I am personally spending tons of time helping out on two clients affected negatively by the tool, I can't help but think...seriously, is the the best use of my time to help these clients succeed online? Instead of spending the same time strategizing on how to build assets that add value, I'm hunting down spammy link networks. Google, is this what you want me and the SEER Interactive team to be doing? After disavowing 5,800 domains and being declined again, I am starting to see this as a serious needle in a haystack. If it is a needle in a haystack for companies like SEER, can you imagine what it's like for the average small business owner? Having submitted a few disavows and ending with them denied time and time again, I realized, man, this is a waste of time. However, we will keep at it because we'll never quit trying to help our clients succeed. Instead of the SEER team working on RCS and brainstorming on how to create valuable content that will add value (i.e. doing all the things Google says we should do), we are spending time trying to find link networks and things we don't know a ton about because we didn't build those crappy links to begin with. We pitched a concept (to be shown at Mozcon, hopefully; buy your tickets now!) that got a client on several news stations (it was quite a rush seeing a SEER Idea on the 6:00 and 11:00 news, along with our CEO being interviewed), newspapers, and countless other sites, but we've minimized our work on it because our disavow requests for that client keep getting denied....you serious?? This is the best thing we've ever built, yet we are spending a portion of our time on disavow and trying to understand why one or two links somewhere is the tipping point over what we already disavowed. So we went nuclear, disavowing every link before SEER started with a DA under a certain level, that is not on blogspot.com style subdomains. Are we throwing out some of the good with the bad? Yup. But we want to get back to adding value and building things we can be proud of. Google is giving spammers more business with disavow, not less There are good people out there who are worried about their businesses, not just their rankings. These people will try to do what’s right to get back in Google's good graces, so they'll pay people to help them save their businesses. I know I would. Once they've decided to reach out for help, who are they going to go to? Probably the same types of people who built their crap link networks in the first place. Who knows how to remove spam links best, a spammer or a marketing agency? Once again, the spammers get rewarded. Those who spammed the Internet spent their hours not creating value, but trying to create patterns in low-quality sites that Google wouldn't pick up on. It worked for years, and then suddenly, it didn't work anymore. Now the same people who created all the spam are the same ones these companies are relying on to find the patterns on how Google does it, since the companies who didn't do this stuff never spent their time architecting crappy links. Disavow was needed. For the business owner in this example, she called and asked what's up the minute she realized these guys had hurt her business more than they helped. She had to spend countless hours away from building quality content and trying to grow her business in order to learn about link networks, and when she said, \"Hey, can you guys remove these links you got?\" her old firm charged her $12,000. If she declined to pay the price tag, they were holding her site ransom. If she agreed to the payment, she would be out 12k for link removal. Ultimately, our business owner paid the fee. Two weeks later, disavow was announced, and - guess what - the old firm didn't remove even close to all the links. So again, I get the need for Disavow, but man, it also gets my team completely off what I'd like them to do. More importantly, it distracts my team from what Google would like them to do. Their time is taken away from building things that add value, and spent on figuring out how spam on the web used to work. This is definitely a skill I'd rather not be investing in, since we all know the shelf life of that skill is pretty limited. Maybe someday Google will use Webmaster Tools as an understanding when a client moves to a new agency, consultant, etc. I'm not convinced that is the right solution, but I guess we need to start somewhere to figure out how we get away from spending time on spam. If you are building spam links (which would make you a spammer) or if you are spending time understanding spam to make disavow work (which is everyone else), it's a bad use of time for everyone. Here are three big takeaways from what I've seen with my limited Disavow work: 1. Cut the bleeding, hardcore This is the wrong time to get nitpicky about Disavowing links, especially if you have switched firms and 90% of what the old firm did was spam. Simply go into Webmaster Tools, pull the link report (with dates), and start Disavowing everything before the old firm started that has a low domain authority. It surprises me at how often people get picky. I’d say you are better off over-Disavowing the links, and then go back when you have time and are out of the penalty to pick back out the ones you think you may have been too aggressive on. It's not a perfect solution, but this way, you get out of the penalty sooner rather than later. 2. Don't cry wolf (too much) I have no proof of this, but I can only imagine that if you keep nibbling off one link at a time and submitting Disavows, Google may begin to get sick of it and might stop reviewing your requests as frequently. I also remember that, when Disavow launched, the Google team was a bit worried that people would disavow the good links along with the bad. I have a sneaking suspicion that if you Disavow quality links, Google has ways of saying \"you probably made a mistake and didn't mean that,\" especially when they compare the good links to their expansive list of bad links, link networks, etc. 3. Go do some real marketing!!! You want rankings? You can't just stop doing the bad; you have to start doing the good! Put priority on doing the things Google wanted you to do all along. Reference the high quality stuff you've done in your re-consideration requests, and let Google know you are making real investments and turning over a new leaf. So often when we talk about disavowing links, clients go…OMG well I’m going to lose some of my rankings… well, RIGHT BUDDY! When your rankings are propped up on fake marketing tactics and you haven’t done enough #RCS, then you are stuck with never having built real assets that attract real links. For the future of your business, you gotta start somewhere, and if your business isn't worth marketing in some way other than SEO, then you are probably the exact kind of site that Google doesn't want to rank well in most verticals. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Yin and Yang of Disavow"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Yin and Yang of Disavow"
    },
    {
      "level": "H2",
      "text": "Google is giving spammers more business with disavow, not less"
    },
    {
      "level": "H2",
      "text": "1. Cut the bleeding, hardcore"
    },
    {
      "level": "H2",
      "text": "2. Don't cry wolf (too much)"
    },
    {
      "level": "H2",
      "text": "3. Go do some real marketing!!!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Wil Reynolds\n          \n            Wil Reynolds\n          \n            Wil Reynolds"
}