{
  "url": "https://moz.com/blog/yo-smx-where-my-devs-at",
  "slug": "yo-smx-where-my-devs-at",
  "title": "Yo SMX, Where My Devs At? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Jeff, our CTO and lead developer-with-a-beard, had recently expressed to me his desire to speak at conferences and events. Fantastic! ...except for one problem. There are no developer-centric tracks at any SEO conferences. SES? Zip. SMX? Zilch. Pubcon has had a smattering of developer-related…",
  "content": "Yo SMX, Where My Devs At? SEO Events By: Rebecca Kelley March 18, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley March 18, 2008 Yo SMX, Where My Devs At? SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Jeff, our CTO and lead developer-with-a-beard, had recently expressed to me his desire to speak at conferences and events. Fantastic! ...except for one problem. There are no developer-centric tracks at any SEO conferences. SES? Zip. SMX? Zilch. Pubcon has had a smattering of developer-related sessions that were, according to Jeff, weak sauce. SXSW is the only conference to offer developer sessions, but that series is more tech than SEO-oriented. Why no love for developer sessions? No matter what conference I attend, ultimately I'll hear a question from an audience member who is clearly a developer or is in some way directly involved with his company's site's back end. And, most of the time, the panelists dodge the person's question because they lack the knowledge to be able to provide the person with a quality response. Case in point: at SMX Social Media in New York (back in October 2007), my fellow link bait panelists and I all stressed, in three separate presentations, the importance of ensuring that your server can handle the massive influx of traffic coming to your site as a result of a successful link bait campaign. That was all well and good...until we got to the Q&A portion of our session. Every third question we were asked had to deal specifically with server issues and what back end-specific changes you should make in anticipation of the traffic stream. We didn't know exactly how to answer because none of us are developers--we just write and promote the content, right? I was asked to reprise my speaking role at SMX Social Media Redux in Long Beach, California. The only problem is that I ended up getting double-booked with speaking appearances, as there's an Ecommerce Summit in New Orleans I got invited to speak at. I needed someone to take my place at SMX Social Media, so I emailed the Third Door folks and pitched Jeff to assume my spot. He could talk about how to prepare your site for link bait, and I thought it would be really valuable for audiences to get the link bait perspective from a developer's point of view. Plus, he could answer all of those pesky server-related questions. Their response? They asked if Jane (who I also recommended in case they didn't warm to Jeff) was available to take my place. Aww. (To be fair, Jane's more than competent to speak about link bait and, in fact, gave a well received presentation at SMX London. I was just hoping for a little dev love this time around.) My point is, why doesn't a conference series (SMX, I'm looking in your direction--it'd be a nice way to differentiate yourself from SES) offer some sessions that are development-focused? Not even a separate track, mind you--just a session or two. Maybe one on \"Web Developer Resources.\" Jeff raves about Firebug, a web dev toolbar. This sort of information is bound to be valuable to advanced SEOs, right? Or what about \"Get to Know Your Programming Languages\"? People can find out which ones do certain things better than others. Or, simply enough, \"Ask a Developer\"? Put a few devs on a panel and let the audience pepper them with questions. How would that not be a popular session? Okay, say people don't want a developer-centric session. What about putting a dev on an SEO panel to provide an alternative perspective, like my link bait suggestion? I know lots of extremely talented developers (Matt, Cesar, Dave, and our own Jeff, to name a few) who I know would be really great speakers and can provide extremely valuable information. It's just too bad that SEO conferences have no love for devs--in my opinion, this is a huge missed opportunity, and if implemented properly, would provide great value to a conference series. Postscript: Danny Sullivan commented below about how SMX Advanced will have an entire Developer Track. Woo hoo! Thanks for your input, Danny! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Yo SMX, Where My Devs At?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Yo SMX, Where My Devs At?"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}