{
  "url": "https://moz.com/blog/you-dont-need-to-be-a-brand-publisher-to-win-at-content-marketing",
  "slug": "you-dont-need-to-be-a-brand-publisher-to-win-at-content-marketing",
  "title": "You Don't Need to Be a Brand Publisher to Win at Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Is being a brand publisher the right choice for your business? If not, there's a better way to do content marketing, and it's one many brands are finding success with. Is yours next?",
  "content": "You Don't Need to Be a Brand Publisher to Win at Content Marketing Content Marketing | Marketing Industry By: Ronell Smith February 4, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ronell Smith February 4, 2015 You Don't Need to Be a Brand Publisher to Win at Content Marketing Content Marketing | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. \"Man, I'm sorry. You guys weren't ready to adopt the brands as publisher mindset. I suspected you'd never be ready to do it successfully. I knew it; I could sense you knew it. I wish I'd spoken up when I saw the intra-departmental debates waging. That's on me. My bad.\" Those were my words to the executive of a midsize lifestyle brand I worked with in 2014. It took me months to get up the nerve to reach out and make it right, even though I'd done nothing wrong. He seemed to understand. But he did have a question that stopped me in tracks and continues to haunt me. \"If we couldn't get it right, with all of our resources, what does it say about the feasibility of becoming a brand publisher?\" he inquired. \"Does that make content marketing [in and of itself] a bad idea?\" A fair question, to be sure, and one I did not have a sufficient answer for. But in looking back, I realized this exec, like so many others before him, made the mistake of thinking he could do quickly what he had not yet learned to do well. Content marketing wasn't the missile that sank his boat. The decision to do content marketing at warp speed and with little direction was his brands' albatross. Four things doomed his efforts from the start, and each was self-induced: He drank the brands-as-publishers Kool-Aid He chose the wrong goals for his brand He attempted to execute a plan that wasn't meant for his business He attempted to do content marketing by skipping the small but important steps Any one of these could have led to failure. Facing them all at once is akin to content marketing suicide. I see these same four elements dooming content marketers so frequently that I've resorted to naming them the four horsemen of content marketing failure. For the purposes of this post, I want to illuminate how attempting to be a brand publisher is a lofty, needless goal for all but a handful of brands. Then I will highlight how to make steps 2, 3, and 4 work for your brand, not against it. Before I begin, however, I want to make one thing abundantly clear: The ideas shared in this post have been formed through working with hundreds of brands over more than a decade, either as a writer, business strategist, content strategist, product marketing consultant or in a PR/media relations capacity. I'm under no illusion that each (or any of them) will apply to everyone, but experience has shown me that these elements play an invaluable role in the success (or failure) of most brands embarking on the content marketing journey. Where content marketing went off course (image source) The web is rife with examples of marketers sharing the \"wisdom\" of brands becoming publishers, and no less common are the examples of brands who've done just that, adding content publisher to the laundry list of services they already provide. Here's the problem with that logic: You're not a publisher, and attempting to become one is fraught with risks that more often than not lead to failure. The logic of brands as publishers Brand publishing refers to brands attempting to behave as media companies, specifically with regard to content breadth and frequency. Also, and most important, it requires a mindset wholly different from that of a typical content marketer: These brands view publishing as part of their business model. That's where the confusion comes in. A lot of very knowledgeable people say any brand that publishes blog posts or adds updates on social media is a brand publisher. But that's akin to saying anyone who runs is a marathoner. It's about scale. While content marketing's goal is to attract and retain customers through the creation and distribution of content, being a brand publisher means you have layers of staff, strategic insight, vision, resources to build platforms for sharing new content and, most important, the ability to produce content at a rate that rivals, well, publishers. If content marketing is a single-family dwelling, brand publishing is a city of one-million-plus. It's not that being a brand publisher is a bad idea all by itself. It's that too many companies, who are barely ready to do content well, now think being a publisher is a sound idea. As brands continue to bite off more than they can chew, the realities are tough to stomach, and have led to some interesting conclusions: Brands who have and who can successfully make the transition to being a publisher can be very successful (e.g., seeing increased links and traffic, greater organic visibility, a significant lift in paid search and enviable social traction). The number of brands who can successfully pull off being publishers is miniscule. After months spent developing content strategies for clients looking for content marketing help, I decided that, in good conscience, I would never again insist that brands become publishers. Instead, I adopted a strategy that's as far away from one-size-fits-all as possible. Good for business doesn't mean good for your business First, I refrained from using the term brand publisher. Next, I became a vocal proponent of the good-for-business-doesn't-mean-good-for-your-business philosophy, which meant that in meetings with managers, directors and C-Suite execs, I had the courage of my convictions in sharing that while content marketing is a sound practice, becoming a full-fledged publisher is something that requires a minimum of three things to be successful: Near-limitless resources: Take a look at the companies crushing it as true brand publishers, and you very quickly see why there aren't many like them. Red Bull, consistently singled out as the leading brand-as-publisher, invests in the full gamut of content, including movies, books, TV shows, magazines and more. The privately held company doesn't release figures related to those activities, but it's likely in the tens of millions. \"[The expense is] something we grapple with on a daily basis,\" says Werner Brell, head of Red Bull Media House, the content arm of the brand. \"It's obviously expensive.\" Come-hell-or-high water commitment: If you choose the brand-as-publisher route, understand that you'll get up close and personal with the word commitment. Aside from the financial commitment, including staff and the cost of producing content, you'd better be prepared for publish or perish to become part of your brand's DNA. There is no \"This isn't working. Let's change tactics.\" This is your horse and you'll keep riding it. It's the lot you've chosen. A change in your brand's overall corporate philosophy: This is the big, hairy gorilla that (fortunately) saves many brands from dooming themselves from choosing the brand publisher route. Few C-Suite denizens are willing to disrupt their corporate model and add publishing to their mantle. And if you're the VP of content or CMO, you're wise to accept this level of restraint. If your company is ready to shoulder such a commitment, then by all means dive right in. If not, there's a better way to do content marketing, one that is no less effective but does not require you to mortgage your future in the process. A better way: content marketing for your brand Instead of attempting to become a publisher, or even a content marketer, focus your efforts on becoming a brand that consistently creates content that puts the needs of prospects and customers first, while simultaneously providing meaningful solutions to their problems. I've been a very vocal haranguer of content marketing, though not because of its inefficacy. I'm simply not a proponent of brands thinking of themselves as anything other than what they are in the minds of their prospects and clients. Hopefully, at the core of your business is a product or service customers clamor for, not a content engine. That's why becoming a customer-first brand that has meaningful content as part of its DNA is the safest, surest, easiest-to-adopt model for brands with the desire to do content marketing right but who aren't willing to re-org the business to get it underway. In this way, you keep the main thing the main thing. That main thing in this case is serving your core audience. At this point, I'm hoping you see the light, realizing that becoming a brand publisher isn't necessary for your company to be successful at content marketing. If you're ready to chart a solid, more reliable path to success, it begins with turning away the four horsemen of content marketing failure. We've banished the first horsemen. Let's do the same with the other three. Choose the right goals for your business Whenever I sit down with a prospect to discuss their business, I open up my notebook and write down the following three phrases, including a checkbox next to each, on a sheet of paper: \"...Be successful.\" \"...Rank No. 1 in Google.\" \"...Increase...conversions.\" Then I ask \"What are your goals for the business?\" all the while knowing full well the answer will be one of the three things I've written down. The followup question, too, is canned: \"What are you doing to get there?\" That answer, too, is typically never a surprise: \"That's what you're here for, right?\" Wrong! After I've apprised them that the shortest path to failure is not having a clear view of their goals, I have their attention and they are ready to begin the goal-setting process. Here's the catch: Only you and your team can decide what those goals are/should be. It's important that the goals take into account the entirety of the business, not just SEO, content, social media, etc. Also, I've found it helps if the metrics assigned to measure a business's success toward their goals are meaningful (e.g., a sincere help to the overall business) and clearly communicated (e.g., everyone involved is aware of what they're working for and being judged against). (image source) No matter what specific goals you decide on, applying the principle of \"HAS,\" as in holistic, adherable (er, sticky) and sustainable, can be a huge help: Holistic—Content marketing success requires that a lot of moving work parts in unison. Your goals must take into account the entirety of the business, though not all at once. Adherable—How likely are you to stick with the goals, seeing them through to fruition? It won't matter how sound your goals are if they don't make sense for your business, or don't make sense for your business at a given time. Sustainable—Will you be able to maintain the needed level of effort for the goals to reach maturity? I've found that keeping these principles top of mind helps to order a brand's steps, ensuring that everyone is aware of the goals and of their role in working toward them. As an example, let's say you're a small business ready to jump into the murky waters of content marketing, but you don't yet have a website. The right goal would be to launch a new website. To make the goal as HAS-friendly as possible, you could assign a timeframe—say, 90 days—then break out the associated tasks by order of importance (see image below). (image source) I'd even suggest keeping a checklist in a Google Doc where team members can stay abreast of what's going on, in addition to seeing who's responsible for what and having a better understanding of where the team is in terms of completing each task related to their goals. Execute a plan that's right for your business If I had to single out the No. 1 reason content marketers I've worked with have failed it would be that they based their goals on what the competition was doing instead of what's best for their own business. Seeing a competitor rank higher for their main keywords; having thousands of web pages indexed by Google; spending mad cash on paid media; and having brand pages on Google Plus, Facebook, Twitter, Instagram and Pinterest, these businesses attempt to do the same. Sounds comical, right, until you realize it happens all the time and to businesses of all sizes. So we just had a new client shut down our social strategy to instead \"copy anything and everything their competitors are doing\" #brilliant— Greg Gifford (@GregGifford) January 26, 2015 Problem is, no two businesses are entirely alike and, well, \"You aren't them,\" as the saying goes. Aside from having little idea of how much real success the competition is enjoying from their search, social and content efforts, these brands are taking their eyes off the main prize: their own business. An approach that works well and is easy to carry out entails taking an inventory or where you are in relation to where you want to be while keeping a keen eye on the competition. With your goals solidly in hand, begin by sketching out a plan based not on where you are, or on what the competition is doing, but on those actions that would likely lead to success for you. (image created by author) In the graph above, created in Google Docs, you can see that I mainly focused on the content-related activities that would have the biggest impact over the next 90 days. (Caveat: This is simply a high-level overview of one area of the business, but it's plenty thorough enough for a team to begin working from.) The key is to take the time to get to know (a) what success looks like for your business, then (b) focus on specific, actionable elements that can be done in the allotted timeframe. Sweat the (seemingly) small but important stuff (image source) \"Why do you hate content marketing?\" I get asked these words at least once a month. The answer is always the same. I don't hate content marketing. I hate most brands' approach to content marketing. There is so much more to making it a success than we're typically led to believe there is. The focus is always on produce, produce, produce. Outreach, outreach, outreach. Produce more. Outreach evan more. Rinse and repeat. As marketers, we've seemingly trained a generation of brands that the focus should be on doing fast (and often) what they barely know how to do at all. We never learn to do well. Yeah, I know it works...for some. But is it scalable over the long-term? Better yet, will it remain scalable into the future? If you want to position your brand for success in content marketing, make sweating the small but oh-so-important steps a priority. This process starts with clarity. Begin by defining who you are and who you desire to be in the minds of your prospects and clients. I can see the eye-rolling. But without answers to these questions, you're wasting your time and, likely, money. Devote the time to having weekly brainstorming sessions with your core team. During these meetings, keep the air open, relaxed and free-flowing, allowing ideas to bounce freely around the room. The goal is to start each meeting with a big question. Then let it \"breathe.\" Your first big question should be \"Who are we?\" followed by \"Who are we to our customers?\" Put on your introspection hats, viewing yourselves through the words and interactions of prospects and customers, who have likely shared comments via email, phone, text, and your website. Ask \"why\" a lot. During Mozcon 2014, Wil Reynolds dropped a slide that gave me goosebumps: (image source) Simple. Brilliant. What I loved about this slide and the line of thinking is it helps brands (and the staff who work for those brands) stay the course, focused on their already-defined objectives. For example, once you know who you are and who you are in the minds of your core prospects and customers, any actions you take should be done with this information in mind. Therefore, if the team begins to get distracted by shiny-things syndrome, anyone has the right to ask \"Why are we doing this?\" or \"Why does this...make sense?\" Nothing like forcing someone to defend a bad idea to provoke clarity. Get to know your audience. The better you know your audience, the easier it is to market to them. Even if you cannot afford the fancy tools and platforms Mike King has previous talked about to develop personas, you can have staff members spend an hour each per week scouring social media, forums, discussions boards and sundry websites' comments sections looking for people who are likely interested in the products/services your business offers. Gather as much information (e.g., age, income, occupation, etc.) about these people and their needs as possible, in addition to what sites they frequent, how often and for what. In this way, you're developing personas without it feeling like an onerous task. Keep copious notes, which can be entered into a Google Doc and shared with teammates. Build a community. I hate the term secret sauce, mainly because no such thing exists. However, if a brand wants to set itself apart from the competition, they should adopt this mentality: Get to know your audience, but build a community. An audience might read your blog, consume and share your information, and recognize your content from the rest of the pack. A community, however, is engaged and passionate, actively seeking out your content, sharing it broadly and fervently, and is easily willing to help in the creation of content for your business (e.g., YouMoz) Have your team keep a watchful eye on out for engaged, visible members of your audience, especially via social media. Share their content, answer their questions and, as resources permit, surprise them with personaliized GIFs or mail them skotskes. The audience-to-community threshold is smaller than you likely think. Create and share meaningful content. Notice that I saved content creation until last. That's no accident. Content marketing is cruelest to those who dive in headfirst without clear goals, lacking a plan of action and who're content to simply \"be on social media\" or to \"share some blogs.\" If you're committed to creating and sharing meaningful content, there are three areas you must focus on: Inspire. People want to feel good about themselves and the work they're doing. Why not use your content to help them and generate buzz for yourself in the process? For example, if your business sells email solutions for small business, a sizable portion of your content should cater to helping business owners \"take back a part of your day.\" When creating content, put yourself in the shoes of your customers, and ask yourself \"What can I create that'll inspire and compel them?\" In this way, it's less about the action you need them to take and more about tapping the emotion needed to bring that action to reality. Immediacy. While evergreen content certainly deserves a spot in your quiver, make certain to offer content that speaks to the immediate needs of the community. This is when a sincere effort at thinking like a publisher comes in handy, especially if you have experts in-house who can speak, with your brand's voice, to these needs. A great example is the job Eric Enge and Mark Traphagen are doing at sharing information regarding Google's updates and important social media news. Look for ways your brands can contribute in a similar fashion. Indispensability. Your content needs an I-can't-do-without-this component. It's the surest path to ensure your content gets read and shared; your website retains steady traffic; your blogs always have significant eyeballs; and your brand is sought-after online. Look at the job the Buffer folks are doing in educating their community on all things social media, time management and productivity hacks. Their posts are read and shared by thousands daily, with many (including myself) seeing the blog as can't-do-without material. Same for the excellent work the Bruce Clay, Inc. content team, whose comprehensive resources add a layer of \"stickiness\" to the brand that's hard to beat. How can you do the same? Commit wholeheartedly to learning the needs of your community, especially those needs associated with pain points they desperately need removed. Creating content around these areas/topics is the easy part. I can't say for certain that, if you refrain from attempting to be a brand publisher, you'll be a successful content marketer. I also cannot promise that going all-in with the three points outlined above ensures your success. What, however, I can say is the vast majority of brands would do better if they banished \"I want to be a brand publisher\" from their lexicon and decided to focus on the right goals, executed a sensible plan and made the small things part of the main things. What about you? Are you ready to do content marketing wisely? Dive into the discussion in the comments below. (main image: licensed by the author ) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "You Don't Need to Be a Brand Publisher to Win at Content Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "You Don't Need to Be a Brand Publisher to Win at Content Marketing"
    },
    {
      "level": "H4",
      "text": "Four things doomed his efforts from the start, and each was self-induced:"
    },
    {
      "level": "H2",
      "text": "Where content marketing went off course"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "The logic of brands as publishers"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Good for business doesn't mean good for your business"
    },
    {
      "level": "H2",
      "text": "A better way: content marketing for your brand"
    },
    {
      "level": "H2",
      "text": "Choose the right goals for your business"
    },
    {
      "level": "H2",
      "text": "Execute a plan that's right for your business"
    },
    {
      "level": "H2",
      "text": "Sweat the (seemingly) small but important stuff"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ronell Smith\n          \n            Ronell Smith\n          \n            Ronell Smith"
}