{
  "url": "https://moz.com/blog/youmoz-revisited-some-tips-for-contributers",
  "slug": "youmoz-revisited-some-tips-for-contributers",
  "title": "YOUmoz Revisited: Some Tips for Contributers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's been about a month and a half since our new site launch, meaning that we've received nearly 2 months' worth of YOUmoz submissions (160, to be exact, with 94 entries published). A little over half of the submissions we receive get published, but what...",
  "content": "YOUmoz Revisited: Some Tips for Contributers Moz News By: Rebecca Kelley March 21, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley March 21, 2007 YOUmoz Revisited: Some Tips for Contributers Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's been about a month and a half since our new site launch, meaning that we've received nearly 2 months' worth of YOUmoz submissions (160, to be exact, with 94 entries published). A little over half of the submissions we received got published, but how did we decide what to publish and what to nix? We thought we'd put together a list of tips and guidelines for those of you who either have submitted entries to YOUmoz or have thought about submitting: We're definitely more likely to publish posts that demonstrate your expertise on a particular topic, niche, sector, etc. This doesn't mean we won't publish beginner-level posts--it's just that a well-written post that reflects the author's savviness is more likely to be published and could also end up being promoted onto the main SEOmoz blog. A lot of posts we published linked to SERPs and websites as references and examples, included screenshots, and incorporated bullet points and numbered lists. These posts reflected the extra effort the author went into researching his post, as well as his desire to share something interesting with readers. We often receive submitted posts that are nothing more than a concise, basic SEO question. These questions likely won't get published because YOUmoz is a user-generated blog, not a forum. If you have an SEO question, it's better to post it in our Q+A Section (if you're a premium member) or at www.cre8asiteforums.com, www.highrankings.com, forums.searchenginewatch.com, or other SEO forums. You can, however, pose or bring up questions in your YOUmoz posts. Good questions to ask might be those that are complicated, illustrate an interesting side of SEO, webdev, conversion strategy or online marketing, and are thought-provoking and encourage a discussion. Submitting a spam post is just absurd. We don't blindly publish everything that's submitted--each post is reviewed and edited before it's published. It's a waste of time to write a three-sentence blurb about your site's services and drop about eighteen links, because this post will never see the light of day. You don't have to stick strictly to SEO topics. We have a variety of blog categories (business tactics, web design/development, etc), and you can write about anything that fits within these topics. However, try to keep your posts on-track. Cold remedies, recipes, and other posts that clearly lack relevance won't get published. It's okay to promote yourself at the end of your post with a short blurb (a couple of sentences should suffice) on who you are and your website. We'll likely formalize the author bio portion soon. We try to space out the publication of YOUmoz posts, so if there are ten or so posts sitting in the submitted queue, we'll publish a few at a time in order to give our readers some breathing room. Therefore, don't get all riled up if you submitted something a few days ago and still haven't received word as to whether or not it's been approved--we're just being strategic (and sometimes swamped with actual client work). We're extremely proud and surprised to see how many submissions we've received so far, and the interaction on YOUmoz has been terrific. Keep up the great work, authors! You're really starting to build a strong, engaging community. If you're interested in authoring a YOUmoz post but haven't gotten around to it, or if you've submitted something and had it rejected, then don't give up. We still want to read what you have to offer, and I'm sure the rest of the SEOmoz members do as well. Reader feedback is generally positive or constructive, so I'd recommend giving it a shot. If you have any questions about YOUmoz submissions or about the process that I haven't addressed in this post, feel free to ask them in the comments. P.S. I forgot to mention that we also won't publish duplicate posts, so if you submit something that has appeared on your blog or on another site somewhere, then sorry, we won't publish it (even if it's really good). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "YOUmoz Revisited: Some Tips for Contributers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "YOUmoz Revisited: Some Tips for Contributers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}