{
  "url": "https://moz.com/blog/your-brand-shouldnt-fear-assigning-authorship",
  "slug": "your-brand-shouldnt-fear-assigning-authorship",
  "title": "Why Your Brand Shouldn't Fear Assigning Authorship - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Developing employees as trusted authorities in your industry via their content can have great benefits for your brand. So why do so many brands fear doing it?",
  "content": "Why Your Brand Shouldn't Fear Assigning Authorship Content Marketing By: Mark Traphagen February 18, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mark Traphagen February 18, 2014 Why Your Brand Shouldn't Fear Assigning Authorship Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Over the past two years I've spoken at numerous conferences and written articles beyond counting (including one here at Moz) on the subject of Google Authorship and author authority online. By far the most frequently asked questions I get on the topic are from brands fretting over whether or not to allow individuals to become brand representative authorities. Typical forms of these questions include: Wouldn't it be better for our content to be branded with our company name/logo? Will individual author authority really translate into better exposure, trust, and (bottom line) new customers for our brand? What if the employee author leaves our company? The brand-content paradox While the issues of brand representation by individuals bleed over into many areas (such as social media, conference speeches, etc.), I'm going to focus on what I think is the \"hottest\" and most important area right now: brand content marketing. In other words, the issue of who or what \"authors\" your brand's content. Let me start by saying to brands, \"I feel your pain.\" Or perhaps more accurately, I understand your fears. The Internet age has created an odd paradox. At the same time that brands have more access to potential customers than ever before, that very fact has made it more difficult than ever to stand out from the crowd. On hotly contested and immensely valuable real estate like Google's first page or Facebook's News Feed, brands contend frantically for attention. I can understand why they would be reluctant to embrace any strategy that seems like it removes the prospect one more step away from the brand name. However, in this article, I'm going to propose that that \"removal\" is exactly what brands need to be doing to stand out and win customers in the highly-competitive world of online marketing. Let me address each of the three questions I quoted above. 1. Shouldn't our content be authored by our brand? Since the dawn of advertising, brands have been willing to invest huge sums of money into getting their brand name known. We've gone from cultural icons like this: to this: In the \"Mad Men\" era of the rise of the big Madison Avenue agencies, the focus was on campaigns that \"branded\" the client brand's name on the minds of consumers. But as brands proliferated over the next 50 years, this became less and less effective. When Colgate and Crest and Close Up all are telling you \"we are best at fighting cavities!\" they just become a blur when you reach the supermarket shelf. But even back in those days (or at least in the fictional version of those days), some people understood that there was a unique power in associating a powerful personal brand with a corporate brand: In that scene Mad Men's Don Draper is taking advantage of a second chance at getting interviewed by a major news outlet. He had blown his first opportunity by being aloof and refusing to give the reporter anything personal. After his Sterling Cooper Draper Price partners threw a fit over the resulting boring newspaper article, Don got the message. As you see in the clip above, when the reporter asks him if Don Draper is the name that defines his agency, he barely hesitates for a moment before responding confidently, \"Yes.\" You forget a name, but you never forget a face Have you ever noticed how many Facebook ads use a human face image (sometimes with unexpectedly embarrassing results)? That's because advertisers know that the human eye is drawn to human faces. That's also the reason you see faces in most ads for law firms and real estate agencies. They get that when making some of the most important transactions of their lives, people want to feel like they're connecting with a real human being. Google gets that, too. So they created Google Authorship, the opportunity for individual content creators to verify their original content from across the web with their Google+ profiles. In return, these authors might get search results for their content in Google Search that display their profile photos next to the result: Not only do these rich snippet results take advantage of our evolutionary programming to be drawn to faces, they reinforce that there is a real human being behind the content. That can have a profound psychological effect on someone scanning down those 10 blue links on a Google search page. It's perfectly true that all the content linked by the non-Authorship results may be by real humans as well. But the author-photo results guarantee it. Let's get personal And that leads us to the true value of identified, human-authored content for brands: It's what searchers want. (See proof in this study by Justin Briggs.) It's a simple fact of human psychology: people will identify with and trust a person long before they'll give the same consideration to a faceless brand. I often tell the story of my first visit to a huge online marketing conference. I was passing through the crowded corridors between sessions when a stranger grabbed me by the shoulders, held me at arms length, and staring intently at my face, exclaimed, \"Wait! I know you from somewhere!\" After a moment it dawned on him: \"I know! You're in my search results all the time!\" Because I write about topics for which he frequently searches, Google Authorship showed him my face again and again. And as he clicked through, he found my content helpful. So now when he searches and sees my face, he automatically goes to my content first, even if I'm way down the search result page. Conclusion to Question 1: Personal brands are powerful. People trust and listen to a person before they trust and listen to a logo. So now a brand might ask me, \"Fine, personal brands are effective. But...\" 2. Will personal brand authority build a corporate brand? My guess is that this is really the #1 concern of brands when they are challenged to let employee authors represent the corporate brand. Why should they invest company time and other resources into letting an employee build up his or her reputation online? I think the response to that lies in the powerful synergy that can occur when a brand is consistently associated with authoritative content that is combined with authoritative persons. Want proof of that? You're looking at it. Not this post (although I believe it actually is a small example), but the site on which it's published. Why is Moz such a household word in the online marketing industry? There is little doubt that it's largely due to the names of Mozzers we know and trust: people like Rand Fishkin, Cyrus Shepard, Jennifer Sable Lopez, Dr. Pete Myers, and too many others to mention here. They write the content that we have come to rely on as authoritative, trustworthy, memorable, and very shareable. And when we become part of the audience of people like that, one of their fans, it doesn't take us long to figure out with what brand they are associated. Then the trust and, let's say it, affection we feel for them inevitably gets transferred to that brand. The face that makes phones ring Several years ago I was working for an agency that had no blog. At the time I was managing AdWords accounts for clients. I loved to write, but frankly found the 95 characters of a Google ad a little confining. So on my own I started a blog for the company. I wrote post after post with very little readership. But I kept at it, developing my own style, learning more about my field, and transferring that knowledge into the best content I could create. Then in June of 2011 I got an early beta invite to Google+. My network there took off, and soon my posts were getting widely shared. They started to earn natural links that made them start to rank in search. As soon as I heard about Google Authorship, I adopted it for all my content. Soon my face was showing up next to search results for my posts. I started to get known as a trusted expert in my field. Out of that came opportunities to speak at major conferences. And then the agency's phone began to ring. \"Mark Traphagen has helped me time and again with his content online. If you guys have him working for you, you must be pretty smart. Send me a contract.\" That began to happen more and more frequently. Eventually, that was working well enough that Eric Enge at Stone Temple Consulting made me an offer I couldn't refuse to come work with that fine outfit. Eric saw I had reputation, trust, and a large and loyal audience. He wanted that associated with STC. And now it is. Conclusion to Question 2: If you encourage gifted employees to go out and create a synergy of authoritative content associated with their trusted name and face, your brand will bask and benefit in the reflected glory. But when I left my former agency, wouldn't that leave them asking... 3. What if that high-reputation employee leaves? NEWS FLASH: Almost no one stays long term at one place of employment these days. A survey by PayScale revealed that in the Fortune 500 tech companies, mean tenure of employees is about one year. So if your company allows an employee to invest serious time into creating content and building up her social following, if she gets a sterling reputation in your industry that starts reflecting well on your brand, and even starts bringing you customers, if she leaves is all that down the drain? Thanks to the power of online reputation and the emergence of Google's growing understanding of entities in semantic search, the answer is a resounding NO. Through Google Authorship, I stay connected in full sight of Google to all my content, no matter what I do or where I go in real life. At Stone Temple Consulting I continue to work hard to create truly useful content and to build my reputation and authority. As those continue to grow, they continue to benefit the content on my old agency's site. That content continues to get recommended, shared, and clicked on based on my reputation. And that's traffic my former employer can continue to convert. I've actually had brands ask me if they should remove the content of an employee who has left them, or change the authorship of the content. I hope by now it's obvious why that would be foolish. Certainly there may be circumstances under which severing the connection would be wise. If for some reason the former employee becomes a public disgrace, or simply starts moving in directions that will not enhance his reputation in your industry, then you might want to disassociate your content. But I would hope such cases would be rare. (As an aside, it might be a good idea for companies to begin to think about and formulate clear policy on ownership and authorship of employee-generated content, both during employment and after. I can see a day coming when author reputation may become so valuable online that problems could develop if a company tried to remove or change authorship on a piece of content after an employee left.) Conclusion to Question 3: If a former employee continues to build a great reputation in your industry after she leaves, then that reputation continues to work for your content. The face of the future Obviously I am strongly in favor of not only allowing employees to develop high-authority online reputations in your industry, I see it as increasingly essential. The social web has forever changed effective marketing from being impersonal brand broadcasting to highly personal connectivity. Not only do authoritative employee authors cast a reflected glow of trust and authority onto your brand, they also help humanize it. Even in the \"coldest\" of industries, at the end of the day, people still want to buy from people they like and trust. What experiences have you had with developing real human authorities for your brand? What obstacles did you need to overcome? What concerns do you still have about this idea? Let us know in the comments! Image credits: Brand X: Purchased photo under a license from shutterstock.com Burma shave signs: by peterme used under a Creative Commons License Goodyear blimp: Purchased photo under an editorial use license from shutterstock.com Facebook ad: From anthroblogia (used by permission) Darth Vader and Luke: by shaun wong used under a Creative Commons License Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Your Brand Shouldn't Fear Assigning Authorship"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Your Brand Shouldn't Fear Assigning Authorship"
    },
    {
      "level": "H2",
      "text": "The brand-content paradox"
    },
    {
      "level": "H2",
      "text": "1. Shouldn't our content be authored by our brand?"
    },
    {
      "level": "H3",
      "text": "You forget a name, but you never forget a face"
    },
    {
      "level": "H3",
      "text": "Let's get personal"
    },
    {
      "level": "H2",
      "text": "2. Will personal brand authority build a corporate brand?"
    },
    {
      "level": "H3",
      "text": "The face that makes phones ring"
    },
    {
      "level": "H2",
      "text": "3. What if that high-reputation employee leaves?"
    },
    {
      "level": "H2",
      "text": "The face of the future"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mark Traphagen\n          \n            Mark Traphagen\n          \n            Mark Traphagen"
}