{
  "url": "https://moz.com/blog/youtube-ranking-factors-whiteboard-friday",
  "slug": "youtube-ranking-factors-whiteboard-friday",
  "title": "YouTube Ranking Factors - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week for Whiteboard Friday we are taking a look at how to get a video to rank on YouTube. Each month YouTube receives over 800 million unique visitors who watch more than 3 billion hours of video, traffic we can't afford to ignore. So how do you get videos to rank for competitive terms on…",
  "content": "YouTube Ranking Factors Whiteboard Friday By: Jeff McRitchie August 3, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jeff McRitchie August 3, 2012 YouTube Ranking Factors Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week for Whiteboard Friday we are taking a look at how to get a video to rank on YouTube. Each month YouTube receives over 800 million unique visitors who watch more than 3 billion hours of video, traffic we can't afford to ignore. So how do you get videos to rank for competitive terms on YouTube? By paying close attention to these 12 important ranking factors. Do you agree with these? Disagree? Tell us your thoughts in the comments below. Video Transcription Hi, my name is Jeff McRitchie from MyBinding.com, and today we're going to be talking about how to get your videos to rank better on YouTube and specifically YouTube ranking factors. We're going to cover 12 specific YouTube ranking factors, kind of in 2 different categories. The first category would be the content that you create. These are things that are really in your control. Not everything about ranking on YouTube is in your control, and yet you have the ability to affect it all by the content that you create. So that's really the place to start is by creating awesome content and then uploading that content in a way that is going to put your best foot forward on YouTube. So let's talk about the first six ranking factors that fall under the category of content. The first is title. You want a title that is going to be awesome. You want a great click through rate. You want people to want to watch your video. So when they're doing a search on YouTube for a specific topic, you want to pop up, and you want someone to say, \"That's exactly what I'm looking for.\" So not only do you need to do the keyword research ahead of time to understand what someone needs, but you also need to deliver on that concept, so that they know that that is what I want, and then when they watch the video, it's not something totally different. So, when you are setting out to create a video for YouTube, the title is probably the most important thing. You want a title that's going to draw people in, but then you also want to make sure that you deliver on that title. If you are going to say that you have the best video on SEO ever, you better make it the best video on SEO ever. Otherwise, people are going to say, \"That's lame.\" They're not going to click through. They're not going to respond. They're not going to do anything. So title is your first and most powerful tool. You're going to want to do the keyword research and make sure you have a call to action in your title. Second is description. You want to write a real description for your videos. I can't tell you how many times I've seen a video, and it's like a link to your website is the only description in there. Or, \"This is a great video on . . .\" and it has like one keyword in it. Write a description. Talk about what your video is all about, what makes it unique. Put some keywords in there, but write it from a real perspective. Make sure you put a link in there to whatever you want, fully qualified URL, and it will light up so that people can click on it. But the real purpose of the description is to make sure that you describe it. Content is king, and this is a place for you to make sure that you have content. For us, I make sure that my writers write the descriptions. They take time. We write 300 to 400 to 500 words in a lot of cases. Maybe we'll do 200 or 300 words, and then we'll add the transcription below. But you want to make sure that you have something unique that's really about the video. Take the time to write it. It's really worth it. The third ranking factor on the content side is your tags. You want at least 10 tags. You want them to be keywords, you want to do your keyword research, and you want to make sure that they're relevant for the video. Something that's weird about YouTube that's a little different than Google is that you can have a video that's all about something, and if you don't use that keyword in there, it doesn't really do the semantic matching for you. So, you could have a video that's all about something, but if you don't spell it the right way or if you don't use the plural version versus the singular version, then YouTube won't even rank it. So you need to make sure, at least until Google gets better at it, that you put those tags in there that have both plural and singular. Do your keyword research. Again, make sure that you understand, what are people looking for that are going to need to watch this video. The fourth YouTube ranking factor on the content side is transcription. This is something that most people don't know about. I'm going to tell you about it today. That is that YouTube has a feature where it's going to try to transcribe your video for you, and it is horrible at transcribing your video. If you've ever tried to read the transcription that it does by machine, it is awful. However, something else that they don't tell you is that they use those transcriptions to rank your video for keywords. So, if you were to slip something, and there's actually been some tests done on this, where someone transcribes a video and throws in a word that isn't mentioned anywhere in the description, anywhere in the title, and then you type that in a search in YouTube and up comes that video. They are indexing the transcriptions. So take the time to go ahead and transcribe your video word for word. Upload the text file. It will match up the words. It will then make your video closed caption, which will increase your click through rate, and it will also allow you to rank better for that video. Just a quick tip on that. Definitely worth doing. If you're going to take all the time to make the video, take a few extra minutes and transcribe it and make it happen. Number five, I put this under the content side of it, and that is your channel authority. You control your content, which means you control your authority. Google is looking for channels that have authority, and it's going to use that as a basis for your ranking. It's going to be easier for someone who consistently creates awesome video to rank for terms versus somebody who just throws up a random video. Now, it's a little bit controversial just in that YouTube also has the power to let any person with a cell phone rank really well for a video if they have enough engagement, which is what we're going to talk about in a minute. But all else equal, if you have a good channel that you have great content on and good engagement on your other videos, that's going to flow over into your current video and getting it ranked. So, you want to make sure that you look at all of your videos as a whole and your channel, not just your single video when you're trying to rank. The sixth is delivery. I put this over in content, because really, ultimately, if you make a crappy video, Google and YouTube will figure it out, and you're not going to rank well. If you think about it, their best interest is providing people with videos that are awesome, that provide the user with exactly what they're looking for, that users say, \"That's what I'm looking for,\" that they interact with. And if you can't do that, if you deliver content in a way that's really poor, the users aren't going to like it. They're not going to watch your video. They're not going to stick around. They're not going to comment. They're not going to engage, which is the next thing that we're going to talk about. If they don't do that, you're not going to rank. So, you need to make sure, when you set out to do a video, that you make an awesome video and not a crappy video. That's really the key. If your users are telling you that your videos are crap, then you need to look and say, \"Okay, what am I doing wrong, and how can I change that?\" That's the content side, the stuff that you control directly. By making awesome content, you can then create awesome engagement, which is really the second part of ranking on YouTube and probably the most important. All else being equal, if you do all of these things and there's no competition, you're going to do great. But if there are other people with other videos that want to rank, and let's face it, almost any industry has other videos that want to rank for the keywords that you want to rank for, you're going to need to do more than just throw up a video with a great title tag and a description and some tags and transcription. It's kind of like creating a website but not telling anyone that it's there. So, now suddenly you have to take it to the next level. You need to get some engagement. That's the next six ranking factors that really come into YouTube. I'm just going to go quickly through them so that you can understand some of the different things that YouTube is looking for. There's kind of a chicken and the egg thing that happens with YouTube. So in order to rank better, you need views. In order to get views, you need to rank better. So there's the sense in which you need to get the word out and allow people to see your video. Use your social media sharing, use your website, use your blog. Whatever network that you have, get people to go watch your video. Once they've watched it, then Google is going to say, wow that's an awesome topic, and they're going to want to rank you better. But it's not just about views. They're looking at the quality of those views. That's why I put attention as the second part of number one. They're looking to see, how well are people receiving that? I don't know if you've ever logged in and looked at a specific video in the engagement report that you can get on YouTube. It's really cool. Basically, what you can see is how long people watched, where they fell off. So maybe you have a trailer on the end of your video. You're going to watch this nice graph, and everybody's following, following, following. Bam, they're gone. They got to the advertisement. They say, \"Okay, I'm done with this video.\" You can also see that maybe that happens. You delivered your point, someone got bored. If your audience is getting bored, YouTube is using that to determine how good your video really is. So, if people are watching it all the way through, if they're totally engaged, then YouTube is going to rank you better than somebody who has a video where they watch the first 10 seconds and they're out. So that's something to keep in mind. You're going to want to look at those reports and make sure that you have the attention that you need. And if you're not, do something to fix it. Make sure that your next video is awesome all the way through, or recreate that video with a new version that's going to garner the attention that you really, really want and need. The second part is inbound links. I know everybody in the SEO world is talking about inbound linking right now and everything. But essentially, YouTube is using inbound links to videos as a ranking factor. Surprise, surprise. It's Google. Inbound links are king. So, think about ways that you can build links to your YouTube channel and to your YouTube video specifically. So they're looking for both channel links, and they're looking for links to that specific video. Now, awesome video content gets natural links. People say, \"Hey, I saw this great video over here. Go ahead and take a look at it.\" It's going to build links naturally, but there are ways that you can help that process along by sharing it on your social media, by making sure that your users know that it's there so that they can go and watch it, especially your most engaged audience, which are going to be the people that you're dealing with. For us, that's our customers. You're also going to want to make sure that you share it on your blog. Those count. You're going to want to make sure that you share it anywhere else where you can that gets people to know about your video so they can link back to it. And if they're really interested, they will link. So, you don't need to go and sit there and try to rack your brain on how to build links to your YouTube videos, and yet you need to always be thinking about how to build links to your YouTube videos. On the other hand, you should always be building links to your YouTube channel, and that should be natural. All of your profile links, like when you do an email, you're going to have your YouTube channel in the bottom. When you do a press release, you should have your YouTube on there. On your website, you should link to your YouTube channel. It's just natural that you're going to want to promote your YouTube channel, because your YouTube channel is important to you, and you want people to see the stuff that's there. So, that's something that kind of gets overlooked in the YouTube ranking factors, but inbound links are really important. The third is social shares. You have the ability on YouTube to easily and quickly share stuff on social media sites - Twitter, Facebook. It's simple to quickly share on your own, and it's simple for your users to share as well. Make sure you share it on your own, and hopefully you're going to have people reshare that. Google is tracking that. They're looking for it. They're looking for social signals for these videos. As more people share it, it's going to raise you up in the rankings. Again, it's just one factor in the basket of factors in terms of engagement. Fourth is embeds. That's going to be people who want to embed the video on their site. Also included is you embedding it on your site or blog. So, if you think about creating your video, you don't want to just leave it on YouTube. You want to then go and take that and embed it somewhere. Also, you have the ability to turn on or off the embed feature. Now, you have to kind of weigh that out in terms of, maybe you don't want people to embed it. But the more people that embed it, the better it's going to rank. So, you kind of have to say, is there a specific reason why I don't want it embedded on other people's sites? If there is, then you can turn it off. But I suggest turning it on, and letting bloggers, letting people embed that right onto their own sites. You're going to see that your rankings will raise as people embed those videos onto their sites. The fifth under the engagement section is comments and video responses. So this is really key, and Google is really good at figuring out which comments are spammy and which comments are real. So don't try to game the system. Try to produce content that's going to be awesome so that people want to comment on it. So, people who come and say, ask a question, respond back. If someone comes and says, \"This is an awesome video,\" make sure you reach out to them. Google is looking for videos that build social following and that people interact with, because it shows that the video is being watched, that there's quality, and that it's really a worthwhile video to rank. So you're going to want to build up those comments. On the other hand, they're also looking for video responses, which is a lot harder to get. So, how do you get somebody to make a video in response to your video? That's a pretty tall tale, but it also is a huge ranking factor. Because if someone's willing to do that, then, often, that says to Google, wow, this video really made sense to them or was really important to them. So one of the things that you can do is you can make your video a video response to other videos that might be out there. Now that's not quite as powerful as somebody making a video for you as a video response. You can also add your video as a video response to your other videos that you have on your channel. Again, not as powerful as somebody making a video for you as a video response. Now, if you have a friend or you know somebody else who does video and you want to trade video responses, that would be awesome. Ask them to make you a video. Ask them to respond to it. Get in front of their webcam on their laptop and record a quick video response that says, here's what I really liked about this video, or this is how I feel. Upload it to their own YouTube channel, share it, and respond to the video and put it as a video response. That's going to be a huge factor for you in terms of ranking. It's just one of those things. It's kind of a big favor to ask. Video is not that easy to create for a lot of people. So it's one of those things that you've got to kind of weigh it out and say, \"Okay, how big of a favor can I ask of my friends?\" if I want them to create a video response for me. Then, the last under the engagement side of things is likes and favorites. So there's a like button, just like Facebook. You can sit there, and you can thumbs up or thumbs down. You want, obviously, lots more thumbs up than you want thumbs down. You want people to say, \"Hey, I love this video.\" But a thumbs down isn't the kiss of death for your video, because at least people are engaging with it, and they say, \"Okay, I didn't like it.\" That might tell you, if you get too many thumbs down, that maybe you need to create a better video. But ultimately, you're looking for people to engage with the likes/dislikes side of things. And you also want them to favorite your video, which means that you really had an impact on them, that they really wanted to share it with their people. The more you share it and the more they share it, the better your video is going to rank. When it comes down to all of this, content and engagement, there's actually an internal page rank system inside of Google and inside of YouTube that causes the rankings to fluctuate. That's why link building and inbound links work. That's why you have all of these different factors at play. When someone shares your video and it's on their channel, they're passing page rank to your video. When somebody accepts that as a video response on their video, they're passing page rank and authority to your channel and to your video. So you're going to want to make sure that you're engaging with the YouTube community, that you have your videos out there, that other people are engaging, because it's going to show up in their feed. Their feed is going to pass internal page rank to you. Again, internal page rank, what I say that is that they're shuffling it, but they're trying to determine how well does your channel and your video really fit into the YouTube community? Ultimately, if you create awesome content and get great engagement, then you're not going to have any problems at all ranking for the keywords that you really need to rank. Thank you and that's Whiteboard Friday. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "YouTube Ranking Factors"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "YouTube Ranking Factors"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jeff McRitchie\n          \n            Jeff McRitchie"
}