{
  "url": "https://moz.com/blog/youtube-email-marketing-youve-got-our-attention",
  "slug": "youtube-email-marketing-youve-got-our-attention",
  "title": "YouTube + Email Marketing = You've Got Our Attention - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While Rand was out of town he received an email from a man named Darren Barefoot. Since Rand was up to his ears in meetings, presentations, and consultancies, he forwarded the email to me and asked me to take a look at it. The email subject was \"Can You Spare 88 Seconds?\" My first thought was,…",
  "content": "YouTube + Email Marketing = You've Got Our Attention Social Media By: Rebecca Kelley June 25, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley June 25, 2007 YouTube + Email Marketing = You've Got Our Attention Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. While Rand was out of town he received an email from a man named Darren Barefoot. Since Rand was up to his ears in meetings, presentations, and consultancies, he forwarded the email to me and asked me to take a look at it. The email subject was \"Can You Spare 88 Seconds?\" My first thought was, \"Probably.\" (Really, 88 seconds is not much time to sacrifice.) The body of the email asked us to spare 88 seconds to watch a video message that Darren recorded for us. Intrigued I was--I mean, it's not every day that SEOmoz receives video messages directed specifically to target us. So, what did I do? I watched the video: (By the way Darren, it's \"S-E-O mahs,\" not \"S-E-O mohs.\") Anyway, I was impressed with the efficacy of Darren's marketing campaign. He recorded a video that targeted us, stuck it on YouTube, and emailed Rand asking him to check it out. In fact, he almost guilted me into watching it by playing up the whole \"It's only 88 seconds long!\" angle. (It worked.) The campaign was simple yet innovative, brief but effective. How effective was it? Well, after I watched the video I went over to the Get Elastic site to check out these \"Crazy, Messed Up World of Ecommerce\" videos. Basically, it's a series of videos that translate online complaints into real-world situations (e.g. filling your shopping cart only to get prematurely redirected back to the home page, getting inundated with \"Customers who bought this item also bought such-and-such!\" prompts). The videos are sort of hokey and corny, but they're fairly amusing and elicited a chuckle or two. Darren's marketing campaign was brilliant--he personalized his efforts by specifically calling us out and engaging us. By the time I read his email and watched his video, I felt compelled to check out the site he was promoting. What main points can we get out of his efforts? Personally address your target. Everyone hates those \"Dear webmaster\" emails (In fact, today Scott received an email that said \"Dear webmaster, my name is webmaster.\" Um, okay.)--they reek of laziness and spammy link efforts. Not only did Darren email Rand personally and address us personally in the video, but he made a reference to Seattle, demonstrating that he did a little bit of homework and injected a little sumthin' sumthin' to get us to go \"Hey, we do live in Seattle! This guy must know us!\" Engage your target. Darren made quite an effort here. He recorded a personalized video and edited some clips from the Elastic Path videos into it. This marketing campaign was definitely something different than the slew of generic, vanilla emails we receive every day asking us to check out a new feature/site/monkey's paw/whatever. Keep it brief! The short email and the 88 second video really made me think \"Okay, it looks like this guy is going to get to the point quickly, and I like that.\" And Darren didn't disappoint. You need to capture your audience's attention quickly. Most of us don't have time to read long, drawn-out emails detailing every minute feature about your product. Get to the meaty stuff quickly or you'll lose your audience. Well done, Darren--you prompted Rand to make me blog about something he thought was interesting, and that's no easy feat (usually I just ignore him). Keep up the good work, and as for the rest of us, well, I'd say that this is an interesting study about how email marketing isn't dead after all--it's just requiring a bit of creativity. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "YouTube + Email Marketing = You've Got Our Attention"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "YouTube + Email Marketing = You've Got Our Attention"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}