{
  "url": "https://moz.com/blog/youve-got-70-minutes-to-vote-on-this-post",
  "slug": "youve-got-70-minutes-to-vote-on-this-post",
  "title": "You've Got 70 Minutes to Vote on this Post - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This morning at SEOmoz, we're having a dev priorities meeting to decide which items in our queue of tools, upgrades and improvements will take priority for the next 45-60 days. For fun, I thought I'd open it up to our community and ask you - what would you most want to see from us in Q1 of…",
  "content": "You've Got 70 Minutes to Vote on this Post SEO Tools By: Rand Fishkin December 11, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 11, 2008 You've Got 70 Minutes to Vote on this Post SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This morning at SEOmoz, we're having a dev priorities meeting to decide which items in our queue of tools, upgrades and improvements will take priority for the next 45-60 days. For fun, I thought I'd open it up to our community and ask you - what would you most want to see from us in Q1 of 2009: What Do You Want SEOmoz to Work on For Q1 '09 ( surveys) Meeting starts at 10am Pacific (70 minutes from now) :-) p.s. I know another Linkscape update isn't listed on there, but it is already in the works and should refresh much of the most important content and grow the index size again (no definitive deadline yet, though). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "You've Got 70 Minutes to Vote on this Post"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "You've Got 70 Minutes to Vote on this Post"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}